{
  "source": "https://www.techradar.com/reviews/panasonic-g95-g90",
  "title": "Panasonic G95 / G90 review",
  "category": "cameras",
  "updated": "2019-06-28T16:27:45Z",
  "author": "matt-golowczynski",
  "summary": "The G95 / G90 beefs up Panasonic's G series",
  "verdict": "The Panasonic G95 / G90 blends an abundance of features with sound image quality and strong video to boot. It's got some strong competition, however, and it's not the biggest step up from the G85 when you consider its asking price, but what it does it generally does very well.",
  "pros": [
    "Speedy autofocus system",
    "Well-considered design",
    "Very responsive in use",
    "Sound image quality"
  ],
  "cons": [
    "Only a modest update on the G85",
    "Large body for a small sensor",
    "20MP somewhat behind the times",
    "Buffer with raw not as strong as quoted",
    "Noticeable rolling shutter and crop in 4K"
  ],
  "article": [
    "Panasonic has arguably done more than any manufacturer with mirrorless technology. It launched the first mirrorless camera, after all, and thereafter it expanded its G-series of cameras and lenses in many different directions, notably developing some of the most popular video-centric mirrorless options we've seen yet.",
    "The focus may now be on what the company does with its newer S series, having recently launched the S1R and S1, but the S series is not a replacement for the more established line; the demand for smaller, lighter and more accessible models like the G95 is still there.",
    "The previous Panasonic G85, also known as the Panasonic G80, is an excellent upper-entry-level mirrorless offering, with great image quality and a wide-ranging feature set to recommend it; but, after two and a half years, certain features are looking a little dated. So it's time for something fresh to take its place, and while the G95 / G90 isn't officially a replacement, it essentially picks up from where the G85 /G80 left off.",
    "Panasonic has been using 20.3MP Four Thirds sensors inside its G-series cameras for some time, and the G95 is the latest recipient. While some may see this as being behind the 24/26MP that's standard across many other cameras at the same price point, it is at least a step up from the 16MP sensor found inside the G85.",
    "This is actually the same sensor that's found inside the G9, which is still the company's flagship photo-oriented camera in the series, and it works across an ISO range of ISO200-25,600. As on previous models using this sensor, Panasonic has omitted an optical low-pass filter to enable it to capture crisper details, and image stabilization is built into the body too.",
    "This system can be used as-is when the lens you're using lacks image stabilization, although if you partner it with a stabilized lens the two systems will work together; this technology is known as Dual I.S. 2, and it promises five-axis correction to a maximum of five stops, and this appears to be unchanged from the G85.",
    "The older G85 offers 4K video recording, and the Panasonic G95 /G90 continues this, although the new model is decidedly more video-centric than before.",
    "For a start, it includes a VLog-L profile to provide a better starting point for grading, something that's only available for S1R and S1 users at an additional cost; the fact that this is included as standard here shows how credible Panasonic considers the camera to be for more considered video use.",
    "4K videos can be captured to 30, 25 and 24p, while Full HD video can be captured at frame rates up to 60p (and beyond to 120fps in the High Speed Video mode). This is backed up by a slew of supporting options, from microphone and headphone ports – the latter missing from the G85 – through to electronic stabilization, and the clever 4K Live Cropping feature, which lets you perform smooth pans and zooms without the need for special kit.",
    "On the rear of the G95 / G90 is a 3-inch LCD with a 1.04 million-dot resolution, and this flips out from the camera body and spins around to face the front via a hinge to its side. It's also touch-sensitive, enabling the user to set the focus point, swipe through images and navigate the menus among other things.",
    "Above this lies an electronic viewfinder that's based around a 2.36 million-dot OLED panel, with a magnification of 0.74x in 35mm terms, and an eye sensor just above it that switches between the finder and the LCD as the user's face approaches and moves away.",
    "In terms of functionality elsewhere, the model offers everything we expect at this level, with Panasonic's usual sprinkling of extra features on top. The 1,728-zone multi-pattern metering system offers Multiple, Center Weighted and Spot options, and exposure control covers the PASM quartet plus exposure compensation and bracketing options.",
    "The 9fps burst mode is unchanged from the G85, although this drops to 6fps when you want to use live view, or maintain autofocus between frames. Panasonic reckons this can be maintained for 45-plus raw frames or more than 300 JPEGs, which is perfectly acceptable for a model of this sort.",
    "Color modes, or Photo Styles in Panasonic parlance, range from the usual Standard, Vivid and Natural options through to various black-and-white options and Cinelike settings. On top of that, fun effects such as Retro, Cross Process, Toy Effect and Fantasy let you apply pre-defined looks to your images.",
    "There's also a small flash on the top plate that has a guide number of 9m at the base ISO200 setting, while other features include Face and Eye Detection, a silent shutter, and both timelapse and stop-motion settings. Wi-Fi and Bluetooth are also on board, allowing for wireless image transmission and remote control of camera settings from an iOS or Android device running the Panasonic Image app.",
    "The Panasonic G95 /G90's CIPA-rated battery life of 290 frames per charge (regardless of whether you're using the LCD or the EVF) may underwhelm, but Panasonic points out that switching to the Power Save mode will boost this to 1,000 frames. The average user will get more than 290 frames per charge regardless, however, and USB charging does at least make powering the camera up convenient.",
    "Need more juice? A DMW-BGG1 battery grip is available that works with the camera and has space for an additional battery, although this is an added expense.",
    "All images and videos are sent to an SDHC or SDXC memory card, with a single card slot located behind a door at the camera's side. There's support for both the UHS-I and UHS-II standards, as well as for UHS Speed Class 3 (U3), which promises a minimum sustained write speed of 30MB/s."
  ],
  "headers": {
    "3": "Features"
  },
  "links": {
    "S1R": "https://www.techradar.com/reviews/panasonic-lumix-s1r-review",
    "S1": "https://www.techradar.com/reviews/panasonic-lumix-s1-review",
    "Panasonic G85": "https://www.techradar.com/reviews/panasonic-lumix-g80-g85",
    "G9": "https://www.techradar.com/reviews/panasonic-lumix-g9-review"
  }
}