{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-review",
  "title": "Samsung Galaxy Watch Active review",
  "category": "wearables",
  "updated": "2019-12-23T16:03:05Z",
  "author": "james-peckham",
  "summary": "A beautiful yet functional smartwatch",
  "verdict": "Samsung’s Galaxy Watch Active takes a lot of what was great about the company’s standard smartwatch, pushes it all into a smaller package and trims some of the top-end features we’ve come to love. Given that the Galaxy Watch Active is a lot cheaper, and the design is suitable for both working out and wearing in your daily life, it’s difficult to find anyone the Galaxy Watch Active isn’t suited to.",
  "pros": [
    "High-end design",
    "Competitive price",
    "Lots of features"
  ],
  "cons": [
    "Lacks rotating bezel",
    "No LTE variant",
    "Limited storage"
  ],
  "article": [
    "It has been a turbulent time for Samsung watches. The company's first attempts weren’t the best devices at the time, but its latest Galaxy Watch duo prove to be some of the best wearables you can buy.",
    "The Samsung Galaxy Watch is a premium piece of kit that we have ranked as our best smartwatch you can buy right now.",
    "Launching a little over six months after the launch of the Galaxy Watch, the Galaxy Watch Active landed alongside the Galaxy S10 in March 2019. And mere months later, the smartwatch was superseded by the Samsung Galaxy Watch Active 2, a virtually identical successor that added a haptic digital dial around the rim - and bumped up the price.",
    "The original Galaxy Watch Active is undeniably a pared-down version of the Galaxy Watch as it’s lacking a few features, but it sports a smaller design and a more affordable price tag that will definitely make it a more attractive option for some.",
    "Does the Galaxy Watch Active live up to the original Galaxy Watch? Read on for our full review to find out.",
    "The launch price for the Galaxy Watch Active is set at $199.99 / £229 / AU$348. It was announced alongside the Galaxy S10 in February 2019 and it hit stores in March of the same year.",
    "You're likely to find the price a little lower than the above. We've seen it as low as $179 in the US or £179 in the UK. Those in Australia have seen it drop to around AU$310.",
    "This is quite a bit cheaper than the Samsung Galaxy Watch was at launch, as that sat at $329 / £279 / AU$499. The price of that device can also go up to $349 / £299 / AU$549 when you go for the larger 46mm variant.",
    "There’s only one size of the Galaxy Watch Active (that’s 40mm) so you’ll only have to choose your color when picking which variant to buy. It's available from a variety of retailers as well as directly from Samsung.",
    "This is another circular smartwatch from Samsung. Unlike on the Galaxy Watch, there's no rotating bezel here in what we believe is an attempt to make a sportier design for the wearable.",
    "If that is the intention, it has worked. It feels a lot lighter on the wrist than the larger device, and it’s noticeably thinner on the wrist without losing the premium look of the Galaxy Watch.",
    "We did miss the rotating bezel as it’s one of the most intuitive ways to navigate around a smartwatch, but after a while we got used to scrolling through menus. If you’re after a smaller smartwatch, opt for this one as it makes sense to drop that feature to offer this slimmer design.",
    "The watch body itself is made of metal and it looks high-end. It’s relatively featureless with the main screen centered in the middle and two buttons at the two and four positions on the right hand edge of the watch.",
    "These buttons aren’t always easy to find when you’re unlocking the watch, and we probably would have preferred these to be a little more pronounced to make them easier to press with a finger.",
    "There are four color choices for the Galaxy Watch Active: black, silver, blue (technically sea green) and pink. The pink band comes with a rose gold body, while the rest of the watches just come with the same color as the strap.",
    "All of those bands are made of silicone, which we found to be comfortable even when you’re sweating. It’s a similar feel to straps you can buy for the Apple Watch, and Samsung’s version felt secure around our wrist at all times.",
    "In fact, we could wear this for a full day without finding it irritating on the wrist.",
    "It uses 20mm straps, which can be swapped out. That means you can buy other straps directly from Samsung, or you can even choose to get a third-party strap instead, so there are plenty of options.",
    "In the middle of the watch there’s a 1.1-inch 360 x 360 resolution display. If you’ve used a larger smartwatch, you may find this a bit more restrictive than devices like the Apple Watch 4 or the 1.3-inch Galaxy Watch.",
    "It’s still usable though, and we found we were able to navigate around the features of the watch without ever touching the wrong element on the display. The screen proves to be bright, and unlike a lot of fitness trackers and some cheaper smartwatches it’s a full color display, so it looks great when you’re navigating around Tizen’s variety of apps.",
    "Sometimes we did find the watch difficult to read from certain angles, but it’s not anything that would put you off using the watch altogether.",
    "It's also water-resistant to depths of 5 meters (as well as being IP68 rated), meaning you'll be able to wear this when you head into the pool for a dip, and there’s swim tracking included here too to help you make the most of that.",
    "Image Credit: TechRadar"
  ],
  "headers": {
    "5": "Samsung Galaxy Watch Active price and release date",
    "9": "Design and display"
  },
  "links": {
    "Samsung watches": "https://www.techradar.com/news/best-samsung-smartwatch-finding-the-right-tizen-wearable-for-you",
    "Samsung Galaxy Watch": "https://www.techradar.com/reviews/samsung-galaxy-watch-review",
    "best smartwatch": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Samsung Galaxy Watch Active 2": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-2-review",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review"
  }
}