{
  "source": "https://www.techradar.com/reviews/coreldraw-2019",
  "title": "CorelDRAW 2019 review",
  "category": "computing",
  "updated": "2019-08-26T19:32:01Z",
  "author": "steve-paris",
  "summary": "The latest version has a surprise or two up its sleeve",
  "verdict": "CoreDRAW 2019 offers features which are most welcome and help make this software package more useful and relevant for today’s needs.",
  "pros": [
    "Multi-Platform",
    "Full-features",
    "Bundled with multiple highly useful apps",
    "Choose your pricing structure"
  ],
  "cons": [
    "Expensive",
    "The Mac version’s responsiveness feels a little laggy"
  ],
  "article": [
    "Corel has released a new version of its flagship image editing app CorelDRAW, which is actually a bundle of multiple applications sold under the name ‘CorelDRAW Graphics Suite 2019’.",
    "The package in question includes Photo-Paint, a bitmap and photo editing app with support for layers and non-destructive editing, AfterShot, which is designed to handle raw and HDR images and offers batch processing features, PowerTRACE, a clever tool that helps you transform a bitmap image into a vector one, and FontManager organises your typefaces and font collections, and also lets you index font folders on your local and network drives - which means you don’t need to install all fonts on your local machine should you chose not to while still being able to make use of them.",
    "But the main attraction is of course CorelDRAW, a highly versatile vector-drawing package which is also capable of handling and creating multiple page documents - so you don’t need to use a DTP app as well; you could design it all within CoreDRAW. It has most of the typography and page layout tools you’d need, including master pages, page numbers, compatibility with OpenType, etc.",
    "For those who don’t know, CorelDRAW has been around for thirty years. In that time, it has developed an amazing array of tools, like for instance Colour Harmony, which allows you to alter the hues of an object from one group of complementary colours to another, or Pointiliser, which helps you create vector mosaics. It also comes with intuitive vector editing tools that enable you to alter the curves you create, apply smear and twirl tools, etc.",
    "The designers have worked hard to make this new version more relevant to the needs of today’s users. For instance, a great focus has been put on making artwork more compatible for the web.",
    "With that in mind comes Pixel Perfect control. The idea behind it is to keep your design as sharp as possible when converting it from vector to bitmap. Obviously vector artwork is pin sharp no matter what its size, but bitmap images have a fixed resolution, which is how all images online or in your photo library work.",
    "As you convert a vector image, it might not be perfectly aligned to the pixel grid, leading to a blurry or fuzzy output. Pixel Perfect control lets you zoom into the artwork and with the help of the ‘align with pixel grid’ tool, move parts of your design so the edges don’t overlap pixels, leading to a cleaner, sharper result.",
    "Another big and welcomed improvement is the non-destructive capabilities in this version. It was already possible to add effects to vector images, but now, not only can you add as many effects as you need to a shape, you can alter them and the shape itself at any time, and everything alters accordingly.",
    "The Templates menu has been enhanced as well, making it easier not only to access those that come bundled with the program, but also any custom ones you’ve created.",
    "Perhaps of greater interest is the change to the Object Docker. Now every layer is represented with a thumbnail, which is a graphical representation of the shape in question. This makes it much easier to quickly locate and select the one you need to work on.",
    "Even better, there’s a handy search field at the top. Since you can rename your layers, all you have to do is type what you’re looking for and anything that doesn’t match what you typed will disappear from view. When you’re working on a complex project - as long as you’re organised - you’ll find this a great time saver.",
    "The same applies to the new Find and Replace feature. You can use it to find local drawing components, or an object can be selected and used as a basis for a search, you can breakdown your search by colour, fill, etc. Finding and replacing text can also be done using this method.",
    "The idea of moving with the times is seen with a feature that isn’t actually a part of CorelDRAW but is bundled with the software and fully compatible with it: you can carry on working on and annotating your project on the go. Now before you get too excited, this wasn’t the announcement of a tablet version of CorelDRAW, but failing that, this was the next best thing: a web app.",
    "CorelDRAW.app is the URL. Just as you’d expect, you need to sign in to your Corel account, and once logged in, you can create new designs from scratch or with the help of templates, or open files you would’ve stored in the cloud.",
    "Now you wouldn’t expect to be able to do everything a native app can do, but it should be enough for most of us to keep on working. It’s a great addition for the times you might not be near your laptop but have a great idea you’d like to get started on.",
    "But perhaps the biggest change to CorelDRAW isn’t any of the new features, but the fact that this software is finally returning to the Mac. It’s such a big deal and it’s likely most weren’t expecting that this would be happening. Ever.",
    "CorelDRAW used to be on the Mac years ago, but it was a poor port from Windows and was never well received by Mac owners because of that. This time however, they are guaranteeing that the Mac version has been build specifically for the MacOS while ensuring full file compatibility between platforms.",
    "You get the same design experience including all tools and effects between the Mac and Windows. Corel has worked closely with Apple to follow the Mac’s Human Interface Guidelines, and the software even supports such new features as Dark Mode.",
    "CorelDRAW doesn’t appear to support Apple’s autosave feature though, but if you’re concerned about losing your work for any reason, the auto-backup feature can be changed from the default 20 minutes down to 5.",
    "If you already own a previous version, this upgrade will cost you $199. The full price for a perpetual licence will set you back $499.",
    "This is a big chunk of change for casual designers, but those who use the software professionally would make their money back in no time.",
    "However it is worth noting that Corel also offers a subscription model which costs $198 or $16.50 monthly and would allow you to always have the latest version available. If you regularly upgrade your software, you might find this option more cost effective.",
    "We would be remiss though not to mention that there is competition out there. Adobe is the most obvious one and getting access to all of their apps (not just the design ones, but every single one of Adobe’s apps) costs $52.99 per month. It’s only slightly more expensive for a whole lot more.",
    "If the subscription model doesn’t appeal and Adobe isn’t even on your radar because of that, then take a look at Affinity's series of apps. Extremely affordable and powerful software (all three would cost you $150 in total), two of which are also available as native iPad apps.",
    "CorelDRAW is a veteran on the design stage. Not as prolific as Adobe, but a serious contender in the professional space. The update offers a good list of very welcomed features, and its return to the Mac can only be seen as a commitment to all designers, no matter which platform they prefer to use."
  ],
  "headers": {
    "4": "A version for today's expectations",
    "12": "Work on the web",
    "15": "Not only for PCs",
    "19": "Plans and pricing",
    "24": "Final verdict"
  },
  "links": {
    "CorelDRAW Graphics Suite 2019": "https://www.coreldraw.com/en/product/coreldraw/?topNav=en"
  }
}