{
  "source": "https://www.techradar.com/reviews/suunto-5",
  "title": "Suunto 5 review",
  "category": "wearables",
  "updated": "2019-06-17T10:47:55Z",
  "author": "kieran-alger",
  "summary": "Feature-packed but flawed",
  "verdict": "Even against Suunto’s own watches the Suunto 5 feels dated and clunky, and despite some of Suunto’s most interesting features trickling down from pricier models, it’s hard to get past a poor screen, complicated navigation and a less-than-comfortable design. Right now Garmin, Polar and even new brand Coros offer much better value.",
  "pros": [
    "Good battery life",
    "Useful training plans",
    "Packed full of fitness features"
  ],
  "cons": [
    "Poor screen",
    "Complicated navigation",
    "Uncomfortable strap"
  ],
  "article": [
    "What Suunto does best is make big, rugged, built-to-last watches, primed for the kind of adventures where your tech is likely to take a beating. The Suunto 3 Fitness aside, they’ve rarely strayed from that path and the new Suunto 5 doesn’t deviate too far either.",
    "This latest GPS-tracking multi-sport fitness watch sticks to the Finnish brand’s familiar style with a design that screams Suunto from 50 tracked paces away.",
    "Underneath that rugged exterior, this replacement for the Suunto Spartan Trainer Wrist HR bring skills we’ve seen on higher end Suunto watches enticingly down into the mid-range price bracket.",
    "This includes a 40-hour battery life, with intelligent guidance that learns your training patterns and reminds you to charge before your next session if you’re too low on juice to get it done. There’s adaptive training plans, fitness-level tracking, and activity, sleep and stress/recovery insights too.",
    "You also get built-in optical heart rate and 80 customizable sports modes. But is this enough to make Suunto’s sub-$350/£300 watch a contender at this competitive price point? Read our full Suunto 5 review to find out.",
    "With a $329 / £299 / AU$549.99 price tag the Suunto 5 sits in the middle of the mid-range price bracket alongside the likes of the Polar Vantage M ($280 / £249 / AU$399), the Garmin Forerunner 245 ($599 / £520) and the Coros Apex ($299 / £270). It’s available now.",
    "Plonk the Suunto 5 next to its predecessor and it’s quite hard to tell them apart. There’s the same small screen, with far less real estate for your stats than most of its rivals, you get the Suunto trademark five side buttons to control the watch and – as with the Spartan Trainer – there’s still no touchscreen.",
    "Like the Suunto Spartan Trainer Wrist HR, there’s a set of rigid shoulders that protrude out of the watch face and drop down into the silicone strap.",
    "While they’re curved to fit the shape of your arm, they’re much less pliable than other straps we’ve tested and we found it hard to get a truly comfortable fit, particularly while sleeping, to the point where we wouldn’t really want to wear this in bed.",
    "These fixed shoulders also make the watch feel chunkier on the wrist and though the Suunto 5 calls itself a compact GPS watch – and it is smaller and more compact than a lot of other Suunto watches – at 66g it’s also heavier than the 45g Polar Vantage M and the 38.5g Garmin Forerunner 245.",
    "It gets worse too because although the watch face is as large as the Polar Vantage M and Garmin Forerunner 245, for some strange reason the tiny 218 x 218 resolution matrix color screen is framed in a way that makes the information immediately feel cramped.",
    "And when you compare its clarity and crispness to most other watches, it’s sadly lacking. Even when you hit the backlight it’s dull, suffers from glare, and is difficult to read in a lot of light conditions.",
    "It also scratched far too easily, bringing into question that trademark Suunto durability. After just a week of regular use two big scratches appeared on the bottom of our screen.",
    "You can choose from eight different watch faces to fill that screen, though these are quite limited, mainly offering variations on the time and how many steps you’ve taken against your target for the day.",
    "Flip the Suunto 5 over and you’ll see a 4-LED optical heart rate monitor and the usual four-pin charging port. The latter is thankfully the same as other Suunto charging ports, avoiding Garmin’s habit of changing the USB cable connectors with every new device.",
    "The heart rate sensor isn’t quite as raised as other devices which means there’s no ‘digging in’ from an overly aggressive bump. Though there could be a trade-off here between tight fit and accuracy but more on that on the next page.",
    "The Suunto 5 is water resistant to 50 meters as you’d expect, to unlock the swimming smarts.",
    "It comes in four colors: Black, White, Burgundy Copper and Graphite Copper. The latter two pair a striking copper bezel with color straps for a look that’s more contemporary than the all black and white standards."
  ],
  "headers": {
    "5": "Suunto 5 price and availability",
    "6": "Design and screen"
  },
  "links": {
    "Suunto 3 Fitness": "https://www.techradar.com/reviews/suunto-3-fitness-review",
    "Suunto Spartan Trainer Wrist HR": "https://www.techradar.com/reviews/suunto-spartan-trainer-hr",
    "Polar Vantage M": "https://www.techradar.com/reviews/polar-vantage-m-review",
    "Garmin Forerunner 245": "https://www.techradar.com/news/garmins-new-forerunner-watch-range-brings-phone-free-spotify-to-the-masses"
  }
}