{
  "source": "https://www.techradar.com/reviews/amazon-echo-loop",
  "title": "Hands on: Amazon Echo Loop review",
  "category": "wearables",
  "updated": "2019-09-25T23:21:32Z",
  "author": "david-lumb",
  "summary": "An Alexa walkie-talkie in your palm",
  "verdict": "Amazon's Echo Loop is an oddball product, but one that might be the easiest sell thus far to bringing Alexa out of the home. That said, it's thick, you'll look weird using it, and we doubt having a voice assistant in the palm of your hand is worth buying another device that needs daily charging.",
  "pros": [
    "Simple, elegant use",
    "Decently attractive design",
    "Feel like a spy using it"
  ],
  "cons": [
    "Needs daily charging",
    "Looks odd to use"
  ],
  "article": [
    "The Echo Loop might be Amazon’s weirdest product yet - and weirder still, it kind of makes sense. Instead of talking to Alexa through a smart speaker, you can just slip the Loop - a thick, speaker-filled ring - over your finger and chat with the voice assistant on the go, walkie-talkie style.",
    "It’s part of Amazon’s push to get Alexa out of the house, so to speak. Along with the Amazon Echo Frames, also announced at the September 2019 event, the Loop routes requests through your Alexa-supporting device - but allows you to send queries in a less cumbersome way than pulling out your phone.",
    "Whether folks will wear a ring to interface with Alexa is another question - which is why it’s part of Amazon’s new Day 1 Edition program. It’s essentially early access for hardware, and is only available by invitation for now - but conceivably, it will get the Loop into enough hands to drive enough feedback for a refined consumer-facing final product.",
    "But the use case is easy enough to understand: lean into the Loop’s underside microphone - essentially asking a question into your palm - and lift your palm to your ear, where a speaker will give Alexa’s answer.",
    "Whether folks want and need an Alexa-interacting ring is, perhaps, the biggest question of all.",
    "The Echo Loop is available for $129, but only in the US right now - and only by invitation. It’s unclear when or if it will be available elsewhere, but it’s clear the Loop is having its first trial run among a select group of consumers, much like the Echo Frames, also in the Day 1 Edition program.",
    "Like the Frames, the Loop only comes in a black metal model.",
    "The Echo Loop is a thick ring with a large, flat front and a black titanium finish. It comes in four sizes - small, medium, large, and extra large; those lucky enough to get an invitation to try it out will be sent a “fit kit” to determine which size is right for them.",
    "The inside of the Loop has a button, located a bit off-center to make it easier to hit with your thumb. Hit it to activate Alexa, then speak. It’s that simple.",
    "Next to the Alexa button is a microphone to hear your voice and a speaker - the smallest Amazon has ever built - that you raise to your ear to hear Alexa. Unlike the Frames, which responded loud enough for folks in the immediate vicinity to hear, the Loop’s speaker is only audible if you’re close enough to hug - this is clearly a more discrete product.",
    "The Loop’s flat front contains the other microphone, which detects external audio and algorithmically matches it to ensure Alexa’s vocalized responses are heard. There’s also a haptic engine that vibrates right after the button has been pressed to indicate that Alexa is listening.",
    "Actually using Alexa is pretty easy: click button, lean into your hand (as if about to cough) and ask, lift hand to ear. I found myself naturally cupping my ear to hear the response - it’s natural.",
    "You’ll need a phone or device with the Alexa app to set up the Loop, and much like using Alexa on other devices, the Loop won’t work without an internet connection.",
    "You can use the Loop for nearly everything you could on other Alexa devices - including, yes, playing music, though the tiny speaker won’t do your tunes justice; likewise, taking phone calls might be cumbersome. There are a handful of things it absolutely can’t do, like Drop In to group conversations or send announcements to personal devices like other Loops.",
    "But it conceivably handles adding things to lists and asking Alexa for reminders or asking trivia questions just fine. Its haptic engine vibrates to alert you about a timed or location-based reminder.",
    "Wearing the Loop isn’t super comfortable, as the ring is somewhat thick -- thicker than most wedding bands, anyway. You’ll notice wearing it, but we’d need review time to determine whether it will be annoying to wear all day.",
    "Amazon claims the Echo Loop lasts for an entire day of battery, and unless you’re listening to a ton of music on your Loop, we’d expect that to be a decent estimate.",
    "The Loop recharges via a discrete “cradle” - a column you slide the Loop over until it hits the golden pickups on the inside of the ring.",
    "Like the Echo Frames, it’s tough to tell whether folks will need Alexa interactions outside the home. Sure, it can solve queries and add reminders or make lists faster than pulling out your phone, but it’s also yet another device to pay a not-insignificant sum for...and one more thing to recharge at the end of the day.",
    "That’s likely why the Loop is part of Amazon’s Day 1 Edition program, but it’s hard to judge whether any version of this product will be a must-have for consumers, even after it’s been refined.",
    "But compared to the also-Day-1-Edition Frames, Amazon’s new ring is a more user-friendly device for anyone who could really benefit from taking Alexa on the go. You’ll just have to live with looking a bit weird asking your hand questions and raising it to your ear for answers."
  ],
  "headers": {
    "5": "Echo Loop price and release date",
    "7": "Echo Loop design",
    "11": "Using Alexa, walkie-talkie style",
    "16": "Echo Loop battery",
    "18": "Echo Loop early verdict"
  },
  "links": {
    "Amazon Echo Frames": "https://www.techradar.com/reviews/amazon-echo-frames",
    "September 2019 event": "https://www.techradar.com/news/amazon-2019-launch-liveblog"
  }
}