{
  "source": "https://www.techradar.com/reviews/puma-smartwatch",
  "title": "Puma Smartwatch review",
  "category": "wearables",
  "updated": "2019-12-19T20:34:10Z",
  "author": "jennifer-allen",
  "summary": "A basic smartwatch from a big brand",
  "verdict": "The Puma Smartwatch is a typically sporty first entry into the smartwatch market for the sports fashion brand. Under the hood, it lacks the RAM you'd expect for the price, and there are definitely cheaper ways of getting the same features, but that's not to say it’s entirely without benefit.",
  "pros": [
    "Very lightweight",
    "Simple to use",
    "Good for sports"
  ],
  "cons": [
    "No speaker",
    "Uncomfortable strap",
    "Expensive for what it is"
  ],
  "article": [
    "The first joint smartwatch venture between Puma and Fossil has a predictably dull name: the Puma Smartwatch. But does that dullness continue in the tone of the watch? Yes and no.",
    "Ultimately, the Puma Smartwatch plays it very safe. It's still an appealing enough watch, as it offers all the features that those who exercise regularly will love, but it doesn't offer much extra on top of that.",
    "Yet it's still more expensive than some of its nearest rivals, while packing lower specs than others. Still, if you're a fan of the Puma label, this could be for you.",
    "The Puma Smartwatch came out in November 2019. It's currently widely available with a recommended retail price of $275/£249 (around AU$405). Look around and you can find it a little cheaper, with Amazon UK selling it for £240 for the black variant for example.",
    "The Puma Smartwatch is available in three color schemes - Rose Gold/White, Black/Grey, and Yellow/Black. Expect prices to change slightly depending on your preferred color choice.",
    "The Puma Smartwatch is a watch that is both slim at only 11mm thick, yet also has a bezel that makes it feel bulky and capable of shrugging off some scrapes and damage.",
    "Depending on your choice of color scheme, the bezel can be very noticeable, with the Yellow/Black variant being particularly bright. Combined with the silicone strap, it’s almost a Fisher Price ‘my first watch’ style.",
    "Luckily, you can switch out the strap easily - that's all the better, as we found the strap that comes with it slightly uncomfortable.",
    "The 44mm watch face is a decent size for glancing at to check, with its 1.19-inch AMOLED display looking sharp and appealing, no matter what the lighting conditions may be.",
    "There's a Puma logo on the strap and an even tinier Puma logo on the rotating crown (which can be used to navigate the interface), but that's it in terms of labeling. It's a bit of a missed opportunity for fans who like to advertise their brand affiliation.",
    "Like other Fossil watches of late, such as the Michael Kors Access MKGO, the Puma Smartwatch uses the Qualcomm Snapdragon Wear 3100 chipset, which is the most recently-released smartwatch chipset from Qualcomm and the best you're likely to find with Wear OS.",
    "It also has 4GB of storage and a paltry 512MB of RAM, less than the Fossil Gen 5 which is available for a similar price.",
    "Features-wise, there's built-in GPS, heart rate monitoring, waterproofing up to 5ATM, Google Assistant support, and support for Google Pay, as well as synchronizing with your phone to display notifications. Standard stuff by now with any Wear OS-based smartwatch.",
    "Like other Fossil-made watches, Spotify comes automatically installed, but don't count on a physical speaker here. The Puma Smartwatch has a microphone for Google Assistant control but can't broadcast audio, so you can only use it to control Spotify rather than bump tunes directly from the device.",
    "Not that you'd probably want to listen to music through a watch speaker anyway.",
    "Don’t count on good GPS support here when separated from your phone. The Puma Smartwatch's location-finding is pretty awful, and takes a few minutes for the watch to acquire a signal unless it’s connected to your phone.",
    "That’s the biggest irritant for a sports-focused smartwatch that otherwise covers all the usual bases courtesy of a sweat-proof silicone band and the usual bevy of Google Fit abilities. At least the heart rate monitoring is pretty accurate compared to other watches.",
    "The Puma Smartwatch is pretty standard with battery life. Expect about 24 hours but not much more, unless you switch it to basic watch mode, which somewhat ruins the point of a smartwatch but will get you out of a low-power jam.",
    "First reviewed: November 2019"
  ],
  "headers": {
    "3": "Puma Smartwatch release date and price",
    "5": "Design and display",
    "10": "Specs and features",
    "15": "Fitness",
    "17": "Battery life",
    "18": "Don't buy it if..."
  },
  "links": {
    "Michael Kors Access MKGO": "https://www.techradar.com/reviews/michael-kors-access-mkgo",
    "Fossil Gen 5": "https://www.techradar.com/reviews/fossil-gen-5-smartwatch"
  }
}