{
  "source": "https://www.techradar.com/reviews/cerner-powerchart-emr",
  "title": "Cerner PowerChart EMR review",
  "category": "computing",
  "updated": "2019-11-18T05:42:44Z",
  "author": "jonas-p-demuro",
  "summary": "Medical records in the cloud",
  "verdict": "Although it has the usual opaque pricing, the Cerner EMR remains a strong market leading entry with support for communication to labs and pharmacies for a seamless experience for both clinical providers and patients.",
  "pros": [
    "Dynamic clinical documentation",
    "Auto text",
    "Patient portal"
  ],
  "cons": [
    "No free trial",
    "Quote based pricing model"
  ],
  "article": [
    "Cerner is a top provider in the electronic medical records area, with origins going back to 1979. The company focuses on inpatient care for medium and large organizations, and has support for over 55 medical areas of specialization, with a global workforce that is over 26,000 strong.",
    "The Cerner EMR is an important component of their unified electronic health record system which facilitates work for clinicians, including physicians, nurses, pharmacists, and other ancillary health personnel. The benefits include reductions in cost, and enhancements to patient safety. Furthermore, the Cerner EMR is customizable, to be adapted to a wide variety of deployments.",
    "A downside of any EMR is the work required for entering the data into the medical record. After all, seasoned clinicians fondly recall the days when they could just scribble their entries into a paper Progress Note of the patient’s chart, and legibility mattered little as seasoned nurses could understand their ‘Chicken scratch’ handwriting.",
    "The Cerner EMR incorporates an auto-texting feature. Rather than having to free text entry all of the information into the note, the clinician simply enters a trigger, which then calls up and enters into the medical record pre-completed information, such as a procedure note, and other repetitive documentation. Providing flexibility, this auto-texting feature can be used anywhere in the note that has a free text field, which simplifies the workload for the clinician, reducing the burden of entering information, and actually decreases the time required for documentation compared to traditional handwriting.",
    "Not every clinician is facile with a mouse and keyboard, but Cerner has this challenge covered as well. While data can certainly be entered via a computer via full text, it also supports other options, including voice recognition and code words. This ease of use makes it unnecessary to have various scribes following the clinicians around with tablets, which reduces issues ranging from privacy concerns of unlicensed staff, inputting errors, and additional staff cost.",
    "‘No man is an island,’ and neither is any EMR, as the true point of it is to share data (in a HIPAA compliant way of course), and not just lock it away somewhere. We can report that the Cerner EMR also excels in these integration features.",
    "An example of Cerner’s integration is the process for refilling a prescription. The electronic transmission of prescriptions, known as ePrescribe, continues to gain in popularity, and is even required in some states of the US. The Cerner EMR supports ePrescribe, integrating with third party software that pharmacies use allowing the prescription to be sent to the patient’s pharmacy of choice with ease- no more waiting on the phone for the pharmacist for giving a telephone prescription through this safe and secure process. An analogous process is in place for the ordering of laboratory testing electronically, and receiving the results back immediately after the specimen is analyzed.",
    "We are moving past the days of patients and their families calling the office directly for their lab results, or to renew a prescription. It also becomes a challenge to document these interactions consistently in the busy office environment. Also, particularly younger patients prefer to book their appointments directly- without speaking directly to the office staff.",
    "Cerner EMR offers the Patient Portal, which provides a secure area for direct communication between clinicians and their patients. A critically useful feature is that all the interactions get electronically documented automatically. Patients can then use this Patient Portal to access various aspects of their health record like their latest lab results, to request prescription refills, and to book and cancel their appointments, with an added benefit of reducing staff time for interaction. This Patient Portal is easy to use, and often preferred by younger patients that find it difficult to make time for phone calls.",
    "The pricing of the Cerner EMR is a downside. Unfortunately, Cerner is quite opaque on their pricing structure, so it requires contact with the company, and a direct quote depending on the needs of the organization. We’ll keep in mind that no two facilities are identical, so really each deployment does need to be priced on a custom, and individual basis.",
    "There is also no free trial available.",
    "Options exist for both on site, and off site hosting of the Cerner EMR. Yes, it should make everyone a little nervous to have Protected Health Information (PHI) hosted in ‘The Cloud,’ but this software from Cerner is a fully compliant HIPAA solution to meet all federal standards. The recent news is that Cerner has partnered with Amazon Web Services (AWS) to create an even more effective solution that is scalable and secure. Additionally, current data mining technologies such as Machine Learning, and Artificial Intelligence can be applied via this partnership to identify trends in data.",
    "The only language that the Cerner EMR supports is English, which makes this just fine for the US, Canadian and UK markets, but makes it poorly suited for most other markets. Cerner does offer a variety of support methods for their product, that include interaction via phone, email, and also live support.",
    "The list of supported OS’ and devices is quite expansive via their web portal. The OS’ include Windows, Mac and Linux, along with the mobile OS’ of iOS and Android to support use via a smartphone or tablet- often ideal for documenting bedside patient interactions rather than being limited to a desktop back in the office.",
    "The Cerner EMR is software designed to encompass a wide variety of patient care needs. The pluses include the variety of input methods, the support for third party interactions with labs and pharmacies, and the large number of supported platforms to fit in at any organization. The major shortcoming is the lack of free trial, and opaque pricing. Overall, Cerner represents an excellent choice for an EMR, and continues to be a market leader with good reason."
  ],
  "headers": {
    "2": "Entering data",
    "5": "Integration",
    "7": "The portal",
    "9": "Pricing",
    "11": "Patient data in ‘The Cloud’",
    "12": "Support",
    "14": "Final verdict"
  },
  "links": {
    "electronic medical records": "https://www.techradar.com/best/best-electronic-medical-record-emr-software",
    "Cerner EMR": "https://www.cerner.com/solutions/health-systems"
  }
}