{
  "source": "https://www.techradar.com/reviews/adata-se800-waterproof-external-ssd",
  "title": "Adata SE800 waterproof external SSD review",
  "category": "computing",
  "updated": "2019-10-22T14:00:59Z",
  "author": "desire-athow",
  "summary": "Waterproof, speedy and affordable, there’s a lot to like",
  "verdict": "Absurdly quick, waterproof and not that expensive, the Adata SE800 should be near the top of your list if you are after an external SSD that can deliver what it says on the tin.",
  "pros": [
    "Ridiculously small",
    "Great performance",
    "Affordable"
  ],
  "cons": [],
  "article": [
    "Adata has been a prolific external storage vendor in a market dominated by Samsung and WDC with its three brands SandDisk, G-Technology and WD. These two account for about 90 per cent of the global external SSD market accounting to one source leaving only scraps to the smaller vendors.",
    "Despite not being vertically integrated, the Taiwanese vendor seems to be happy with that though and its latest SSD, the SE800, builds on its predecessor, the SE730H, to deliver a storage product, that on paper at least, promises to shake the market in a way not seen since the launch of the original Samsung T model.",
    "The drive carries a recommended retail price of $180 for the 1TB model while the 512GB model costs $100.",
    "Adata pitched the forerunner of the as the world’s most compact external SSD. It kept the same chassis which in turn kept prices lower, thanks to economies of scale and reduced R&D costs. At 72.7 x 44 x 12.2mm and with a weight of only 40g excluding the cable, it has a smaller footprint compared to the Samsung T3 and T5 and is lighter as well. It is slightly thicker though, probably because it needs extra protection to earn its IP68 certification.",
    "This drive - which is still made of aluminum and rubber - is one of a handful of models on the market that have achieved this certification. If the cap hiding the USB Type-C connector is firmly in place, the drive is completely dust resistant and can remain underwater at a depth of 1.5m for more than an hour.",
    "Like the SE730H, the SE800 also meets the stringent MIL-STD-810G 516.6 impact resistance test so it should survive accidental drops and shocks without much damage. Other than the connector, the cap also hides an activity light that goes solid when connected and blinks when data is written or accessed.",
    "Adata opted for less flashy colors this time around; gone are the gold and red color scheme; instead it’s all black and blue hairline brushed metal surface; our preference goes to more subtle and conservative colours. The unique shape of the drive - from the side, it looks like a pinched oval - makes it easier to hold thanks to the improved grip.",
    "Like most of the Adata drives we have reviewed in the past (Adata SSD Ultimate SU800, the Adata SD700 External SSD and the Adata SV620H), this drive features 3D TLC technology likely to be the same as its sibling.",
    "We tried to open the device but were unsuccessful in doing so; as a reminder, the previous model included a large Adata 121104747533A03 chip, a Nanya 1711 nt5cc128M-161pd1 128MB buffer memory and a VLI VL714-Q4 USB3.1 to SATA 6Gb/s bridge controller for Type-C connector. Most of them are likely to have been replaced by components compatible with higher data rates, so likely to be a USB3.2 to NVMe bridge controller.",
    "It wouldn’t come as a surprise should the latter be connected to an M.2 2242 SSD, one which houses the flash memory, likely to be the IMFT’s 384Gbit TLC 3D NAND (why change a winning formula), something that Adata said is more durable - up to 25% - and more power efficient compared to the previous generation of NAND - no QLC in sight here.",
    "Other than a standard three year limited warranty, the last tidbit worth noting is that it draws up to 4.5W (5V, 0.9A), not a problem if you connect it via a USB Type-C controller.",
    "Two applications - OStoGO and HDDtoGo - are offered as downloads, the drive itself comes formatted as a bare exFAT-formatted model; the first one is an alternative solution to install an operating system without using an optical drive. The second one is more of a toolkit that offers no-trace browsing, file synchronisation, data compression and encryption and more. Both are nice to have rather than must have applications.",
    "Adata claims that the drive can reach read/write speeds of up to 1GBps when combined with a USB 3.2 Gen 2 connector (not to be confused with a USB 3.2 Gen 2×2 one which can reach up to 20Gbps in theory).",
    "We achieved 915MBps and 900MBps on read/write speeds on CrystalDiskMark and 910/992MBps read/write on ATTO. That’s more than twice the speed of the SE730H and very near to Adata’s claims. AJA and AS SSD tests produced slightly lower but still very respectable scores. Copying a 10GB file using Teracopy took around 27 seconds rather than 43.",
    "These results were obtained on a Toshiba Tecra X40-F laptop with a Gen 2 connector which is limited to 10Gbps, so the numbers obtained in the test were close to the theoretical limits (once you account for transfer overheads etc).",
    "There are only a few rivals to the Adata SE800 that will come with an IP68 rating. Ironically, two of them are Adata products; the SD600Q and the SE730H.",
    "If speed is not of a concern (but IP68 rating is), then the SD600Q should be high on your list with a $100 price tag for the960GB model, $80 cheaper than the SE800). Sandwiched between the two is the $160 SE730H which is exactly like the SE800 bar the slower speed.",
    "Sandisk is the only other SSD vendor we know that has an IPxx rating (IP55 in this case). The Extreme has a slower interface and is marginally cheaper at $170. It is also physically larger and heavier plus its connector is not protected by any flap - as is the case with the SE800.",
    "This is the Adata drive we were waiting for moving away from SATA means that the data transfer bottleneck no longer exist. We feared that the move towards NVMe would add to the price and it did.",
    "However $20 is not a big deal in the grander scheme of things and its performance is closer to the slower Thunderbolt 3 devices (e.g the Patriot Evolvr) than it is to the older generation USB 3.x drives. It is still far slower (by a factor of three) than the current king, the Samsung X5 but the latter is also about four times more expensive and is not waterproof."
  ],
  "headers": {
    "3": "Design",
    "7": "Hardware",
    "11": "In use",
    "15": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "SE730H": "https://shop.adata.com/us/ASE730H-1TU31-CTI",
    "1TB model": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-2608301991303871500&murl=https%3A%2F%2Fwww.newegg.com%2Fadata-se800-1tb%2Fp%2FN82E16820215332",
    "512GB model": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-1402578870695092500&murl=https%3A%2F%2Fwww.newegg.com%2Fadata-se800-512gb%2Fp%2FN82E16820215321",
    "T5": "https://www.techradar.com/reviews/samsung-portable-ssd-t5",
    "Adata SSD Ultimate SU800": "https://www.techradar.com/reviews/adata-ssd-ultimate-su800",
    "Adata SD700 External SSD": "https://www.techradar.com/reviews/adata-sd700-external-ssd",
    "Adata SV620H": "https://www.techradar.com/reviews/adata-sv620h-256gb",
    "SD600Q": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-2723745670344349000&murl=https%3A%2F%2Fwww.newegg.com%2Fadata-sd600q-960gb%2Fp%2F0D9-000G-000J3",
    "Extreme": "https://www.techradar.com/reviews/sandisk-extreme-portable-ssd-1tb",
    "Patriot Evolvr": "https://www.techradar.com/reviews/patriot-evlvr-thunderbolt-3-external-ssd-1tb",
    "Samsung X5": "https://www.techradar.com/reviews/samsung-x5-portable-ssd"
  }
}