{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-s8-plus-review",
  "title": "Samsung Galaxy S8 Plus review",
  "category": "phones",
  "updated": "2019-02-05T21:25:34Z",
  "author": "matt-swider",
  "summary": "One of the best big Android phones you can own",
  "verdict": "The Galaxy S8 Plus is the Android phone you want if you like big and tall smartphones. The amazing display, great camera and slick software should make you forget about the awkwardly placed fingerprint scanner and the half-bake Bixby assistant.",
  "pros": [
    "Big screen, acceptable phone size",
    "Best camera on a smartphone",
    "Slick software and performance"
  ],
  "cons": [
    "Your most expensive phone yet",
    "Flawed fingerprint sensor",
    "Hello, Bixby? Hello?!"
  ],
  "article": [
    "Update: We brought out Samsung Galaxy S8 Plus review up to speed now that it's two years older and has a cheaper price attached to it. It's still one of the most capable Android phones out there. Here are our updated impressions.",
    "The Samsung Galaxy S8 Plus, even in 2019, lives up to 'the next big thing' slogan we so often hear from Samsung. It has a ridiculously sized screen, fast chipsets and an equally outsized price – though one that has fallen a fair bit since launch.",
    "We're seeing more Galaxy S8 Plus deals now that the Galaxy S9 Plus has been out for nearly a year and the Galaxy S10 Plus is due to launch on February 20. The latest model will have a bigger screen and be even more expensive, making this the ideal time to upgrade to 2017's Plus-sized phone.",
    "Just how big is the S8 Plus? You’re looking at a 6.2-inch display that far and away makes it one of the best big Android phone you can buy – if you can handle it. The ‘smaller’ 5.8-inch Galaxy S8 or Galaxy S9 exists if you can’t, or if you want something even bigger with a handy stylus, there's the Galaxy Note 8 or Galaxy Note 9.",
    "What’s remarkable is that the elegantly curved screen has dramatically grown half an inch from the 5.7-inch Galaxy S7 Edge, yet the phone is nearly the same size. It’s just a bit taller thanks to the elimination of needless bezel and Samsung’s familiar oval-shaped home button.",
    "Moreover, owning this new Android means you’re upgrading to the most cutting-edge, VR-ready smartphone available. Having the absolute best camera and best OLED display matter to you.",
    "It’s a glimpse of the future and, in a twist of fate for Samsung vs Apple, a lot of what Apple finally put out through the iPhone X. In 2017, Samsung continued to be the smartphone trendsetter.",
    "Obviously, the Galaxy S8 Plus isn’t the perfect phone for everyone, and for more reasons than ‘it’s too tall for people with small hands.’ Having no physical home button is going to be a deal-breaker for some Samsung fans and their muscle memory.",
    "Ironically for such a futuristic phone, the rear-mounted fingerprint sensor on the S8 Plus is stuck in the past. Accessing this off-center scanner is impractical, and Samsung’s new face-recognition unlock feature just doesn’t work well.",
    "Check out our Samsung Galaxy S8 Plus review video",
    "There are now lots of Samsung Galaxy S8 Plus deals since the phone has been out since May 2017. It's still incredibly expensive but the introduction of the Galaxy Note 8 and the passage of time has meant the price has dropped down a touch.",
    "In the US it’s now available at about $35 a month with a 24-month contract through carriers. Verizon, AT&T, Sprint and T-Mobile are all selling the new phone on-contract. It launched on Friday, April 21 2017.",
    "Looking for that elusive unlocked Samsung Galaxy S8 Plus in the US? It costs around $460 on Amazon if you get the 'International' version, and $689 via Samsung, and $639 at Best Buy.",
    "The SIM-free Samsung Galaxy S8 UK price was £779.99 at launch but it's now down to around £600 from some retailers. Either that or you can get it on-contract through a carrier for £45-£50 a month with £0 cost upfront. In Australia it tops out at AU$1,349. It launched on April 28 2017 in both regions.",
    "The Samsung Galaxy S8 Plus design is exactly what we’ve wanted for several years – almost. Before 2017, we had been asking for a bigger screen, but on a phone that’s still small enough to be easy to hold.",
    "Samsung nailed that balance with its nearly bezel-less front face. It once again eliminates the left and right borders with a gently curved screen, and now nearly erases the top and bottom bezels too.",
    "It’s a neat trick. You’re getting an 'all-screen' phone – or what Samsung calls its ‘Infinity Display’ – that gives you more screen real estate without significantly increasing the size of the device.",
    "It measures 159.5 x 73.4 x 8.1mm and weighs 173g. That’s taller than the Samsung Galaxy S7 Edge and even the Note 7, but not by much. And get this: the iPhone 7 Plus with its smaller 5.5-inch screen is just a millimeter shorter and actually wider and heavier than the S8 Plus.",
    "Touching the top corners of the display requires two hands, or extreme juggling with one hand. This phone isn’t going to be easy for anyone moving from a 4.7-inch or 5.1-inch screen.",
    "Everything about the Galaxy S8 Plus design seems to highlight the real star attraction, the 6.2-inch screen. This includes the rather muted Galaxy S8 colors of Midnight Black, Orchid Gray, and Arctic Silver (we’re not getting Maple Gold or Coral Blue in the West).",
    "The same goes for the now-understated rear camera design, and the S-A-M-S-U-N-G logo no longer adorning the top of the screen and staring back at you every single second you use your phone; the logo is now on the back, and everything is a lot cleaner that way.",
    "Samsung has eliminated the ugly rear camera bump, and simply outlines the flat lens with a tiny lip. We’re in favor of this decision – a protective camera lip may save your camera if you do happen to drop it and crack the back glass. We’ve found out the hard way that the bump-free, unprotected Google Pixel XL will spiderweb when just about any part of the back glass shatters, rendering your main camera useless.",
    "You’re once again protected against the elements, too. Samsung’s phone has an IP68 rating to make it dust- and water-resistant. It can survive 1.5m underwater for 30 minutes – you can probably take it deeper, although we don’t suggest testing your luck or your warranty.",
    "The bottom frame of the phone has something new, something old and something ancient: Samsung has finally switched over to the fully reversible USB-C port for charging and data transfer, replacing the non-reversible micro USB port. You can now plug in your phone in the dark.",
    "Samsung keeps the old-fashioned 3.5mm headphone jack, dismissing early rumors that its new phone would eliminate this still-widely-used port in favor of USB-C audio. The company even includes high-end AKG-branded earbuds in the box for clearer audio.",
    "What’s ancient is the single speaker at the bottom, and we’re disappointed to see it. It’s easy to accidentally cover up the grille when watching YouTube videos in landscape mode, and really, when Apple is beating you to something with the iPhone 7, you know there’s a problem.",
    "The biggest shift for long-time Samsung users is the home button. Gone is the physical oval-shaped button, along with the capacitive ‘recent’ and ‘back’ keys that flanked it. Samsung has finally switched to on-screen bottom buttons, including a pressure-sensitive home button.",
    "Sure, on-screen buttons aren’t a big deal for non-Samsung Android owners. They’ve been used on LG, Google and Motorola phones for years, just to name a few. And now you can swap the ‘back’ and ‘recent’ keys if you’d like. You’ll get used to their disappearing and reappearing act when watching a movie that takes up the entire screen.",
    "However, Samsung fans – and everyone else, really – will be tripped up when it comes to the oddly-placed fingerprint sensor. It’s now on the back of the phone, and in an off-center location next to the camera lens. It’s hard to reach, and you’ll often mistake the camera lens for the sensor. Smudge, smudge, smudge. “Why are my pictures so blurry?”",
    "The biggest mistake Samsung has made here is placing this scanner to the right of the camera lens, meaning the majority right-handed users who hold their phone in their non-dominant left hand (to do other things like open doors and of course not drive) are going to have an extra-difficult time unlocking their phone.",
    "Samsung’s solution seems to be no shortage of other ways to unlock your phone: passwords, pins, patterns, an iris scanner and the all-new face unlock. Sounds promising, right?",
    "Face unlock is the default method that you’ll see on the set-up screen, but, while it may work at first, it rejected our faces more than half of the time, requiring us to enter our backup pattern. A 50% fail rate is incredibly problematic. Don’t worry about someone breaking into your phone – you can’t even get in.",
    "We found that the iris scanner, borrowed from the Note 7, is more accurate and maybe only half a beat behind a normal fingerprint sensor. It doesn’t work with sunglasses, and you have hold the top of phone so it’s aligned with your eyes, but this is the retina-scanning unlock method you should switch to. It’s quick enough, it works in the dark and there are fun cartoon owl eyes and scuba masks, so that the two eyes staring back at you don’t look as demonic as they did on the Note 7.",
    "But all of this is a problem when even incredibly cheap Android phones are debuting with fingerprint sensors that work close to 100% of the time. There’s no easy-to-reach fingerprint sensor here, and Samsung’s trumpeted new method, Face unlock, doesn’t even work in the dark.",
    "A true fix may come with the Samsung Galaxy S9. The company was reportedly close to being able to embed a fingerprint scanner inside the front home button, but backed off at the last minute. For now, though, it’s this issue that keeps the Galaxy S8 Plus from scoring a five-star review.",
    "The Samsung Galaxy S8 Plus has the world’s best phone display, and for more reasons than simply because it packs in a lot of extra pixels. That’s definitely not all that’s happening here.",
    "Its new 18.5:9 aspect ratio elongates the screen’s dimensions to give you more viewing space; you can train your eyes on two to three Facebook stories at a time in your newsfeed, instead of having to continuously scroll just to read portions of one.",
    "It’s all thanks to the impressive 88% screen-to-body ratio of Samsung’s ‘Infinity Screen’. The Galaxy S7 Edge had what we thought was a good 76% ratio, while the iPhone 7 Plus sits at about a 68% screen-body ratio.",
    "Reading is certainly easier, and split-screen multitasking feels less cramped, but because it deviates from the traditional 16:9 aspect ratio, the phone throws up black bars when playing video content. This didn’t bother us as much as we thought it would, and it’s partly because every S8 color option has a black front face. It blends really well.",
    "Samsung also gives you some familiar options you’ll remember from when HD first came onto the scene in an SD world. You can choose Smart Cropping, which fills the entire extra-wide screen (some content is cut off at the top and bottom), or Fit to Screen with black bars.",
    "Transitioning between Smart Crop and Fit to Screen is tedious – apps don’t remember what we prefer, and we’re still unsure too. Neither is perfect, though neither is a deal-breaker when it comes to becoming immersed in video on this gorgeous 6.2-inch screen. It’ll be interesting to see where Samsung and LG go with this wider format when they also own the 4K TV market.",
    "Samsung is once again pushing HDR on a mobile device, offering more vibrance, brightness and contrast, just like it did on the Note 7 and the Galaxy Tab S3. It’s even touting the Mobile HDR Premium label on the S8 and S8 Plus. Here’s the (literally) unseen problem: HDR video content from Amazon, Netflix and others just isn’t here yet on mobile devices, only your 4K TV.",
    "The Galaxy S8 Plus is at least future-proofed for the HDR revolution. It’s not, however, bringing a 4K revolution to the palm of your hand. It sticks with the same Quad HD resolution as the Galaxy S7/Galaxy S7 Edge, and frankly we’re okay with that. We’re even okay with it defaulting to Full HD 1080p as a battery-saving tactic. Quad HD is best saved for VR, when the screen is two inches from your face and even at that 2K-level resolution you’re sometime able to make out individual pixels (what’s called the screen door effect).",
    "We’re hoping that Samsung, solely for the purposes of VR, amps that up to 4K with the Galaxy S9 later this year. For everyday use, Full HD actually looks good, and most people won’t be able to tell the difference. You could even tell them it’s 4K and they’ll readily believe you.",
    "Samsung’s curved Super AMOLED display makes it seem as if your app tiles and menus are falling off the sides of the screen as you scroll through your many app-filled homepages. It’s a neat effect that’s sure to attraction attention, and we're even happier with the gentler curve here – we’ve experienced fewer false touches than we did with the S7 Edge or any Samsung phone,. so if that’s been a problem for you with past device, consider it fixed.",
    "We’re also mightily impressed with the enhanced Always-on Display. It constantly shows the time, date, battery life and tiny notification icons (which you can double-tap to open straight away – after you figure out how to unlock your phone). There’s even a way to display world clocks, a calendar and a small image on the Always-on Display. That’s right, you can set lock screen, home screen and now always-on screen wallpaper."
  ],
  "headers": {
    "10": "Samsung Galaxy S8 Plus price and release date",
    "14": "Design",
    "26": "About that fingerprint scanner",
    "35": "Display"
  },
  "links": {
    "Galaxy S9 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s9-plus-review",
    "Galaxy S10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s10-plus",
    "Galaxy S8": "https://www.techradar.com/reviews/samsung-galaxy-s8-review",
    "Galaxy S9": "https://www.techradar.com/reviews/samsung-galaxy-s9-review",
    "Galaxy Note 8": "https://www.techradar.com/reviews/samsung-galaxy-note-8-review",
    "Galaxy Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "Galaxy S7 Edge": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s7-edge-1315189/review",
    "iPhone X": "https://www.techradar.com/reviews/iphone-x-review",
    "Samsung Galaxy S8 Plus deals": "https://www.techradar.com/deals/samsung-galaxy-s9-unlocked-sim-free",
    "$460 on Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSamsung-Galaxy-64GB-Unlocked-Phone%2Fdp%2FB06Y15G61T%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3098174386382597000-20",
    "via Samsung": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-5403886979580569000&url=http%3A%2F%2Fwww.samsung.com%2Fus%2Fexplore%2Fgalaxy-s8%2Fbuy%2Fs%2FSummary&article_name=Samsung%20Galaxy%20S8%20Plus%20review&article_url=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fsamsung-galaxy-s8-plus-review",
    "Best Buy": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1020678616368152700&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fsearchpage.jsp%3F_dyncharset%3DUTF-8%26id%3Dpcat17071%26iht%3Dy%26keys%3Dkeys%26ks%3D960%26list%3Dn%26qp%3Dmodelfamily_facet%253DModel%2520Family~Samsung%2520Galaxy%2520S8%252B%26sc%3DGlobal%26st%3DSamsung%2520Galaxy%2520S8%2520Plus%26type%3Dpage%26usc%3DAll%2520Categories&article_name=Samsung%20Galaxy%20S8%20Plus%20review&article_url=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fsamsung-galaxy-s8-plus-review",
    "iPhone 7 Plus": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-7-plus-1327948/review",
    "Galaxy S8 colors": "https://www.techradar.com/news/latest-samsung-galaxy-s8-leak-reveals-possible-pricing-and-colour-options",
    "Google Pixel XL": "https://www.techradar.com/reviews/google-pixel-xl-review",
    "iPhone 7": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-7-1327947/review",
    "cheap Android phones": "https://www.techradar.com/best/best-android-phones",
    "Samsung Galaxy S9": "https://www.techradar.com/reviews/samsung-galaxy-s9-review",
    "Galaxy Tab S3": "https://www.techradar.com/reviews/samsung-galaxy-tab-s3"
  }
}