{
  "source": "https://www.techradar.com/reviews/gotomypc",
  "title": "GoToMyPC review",
  "category": "computing",
  "updated": "2020-08-27T11:00:31Z",
  "author": "mark-pickavance",
  "summary": "In our GoToMyPC review we look into a simple but expensive remote desktop solution",
  "verdict": "GoToMyPC is a simple and effective software for connecting to a PC or Mac remotely. But, the price is high for a single computer and out of control for business teams.",
  "pros": [
    "Includes file transfer utility",
    "Requires unique passwords for each remote computer"
  ],
  "cons": [
    "Expensive, especially for teams",
    "Difficult to get in touch with support team"
  ],
  "article": [
    "Looking for the best remote desktop software? GoToMyPC enables you to access multiple remote computers quickly and easily from anywhere. Better yet, you don’t need to be an IT whiz to use this software. But despite its simplicity, GoToMyPC is a relatively expensive option for remote computer access.",
    "So, is this the right remote desktop software for your needs? Our GoToMyPC review will cover everything you need to know in order to decide.",
    "GoToMyPC offers 3 plan tiers: Personal, Pro, and Corporate. The Personal plan costs $35 per month for one user and one remote computer. You can add more remote computers, but they’ll cost an extra $35 each.",
    "The Pro plan costs $66 per month and allows up to 50 users with an unlimited number of concurrent sessions. The catch is that only two remote computers are included, and every additional pair of remote computers costs another $66. Since this plan is designed for teams, it includes a handful of administration and reporting features.",
    "The Corporate plan is designed for medium- and large-sized businesses that need remote access to a large number of machines. Pricing starts at $140 per month for 10 user accounts, but you’ll need to contact GoToMyPC to work out details for your company.",
    "GoToMyPC doesn’t include many fancy features, but it makes simple tasks fairly easy. One of the best examples of this is that you can create desktop icons for remote computers. Just double-click and you’re connected. That’s a lot faster than the process you’ll face with more complex remote desktop connection managers.",
    "The software also includes useful features like a shared clipboard and remote printing utility. You can drag and drop files between connected computers, or there’s a bulk transfer tool for moving large numbers of files.",
    "That said, GoToMyPC is missing a few basic functions. You can’t share audio to talk with someone at a remote computer, which complicates the process of using this software for helpdesk applications. There’s also no easy way to record video of a remote session.",
    "GoToMyPC comes with mobile apps for Android, iOS, and Kindle devices. These are surprisingly functional for accessing a desktop computer, as you can access the remote’s device keyboard and move the mouse using your fingertip.",
    "Setting up GoToMyPC is fairly quick. From the computer that you want to access remotely, access your GoToMyPC account online and download the remote controller software. Once it’s installed, you’ll need to log in and create a password to access this remote desktop.",
    "After that, you can connect to your remote computer from any device. Log into your account on the GoToMyPC website to see your available remote desktops. Keep in mind that you’ll also need to download the viewer software, although this only takes a second.",
    "Unless you have a desktop shortcut to access your remote computer, you’ll need to log in to your GoToMyPC web account to see your available connections. This interface is straightforward, if not all that pretty. Your devices are available in a list, and you can access account information like billing from a side menu.",
    "When you open up the viewer software, it’ll launch the desktop on your remote computer. The interface is surrounded by a border, which you can customize to help distinguish between multiple remote desktops. There’s also a small tray of icons in the upper corner, where you’ll find options for text chat with the remote computer and a bulk file transfer tool. The whole thing felt just a little outdated to us, but it also doesn’t distract from your work or overwhelm you with software features.",
    "As for performance, we tested a connection from one Windows 10 computer to another. Establishing the connection only took a second, and there was no apparent lag in moving the mouse or opening programs on the remote computer. Toggling the bandwidth setting in the preferences menu also didn’t seem to impact the connection at all, although this might come in handy if you’re accessing your desktop over a cellular network rather than WiFi.",
    "GoToMyPC has a reasonable number of security features to keep your remote desktops safe. First and foremost, your online account password and your access code for each remote computer must be unique. Passwords cannot be reused. You can also turn on two-factor authentication to add extra security to your GoToMyPC web account.",
    "Importantly, your access codes for each remote desktop are known only to you. GoToMyPC does not keep copies of your access code, which is a major plus for the security-minded. But, that also means that if you forget your code, you’ll need to be physically present at the remote desktop in order to reset it.",
    "GoToMyPC includes 24/7 support with all accounts. However, we had a hard time finding a phone number to call on the company’s website. At the very least, the customer support pages aren’t well-organized. Your best shot is to use the chatbot option and ask questions until you get a live support tech on the other end.",
    "Despite that, the website does have a fair amount of documentation about the software. There are a number of product videos and PDF user manuals for those with more detailed questions. GoToMyPC even has a community forum, although it doesn’t seem to get much traffic.",
    "GoToMyPC is a very easy-to-use remote desktop connection manager. The fact that you can connect to a Mac or PC from mobile devices is nice, and we appreciated the basic file transfer and remote printing features.",
    "But, it’s hard to recommend GoToMyPC for most users because of how much it costs. A lot of competing platforms let you access one remote desktop for free, but this software requires a license for $35 per month. For small businesses, the pricing structure can quickly get out of hand.",
    "There are a number of remote computer access platforms that offer many of the same features as GoToMyPC at a cheaper price point. For individuals, the best is perhaps AnyDesk. It’s free for personal use, or just $10.99 per month for one user and an unlimited number of endpoints.",
    "For business teams, RemoteUtilities for Windows charges a one-time fee of $99 per user and $29 per endpoint for up to 20 remote computers. Just beware that RemoteUtilities—as the name suggests—is limited to use on Windows computers.",
    "You can find out more about the alternatives to GoToMyPC by reading our Best remote desktop software guide."
  ],
  "headers": {
    "2": "GoToMyPC: Plans and pricing",
    "5": "GoToMyPC: Features and utilities",
    "9": "GoToMyPC: Setup",
    "11": "GoToMyPC: Interface and performance",
    "14": "GoToMyPC: Security",
    "16": "GoToMyPC: Support",
    "18": "GoToMyPC: Final verdict",
    "20": "The competition"
  },
  "links": {
    "best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software",
    "GoToMyPC": "https://imp.i122462.net/c/221109/795501/11354?subId1=trd-us-5459582138339204000&sharedId=trd-us&u=https%3A%2F%2Fget.gotomypc.com%2F",
    "3 plan tiers": "https://imp.i122462.net/c/221109/795501/11354?subId1=trd-us-1344948146862063900&sharedId=trd-us&u=https%3A%2F%2Fget.gotomypc.com%2Fplansandpricing",
    "RemoteUtilities for Windows": "https://www.techradar.com/reviews/remote-utilities-for-windows-review",
    "Best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software"
  }
}