{
  "source": "https://www.techradar.com/reviews/benq-gv1",
  "title": "BenQ GV1 review",
  "category": "audio-visual",
  "updated": "2019-05-12T09:37:12Z",
  "author": "nick-rego",
  "summary": "Portable problems?",
  "verdict": "The BenQ GV1 sports a limited app store and few physical connectivity options. Restrictions with wireless streaming also make it a bit awkward to use when paired with a smartphone, making it hard to recommend as a portable projector.",
  "pros": [
    "Easy to carry",
    "Support for iOS and Android, technically",
    "Decent battery life"
  ],
  "cons": [
    "Can’t stream iTunes or Netflix on iOS",
    "Limited physical connectivity",
    "Remote control needs to be carried"
  ],
  "article": [
    "Portable projectors are great for scenarios where you don’t need a full-blown, complicated projection system. Whether you’re looking to entertain the kids before bedtime, watch your favorite football matches during an evening BBQ in the garden, or otherwise – here is a gadget you can transport easily between rooms or homes and set up with little hassle.",
    "That’s pretty much what the BenQ GV1 promises to do – just connect your smartphone or laptop to it via cable or wirelessly, and you should be able to enjoy your favorite movies and TV shows. In reality though, the GV1 isn't as easy to use as you'd hope, making it a somewhat questionable purchase.",
    "The BenQ GV1 is available now, and is priced at $394 (AED 1,450, £329, AUD$553).",
    "We've had confirmation from BenQ that the GV1 will be available in the UK during the first quarter of 2019, which means it'll arrive soon.",
    "At that price point there are a couple of similar models to consider in our best portable projector guide. The ASUS ZenBeam E1 for example is only $269, and while it doesn't have wireless streaming, it's faster and less of a hassle to use.",
    "The GV1 looks more like a portable speaker than a projector, and that’s totally intentional. The speaker grille elegantly meets the top projection part, separated by a bright yellow band. The actual projector can tilt upwards up to 15 degrees, and the entire unit can also fit onto a standard camera tripod mount.",
    "On the top you’ve got four buttons – two for adjusting volume, and one button to turn the unit on. There’s also a button that toggles the GV1 between being a projector and just a Bluetooth speaker. There’s a manual focus ring to the side too, while the GV1’s auto-keystone ensures that you always have a well-aligned image.",
    "At the back are two ports, one for a power adapter and a USB-C port for connecting a device such as a compatible smartphone or laptop (BenQ includes a USB-C to USB-C cable with the projector). You can also connect a USB-C card reader to project content such as photos or videos off a memory card or USB drive.",
    "It's a shame that the GV1 doesn't include a standard USB-A port, or at least some kind of dongle to connecting other inputs easier. Also, just because your device has a USB-C port doesn’t mean you can immediately connect it for projection – it needs to support DisplayPort 1.1 at least in order for the GV1 to detect it.",
    "The lack of an HDMI or mini HDMI port also makes the GV1 pretty useless for gaming consoles, or older laptops without more modern ports. You may think you can use an HDMI to USB-C adapter to solve this, but the current technical limitations of the GV1 won't allow it.",
    "From a technical side of things, the GV1 has a maximum brightness of 200 lumens when plugged into a power source, but drops to much lower brightness when running on battery. Its native resolution is 480p, but is capable of resolutions from 640x480 all the way to 1920x1080. The GV1 runs a modified version of Android, which sports the Apitode app market rather than the official Google Play store.",
    "That's a disappointment, as the apps available on Apitode are quite out of date, or aren't from official providers. The YouTube app for example, is woefully out of date, and doesn't support signing in or the ability to cast a video from the YouTube app on a smartphone.",
    "It's important to remember to update the GV1 to the latest firmware, as this new firmware is the one that will introduce the app store and improve overall stability.",
    "Bundled with the GV1 is a slim remote for navigating through the OS as well as changing various settings. Because there are no other buttons on the GV1 itself, you must always bring this remote with you, simply because when you plug in a video source into the USB-C port, it won’t automatically display the source.",
    "Instead, you have to press the ‘Ok’ button on the remote control, which would have been so much easier if these buttons were on the device itself. The fact that the remote doesn’t light up either makes it difficult to navigate its controls when in poor or dim light – say, when you're settling in for a movie.",
    "Setting up the GV1 is actually quite easy – just power it on, set up the WiFi, and you’ll almost instantly be able to stream to it via Apple AirPlay. If you’re on Android, you’ll be able to use Google Cast to do the same, and there’s no fiddling about on the projector to switch between either streaming method, which is a relief.",
    "As mentioned before, you can also directly plug a device into the GV1 using the supplied USB-C cable. We connected a Huawei P20 Pro smartphone to it and it instantly mirrored the phone’s screen.",
    "Things go downhill when you’re trying to stream wirelessly, specifically content from Netflix or iTunes on iOS – as neither of their iOS apps were compatible with the GV1. YouTube works perfectly fine, but who’s connecting a projector just to watch YouTube clips? We tried connecting a USB-C to Lightning cable in the hopes that it would fix our iOS problems, but our connected iPhone just started charging via the GV1, rather than outputting a display.",
    "Streaming via Android was another mixed bag – out of six Android phones we tried, only one of them managed to see the GV1 out of the box natively. For any other Android device, you'll need to install Google Home on your Android phone to cast to the GV1.",
    "Thankfully, streaming Netflix wirelessly worked without any of the issues we experienced on iOS, though we did notice an occasional frame drop. Of course, if your Android phone supports DisplayPort 1.1, you can just plug it straight into the GV1 without any issues.",
    "Things are slightly better when you connect a Macbook via AirPlay, which recognizes the GV1 and mirrors your screen to whatever you’re watching. This slightly defeats the purpose of the GV1 though – it’s a portable projector, and you'd hope it would work as well with a smartphone rather than a larger and more cumbersome laptop. You can also use Chrome on a Windows machine to broadcast a browser tab or your desktop directly to the GV1, which is handy.",
    "The actual projection quality will vary depending on whether or not the GV1 is plugged into a power source. If you can stretch a power cable to your backyard, you can enjoy a decent backyard cinema experience. Lose the power source, and brightness drops considerably to maintain battery life. You can adjust picture settings to get the best image quality, but this is again only available when there’s a power source plugged in.",
    "For the best projection you’ll want to adjust the GV1 to a 60” screen from a few feet away. You can technically go as large as 100”, but you’d have to use it in a very darkened room to maintain some semblance of image quality.",
    "The 5W sound chamber does a decent job of amplifying audio in a small room, though things get a bit murky outdoors, as the GV1's speaker isn’t powerful enough for dialogue to be heard clearly if you’re sitting further away from the unit. In testing the battery life we found it came in at just under the three hours promised by BenQ (around 2h43).",
    "If you’re in a scenario where you don’t have access to WiFi, the GV1 can broadcast its own hotspot for you to connect to in order to enable wireless streaming. However this will disable Internet on your smartphone, so you can only stream content that’s already on your phone.",
    "The BenQ GV1 is a stylish and portable projector, but has some serious hurdles to overcome. The middling app store can be overlooked, but the issues around iOS streaming are just too hard to ignore, especially since the lack of an HDMI port severely limits physical connectivity.",
    "The reliance on the remote control is also disappointing, and we would have liked to have seen controls on the projector itself for a more independent portable device.",
    "While it may be stylish, the BenQ GV1 is hard to recommend unless you’re an Android user. Otherwise you'll be better off with one of the mini projectors at the link below."
  ],
  "headers": {
    "2": "BenQ GV1 price & availability",
    "5": "Design & features",
    "15": "Connectivity & performance",
    "25": "Our verdict"
  },
  "links": {
    "best portable projector": "https://www.techradar.com/news/best-portable-projectors"
  }
}