{
  "source": "https://www.techradar.com/reviews/audio-technica-at-lp60xbt",
  "title": "Audio-Technica AT-LP60XBT review",
  "category": "audio-visual",
  "updated": "2020-05-11T12:10:55Z",
  "author": "olivia-tambini",
  "summary": "Vinyl, but make it modern",
  "verdict": "The AT-LP60XBT makes a great starter turntable for beginners, thanks to its low price, easy setup, and support for wireless playback.",
  "pros": [
    "Great value for money",
    "Easy setup",
    "Wireless playback"
  ],
  "cons": [
    "Audio could be more detailed",
    "Materials feel a bit cheap"
  ],
  "article": [
    "Audio-Technica boasts a long legacy of creating consumer turntables, but its latest models are looking to the future with the inclusion of wireless Bluetooth connectivity for cable-free listening.",
    "The AT-LP60XBT, which “combines high-quality record playback with the convenience of wireless operation” according to the company, is a great example of how turntables are being refreshed for the age of wireless audio.",
    "So, is the AT-LP60XBT as convenient to use as Audio-Technica says? We put the wallet-friendly automatic turntable to the test.",
    "The AT-LP60XBT is available to buy for $149 / £179 / AU$299, much cheaper than many of the best turntables, which tend to range in price between $200 and $1000.",
    "It’s not the first time Audio-Technica has released such a budget-friendly deck; one of our favorite turntables is the AT-LP60, which originally retailed for $99 / £140 (around AU$140).",
    "Overall, the design of he AT-LP60XBT is both pleasing and functional with a matte black plinth and space-saving sleek build.",
    "It’s also incredibly light, coming in at just 2.6kg, thanks to its extensive use of thin plastic. The downside to that is while its neat dimensions and lightness could be an attractive feature for those who are short on space, the AT-LP60XBT does feel slightly fragile.",
    "That insubstantial feeling is also present in the dust cover, which is also made from clear plastic, and the turntable’s fragile-feeling tonearm; while testing the AT-LP60XBT we found ourselves worrying that it would break.",
    "That’s not to say that the AT-LP60XBT is badly designed – all its components work very well – but the materials used here aren't as luxurious as you'd find elsewhere.",
    "Setting up the AT-LP60XBT is fairly straightforward, but it does require some assembly before you can start spinning your records.",
    "Firstly, you’ll need to place the platter (the part that turns the record) onto the spindle (the bit that sticks through the hole in the middle of your vinyl). Once you’ve done this, you can attach the belt to the motor pulley, and place the felt mat onto the platter.",
    "Audio-Technica recommends that you then “rotate the platter 10 times” using your hands to reset the auto mechanism, get rid of any twists in the belt and make sure the belt “rides smoothly along the drive rim on the underside of the platter”.",
    "You do get an instruction manual in the box, with helpful illustrations to guide you through this process, but if you’re unsure, you can also check out our guide on how to set up a turntable.",
    "Once you’ve assembled the turntable, you can plug in the AC adapter, and you’re ready to go – pressing the start button will spin the platter and lift and lower the tonearm automatically, which is handy for beginners who are worried about breaking the delicate stylus or their precious records. You can maneuver the tonearm manually as well, if you wish.",
    "It can be used with a wired connection to your speakers or headphones, or wirelessly via Bluetooth. With a built-in phono equalizer function, Audio-Technica says that you can use the AT-LP60XBT without a “phono amplifier or connectable equipment with a built-in phono amplifier”. You can also use it with your own external phono amplifier if you prefer.",
    "We tested the AT-LP60XBT using wireless headphones connected via Bluetooth, and we found the pairing process to be totally seamless – you just need to put your Bluetooth headphones or speakers into pairing mode, and then hold down the Bluetooth button on the bottom left corner of the turntable’s plinth.",
    "When it's in pairing mode, an LED light will rapidly flash blue and red, before settling on blue to indicate a successful connection.",
    "We didn’t experience any connection dropouts while using this feature, and we loved the fact that we could combine the grainy analogue warmth of a vinyl with the modern convenience of wireless headphones.",
    "While the calling card of the AT-LP60XBT is its support for wireless playback, you can of course connect your speaker setup with a wired connection, which audiophiles may prefer for a higher level of audio quality.",
    "Saying that, as the turntable supports Bluetooth 5.0 aptX connectivity, the sound quality is still pretty impressive over a wireless connection.",
    "To test the AT-LP60XBT, we played Sufjan Stevens’ Carrie and Lowell album – and it flowed beautifully, with interweaving guitar arpeggios sweetly accenting Stevens’ harmonized vocal melodies.",
    "The soundstage is generally very warm, which isn’t unusual for vinyl; however, if you prefer your music to have a little more attack in the treble frequencies, you may find yourself craving a bit more crispness – it’s all a matter of taste.",
    "Audio-Technica is known for producing high quality cartridges, and the one used on this turntable is no exception; the ATN3600L conical stylus fits perfectly into the grooves of the record and reveals details in songs you may have never noticed before – in short, it makes your music an absolute joy to listen to.",
    "With a budget-friendly price, easy assembly, and the convenience of wireless playback, the AT-LP60XBT could make a fantastic first turntable for any fledgling vinyl enthusiast.",
    "While the plinth does feel somewhat insubstantial, and the sound might not be detailed enough for some, it's brilliant price more than makes up for that – and the inclusion of Bluetooth connectivity makes the AT-LP6XBT feel like very good value for money.",
    "Hardcore audiophiles may prefer the sound and look of Hi-Fi turntables like the $1700 / £1500 (around AU$2750) Cambridge Audio Alva TT, but if you’re looking for something super simple and not too pricey, the AT-LP60XBT might be your best bet."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "9": "Features and performance",
    "23": "Final verdict"
  },
  "links": {
    "AT-LP60": "https://www.techradar.com/news/should-i-buy-the-audio-technica-at-lp60-fully-automatic-belt-drive-stereo-turntable-with-sp121bk-active-speaker",
    "how to set up a turntable": "https://www.techradar.com/how-to/how-to-set-up-a-turntable",
    "Cambridge Audio Alva TT": "https://www.techradar.com/reviews/cambridge-audio-alva-tt-turntable-review"
  }
}