{
  "source": "https://www.techradar.com/reviews/asus-zenfone-6-review",
  "title": "Asus ZenFone 6 review",
  "category": "phones",
  "updated": "2019-06-05T16:00:40Z",
  "author": "andrew-williams",
  "summary": "A clever camera is just the start",
  "verdict": "Many people will probably be drawn in by the Asus ZenFone 6's motorized flip camera, but they'll stay for the great value, battery life and raw performance, as these are what truly makes it worth buying.",
  "pros": [
    "Excellent battery life",
    "Large notch-free screen",
    "Very powerful"
  ],
  "cons": [
    "No zoom camera",
    "Motorized camera feels vulnerable",
    "It’s not the prettiest around"
  ],
  "article": [
    "For years Asus made fairly conventional Android phones that, while solid, did not establish the company as a big name in phones. You may know Asus for laptops and routers, but probably not its mobiles.",
    "The Asus ZenFone 6 is part of a new class of attention-grabbing models a little different to others you’ll find on shelves.",
    "In 2018, Asus gave us the ROG Phone, a gaming Android based on the style of its popular ROG gaming laptops. The Asus ZenFone 6 has broader appeal, but you could argue it is actually stranger.",
    "The Asus ZenFone 6 has a motorized flip camera. It can track subjects as they move, take ‘auto’ panoramas, and lets you shoot 4K 60fps selfie video.",
    "This is not what makes it a great phone, fun as it is. Excellent value, clean-looking software and two-day battery life are. The Asus ZenFone 6 is one of the best sub-$500/£500 phones, now Huawei and Honor handsets are harder to recommend following cut ties with companies like Google.",
    "The Asus ZenFone 6 was announced in May 2019, but it’s not the first phone to bear this name.",
    "Asus made a 'ZenFone 6' in 2014. You’re not likely to mistake the two, unless you make a grave eBay error. This phone has a motorized camera. The old version went off-sale years ago.",
    "The new ZenFone 6 costs $499/£499 (roughly AU$725). At this price obvious alternatives include the OnePlus 7, Honor 20 Pro and Google Pixel 3a XL.",
    "Which is the best? The ZenFone 6 pushes hardest in the tech-per-dollar stakes but is also the strangest of the bunch. And a few little software elements seem slightly underdeveloped at launch, which will likely improve with updates. This is the early adopter’s pick of the bunch, but it does not come with the usual early adopter tax.",
    "If you forget the Asus ZenFone 6’s flip camera for a moment, it seems a typical 'challenger brand' mobile. It needs to lure us away from the likes of Google, Samsung and Huawei. And to do that, Asus offers a lot of tech for relatively little money.",
    "The ZenFone 6 has the high-end Snapdragon 855 chipset. It has 128GB or 256GB of storage, a huge 5,000mAh battery and a hole-free 6.4-inch screen.",
    "All the core elements of a top-end phone are here. But you pay what they used to cost years ago, not today’s prices.",
    "You’re probably here because you have heard about the ZenFone 6’s motorized camera. Some other phones have little selfie cameras that pop out of the top of the frame, but the ZenFone 6’s flips around from the back, so the same two lenses are used for both selfies and regular shots.",
    "One is a 48MP camera with a ‘normal’ view, the other a 13MP ultra-wide one. There’s no zoom, and night image quality is not nearly best-in-class. The Honor 20 Pro and Pixel 3a XL pip it for image quality with some scenes, but we think most of you will be happy.",
    "The camera also has an effect on the ZenFone 6’s appearance. This is a gadgety-looking phone, one that will go down better with a nerdy crowd than those who like big names and slick or minimalist looks.",
    "However, that does not mean any corners have been cut. The Asus ZenFone 6 has a curved Gorilla Glass 6 front, an earlier generation of this toughened glass on its back, and aluminum sides. It may have a geeky aura, but this phone does not look or feel remotely cheap.",
    "The flip camera may repel people as well as converting fans, but Asus has done a great job here for the price.",
    "Those after a mid-price Android phone are spoilt, as there are plenty of models that don’t look any cheaper than the top-price ones.",
    "The Asus ZenFone 6 is not one of the prettiest around. Its finish is plain, and its motorized camera housing looks a bit odd.",
    "We’re glad Asus didn’t use an 'out there' finish. It doesn’t need anything else to stand out. If anything, we wish it was plainer. What’s with the blue logo and rear writing, Asus?",
    "The Asus ZenFone 6 feels good, though. Its back is curved Gorilla Glass. The sides are curved aluminum with beveled edges.",
    "This is a big phone. It’s larger than the Honor 20 Pro, smaller than the OnePlus 7 Pro, but the difference is not as great as you might expect. The ZenFone 6 has small screen surrounds, not teeny-tiny ones.",
    "In another respect, the phone’s size is actually quite impressive. The Asus ZenFone 6 has a massive 5,000mAh battery, but it is not obviously fatter or heavier than its peers at 190g.",
    "When you consider Asus also had to cram in its motorized camera mechanism, that’s an achievement. You also get a simple case in the box, which is handy.",
    "The Asus ZenFone 6 does not have any explicit water resistance, like a lot of phones in this class. As for configurations, you get a choice of either 128GB or 256GB or storage, and 6GB or 8GB of RAM.",
    "There’s one odd part. The Asus ZenFone 6 has a headphone jack, which is rapidly gaining unicorn-like status among pricier phones. We love that it’s here. And, as you might imagine, we’re not short of the odd pair of wireless headphones at TechRadar.",
    "Its fingerprint scanner is a very conventional rear pad, a fairly small rounded-off rectangle with fair but not fantastic ergonomics. It is quick. Perhaps not the quickest we’ve seen but still quicker and less problematic than the earlier in-screen fingerprint scanners and 2019’s Samsung Galaxy S10.",
    "A little piece of older tech makes sense when you consider the motorized camera. The Asus ZenFone 6’s camera sits in a little metal block that rotates around on a 13-gear mechanism. It’s a complicated little thing.",
    "It also makes us a lot more worried about its long-term resilience than the OnePlus 7 Pro and Oppo Reno pop-up cameras. You can accidentally force it the wrong way, like overextending a limb joint, and open it up manually (which you aren’t meant to do).",
    "The Asus ZenFone 6's camera motor sounds, well, odd too. It’s the ghost of an old dot matrix printer, and the tone changes as it works its way through the movement. This is only because the gears it uses change, but this seems the most potentially problematic motorized camera we’ve seen so far.",
    "We’ll look at its various benefits in the camera section of this review.",
    "It can, surprisingly enough, be used to face unlock the Asus ZenFone 6. However, it’s a little too slow and ungainly. You press the button, flick up to get to the unlock page, then the camera flips around in just under a second.",
    "The camera itself is fairly quick to operate, given it flips through almost 180 degrees. But we much prefer using the fingerprint scanner. You can even feel the vibrations of the mechanism through the ZenFone 6’s back. It’s a bit much to use 50 times a day.",
    "Asus says the camera has been tested for 100,000 operations. We’re less worried about lab-style conditions than the ways it might be accidentally abused over the months, though. And if you have kids, that risk goes through the roof.",
    "Perhaps we are being too conservative, but the Asus ZenFone 6 does seem an early adopter’s gamble.",
    "The phone also has a Smart Key. This is an additional button on the side, just high enough to be ignored 99.8% of the time.",
    "Press it and the Google Assistant pops up. Google seems to encourage its partners to use these buttons, as it really wants us to use the assistant. However, you can customize it too. Single taps, double taps and long presses can all do different things.",
    "This doesn’t include running specific apps, but it can toggle Do Not Disturb, switch between silent/vibrate modes, take a screenshot and toggle auto-rotate.",
    "The Asus ZenFone 6 has a 6.4-inch screen. It’s an LCD display, so you don’t quite get the color saturation or contrast of the Galaxy S10 or OnePlus 7 Pro. However, it’s hard to imagine exactly who would want more color punch than you get here.",
    "This phone’s wide color gamut mode has an OLED-like richness that we actually find a bit too much. It’s based on the DCI-P3 standard, the range of colors used by cinema color graders.",
    "Switch down to ‘standard’ mode and the app icons of Chrome and YouTube look subtler, and less garish.",
    "You can go even further if you want to. The Asus ZenFone 6 has a version of Splendid, the display customization software Asus puts in many of its tablets and laptops. You can manually alter the saturation, and even the color hue. Maxed-out, the screen looks ridiculously vivid. Not in a good way.",
    "Brightness is at a similar level to the Honor 20 Pro. It doesn’t have the kind of turbo-charged brightness that makes composing images on a very bright day a cinch, but you can see what’s on-screen clearly enough. Asus says the backlight offers 600-nit brightness. A few phones can now reach 1000 nits, but this is respectably bright.",
    "Display shape is the real appeal of the Asus ZenFone 6's screen. As there’s no need for a dedicated selfie camera, the screen is free to fill out the front, bar a couple of millimeters’ worth of border.",
    "This is a superb display for video streaming, better even than the Samsung Galaxy S10 Plus’s in some respects. There’s no punch-hole or notch to spoil the image when you make a video fill the screen.",
    "Punch holes may have only arrived what seems like weeks ago, but the motorized camera style of the Asus ZenFone 6 has genuine appeal.",
    "There are just a couple of display shortcomings. Brightness drops off quite significantly, and whites become ever-so-slightly purplish at an angle. We’ve also stumbled upon a bug. When used on a bright day, causing the Auto brightness to max-out the screen, the ZenFone 6 often reverts to the minimum backlight level.",
    "You’ll assume the phone has turned itself off. But the screen is just too dark to let you see anything. The one possible reason for this is that the Asus ZenFone 6 drops brightness when it gets warm. However, a simple software bug is the more likely cause as the phone never actually became that hot. Like most recent phones, the ZenFone 6 handles heat fairly well."
  ],
  "headers": {
    "5": "Asus ZenFone 6 price and availability",
    "9": "Key features",
    "17": "Design",
    "38": "Screen"
  },
  "links": {
    "ROG Phone": "https://www.techradar.com/reviews/asus-rog-phone-review",
    "OnePlus 7": "https://www.techradar.com/reviews/oneplus-7-review",
    "Honor 20 Pro": "https://www.techradar.com/reviews/honor-20-pro",
    "Google Pixel 3a XL": "https://www.techradar.com/reviews/google-pixel-3a-xl-review",
    "OnePlus 7 Pro": "https://www.techradar.com/reviews/oneplus-7-pro",
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Oppo Reno": "https://www.techradar.com/reviews/oppo-reno-review",
    "Samsung Galaxy S10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s10-plus"
  }
}