{
  "source": "https://www.techradar.com/reviews/lg-c8-oled-oled55c8",
  "title": "LG C8 OLED (OLED55C8, OLED65C8) review",
  "category": "televisions",
  "updated": "2021-02-04T09:54:24Z",
  "author": "stephen-withers",
  "summary": "LG set a new standard with its 2018 OLED range",
  "verdict": "The C8 OLED combines an impressive picture, extensive features, attractive design and an unrivaled smart platform to deliver one of the best TVs we have yet to see.",
  "pros": [
    "Superb picture quality",
    "Comprehensive features",
    "Highly effective smart platform",
    "Elegant design"
  ],
  "cons": [
    "Limited peak brightness for HDR",
    "No HDR10+ support"
  ],
  "article": [
    "There's no doubt in our minds that LG’s billion dollar gamble on OLED TV tech has paid off in spectacular style over the past few years, as its OLED TVs dominated the premium end of the market. A combination of performance, features and some fairly aggressive pricing resulted in LG beating Samsung’s QLED when it came to higher-end models.",
    "So, what's LG's next move? Simple, just make the best even better.",
    "The new C8 isn’t massively different from its 2017 counterpart – the LG OLED C7 – so you still get an extensive set of features that includes almost every high dynamic range format and Dolby Atmos sound.",
    "New for this year is the design of the TV itself, not to mention the internal components where LG has integrated its new Alpha 9 processor and added some new picture features to deliver a TV that sets the OLED bar very high indeed.",
    "It's worth noting that the C8 comes in three sizes: a 55-inch (OLED55C8), 65-inch (OLED65C8, reviewed here) and 77-inch (OLED77C8).",
    "The C8 is yet another winner from the LG design team, with an elegant simplicity that effectively emphasises the ultra-thin nature of the OLED panel. There’s no bezel, just a black metallic trim around the outer edge, reinforcing the sense of a size zero screen.",
    "The TV is mere millimetres thick at the top but widens out at the bottom, where the electronics, speakers and connections are housed. The rear is a two-tone affair, with brushed aluminium at the top and dark grey plastic further down, and the overall build quality is very good.",
    "The TV sits on a wide and sloped stand that not only retains an attractive aesthetic quality but also serves a practical purpose, redirecting sound from the downward-firing speakers towards the viewer. There is a genuine beauty to the streamlined minimalism of the C8, and it’s a lovely looking TV.",
    "LG abandons minimalism for a more comprehensive approach to the connections, which include four HDMI inputs: three at the side and one facing the rear.",
    "There are also three USB ports, with one at the side and two facing rearwards, along with a terrestrial and satellite tuner, a LAN port, a CI slot, an optical digital output, a line out and a headphone jack. On the wireless side, there’s built-in WiFi, WiDi and Bluetooth support.",
    "Operating the C8 remains a pleasure thanks to the Magic remote, an incredibly precise motion controller. This handset uses a combination of on-screen pointer and scroll wheel, allowing you to easily access menus, navigate the smart platform and control the TV. You’ll quickly appreciate the merits of the Magic remote, making other TV controllers seem antiquated by comparison.",
    "Design TL;DR: The C8 is beautifully designed, combining style and minimalism to deliver a TV that perfectly complements the impressive picture quality.",
    "LG’s WebOS remains largely unchanged from previous years - but, if it ain’t broke why fix it? That said, you can expect the same intuitive and highly responsive smart platform that still uses a launcher bar along the bottom this time around.",
    "Here you can choose from various streaming services and connected devices, as well as other features such as the Gallery (which has been expanded this year), Content Store and Web Browser.",
    "There’s also a very useful Recommendations service that can be accessed by moving the Magic remote cursor to the right-hand side of the screen. This monitors your viewing habits and makes recommendations based on a predictive algorithm.",
    "WebOS is incredibly easy to use, but despite its inherent simplicity you’ll find all the UK catch-up services thanks to Freeview Play, as well as NOW TV, Netflix, Amazon Prime Video and YouTube. The latter three include support for 4K, HDR and, in the case of Netflix, both Dolby Vision and Dolby Atmos.",
    "If you’re looking for other ways to control the C8 besides simply using the Magic remote, there’s the option of LG’s effective remote app.",
    "There’s also voice control, which uses a microphone built into the Magic remote and has been upgraded this year with natural language processing, making interaction more ‘conversational’.",
    "It’s actually quite effective and can prove very useful, especially when searching for content. When voice controlling the TV, there are also simple guidelines built in that can be accessed using the appropriate button on the remote.",
    "The improved voice control is part of ThinQ AI, which is a proprietary artificial intelligence technology that LG has added to WebOS this year. It is based on the Internet of Things (IoT) and uses ThinQ open-standard control protocols to enable its TVs to communicate with other devices that support ThinQ.",
    "Speaking of communicating with other devices, ThinQ also includes compatibility with Google Home and Amazon Echo AI speakers.",
    "Smart TV TL;DR: WebOS was a game changer when first released and it remains the best smart platform, with a comprehensive set of streaming services and easy control via remote, app or voice.",
    "The C8 delivers some of the best HD/SDR images we have ever seen, with the deep blacks that one associates with an OLED TV and gorgeous saturated colors. LG has taken great strides in eliminating issues that affected OLED screens in the past, such as crushed blacks or poor screen uniformity. The C8 has none of these problems; just a lovely picture that is free of any crush, discoloration or uniformity issues.",
    "There are a number of picture modes to choose from but Technicolor and ISF deliver highly accurate images with natural colors, accurate whites and any unnecessary processing turned off. For those who prefer their TV picture with a bit more punch, the Standard mode results in images that are bright, vibrant and detailed, thanks to some excellent processing.",
    "The new Alpha 9 processor is highly effective, taking HD images and upscaling them to match the native 4K resolution of the panel. The results were particularly impressive with good quality HD sources, where the processing was able to retain all the fine detail and avoid any unwanted artefacts. However it was also able to take lower quality HD images and clean them up to a degree, removing unwanted noise whilst retaining a natural-looking image.",
    "LG have added a new de-contouring feature to the Alpha 9 processor, which is activated by selecting the low setting in the MPEG Noise Reduction control. This is designed to remove contours (banding) in source material and we found that it actually worked very effectively on content where this is an issue, such as the skies in The Martian or the opening of In the Heart of the Sea.",
    "The motion handling has been improved since last year and football in particular looks much better, with the C8 tracking the ball and players with greater precision. Although we would recommend turning TruMotion off for films and TV dramas, unless you want to suffer the dreaded ‘soap opera effect’ (SOE), it can be very effective with fast sports action.",
    "This year LG have also added Motion Pro, which is a ’black frame insertion’ (BFI) feature that, as the name suggests, literally adds a black frame between every other frame. This results in better motion without introducing SOE, but it does result in the image darkening and some people will see flicker caused by the black frames, so it’s not for everyone.",
    "If you love gaming, the C8 is sure to please with an extremely responsive 21ms input lag that should be low enough for even the most demanding gamers. To get such a low input lag you’ll need to select Game mode but the results are as impressive as they are responsive and we really enjoyed gaming on the C8.",
    "A word of caution, OLED is a self-emissive technology and there is a possibility of image retention or even screen burn, so bear that in mind if you game for hours on end.",
    "HD/SDR Performance TL;DR: A combination of deep blacks, vibrant colours, superb processing and improved motion handling results in an impressive performance with HD/SDR content.",
    "The C8 supports just about every version of high dynamic range currently available, including HDR10, Hybrid Log-Gamma (HLG) and Dolby Vision. In fact the only version it doesn’t support is HDR10+, an open source alternative to Dolby Vision that also uses dynamic metadata. However at present only Amazon are employing HDR10+, whilst Dolby Vision is heavily supported on Netflix, iTunes and Ultra HD Blu-ray.",
    "All the factors that made the C8’s HD/SDR picture great are just as important when it comes to 4K/HDR. HDR is all about dynamic range, the difference between black and white, and those deep blacks deliver a solid base from which to create an image with great contrast. The star field at the start of Passengers is a good example of those deep blacks, speckled by tiny spots of brightness.",
    "The level of detail is also often astonishing, and when watching native 4K productions like Passengers, The Revenant or the BBC’s Planet Earth II, the C8 takes full advantage of its Ultra HD panel to deliver every pixel. The colors are equally as impressive, popping off the screen and delivering images that are often jaw-dropping.",
    "The C8 is bright for an OLED, hitting around 820 nits, but it’s nowhere near as bright as the best LCD TVs. However the peak highlights in an HDR image are delivered with far greater precision; after all an OLED has 8 million pixels to play with.",
    "Where the C8 struggles slightly is in terms of brighter overall images, such as the snow fields in The Revenant. An OLED can’t really go above 150nits in such circumstances, especially if it’s accurately tone mapping the original image. The problem is compounded by content mastered at 4,000 or even 10,000nits, resulting in images that sometimes appear too dark.",
    "To mitigate this issue, LG has added Dynamic Tone Mapping that analyses each frame and adjusts the brightness accordingly. It’s essentially a fake version of the dynamic metadata used by Dolby Vision and HDR10+, but it really works. HDR images are much brighter overall and the effect is achieved without losing detail in brightest parts of the image. This feature was available in 2017, but this year LG has given it a dedicated control in the menu.",
    "Once again the C8 is capable of delivering a hugely enjoyable gaming experience, with HDR games like Horizon Zero Dawn appearing almost photo-real at times. The input lag is still 21ms and the colours and motion handling remain just as impressive as with HD/SDR games.",
    "However the same caveat about image retention and screen burn applies, only more so because you’re driving the panel harder. It shouldn’t be a problem, just be sensible when gaming for long periods of time.",
    "4K/HDR Performance TL;DR: Although limited in terms of peak brightness, the deep blacks, precise highlights and gorgeous colors make for an impressive HDR experience.",
    "LG have packed 2.2-channels and 40W of amplification into the C8’s slim frame, and when you consider how thin this TV is, the sound is remarkably good.",
    "A speaker works by moving air; the bigger the driver, the more air it can move and the better it sounds. If you can only fit tiny speakers into a TV chassis then you’re going to struggle to deliver anything approaching a decent level of sound quality. As Mr. Scott is fond of saying in Star Trek, you can’t change the laws of physics.",
    "However you can help physics out, and the streamlined Alpine stand, as LG call it, actually does a great job re-directing the TV’s audio at the viewer. It also manages to create a wider and more expansive front soundstage, performing better than most other TVs with similarly svelte dimensions: There’s a solid mid-range and the top end sounds decent, but the bass is understandably limited.",
    "It will never sound as good as a dedicated soundbar but it’s certainly an improvement, and the fact that the Alpine stand also looks nice is an added bonus.",
    "LG is one of the few TV manufacturers to include Dolby Atmos processing in its higher-end models, and this applies some psycho-acoustic trickery to help create a more immersive soundstage. It does work to a degree, but eventually we come back to the laws of physics, and the effectiveness of the processing is limited by the native capabilities of the speakers built into the C8. If you want a big sound to go with those lovely images, you’ll need to invest in a soundbar.",
    "Sound TL;DR: The Alpine stand doesn’t just look nice, it actually helps improve the sound of this ultra-thin TV. But ultimately you can’t cheat the laws of physics.",
    "If you’re in the market for an OLED TV then ironically the C8’s biggest competition probably comes from last year’s LG models, with the excellent B7 OLED and C7 OLED both heavily discounted at this time. In terms of 2018 OLED TVs, and sticking with LG, there’s the upcoming B8 OLED which is cheaper but uses the Alpha 7 processor, and thus lacks some of the new picture features.",
    "Alternatively you could look at the Sony AF8 (Sony A8F OLED in the US), although the Android smart platform is less than ideal and its implementation of Dolby Vision has been a mess. In addition there’s the Philips 9002 but that also uses Android and doesn’t support Dolby Vision. The Panasonic FZ802 doesn’t support Dolby Vision either, but on the plus side it doesn’t use Android and supports HDR10+.",
    "Another option for our UK readers is the Philips 802 OLED. Buyers should weigh the visual benefits against the minor irritations, like poor catch-up TV provision, just two full-spec UHD HDMI inputs and the lack of Dolby Vision. Philips Hue-compatible Ambilight room lighting system, and the promise of an early upgrade to the new Android Oreo TV OS, however, might just balance the books.",
    "Finally if you fancy an LCD panel, then the excellent Samsung Q9FN QLED TV uses direct LED backlighting to deliver near-OLED blacks and a huge peak brightness, making it ideal for HDR. Since it also has a 21ms input lag and doesn’t suffer from image retention or screen burn, it’s also a great choice for gamers.",
    "LG’s C8 builds on the success of last year’s models, resulting in a TV that can deliver astonishing HD/SDR images and equally impressive 4K/HDR pictures. It’s not as bright as an LCD TV but those deep blacks make a huge difference to the dynamic range of the image. It’s also capable of vibrant and gorgeous colors, not to mention an astounding level of detail with native 4K content.",
    "The WebOS smart platform remains the best available and the choice of streaming services is second to none. Once you add the gorgeous design and a comprehensive set of features, you have one of the most complete TVs that we’ve ever reviewed."
  ],
  "headers": {
    "5": "Design",
    "12": "Smart TV (webOS with ThinQ AI)",
    "22": "HD/SDR Performance",
    "31": "4K/HDR Performance",
    "40": "Sound",
    "46": "Other panels to ponder…",
    "50": "Verdict"
  },
  "links": {
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "LG OLED C7": "https://www.techradar.com/reviews/lg-oled-c7",
    "NOW TV": "https://www.techradar.com/reviews/audio-visual/av-accessories/now-tv-1192011/review",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "B7 OLED": "https://www.techradar.com/reviews/lg-oled-b7-oled55b7v",
    "Sony A8F OLED": "https://www.techradar.com/reviews/sony-a8f-oled-kd-55af8-review",
    "Philips 9002": "https://www.techradar.com/reviews/philips-55pos9002-oled-tv",
    "Philips 802 OLED": "https://www.techradar.com/reviews/philips-oled-803-4k-hdr-tv-55oled803-review",
    "Samsung Q9FN QLED TV": "https://www.techradar.com/reviews/samsung-q9fn-qled-tv-qn65q9fn"
  }
}