{
  "source": "https://www.techradar.com/reviews/huawei-band-3-pro-review",
  "title": "Huawei Band 3 Pro review",
  "category": "wearables",
  "updated": "2019-04-11T09:55:28Z",
  "author": "andrew-williams",
  "summary": "Style and substance on a budget",
  "verdict": "The Huawei Band 3 Pro isn’t perfect, but excellent value, strong battery life, a good screen and a wealth of features for the money make up for this band’s slight strap design issues.",
  "pros": [
    "Good battery life",
    "Fetching color screen",
    "Full GPS lets you track runs phone-free"
  ],
  "cons": [
    "Slightly slow GPS lock on",
    "Rival Fitbit is a little comfier",
    "Loses ‘breathing’ mode of predecessor"
  ],
  "article": [
    "The Huawei Band 3 Pro is a low-cost fitness tracker with features usually present in pricier bands. How often do you see one of these with GPS, a color OLED screen and shiny metal bits? Not that often.",
    "It’s a chunkier, shinier Honor Band 4 that works better without a phone.",
    "The Fitbit Inspire HR is more comfortable, and we prefer the lower-key look of the Honor Band 4. But if you’re looking to start seriously tracking your runs and don’t want a Garmin, this is one way to get the goods without spending too much.",
    "The Huawei Band 3 Pro is out now, and while it launched at $69.99 / £79.99 / AU$110, in the UK and the US you can already find it for less, with prices starting at around $60 / £60.",
    "That makes it a similar price to the Honor Band 4 and significantly less than the Fitbit Inspire HR.",
    "Huawei sent us the gold and white version of the Huawei Band 3 Pro. If we had a trackpad finger primed on the checkout page, this isn’t the version we’d pick. It’s a little ‘Dubai chic’, keen to show ‘what it’s got’ and look expensive while doing so.",
    "But for us tech dullards Huawei makes a black version, and this gold model does show off what is special about the Band 3 Pro’s design. Most sub-$100/£100 fitness bands are made of plastic and silicone. But Huawei wants to make the rival Fitbit Inspire HR look cheap.",
    "The Huawei Band 3 Pro has a plate of brushed aluminum on its top, with beveled sides to bring out the bling. And, more important, the screen is covered by curved glass, not plastic. This should make it less susceptible to the scratches and scrapes wearables can earn when you run on narrow streets, dodging double-wide buggies.",
    "Fitbit’s Inspire HR has a plastic display.",
    "For all its fancy bits, we were not immediately impressed by the Huawei Band 3 Pro’s look, though. It’s chunkier than either the rival Fitbits or the sister Honor Band 4. That bands like this are slight and low-key is part of the appeal. This one still is, but it’s a little larger than most alternatives.",
    "Its band is also not quite as comfy as the Fitbit Inspire HR’s. Fitbit’s silicone strap has a bit more give, and a couple of times during runs the Band 3 Pro has caused a strange bit of tickly discomfort in the inner wrist.",
    "Like the size issue, comfort is not a problem in isolation. The Huawei Band 3 Pro just isn’t quite as comfortable as some alternatives.",
    "However, it is water resistant to 5ATM, the best you’ll find in one of these trackers. This makes it suitable for swimming, and there are no flaps to worry about before you get in the water.",
    "The Huawei Band 3 Pro has the same screen spec as the Honor Band 4, even if its higher price and longer width might make you assume it’s bigger.",
    "This is a 0.95-inch 120 x 240 AMOLED screen, a fantastic display for such a cheap band. It is full color, unlike the Fitbit Inspire HR’s, and pixel density is high enough to display several stats at once without the sense there are too few pixels to do the job properly.",
    "A fetching screen makes Huawei’s limited use of it all the more frustrating. You have a choice of just three watch faces. One is an analog clock, one a bold digital design. The last gives your sports stats half of the display and is the most colorful. It’s our pick of the bunch, but the Huawei Band 3 Pro’s display deserves at least a half-dozen choices.",
    "It is otherwise great, though. It’s bright, bold, its contrast is excellent, and it’s a clear technological step up from the rival Fitbit Inspire HR. An auto brightness sensor is one other thing it misses out on though.",
    "You have to dig into the menus to find the brightness control, and we bet half of Huawei Band 3 Pro owners won’t even realize this is possible. We had no issues seeing the screen on a bright (we’re talking UK-bright) day while out for a run, but when it starts firing off in the cinema after a wrist twirl, embarrassment ensues.",
    "Huawei has tried to make up for the lack of an ambient light sensor by letting you dim the display at night, a timed change. But the Band 3 Pro would be even better with auto brightness."
  ],
  "headers": {
    "3": "Huawei Band 3 Pro release date and price",
    "5": "Design",
    "13": "Screen"
  },
  "links": {
    "Honor Band 4": "https://www.techradar.com/reviews/honor-band-4-review",
    "Fitbit Inspire HR": "https://www.techradar.com/reviews/fitbit-inspire-hr-review"
  }
}