{
  "source": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/nikon-d3300-1212963/review",
  "title": "Nikon D3300 review",
  "category": "cameras",
  "updated": "2019-05-08T14:19:52Z",
  "author": "phil-hall",
  "summary": "Is this old-timer still a peach?",
  "verdict": "The D3300 has been one of our favourite entry-level DSLRs, and it's only because of the arrival of the newer D3400 and D3500 that's it's started to lose its sheen a little. But if you're not too fussed about the very latest tech, this is still a bargain buy, with a great sensor and an easy-to-use body and menu system as its key draws, as well as a huge selection of lenses to help you get creative.",
  "pros": [
    "24MP sensor with no low-pass filter",
    "Excellent Guide Mode",
    "Very easy to use",
    "Great value for money"
  ],
  "cons": [
    "Fixed LCD screen",
    "Screen not touch-sensitive",
    "Few direct controls",
    "Limited connectivity options"
  ],
  "article": [
    "The Nikon D3300 may have been replaced by the D3400, which itself was updated by the D3500, but that's no reason to discount this entry-level DSLR.",
    "While it lacks some of the fancy tricks of pricier DSLRs, the D3300 still offers everything the beginner needs to take great pictures. It's a cheap way into a sprawling system that includes all kinds of different lenses, and it's super simple to use, having been designed very much with those completely new to photography in mind.",
    "Do you need a DSLR or would you be better served by a mirrorless camera? DSLRs typically have the bonus of more lenses and often have better handling, but mirrorless cameras at this level often provide a few sweeteners, such as 4K video recording, tilting screens and USB charging. If you're not sure what's best for you, read our guide to mirrorless vs DSLR cameras.",
    "[Update: The D3300 has since been replaced by both the D3400 and the D3500, and while both new models don't offer a huge change in features, they are that bit better. The D3300 will also be quite tricky to buy new now as well, with dealers shifting their inventory to make way for the newer cameras. You'll find plenty of used models, but take a look at the D3400 and D3500 first as these are incredibly good value.]",
    "The Nikon D3300 features a 24.2MP APS-C sensor, which may well be standard for a camera of its class, but it's pretty impressive when you consider the enthusiast-focused (and much higher priced) D7200 shares an almost identical sensor. Like the rest of the Nikon range, the D3300's sensor does away with an optical low-pass filter on the sensor as well, which means even more detail can be captured.",
    "In addition to this, the native sensitivity range runs from ISO100 to 12,800, and there's an expansion setting that takes it to the equivalent of ISO25,600. That should provide plenty of flexibility for a range of lighting situations, so you can still carry on shooting as light levels fall.",
    "Like some of the cameras positioned above the D3300 in Nikon's lineup, the D3300 sports Nikon's now second-generation processing engine, the EXPEED 4. This allows the camera to shoot continuously at a maximum rate of 5fps, while it can sustain this burst rate for up to 100 fine quality JPEGs. Not probably quite a match for some mirrorless rivals, but more than enough for most people's needs.",
    "The EXPEED 4 processing engine is also responsible for allowing the D3300 to record Full HD movie footage at frame rates up to 50p/60p and with continuous autofocus. Helpfully, there's a microphone port as well as a built-in stereo mic for better sound recording during movie shooting.",
    "If you want 4K video recording, you'll either have to look further up the Nikon line-up or at some mirrorless competition like the Canon EOS M50, Panasonic G85/G80 or Olympus OM-D E-M10 Mark III.",
    "Unlike some (pricier) rivals that offer articulating LCD screens, the 3.0-inch display on the rear of the D3300 sits flush to the body. The absence of a touchscreen interface is also a little disappointing, especially when you consider how many of the camera's controls are changed via the menu system. If these are deal-breakers, then you might want to look further up the Nikon range to the D5600 or rivals from Canon.",
    "Like pretty much every DSLR at this price point, the D3300's optical viewfinder only offers a 95% field of view. While it is bright and clear, not being 100% does mean that there is a chance of something appearing in the final image that you didn't notice when framing up your shot.",
    "There are a host of Special Effects on tap, allowing you to jazz-up JPEG files and videos with a collection of styles. Nikon has boosted the list of Effects to 13 for the D3300, and it now includes Pop, which increases colour saturation, Toy Camera, which creates a retro effect, and Easy Panorama. These effects can be previewed in real time on the LCD screen, so you can see exactly what you'll get once you trigger the shutter.",
    "One thing that isn't too great next to more modern offering are connectivity options. Wi-Fi isn't built in, so if you want to wirelessly transfer images you'll have to invest in the optional WU-1a Wireless Mobile Adapter. If you want a connected entry-level Nikon DSLR, you'll want to turn your attention to the D3400; featuring Nikon's SnapBridge technology, this functionality allows the D3400 to be connected wirelessly to your smartphone or tablet."
  ],
  "headers": {
    "4": "Features"
  },
  "links": {
    "D3400": "https://www.techradar.com/reviews/nikon-d3400-review",
    "D3500": "https://www.techradar.com/reviews/nikon-d3500-review",
    "guide to mirrorless vs DSLR cameras": "https://www.techradar.com/news/mirrorless-vs-dslr-cameras",
    "D7200": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/nikon-d7200-1290203/review",
    "optical low-pass filter": "https://www.techradar.com/news/the-a-to-z-of-photography-low-pass-filter",
    "Canon EOS M50": "https://www.techradar.com/reviews/canon-eos-m50-review",
    "Panasonic G85/G80": "https://www.techradar.com/reviews/panasonic-lumix-g80-g85",
    "Olympus OM-D E-M10 Mark III": "https://www.techradar.com/reviews/olympus-om-d-e-m10-mark-iii-review",
    "D5600": "https://www.techradar.com/reviews/nikon-d5600"
  }
}