{
  "source": "https://www.techradar.com/reviews/acer-conceptd-5-pro",
  "title": "Acer ConceptD 5 Pro laptop review",
  "category": "computing",
  "updated": "2019-11-11T11:45:51Z",
  "author": "mike-jennings",
  "summary": "Acer’s latest machine is packed with power and designed for creative workers – can it challenge established rivals?",
  "verdict": "Acer’s ConceptD 5 Pro has an incredible amount of power on the inside – enough to handle creative tasks – and a stunning screen alongside a solid price. However, battery life is poor, and both build quality and port selection could be far better.",
  "pros": [
    "Huge GPU power",
    "Fast Core i7 CPU",
    "Fantastic screen quality",
    "Decent keyboard and trackpad"
  ],
  "cons": [
    "Inconsistent build quality",
    "Mediocre port selection",
    "Poor battery life"
  ],
  "article": [
    "Acer is usually known for its more affordable laptops, but the ConceptD 5 Pro is more ambitious.",
    "It’s a machine designed for designers and creative workers – people who need lashings of power inside a case that looks suitably stylish.",
    "On the inside, it’s packed with memory, a top-tier CPU and professional graphics, and it’s got a stunning 4K screen. Is the ConceptD 5 good enough to help Acer gain a foothold in the professional market?",
    "The model we’ve reviewed costs $3,400 (£2,700, around AU$5,000), and is the most expensive ConceptD 5 laptop.",
    "There are two other ConceptD 5 Pro models. One has the same specification as this laptop, albeit with only 16GB of memory. That laptop costs around $3,200 (£2,500, around AU$4,700). The cheaper ConceptD 5 Pro drops down to weaker Quadro T1000 graphics, with the price falling to $2,000 (£2,150, around AU$4,000).",
    "The rest of Acer’s ConceptD range is extensive. Cheaper laptops in the ConceptD 3 range are forthcoming, and ConceptD 7 machines with high-end consumer GPUs have prices that range between $2,300 (£1,800, around AU$3,400) and $3,000 (£2,300, around AU$4,400).",
    "The Acer ConceptD 5 Pro looks smart: it’s made from thick, matte black magnesium alloy, it’s got sleek, angled corners and Acer’s logos are unobtrusive.",
    "It’s no surprise Acer has spent plenty of time on aesthetics. The ConceptD 5 squares up against the Asus ZenBook Pro Duo UX581, which has an attractive metal design and eye-catching dual screens. And then there’s Apple’s MacBook Pro – perennially one of the world’s best-looking laptops.",
    "However, closer examination reveals areas where Acer’s design doesn’t stack up.",
    "There are visible seams throughout – not a terminal issue, but disappointing given the price. Lots of the edges are sharp, and the outlandish exhausts come straight from Acer’s gaming notebooks and look out of place.",
    "The base is strong, but the lid flexes back and forward and is easy to depress. These build quality issues mean both rivals are stronger, and we’d recommend carrying the Acer in a sleeve.",
    "Acer’s machine weighs 4.9lb (2.2kg), which means it’s lighter than the dual-screen Asus – and its 0.9in (21mm) thickness barely differs from the ZenBook. However, Apple’s MacBook Pros are much smaller, with 0.6in (16mm) designs that weigh just 3.9lb (1.8kg).",
    "Connectivity is also mediocre. Acer’s machine has two full-size USB 3.1 ports and a slower USB 2 port alongside a Type-C connection and an HDMI output. However, Thunderbolt, DisplayPort, a card reader and a fingerprint reader are all missing.",
    "Connectivity is better inside – there’s super-fast Wi-Fi 6 alongside Gigabit Ethernet and Bluetooth 5.0.",
    "But what about the keyboard and trackpad? The Chiclet keyboard is good. It’s got a numberpad, large cursor keys and no serious layout issues – so it’s easy to get up to speed.",
    "The base is sufficiently robust, which means keys can be hammered down with consistency and force. The buttons have reasonable speed, and they’re quiet and comfortable – so you can work without disturbing others. It’s satisfyingly easy to use for long periods.",
    "Apple’s keyboards have more speed and snap, but only real fanatics will be bothered.",
    "The backlight uses a gentle amber tone that Acer says is warm and calming, and it can be adjusted with four brightness levels.",
    "The trackpad is decent, too. The surface is smooth, precise and has full gesture support, and the in-built buttons are responsive.",
    "The 15.6in screen has a 4K resolution, which means a density level of 282ppi. That’s vast, and it means this screen is crisp. For precise design and colour work, that’s crucial.",
    "It’s the same resolution and width as the main screen on the Asus, and it’s better than the MacBook Pro.",
    "Quality levels are superb. The Delta E sits at 1.9, which is great – anything below 2 means human eyes can’t detect colour deviations. The temperature of 6,329K is great, too – barely different from the 6,500K ideal. The Acer rendered 99.8% of the sRGB and 98.9% of the Adobe RGB gamuts – so it’s comfortable working in both colour spaces.",
    "The brightness level of 385cd/m2 is huge – high enough to make it easy to use this machine under office lights and outdoors. That brightness figure is joined by a black point of 0.26cd/m2, which lends proper depth to dark areas.",
    "The contrast ratio of 1,480:1 is superb, and means the whole screen has exceptional punch and vibrancy – and that it does a great job of rendering subtly-changing shades.",
    "In terms of pure screen quality, the Asus is better – its OLED panel has vibrant colours and perfect black levels, and it has that second panel.",
    "However, the Acer’s screen is one of the best on the market, with top-tier colours and contrast. It’s better than the MacBook Pro, and it’s easily good enough for photo and design work."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "19": "Screen quality"
  },
  "links": {
    "Asus ZenBook Pro Duo UX581": "https://www.techradar.com/reviews/asus-zenbook-pro-duo-ux581",
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro",
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors"
  }
}