{
  "source": "https://www.techradar.com/reviews/gaming/handheld-consoles/nintendo-2ds-1176863/review",
  "title": "Nintendo 2DS review",
  "category": "gaming",
  "updated": "2019-02-26T16:45:32Z",
  "author": "hugh-langley",
  "summary": "Won't somebody please think of the children?",
  "verdict": "A cheaper, simpler alternative to its 3D counterpart, the Nintendo 2DS offers dual-screen action in a more kid-friendly package. Given you can't display in 3D though, the stereoscopic camera is pretty useless.",
  "pros": [
    "Affordable and durable",
    "Perfect for kids",
    "Plays all 3DS games"
  ],
  "cons": [
    "Mono speaker",
    "3D camera feels pointless",
    "Still not sold on the wedge"
  ],
  "article": [
    "If you still think the Nintendo 2DS is completely bonkers, you probably haven't wrapped your hands around one yet. Putting out a slab-shaped version of the Nintendo 3DS without the 3D functionality might seem odd at first, but when you play it yourself it all starts to make sense.",
    "Sure, this isn't a gaming device for hardcore gamers. At £110/$130 it's a way for Nintendo to get younger children – and, let's be honest, some of their parents – tapping into the Nintendo 3DS game library.",
    "Nintendo often struggles to communicate the point of its consoles to audiences: who is for? What sort of games can we expect from it? The Nintendo 2DS, if you're unsure, is simply a cheaper and more robust handheld than its high-priced sibling, and is therefore perfect for kids.",
    "Dropping the clamshell design, the Nintendo 2DS comes in a wedge-shaped slate design that feels (and looks) pretty weird at first. It's also the first non-hinge handheld since the GBA Micro.",
    "But within minutes of holding it we found that these feelings faded away and that, actually, the Nintendo 2DS is surprisingly comfortable to hold. It's not the most ergonomic thing in the world though certainly better than what we expected.",
    "All the buttons found on the Nintendo 3DS are here except there's also been a slidable sleep button added to compensate for the lack of hinge-closing functionality. Meanwhile the home button has been blown up a bit and sits under the bottom display.",
    "The start and select buttons can now be found to the right of the screen and the circle pad and d-pad are now further up on the left.",
    "The Nintendo 2DS comes in either blue and black, red and black, or, if you live in the US, black and red. But the 2DS doesn't feel like a piece of premium tech. Instead Nintendo has opted for something that feels cheaper and more plasticky than the 3DS and 3DS XL.",
    "We reckon you could chuck this at something with a fair bit of force and it would be ok, which we guess is sort of the point. Kids and hinges don't tend to get along; kids and delicate touchscreens don't really see eye-to-eye either.",
    "So the Nintendo 2DS is sturdy and able to take a bit of a knocking. But after enough tossing around even the 2DS will start picking up scratches. So we'd recommend pairing it with a protector case if you plan to put it under the Christmas tree for someone this year.",
    "Although there's logic in the 'stripping down' thought process, we do think Nintendo could have still offered something a tad nicer for the price. For example, the Nintendo 2DS now comes with just one speaker on the console, which means it loses the stereo sound of the 3DS. It's a noticeable shame.",
    "The camera is perhaps the most curious part of the Nintendo 2DS. While the handheld no longer owns a 3D display, Nintendo has chosen to keep the two cameras on the back. This means you can still take 3D pictures but won't be able to make them pop unless you transfer them to someone else who has a 3DS.",
    "It also means that you'll be looking at some pretty grainy shots on the 2DS screen – really, a better 2D camera would have fit in better here.",
    "We can't see many kids making an effort to get their pictures in full stereoscopic action. Really, we'd have rather the Nintendo 2DS dropped a camera and added another speaker instead."
  ],
  "headers": {},
  "links": {
    "Nintendo 3DS": "https://www.techradar.com/reviews/gaming/handheld-consoles/nintendo-3ds-931771/review",
    "3DS XL": "https://www.techradar.com/reviews/gaming/handheld-consoles/nintendo-3ds-xl-1089176/review"
  }
}