{
  "source": "https://www.techradar.com/reviews/realme-3-pro-review",
  "title": "Realme 3 Pro review",
  "category": "phones",
  "updated": "2019-06-05T10:36:09Z",
  "author": "sean-cameron",
  "summary": "Is this the perfect budget phone?",
  "verdict": "With a powerful camera, nippy performance, great battery life and an included fast charger, the Realme 3 Pro makes a great impression. This is only slightly dulled by a micro USB port, no NFC and divisive software.",
  "pros": [
    "Class-leading camera",
    "Great screen",
    "Fast charging"
  ],
  "cons": [
    "Fussy software",
    "Slippery design and no NFC",
    "Outdated microUSB port"
  ],
  "article": [
    "Pick a phone, any phone identified as being 'budget', and three things will likely define it: an over-enthusiastic marketing campaign, claims of being as capable as a 'flagship' and - of course - a relatively low asking price.",
    "For an individual phone to stand out is a difficult task, to truly succeed in this it takes 'personality' - a quality which is somewhat nebulous in itself.",
    "Enter the Realme 3 Pro, which positively oozes personality. Brash marketing campaign? The current tagline is 'Speed Awakens', which leads into claims of being as capable as the 'flagships'.",
    "Small cash outlay? Starting at around £175, it is certainly competitively priced, against the likes of the Moto G7 Plus, Honor 10 Lite and Moto G7 Power.",
    "The Realme 3 Pro is the latest star from the Chinese smartphone manufacturer which is dipping its toe into the UK (and European) market for the first time with this handset.",
    "Realme is actually a subsidiary Oppo, in a similar way Honor is to Huawei. Much like Huawei, Oppo has dreams of making it big in the West and only officially entered the UK itself at the start of 2019, despite already being one of the largest smartphone manufacturers in the world.",
    "There's plenty of pedigree behind the Realme 3 Pro, and from what we've found it shines through.",
    "The Realme 3 Pro release date was June 5, 2019 in the UK via the company’s own website.",
    "Realme 3 Pro prices start at £175 for the 4GB of RAM and 64GB of storage base model, but you can also get a Realme 3 Pro in a 6GB/128GB configuration for £219.",
    "It means the Realme 3 Pro sits at the budget end of the market, with established names such as Motorola and Honor for company.",
    "The Realme 3 Pro, as with many devices arriving on British shores from Chinese manufacturers, comes with an array of specifications designed to win any spec war at the price point.",
    "That is to say, it comes with a 4,045mAh battery, a powerful octa-core Snapdragon 710 chipset, a dual-lens snapper complete with lots of modern camera tech, a large screen with a teardrop notch, and an eye catching design which has colors that shift in the light.",
    "Of these, for the price, the Snapdragon 710 is the most surprising inclusion - this is a fairly new 10nm chipset with significantly powerful multi-core performance that can almost match the Snapdragon 835. Its presence here is a strong differentiator for the Realme 3 Pro, against the likes of the Redmi Note 7 (Snapdragon 660) and Moto G7 Plus (Snapdragon 636).",
    "The 4,045mAh battery, beyond its large capacity, also has a significant plus in the included ‘VOOC’ fast charger. This is built on Oppo’s own renowned fast charging tech and only works with the included charger and cable, allowing roughly a 50% charge within half an hour, which is impressive by anyone’s estimate.",
    "As for the camera, the Realme 3 Pro uses the same main sensor as the Oneplus 6T, which is 1/2.6” in size, coming with an impressively large f/1.7 aperture. It has a proprietary night mode, HDR image stacking and more to help provide detailed and pleasing shots, though more on the success of this later on.",
    "The immediate first impression one might get from the Realme 3 Pro isn’t particularly memorable - this is a device whose qualities reveal themselves slowly.",
    "That isn’t to say it isn’t well built - constructed from polycarbonate, it feels sturdy enough to take a few knocks and keep on rocking. Indeed, we found it almost therapeutic going back to the days of the plastic fantastic - this is a device which isn’t as fragile as glass or as prone to chipping as metal.",
    "That's not to say it doesn’t slip though, for when it isn’t in a case it seeks the company of a floor with an almost fanatical drive. The plastic also has a tendency to collect fingerprints with gusto, so it is worth investing in a microfiber cloth to carry around.",
    "At 172g, the Realme 3 Pro is a chunky monkey even if it doesn’t quite feel that in the hand, while the 6.3-inch screen is certainly quite immersive.",
    "The back comes in two different colors, we received the ‘Nitro Blue’ edition (your other choice is Lightning Purple). Each of these different paint jobs capture the light in interesting ways, shifting between different angles.",
    "Small colored accents can also be found around the rear camera housing, with various other small touches throughout. Despite the plastic body, this device does go some way to justify itself as premium, even if in the budget space.",
    "Other small touches are a little odd however, and do annoy. The presence of a microUSB port is mystifying, and the factory-fitted screen protector does seem to have slight issues with its oleophobic coating - fingerprint free it is not.",
    "We did enjoy, however, the presence of dual-SIM capability along with microSD card support, though the lack of NFC is surprising, given how ubiquitous contactless payments have become.",
    "The Realme 3 Pro doesn’t feel quite as much of a polished jewel as the iPhone XS, however like the Pocophone F1 it is a device which feels built to take the challenges of life, and is a breath of fresh air as a result. Glass may be beautiful, but it is certainly not as practical.",
    "The Realme 3 Pro’s 6.3-inch screen comes with a 1080 x 2340 resolution, putting it roughly in line with most modern phones. This means a small trade-off in resolution compared to QHD+ handsets, for a corresponding boost in both battery power and performance.",
    "At its normal setting, we found colors on the Realme 3 Pro a little warm, though not in an unpleasant way. A color calibration tool is present in the settings for those who like to tweak, however most will be happy with how it looks straight out of the box.",
    "As for brightness, the device certainly gets bright enough for indoor use, and we had no issue with it in most environments. It does struggle in strong sunlight however, but for the price point it is a very competent showing. Viewing angles too are strong, as one would expect from an IPS panel.",
    "For some, something which may also be of interest is the array of options made available through the ‘Night Light’ mode. This allows the color temperature to be tweaked for night viewing manually, and even offers the option to go grayscale for reading."
  ],
  "headers": {
    "7": "Realme 3 Pro price and availability",
    "10": "Key features",
    "15": "Design",
    "24": "Screen"
  },
  "links": {
    "Moto G7 Plus": "https://www.techradar.com/reviews/moto-g7-plus",
    "Honor 10 Lite": "https://www.techradar.com/reviews/honor-10-lite-review",
    "Moto G7 Power": "https://www.techradar.com/reviews/moto-g7-power-review",
    "website": "https://www.realme.com/eu/realme-3-pro",
    "Redmi Note 7": "https://www.techradar.com/reviews/xiaomi-redmi-note-7",
    "Oneplus 6T": "https://www.techradar.com/reviews/oneplus-6t-review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "Pocophone F1": "https://www.techradar.com/reviews/poco-f1"
  }
}