{
  "source": "https://www.techradar.com/reviews/hifiman-supermini-high-res-portable-player",
  "title": "HiFiMan SuperMini High-Res Portable Player review",
  "category": "audio-visual",
  "updated": "2019-10-15T09:48:48Z",
  "author": "christian-de-looper",
  "summary": "Petite but powerful, the SuperMini has audiophile-grade performance",
  "verdict": "The HiFiMan SuperMini isn’t perfect – but, considering its excellent sound quality and compact design, we highly recommend it for those looking for a great compact music player.",
  "pros": [
    "Excellent sound quality",
    "Balanced headphone jack",
    "Easy to use"
  ],
  "cons": [
    "No internal storage",
    "No EQ"
  ],
  "article": [
    "Your phone is a pretty capable machine. It can make calls, play music, take photos, and browse the web – all in one device.",
    "But it doesn’t do most of things as well as professional equipment can. For example, if you’re a pro photographer, you’ll still probably want a nice DSLR. If you’re an audiophile, you may still want to invest in a decent player – like the HiFiMan SuperMini.",
    "The SuperMini is more than just a run-of-the-mill MP3 player – it’s built to offer an excellent audio quality, and is able to play high-res audio, including FLAC, OGG, and even DSD formats.",
    "Since its 2016 release, the SuperMini has more than halved in price, coming down from $399 to a much more palatable $150 (around £120 / AU$220). So, while our original review is based on the 2016 RRP, it's worth bearing in mind that this MP3 player is significantly cheaper nowadays.",
    "The first thing you’ll notice about the HiFiMan SuperMini is its design: It’s not a bad-looking device by any means. Good looking as it may be, the player is relatively small, coming in at 1.77-inches wide and 4.09-inches tall – so it should fit nice and snugly into your pocket without any discomfort.",
    "The display covers a little more than half of the front of the device, and directly under that display is where you’ll find the three control buttons: a central selection button and two navigation buttons.",
    "On the right and bottom of the player is where you’ll find other buttons, ports and slots. To the left, you’ve got volume and and down buttons, as well as a back button and a power button. On the bottom, you’ll find the microSD slot, a microUSB port and two headphone jacks – one standard, and one balanced.",
    "In general, the player is pretty well laid-out, though it’ll take a few minutes to get used to the controls. It was a little random that the majority of the interface controls were on the front but the back button on the right side, for example. Sure, it’s expensive to use a touch screen, and a touch screen probably isn’t even necessary here, but the controls should at least all be in the same area.",
    "As mentioned there’s a microSD card slot on the bottom, and it’s something you’ll need to use – the internal storage is reserved solely for the operating system. You’ll want to keep that in mind when figuring out your budget for a player. You don’t get a microSD card in the box, and while they are getting cheaper, it’s still an extra cost to consider.",
    "The build-quality of the HiFiMan SuperMini is pretty good, too. It’s machined from a piece of solid aluminum, and we never felt like the player would break. That’s not to say you shouldn’t be careful with it – you most definitely should – but it should last a long while without breaking down.",
    "As mentioned, the device does not feature a touch screen, but that’s not necessarily a huge deal. It does mean that the interface isn’t as intuitive for smartphone users as the Onkyo DP-X1A, which basically just runs a full version of Android, but we still found it relatively easy to navigate through the different sections of the software. The main screen allows you to browse music by artist, album, genre or song, and you’ll also get a file explorer and the ability to see what song is currently playing.",
    "When you’re listening to music, you’ll be able to see all the details you would need to see, including the file format, the bit rate, where you are in the song, and so on. You’ll also be able to switch to the next song or go back to the previous song – as anyone would expect from a player made in the last decade.",
    "There are a few features that we would have liked to see from the interface, though. For one, there’s no EQ. While the player sounds excellent without one, sometimes it’s nice to be able to tune music depending on your headphones or overall listening preferences. It’s a pretty major omission for audiophiles, too.",
    "There’s not all that much to say about the interface – it’s basic, to be sure, but it serves its purpose. The monochrome display may not be the best if you’re into seeing things like album art when you listen, but if all you care about is being able to easily access your music, you’ll have no trouble with the interface on offer by the HiFiMan SuperMini.",
    "Design and ease-of-use are important – but if you’re an audiophile looking for a great MP3 player, you’re looking for a top-performer. Thankfully, the HiFiMan SuperMini performs beautifully. It carries a super neutral tone as well – which is great news for the audiophiles among us.",
    "Instead of a dedicated digital-to-analog converter that you might find in other high-end music players, the HiFiMan SuperMini makes use of a built-in DAC – or one that’s implemented onto a controller chip.",
    "Now, often that would be a bad thing. Built-in DACs are often sub-par in audio quality, but they consume a lot less power. Here, however, that’s kind of the point. HiFiMan has tuned the built-in DAC to offer a much better sound profile overall, while still using less power and offering a better battery life. And we have to say, the company has done a great job at doing so.",
    "The SuperMini is capable of supporting up to 24-bit audio at up to 192kHz sample rate. The frequency response is 20Hz - 20kHz, which is pretty standard.",
    "The low-end on this player is deep and powerful, without adding any annoying bass bumps you might expect from consumer headphones or music players. There’s enough sub-bass content to make bass fans happy, while in the bass range, where things like kick drums and the tone of bass guitars live, you’ll find plenty of response. The bass is relatively tight and controlled, and the layer responds quickly to bass, which is a good thing. (Some cheaper players, on the contrary, get a little sloppy with their bass response and the result is a slight muddiness, which you won’t find here.)",
    "The mid-range is also very tuned, and as mentioned, very natural. It’s clearly defined in that it’s easy to hear the details of instruments that live in the mids – like guitars and vocals – and there’s no so-called “veil” or sense of barrier between you, the listener, and the instruments. That’s a pretty big deal for a player in the sub-$500 category, and puts the SuperMini in competition with much more expensive devices.",
    "The high-end is, in our opinion, where this player really shines. Audio was clear and crisp, and while it did seem as though there was a slight boost in the high-end to help achieve that, we didn’t mind it one bit. It never got overbearing or shrill – on the contrary, it made for a much more exciting listening experience. It’s also important to note that if there is a boost it’s very subtle.",
    "In general, the soundstage here was decent, and the player was easily able to drive most headphones.",
    "The HiFiMan SuperMini is an excellent player. It’s decently designed despite some somewhat random button choices, and highly portable, which is always good. While some might be wary of the device considering the embedded DAC, we would argue that there’s no need to worry – the player is capable of pumping out an audio quality that would make even seasoned audiophiles drool.",
    "Not only that, but SuperMini offers excellent value for money, coming in at just $399 (£400, AU$599), despite the fact that it could easily compete with much more expensive devices."
  ],
  "headers": {
    "4": "Design",
    "10": "Interface",
    "14": "Performance",
    "22": "Final verdict"
  },
  "links": {
    "Onkyo DP-X1A": "https://www.techradar.com/reviews/onkyo-dp-x1a-digital-audio-player"
  }
}