{
  "source": "https://www.techradar.com/reviews/hideman",
  "title": "Hideman VPN review",
  "category": "computing",
  "updated": "2020-07-01T11:51:54Z",
  "author": "mike-williams",
  "summary": "A VPN you can use for free, no registration required",
  "verdict": "We like the Netflix unblocking, but Hideman's problems trample all over its few plus points, making the service impossible to recommend.",
  "pros": [
    "Free plan with no registration",
    "Desktop and mobile clients",
    "Cheap mobile-only plan",
    "Unblocks Netflix, iPlayer"
  ],
  "cons": [
    "Free plan has many limits, some logging",
    "Windows kill switch issues",
    "Apps are basic and rarely updated",
    "Speeds are below-average and very inconsistent"
  ],
  "article": [
    "Note: As of July 1, 2020, Hideman appears to be non-functional. The website has been operational in recent times, but it is now down, and even when the website was live at the end of June, and it was still possible to download the app, it didn’t work when we tested it. Also, the domain used for payments – hidepay.net – was down, and contacting support to query all this resulted in our email bouncing back. As a result, we can only conclude that Hideman is no longer operational. The original review follows below…",
    "Hideman may not be a big-name VPN, but the company has still been in the business for many years and reports millions of installs for its apps.",
    "The company offers more features than you would expect for a small VPN, with more than 20 locations, ad and malicious website blocking, direct .onion and .i2p access, and clients for Windows, Mac, iOS and Android, as well as a Chrome extension.",
    "There's support for connecting up to four devices simultaneously. That's fractionally below the industry average of five, and less than competitors like the excellent ExpressVPN and NordVPN.",
    "Torrents are supported, though only with the Turkey location. That could make for poor performance if everyone else is piling onto the same servers.",
    "The website suggests Hideman can help bypass geoblocking by Netflix, Hulu, BBC iPlayer, Sky and many other media streaming services, wherever you are in the world.",
    "You can try the service with a free plan, if you can live with the multiple restrictions: no choice of location (the client automatically allocates one for you), speeds may be limited at peak times, only four sessions of up to one hour each are allowed per week, and there’s also some logging (more on that later).",
    "The Mobile plan allows connecting up to four mobile devices simultaneously for an excellent $2.90 a month, dropping to $2.07 with the annual subscription.",
    "Hideman's Ultimate plan covers up to four devices of any type – mobile, desktop, gadget, whatever – for $9 a month, dropping to an average $5.75 (£4.60) a month on the annual subscription. That's less impressive, as you can subscribe to some big-name competitors (CyberGhost, NordVPN) for under $3 a month if you're willing to sign up for two or three years.",
    "Hideman's range of payment options is highlight, though. Along with PayPal and cards, you can use Bitcoin, Yandex Money, OKPAY, Mobiamo, WebMoney and more.",
    "While most VPN providers do their best to pretend they don't log anything at all, ever, the Hideman website warns that it does record some information for free users only. Apparently, this includes the 'account used for connection', the 'destination IP address' (presumably the IP address you're allocated), the 'volume of information transferred' and 'the time of initial transfer of information' for the last 14 days of account use.",
    "While this isn't ideal, the company says it will only ever release information if it receives claims that an account has been used for hacking, using other people's payment information, distributing spam or child pornography, or 'threat to human life and health'. As we write, Hideman's Warrant Canary says it's never been requested to log information, so this logging isn’t likely to be an issue.",
    "Hideman has no details on its logging policy for paid users beyond this very brief FAQ response:",
    "'Do you save access logs?'",
    "'NO.'",
    "When the VPN world is beginning to move to public auditing of systems to verify a providers' no-logging claims (see TunnelBear, VyprVPN and more), we think it's no longer enough for providers to just display 'no logs!' on their website and expect everyone to trust them. At a minimum, Hideman should explain in more detail how its systems work. Ideally, it should have its systems and software audited, too.",
    "In a world when some small VPNs have just one or two apps, maybe none at all, it's impressive to see Hideman has something for Windows, Mac, iOS and Android, and even a Chrome extension. This isn't quite as good as it seems (the Windows client hasn't been updated since 2015, the Chrome add-on since 2017), but it still shows the company has genuine VPN expertise.",
    "Setting up the Windows client was quick and easy, with the installer completing its job within seconds.",
    "The client interface is small and simple. A status panel displays your current location, a Connect button automatically connects to the best server for you, and there's not much else.",
    "Opening the Settings box reveals some advanced options, including a choice of OpenVPN TCP or UDP connections, a kill switch to protect you if the VPN connection drops, proxy and port forwarding support, and an anti-DPI mode to help connect in countries which actively block VPNs.",
    "The good news is that you can use the client immediately, with no registration required and no need to hand over your name, email address or anything else.",
    "The bad news is that this Free mode doesn't allow you to choose a location, instead allocating one automatically. This won't necessarily be the closest, either; we were trying the service from the UK, and although the location list included UK, France and Germany, the client connected us to Russia.",
    "There's also an unusual session restriction. The free plan allows six sessions of up to one hour long for your first week, dropping to four sessions after that. Sessions begin from when you launch the client, not when you connect (you can connect and disconnect as often as you like within the hour), and a countdown tells you how long you have left. This isn't an issue if you just want to test speeds and performance, but it's going to be a major hassle for many people in real-world use.",
    "The client did a good job with the connection basics. Desktop notifications let us know when it connected, with details on our new country and IP. When we simulated a dropped connection by closing the OpenVPN process, the client displayed an immediate alert to warn us.",
    "The kill switch had some significant problems, though, starting with setup. You can't simply check a box to turn the kill switch on; it's necessary to choose the network adapter you'd like to disable. That's an issue, as you're likely to have several (including virtual adapters) and many users won't be able to tell which they should disable.",
    "When we chose the correct adapter for us, the kill switch did its job, kicking in as soon as we closed the connection and blocking all internet access.",
    "The big issue is we couldn’t restore our internet access from the client. It couldn't reconnect, presumably because the network adapter was disabled. We turned the kill switch off and closed the client, but that didn't work, either - our internet access was still blocked. Experts can easily restore connectivity from Windows (run NCPA.CPL, right-click the adapter, select Enable), but many users won't realize that, and with internet access blocked, they won't easily be able to search for the answer, either.",
    "There's no way for us to say precisely why this happened, but we noticed one warning sign: the Hideman client executable was dated 4th February 2015, more than four years ago. That tells us both that problems are to be expected as the client isn't being patched to deal with Windows updates and other changes, and that Hideman isn't very interested in improving the client or fixing problems. If something doesn't work as you expect, the chances are you'll have to learn to live with it.",
    "Hideman VPN's free plan has multiple restrictions and limits, but does it at least have decent performance, we wondered? Not according to our tests - we connected multiple times, but our download speeds remained disappointing at 2-6Mbps.",
    "Upgrading to a paid plan didn't make as much difference as we hoped, at least with our nearest UK server. Peak speeds increased but our lows were even lower, with performance ranging from 1-30Mbps.",
    "We had much better results from nearby European locations, with the Netherlands hitting a capable 60-64Mbps.",
    "US performance varied hugely over time and between servers, with download speeds ranging from 10-50Mbps. That's well below average, although still usable for many applications.",
    "With the disappointments mounting, we didn't have much hope for Hideman's claims to unblock content from a range of streaming sites. But we turned out to be wrong. The service ended our review on a positive note, allowing us to view BBC iPlayer and US-only Netflix content without difficulty.",
    "Hideman was a decent VPN a few years ago, but it's not kept up with the competition like ExpressVPN, and whether you're looking at the network, performance, apps or the support site, you'll get more for less with other VPN providers."
  ],
  "headers": {
    "10": "Privacy",
    "16": "Apps",
    "28": "Performance",
    "33": "Final verdict"
  },
  "links": {
    "Hideman": "https://www.hideman.net/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "free plan": "https://www.hideman.net/en/docs/plans-and-pricing/",
    "Mobile plan": "https://www.hideman.net/en/docs/plans-and-pricing/",
    "Ultimate plan": "https://www.hideman.net/en/docs/plans-and-pricing/",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Warrant Canary": "https://www.hideman.net/en/docs/warrant-canary",
    "competition like ExpressVPN": "https://xvtelink.com/?offer=3monthsfree&a_fid=744&data1=trd-us-8858736328141689000"
  }
}