{
  "source": "https://www.techradar.com/reviews/new-world",
  "title": "Hands on: New World first look review",
  "category": "gaming",
  "updated": "2019-02-08T14:00:41Z",
  "author": "nick-pino",
  "summary": "Amazon’s second game is everything its first wasn’t",
  "verdict": "New World's biggest strength is its ambition - Amazon wants to make its first game a sandbox that's built by players, for players, without much intervention. But can players craft their own fun alongside everything else?",
  "pros": [
    "Ambitious sandbox world",
    "Neat social experiment",
    "Crafting gets better over time"
  ],
  "cons": [
    "Boring combat in demo",
    "World isn’t unique enough",
    "Already feels a bit dated"
  ],
  "article": [
    "Amazon’s second game, New World, is a bit of everything: It’s the social structure of a game like Eve Online, meets the resource management of a game like Minecraft and the combat of methodical action-RPG like Dark Souls.",
    "It’s all those things and, perhaps even more importantly, it’s everything that Amazon’s first game, Breakaway, was not.",
    "Before we dive into how Amazon’s first two ambitious projects differ - and how that’s a bit concerning when you consider that Breakaway was cancelled outright this time last year - let’s first talk about Amazon’s brave New World.",
    "New World’s title should give you a vague idea of what to expect - it’s a game about colonizing a new continent in a parallel universe's 17th Century where the only residents of this unspoiled land are demons and monsters. Like landing on the New World in our universe, you're tasked with collecting resources and protecting your claims.",
    "Ideally this all done as part of an in-game community, similar in purpose and design to the trading companies that helped spur the age of discovery at the beginning of the 15th Century. Your company will work together to pool resources, build bases and eventually declare war on other settlements, allowing you to expand your empire. Expect siegecraft to play a significant role here.",
    "To fulfill that manifest destiny you’ll have to fight against rival players, NPC enemies and even the elements themselves as you clear a spot for yourself in the New World.",
    "Gameplay is mostly comprised of resource collection and combat - both of which, if we’re being honest, felt a bit generic at a recent demo of the game. Like Dark Souls, the combat feels methodical and slow. You’ll need to manage a stamina bar that gets depleted with every swing of your sword or hammer, and can be limited by the amount of items you’re carrying on your person. One misstep in a battle, and your opponent can relatively easily take you out.",
    "But that’s where inventory management comes into play.",
    "You very obviously want to be decked out in the best gear at all times - but wear too much of said gear and you’ll be over-encumbered. Wear too little and you’ll get eviscerated in combat. It’s the balancing act of knowing what to wear that’s key to winning combat.",
    "There’s also strategy in just how much combat you should do, too. If you’re out in the field for too long collecting resources (a key component of the game), an enemy player could easily come along and wipe you out.",
    "Don't worry, you’ll still have your entire inventory in the spot where you died that the other player can’t pick up, but it’s still a serious set-back in a game that’s all about collecting resources and upgrading gear faster than your rivals.",
    "Because the game’s still in alpha at the moment, there’s not too much more here to talk about in terms of real gameplay or mechanics - it all revolves around collecting resources, upgrading gear and then banding together to lay siege to another clan's fortress. That said, the vast majority of Amazon's MMO felt fairly benign in an industry filled to the brim with interesting mechanics and new ways to play.",
    "But then there’s this world. This open sandbox. It’s the basket in which you’ll find all of Amazon’s eggs - all of its innovation and potentially where everything goes wrong.",
    "In its current state the world is really rough and unfinished. It's littered with resources at this point, and a few monster mobs, but by and large it's a fairly generic-looking continent without a lot of personality.",
    "To muddy matters even more, unlike traditional MMOs, there aren't really any quest givers to speak of. Your missions in this world are really self-guided, and that means you'll have to make your own fun in the massive sandbox.",
    "When asked about what the end-game looks like in New World, Studio Head Patrick Gilmore said that the answer depended on the person. For some, it will be about getting the best gear, for others joining the best guild and dominating the player-vs-player space. For some folks, though, it will just be about exploration and survival in a sandbox world.",
    "On its surface, that’s a cool idea. Those social aspects are what made Eve such a huge success and the focus on survival through crafting is what makes Minecraft as hugely popular today as it was five years ago.",
    "But, just like Eve and Minecraft, Amazon won’t be authoring any content for the game - at least, not initially.",
    "So far there aren’t be raid bosses like in World of Warcraft, or environments like instances that your entire guild needs to band together to overcome. It’s you and your guild against the world. That’s all there is to it and the results, at least from what we played, were kind of boring at the beginning and only began to improve once we had the resources to craft forts and claim territory as our own.",
    "There’s a really interesting dichotomy between what Amazon made in Breakaway and what it’s trying to do with New World: One of these games tried to cash in on the eSports and MOBA craze with a fast-paced, competitive arena brawler, while the other is trying to expand on a formula that’s been perfected for nearly a decade.",
    "Breakaway became less fun after every sequential match while New World seems to get more fun as you invest more time in it. Breakaway was colorful with a whole cast of unique, interesting characters and New World puts you in the generic clothes of a settler who only later differentiates themselves after acquiring new skills.",
    "If that wasn’t clear enough, Breakaway was a fun, ephemeral experience - one that didn’t linger in any way and could be put down after every match without repercussion. Adversely, New World is going to require some commitment. Your guild will need you to win a war and setup a new base after you take down another group’s settlement. The game asks you to spend a lot of time harvesting materials in the hope of building something bigger and better than what you already have.",
    "Breakaway couldn’t have cared less if you logged out after your match was finished.",
    "It's really amazing how different the games are, especially when you consider that it's largely the same team that worked on both games. (According to Gilmore, most of the Breakaway team transitioned to New World when Breakaway was cancelled.)",
    "The similarity between the games is that they're an ambitious title for a first-time publisher - a fact its Studio Head is all too aware of. But according to Gilmore, that's what Amazon is looking for. \"Amazon is unique in their appetite for ambitious ideas,\" Gilmore told us in an interview.",
    "Of course, ambition alone does not a fun game make. If Amazon wants to get players to leave the safe shoals of traditional MMOs, it's going to have to convince gamers that this world is both more interesting and more fun than anything else out there - a task that right now seems to be giving them some trouble."
  ],
  "headers": {
    "3": "Landing on distant shores",
    "11": "Brave New World",
    "19": "New World vs Breakaway: what has Amazon learned?"
  },
  "links": {}
}