{
  "source": "https://www.techradar.com/reviews/getac-k120-ruggedized-laptop",
  "title": "Getac K120 ruggedized laptop review",
  "category": "computing",
  "updated": "2019-05-20T18:00:40Z",
  "author": "desire-athow",
  "summary": "A notebook that hides more than a few tricks",
  "verdict": "The K120 operates in a niche and the target audience knows exactly what it wants. Getac has delivered a fantastically built rugged laptop that ticks most if not all boxes. There are some debatable design choices, but ultimately the K120 represents the apogee of what’s possible with current technology.",
  "pros": [
    "Very sturdily built",
    "Very fast performance",
    "Plenty of expansion capabilities"
  ],
  "cons": [
    "Not really a laptop",
    "Touchpad is abysmal"
  ],
  "article": [
    "Ruggedized laptops are a niche market, but one which is lucrative and, in our opinion, underserved. Of the top laptop vendors, only Dell has an active rugged sub-brand (Latitude) with smaller players like Panasonic, Durabook and Getac feeding the growing appetite for sturdy powerhouses that can resist a few knocks and more. Getac sent us the K120, which is a 2-in-1 convertible laptop that can take a few bashings and survive the ordeal.",
    "Nothing quite prepares you for what the K120 is. In a world of identikit laptops, many trying to emulate the minimalist look of the Apple MacBook range, Getac’s flagship stands out. This certainly isn’t your everyday laptop, and it’s good to see a manufacturer that hasn’t made any apparent compromises in crafting its rugged device.",
    "The K120 pulls no punches – in tablet mode, it is almost twice as heavy as the LG Gram 14, a laptop that weighs under 1kg. With the keyboard docking station, the K120 measures 340.5 x 307.5 x 47mm with a weight of 3.25kg. That’s hefty, bearing in mind that this is a 12.5-inch device.",
    "But there’s a good reason: the K120 is jam-packed with connectors and features. There are six buttons on the tablet (Windows, power, function key, camera capture/barcode reader trigger, volume up, volume down) with three status lights (Wi-Fi, battery and power). There’s a 2-step secure latch lock that needs to be activated in order to detach the tablet.",
    "A barcode reader was present on our tablet (on the edge), as was a tethered active stylus. As for the list of connectors, there’s a proprietary power port, a full-size USB port, a USB Type-C connector, a GbE port, HDMI and a microSD slot.",
    "A pair of 2,100mAh hot-swappable batteries (that can be upgraded to 3,450mAh and are powered by a 65W PSU), a Full HD camera (which can be hidden manually under a flap) and an eight-megapixel rear camera complete the list of features. The machine we reviewed also came with a serial port, a SIM card reader and a removable M.2 SSD canister (with two Type-C connectors). All ports and slots are protected by lockable flaps and are labelled.",
    "There are also plenty of air vents to cool the components inside. Note that the K120 is not waterproof. It doesn’t carry an IP68 (only IP65) rating but is MIL-STD 810G certified which means that it will survive a 6-foot drop and low pressure water from all directions. Getac also offers optional ATEX and IECEx Zone 2/22 certifications for use in potentially explosive atmospheres.",
    "As for the docking station base, it houses a power socket, three USB 3.0 ports, an Ethernet connector, HDMI, one serial port, an SD card slot, a VGA port and RF antenna pass-through for GPS, WLAN and WWAN. Internal components can be easily accessed by removing six screws at the back. The handle is solid and provides a wide enough opening for even the biggest gloved hands.",
    "The model sent to us was powered by an Intel Core i5-8350U which is, in our view, the perfect business processor. Unlike the ubiquitous 8250U, it supports vPro, which is essential for a host of enterprise features. It has the same number of cores and threads, and graphics subsystem, as its more expensive sibling the i7-8650U – but it’s far cheaper.",
    "The 12.5-inch Full HD screen uses Getac’s proprietary display technology and has a rated brightness of 1,200 nits which should make it readable in broad daylight, which is where a laptop of this caliber is expected to be used.",
    "The Liteon CV8-8E256 SSD is a 256GB M.2 SATA model with a rated read/write speed of 550/450MBps. One standout feature of this SSD is that it uses an on-board redundancy technology called R.A.I.F.E (Redundant Array of Independent Flash Elements). Liteon explains that every piece of data that comes onto the SSD will be protected by parity, so data can be recovered beyond standard ECC protection. Impressive.",
    "Our device benefited from GPS and 4G mobile broadband (both optional) and when it comes to security, you get a smart card reader slot, a fingerprint reader, a high frequency RFID reader and a TPM 2.0 chip, backed by Absolute DDS software.",
    "One design issue we encountered was that the device would only stay stable on a flat surface when the screen was at an angle of up to about 100 degrees – anything greater than that and it tended to tilt and fall backwards. That’s because the tablet is heavier than the base – remember that it holds two batteries and all the components.",
    "Getac keeps bloatware to a strict minimum on the K120. However, you do get the G-Manager which is the system’s dashboard, allowing the user to monitor and control customizable options like the programmable keys.",
    "The IPS display is positively beautiful and performs well in bright sunlight (see the pictures) thanks to its 1,200 nits brightness. It is versatile enough to support multiple input methods: finger (dry or wet), glove, pen and digitizer.",
    "The keyboard and touchpad, however, will divide opinions. We felt that the keyboard very much looks like a toy one, with keys that don’t ‘sit’ perfectly, and have too much travel. These choices are, we posit, down to the fact that the potential users of this laptop are not likely to touch type, and will need plenty of key feedback when doing data entry.",
    "The same excuse doesn’t apply to the touchpad, though. It is certainly one of the smallest we’ve seen on any laptop, and yes, that includes the netbooks from the beginning of the millennium. The touchpad is smaller than a bank card but does come with two physical buttons for feedback. It doesn’t support two-finger scrolling and we found it to be subpar in terms of responsiveness.",
    "The overall performance of the K120 was excellent thanks to a great choice of components – it’s easily the best rugged device we’ve tested in terms of sheer numbers in our benchmarks. Battery life, as well, was great; at almost 10 hours, it tops our video playing leaderboard.",
    "The Panasonic Toughbook 33 is the obvious competitor to the K120. The latter however has a much better processor (the Toughbook offers Kaby Lake parts) and a bigger screen, while Panasonic boasts a higher screen resolution (and in theory should be sharper) plus it offers an OPAL encrypted SSD.",
    "Dell is also a formidable rival with the Latitude 7214 Rugged Extreme, every inch a potent candidate. Dell industry-leading customization options give it a leg up compared to the Toughbook 33 and the K120, plus it is far cheaper. However, it only offers a sixth-generation Intel CPU (we’re currently on ninth-gen) and its display, a smaller 11.6-inch effort, is an HD+ model.",
    "Alternatively consider the Dell Latitude 7424 Rugged Extreme which features newer components (including the 8350U processor found in the K120) and competitive pricing. Bear in mind, though, that neither of those Dell laptops are actually detachable devices (and the 7424 is heavier than the K120).",
    "We’d also like to add the Zebra (formerly Xplore) R12, which we reviewed almost two years ago. Strictly speaking, it is not a convertible, but it is a ruggedized device that ships with a removable keyboard cover.",
    "Getac claims to have the lowest failure rates in the industry and offers a three-year bumper-to-bumper warranty cover as standard. Starting from $2,799 (with our review model costing $4,643), this machine is expensive, but in the grander scheme of things, businesses that will buy one of these devices will look at the total cost of ownership and the increase in productivity (and decrease in downtime) that the K120 (and devices of a similar ilk) can achieve.",
    "We love the attention to small details like the lockable flaps, the ease with which you can swap components around, the four stubs that keep the screen in place, status indicators on the tablet and the base, and so on."
  ],
  "headers": {
    "1": "Design",
    "8": "Specifications",
    "12": "Performance and usage",
    "18": "The competition",
    "22": "The business take"
  },
  "links": {
    "LG Gram 14": "https://www.techradar.com/news/the-lg-gram-light-in-your-backpack-but-not-light-on-battery-power-or-performance",
    "Panasonic Toughbook 33": "https://www.techradar.com/reviews/panasonic-toughbook-33",
    "Zebra (formerly Xplore) R12": "https://www.techradar.com/reviews/xplore-ix125-r1"
  }
}