{
  "source": "https://www.techradar.com/reviews/pdfsam-basic",
  "title": "PDFsam Basic review",
  "category": "computing",
  "updated": "2020-10-23T14:29:05Z",
  "author": "sofia-wycislik-wilson",
  "summary": "A accessible tool for basic PDF tweaking",
  "verdict": "PDFsam Basic might not let you make direct edits or additions to PDFs, but it does include seven very handy utilities for your basic everyday needs.",
  "pros": [
    "Several utilities in a neat package",
    "Wonderfully simple to use",
    "Available for Windows, Mac and Linux"
  ],
  "cons": [
    "Features ads to upgrade to the premium version",
    "Not a comprehensive PDF editor",
    "Requires Java, which many people won't like"
  ],
  "article": [
    "The ‘sam’ part of PDFsam Basic's name means ‘split and merge’, and this is a large part of what this free PDF editor is designed to do.",
    "As well as making it possible to merge multiple PDFs into a single file, PDFsam Basic offers you no fewer than three ways to split PDFs. You can split using page numbers as a marker, using bookmarks contained within a PDF file, or into chunks of a particular size.",
    "You can merge PDFs into a single file, or extract and combine smaller sections. PDFsam Basic also offers Alternate Mix option, which combines two files while alternating their pages.",
    "PDFsam Basic also lets you rotate documents – handy if you've created PDFs from scanned documents – and extract individual or multiple pages. This is a useful option if you want to save the central section of a PDF as a file in its own right without having to go to the trouble of performing multiple splits.",
    "There are also batch processing tools, which are extremely useful if you have multiple documents to deal with.",
    "PDFsam Basic feels like a number of small utilities bolted together through a common interface rather than one unified tool. That might sound like a disadvantage, but in practice it keeps different areas of the software well-focused so there's no scope for getting distracted by unwanted options.",
    "The interface is incredibly easy to get to grips with, and no matter which tool you're using it should be immediately obvious how to complete the task at hand.",
    "It's worth noting that PDFsam Basic's installer offers to install some additional related software, but this is easy to opt out of."
  ],
  "headers": {
    "5": "User experience",
    "8": "You might also like"
  },
  "links": {
    "PDFsam Basic": "https://pdfsam.org/download-pdfsam-basic/",
    "PDF editor": "https://www.techradar.com/best/free-pdf-editor",
    "merge PDFs": "https://www.techradar.com/best/best-pdf-merger"
  }
}