{
  "source": "https://www.techradar.com/reviews/airtv",
  "title": "AirTV review",
  "category": "televisions",
  "updated": "2019-07-26T21:54:15Z",
  "author": "tyler-hayes",
  "summary": "Free TV channels straight to your phone or tablet",
  "verdict": "The AirTV product provides a key service for getting local TV channels to your phone or tablet anywhere, for free. If your location gets good broadcast signals, the price for the box is well worth it.",
  "pros": [
    "Free local TV channels",
    "No service fees",
    "Easy setup"
  ],
  "cons": [
    "Requires an antenna",
    "No UI on the device",
    "Dependent on good reception"
  ],
  "article": [
    "If you want free local TV channels, one solution is to connect an antenna directly to your TV. But that only works when you’re home, watching that specific TV. To get those same free channels on your phone or tablet, however, AirTV is another solution that works even if you’re not at home.",
    "It works by connecting an antenna to the black box, and then connecting the AirTV to the internet. If you subscribe to Sling TV you can get your free local channels inside the Sling TV app. If you don’t, there’s a separate, free AirTV app which will just show you the channels coming to the antenna.",
    "A straightforward and often robust solution to free TV over the internet, the AirTV is a great device... but there are a few things that make it more frustrating than it ought to be.",
    "The physical AirTV box is basic enough. Plug it into power, connect a coaxial antenna into the back, and then connect it to the internet via ethernet or WiFi. It’s not a flashy product certainly, but it's not unattractive either.",
    "Depending on your home theater setup you might be able to tuck it away and hide it if you don’t care for its appearance - at about the size of two Apple TV’s side-by-side, it should be able to find a spot nearly anywhere. Plus, because it doesn’t have to be plugged into any TV, you can position it where it gets the best antenna signal.",
    "One major consideration is that the physical box gets really hot - so hot that it made us consider the surface it was sitting on and whether it would catch fire. So far there hasn't been a fire, but we'd recommend keeping it away from anything flammable.",
    "The type of content experience from an AirTV really depends whether you subscribe to Sling TV or not. If you don’t subscribe, there’s no fees beyond the cost of the product and an antenna, if you don’t have one.",
    "For our review we picked up a cheap Mohu antenna which was able to receive about 56 over-the-air channels in the San Diego area. With the transition to digital broadcast there are a lot of sub-channels for each major provider. For example, there’s not just channel 10 anymore, there’s now 10.1, 10.2, 10.3, and so on - and with the right antenna the AirTV can pick up all of them.",
    "That said, you need to set up the AirTV through a mobile device with the instructions provided in the AirTV app or Sling TV app. As a note of warning, if you do use Sling TV, don’t set up AirTV with its separate app as trying to configure the Sling app produces an error, forcing you to reset the device.",
    "Even though we use Sling TV, we used the AirTV app to set up the box and antenna. We connected it over WiFi and the biggest headache came from the box wanting to perform two software updates before we were able to use it.",
    "Scanning for channels took under two minutes and before long we were watching dozens of free, broadcast channels we’d never even knew existed. Overall, AirTV and the service it provides is wonderful.",
    "Setting the AirTV up with Sling is nearly the same experience, just within a different app. And, if you have a Sling TV Mini attached to a TV in your house, it will connect automatically on the same WiFi network.",
    "The purpose of AirTV Mini is to bring Sling TV and local free channels to a home TV. Not all Sling TV apps on various devices like Apple TV can display the local channels. It’s not clear why, however.",
    "Since the AirTV is independent and not directly connected to any device, it’s hard to evaluate its performance. It relies on the antenna you use and the placement to determine the OTA TV channels - there's no UI that helps to give feedback, instruction or any way to troubleshoot it if something isn't working.",
    "Moreover, the AirTV also relies on your internet connect to get those channels on your devices - which means even if the antenna has good reception your internet connection could cause the video to stutter and buffer.",
    "It's a your-miles-may-vary situation and while our setup pulled in about 56 channels, you may not be that lucky. Worse, even if you manage to get all your local channels, connection issues could cause them not to load, stutter or freeze periodically. Is this a problem with the AirTV box, our internet connection, the broadcast signal, our antenna, or something else entirely? It’s hard to tell.",
    "Despite a few issues in the setup as a whole package, though, the AirTV has performed well. The few hiccups that have cropped up have been annoying, but they haven’t kept us from getting hooked on Antiques Road Show on PBS.",
    "For those looking for a cheap solution and don't mind paying a one-time fee to get a dozen or more channels on the go, AirTV with an antenna is a solid solution. It won’t be for everyone and every situation, but it should provide enough value to most."
  ],
  "headers": {
    "3": "Design",
    "6": "Content and features",
    "13": "Performance",
    "17": "Final verdict"
  },
  "links": {}
}