{
  "source": "https://www.techradar.com/reviews/new-nintendo-2ds-xl",
  "title": "New Nintendo 2DS XL review",
  "category": "gaming",
  "updated": "2019-02-26T16:45:25Z",
  "author": "stephen-lambrechts",
  "summary": "3D is out, 2D is in",
  "verdict": "The New Nintendo 2DS XL might feel unnecessary in a post-Switch world, but there's no denying that its huge back-catalogue of classic games will keep the updated handheld relevant for the foreseeable future. It's also got a hugely attractive price point for newcomers.",
  "pros": [
    "Beautiful design",
    "Huge game selection available",
    "Terrific price point",
    "Comes with a charger"
  ],
  "cons": [
    "Battery life is still underwhelming",
    "Low-res screen looks ancient compared to the Switch"
  ],
  "article": [
    "There was a time when the 2DS and 3DS were the best handheld devices from Nintendo. But now that the Nintendo Switch exists, things have changed.",
    "With the Switch, users have access to a beautiful Nintendo handheld console that has detachable controllers built-in and a stunning HD display. Gamers are also able to play honest-to-goodness Nintendo games on their iOS and Android devices, which means we'd forgive you for thinking there's no space for the 2DS and 3DS anymore.",
    "So with all of that in mind, it may seem like a curious decision for Nintendo to return to the 2DS/3DS ecosystem having just launched the Switch - its greatest and most powerful handheld yet.",
    "However, considering there's a huge back-catalogue of games and a number of big releases still on the horizon, it's clear that there's plenty of life left in the popular dual-screen gaming machine. There's just more competition.",
    "Having achieved some success with its affordable and 3D-less Nintendo 2DS handheld, and an ultimate level of refinement with 2015's New Nintendo 3DS XL, Nintendo has seen fit to combine the best of both worlds with its latest device, the New Nintendo 2DS XL.",
    "The New Nintendo 2DS XL is priced at $149.99 (£129.99 / AU$199.95), making it a very affordable way to play the many 3DS titles currently available and the many still to come.",
    "Still, the question remains – does the New Nintendo 2DS XL have what it takes to impress in an age where Nintendo fans can get a home console-quality experience on the go?",
    "The original 2DS had something of a divisive design, with its flat, wedge-like shape that had both of the system's screens placed on a single, non-foldable plane. Getting your own hands on it was really the only way to see if you liked what Nintendo was attempting to do, with many finding it to be quite a comfortable piece of kit.",
    "That said, there's no beating the tried-and-true clamshell design that Nintendo has been rocking since the Game & Watch era. This foldable design has been a mainstay of every DS and 3DS system that Nintendo has ever released, and we're glad to see it applied to the 2DS line for the very first time.",
    "In terms of size, the New 2DS XL is only slightly smaller than its three-dimensional counterpart (the New 2DS XL is 6.4-inches tall while open and 3.4-inch tall while closed, compared to 6.78-inches tall while open and 3.7-inches tall while closed on the New 3DS XL – all other dimensions are the same), however, there are a few noticeable differences in design between the two.",
    "The first thing you'll probably spot is that the new 2DS XL's hinge now protrudes from the unit's body while closed. On previous iterations, the hinge sits flush with the handheld's spine and shoulder buttons. That's hardly a dealbreaker, though it does mean that the New 2DS XL loses a bit of its sleekness, resulting in a handheld that doesn't feel quite as nice to hold when shut.",
    "Open the New 2DS XL up and you'll see the top screen now has a much smaller bezel. This is because the front-facing camera and mic have been moved down to the hinge, which is probably another reason why it now sticks out. The placement is not a big deal when it comes to taking selfies, though you may have to tilt your head forward to avoid the double-chin effect.",
    "That said, because this redesigned hinge sticks out, the camera is no longer tucked away when the clamshell is shut, meaning you'll always be able to see at least two-thirds of the lens at any given time. This could also potentially lead to the lens getting scratched or damaged if not kept in a protective case.",
    "It's also thinner than the New 3DS XL, with a top screen that's incredibly thin for a handheld. This is likely due to the unit's lack of 3D functionality, which would've made that top display slightly chunkier.",
    "Along with these differences, the power button, headphone jack and stylus have been moved to the bottom of the unit, along with the enclosed microSD and cartridge slots (and thankfully, you won't need a screwdriver to swap out microSD cards this time around). The left and right speakers have also been moved from the console's face to the underside. A volume slider can be found on the left side of the bottom half.",
    "Speaking of the unit's face, you'll find a d-pad, circle pad and home button on the left side, while four game input buttons, Start and Select buttons and a nub-like C-stick can be found on the right. Like the New 3DS XL, new ZL and ZR buttons have been added in between the L and R shoulder buttons.",
    "Overall, the New 2DS XL is a beautiful device, with a nice ridged texture on its top side that makes it feel quite premium. Admittedly, the top screen doesn't feel as sturdy as it has on previous models, with a slight wobbliness to it when you shake the unit around.",
    "We also found the stylus itself to be a little too short physically, barely extending past our knuckle when held in a traditional pencil position. This won't be an issue for small children, but adults may find it a less than ideal."
  ],
  "headers": {
    "7": "Design"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}