{
  "source": "https://www.techradar.com/reviews/roborock-s6-robot-vacuum",
  "title": "Roborock S6 robot vacuum review",
  "category": "appliances",
  "updated": "2019-08-13T11:48:50Z",
  "author": "jon-mundy",
  "summary": "A feature-packed robot vacuum that’s only going to get better",
  "verdict": "There are more refined and intuitive robot vacuum cleaners around, but none provide quite the same combination of features and performance at such a competitive price as the Roborock S6. It’s arguably the best-value robot vacuum cleaner on the market.",
  "pros": [
    "-Very good value",
    "-Effective mapping and navigation",
    "-Full suite of features"
  ],
  "cons": [
    "-Basic smarthome app",
    "-Clunky mapping software",
    "-Mopping features don’t add much"
  ],
  "article": [
    "In the burgeoning robot vacuum market, Roborock doesn’t yet have the brand pull of other models in the space, like the iRobot Roomba or Neato Botvac D7. But if Roborock keeps releasing automated cleaners as accomplished and fully featured as the Roborock S6, and improves its software game, it soon will be.",
    "The Roborock S6 boasts incredible suction, sharp laser-guided navigation, a full suite of features, and powerful home mapping capabilities. It will even mop your hard floors for you – and all for a fair amount less money than its high-end rivals.",
    "The Roborock S6 is currently available in Spain, Germany and France at a price of €549, while US buyers can pick one up for $650. It isn’t officially available in the UK at the time of writing, though we’ve seen some online retailers (like eBay) selling it for around the £500 mark.",
    "Whatever the final price, it’s going to be significantly cheaper than functionally comparable robot vacuum cleaners like the Dyson 360 Eye and the iRobot 980, both of which retail for around £800.",
    "Roborock has stuck with the same basic design template that informed the Roborock S5. This is another low-slung, circular robot that can turn on a sixpence with the help of its two centrally placed main wheels.",
    "The stand-out external feature of the S6, aside from its glossy white finish, is a little turret mounted on top. This houses a red spinning laser that, together with an array of 14 sensors, enables the S6 to navigate and map its environment.",
    "The rear two thirds of the S6’s top surface flips up like a lid to uncover a removable 480ml capacity bin and filter cleaning tool. While the former isn’t as elegant a solution as that of the Miele RX2 or the Dyson 360 Eye, it’s perfectly intuitive and usable.",
    "Flipping the Roborock S6 over reveals a wave-like spinning brush mounted centrally between its two rugged wheels, which helps to ensure that most particles find their way into its maw.",
    "The charging station is a fairly compact plastic dock. Manually mounting the S6 on this dock is far easier than with many of its rivals (we’re looking at you Dyson), due to a deep groove that cups the unit’s small front wheel and makes for a snug fit. We do wish the power lead was a bit longer though.",
    "One notable extra here is the provision of a clip-on plastic base, which the Roborock S6 physically sits on. This is a nod to the bonus floor mopping function, with the idea being that you keep the potentially damp underside of the robot vacuum cleaner off the floor while charging.",
    "The Roborock S6 is an impressively powerful and flexible vacuum cleaner with four distinct power settings. By default it starts out on the second-lowest of these settings – called Balanced – but you can set it to automatically detect when it’s on carpet and increase the suction accordingly.",
    "At the highest MAX setting, you can expect an impressive 2000pa of suction. That’s Dyson 360 Eye territory right there.",
    "We found the Roborock S6 to be a comprehensive cleaner, accessing all areas with its zig-zagging movement pattern and weighty plastic side brush. It doesn’t hang around, either. We found that a complete run through a spacious two-bedroom flat would take the S6 around 45 minutes to complete, while sending it off to tackle individual rooms would take around 10 minutes instead.",
    "The S6’s large 5200mAH battery is good for three solid hours of cleaning in the lowest Quiet mode, while the regular Balanced mode is good for around two hours. We suspect this will give most people plenty of flexibility for an impromptu whip around or spot clean outside of scheduled cleans, even just after it’s finished a run.",
    "It’s relatively rare that a product will improve during the relatively brief time we spend with it for a test, but that’s precisely what happened with the Roborock S6. Our two biggest initial gripes with the unit were fixed before our very eyes.",
    "In our initial runs with the Roborock S6, its rubbery side brush seemed to struggle with the long fibres on our carpet. Rather than stop this non-essential component from spinning, the S6 would come to a complete halt with an accompanying error message.",
    "Less than two months on from our initial test, however, the Roborock S6 appears to be cured. A firmware update seems to have instructed the side brush to temporarily stop spinning under these deep pile conditions, allowing the robot vacuum cleaner to proceed unimpeded.",
    "Our initial runs with the S6 also saw it getting wedged at an angle between the drop off of the aforementioned rug and our low-hanging TV cabinet. After the firmware update, however, it seems to manage to skirt the hazard as well as any of its illustrious rivals.",
    "It gives us a fair amount of confidence that the Roborock S6 you buy today will grow and improve over its life.",
    "If the Roborock S6 has an Achilles heel, it’s software. It utilises the generic Xiaomi Home smarthome app rather than a dedicated Roborock one, with Xiaomi being a major investor in the robot vacuum cleaner brand.",
    "That’s not to say that this is a particular issue in day to day usage, but the lack of brand continuity is a little grating when held next to Roborock’s high-class rivals. It’s also a potential point of confusion for your average consumer.",
    "This lack of clarity continues when you get into the app itself, particularly when you come to the Roborock S6’s aforementioned mapping feature. Currently in beta, it needs to be turned on in the app’s Settings menu. Once activated, it’s both functional and useful, but the interface is undoubtedly clunky.",
    "Dividing up your house into color-coded rooms so you can instruct the S6 to address individual areas works well enough, but drawing out no-go and cleaning zones with a drag and drop box-out feels like some early Microsoft Windows touchscreen experiment from the early 00s.",
    "It’s fiddly, unintuitive and ugly, particularly when you hold it up against the mapping features offered by iRobot.",
    "Mapping aside, the Xiaomi Home app covers the bases pretty well. You can use it to direct the S6 to clean your whole house, select rooms, or a manually sized up zone. The Settings menu is a veritable treasure trove of options, with schedules, cleaning modes, cleaning history rundowns, smart home scenarios and more available to you.",
    "If you don’t want to navigate the app too often, you can also hook the Roborock S6 up to your home assistant of choice. We had it up and running with Google Assistant in no time, enabling us to bark “clean with Roborock” and have it obey our commands.",
    "Besides doing a great job of sucking up dirt from your carpets and floors, the Roborock S6 will also mop your hard floors for you.",
    "It’s an appealing idea, but the execution is only semi-successful. You need to manually affix a cleaning cloth (both disposable and reusable are included) to the cleaning module, then click that module into place behind the vacuum brush. On your average kitchen or bathroom hard floor, you could probably have whipped around with a mop yourself in the time this takes.",
    "You might want to do just that, in fact, as the S6’s hard floor cleaning capabilities are far from comprehensive. There’s no cleaning agent employed, with just a small amount of water emitted by the S6.",
    "The effect is roughly equivalent to lightly running a damp cloth over the floor. We observed to see how the Roborock S6 would fare with some chocolate spread, but the robot vacuum cleaner merely smeared it around a little.",
    "Still, the blackened nature of the cloth after a single kitchen run shows that it does some good, and the labor-saving potential increases exponentially the more hard floor you have in your home.",
    "The Roborock S6 provides an impressive number of features, intelligent navigation, and powerful cleaning for a very low price. It’s also very versatile, with a floor mopping function, four cleaning modes, and the ability to clean individual rooms and areas.",
    "If we were to name one main criticism of the Roborock S6, it’s that it feels a little like an advanced prototype, and feels like a version 0.9 of a hugely promising product.",
    "On the positive side, that means that you’re getting a comprehensively equipped device for a great price that will likely continue to improve throughout your ownership. Conversely, it lacks the refinement and polish of rivals such as the iRobot Roomba 980, the Dyson 360 Eye, or the Neato Botvac D7.",
    "When it comes to sheer bangs per buck, though, we can’t think of a single robot vacuum cleaner that tops the Roborock S6."
  ],
  "headers": {
    "2": "Price and availability",
    "4": "Design and build",
    "10": "Cleaning performance",
    "19": "App and mapping",
    "26": "Floor mopping",
    "31": "Verdict"
  },
  "links": {
    "robot vacuum": "https://www.techradar.com/news/best-robot-vacuums",
    "iRobot Roomba": "https://www.techradar.com/news/irobot-roomba-671-should-i-buy-it",
    "Neato Botvac D7": "https://www.techradar.com/reviews/neato-botvac-d7-connected",
    "eBay": "https://www.ebay.co.uk/itm/192982065667?mkevt=1&mkcid=1&mkrid=710-53481-19255-0&campid=5337827784&customid=trd-us-1132976116850263700",
    "Dyson 360 Eye": "https://www.techradar.com/reviews/dyson-360-eye-robot-vacuum-cleaner",
    "iRobot 980": "https://www.techradar.com/reviews/irobot-roomba-980",
    "Roborock S5": "https://www.techradar.com/reviews/roborock-s5",
    "iRobot Roomba 980": "https://www.techradar.com/reviews/irobot-roomba-980"
  }
}