{
  "source": "https://www.techradar.com/reviews/oneplus-7t",
  "title": "OnePlus 7T review",
  "category": "phones",
  "updated": "2020-04-28T09:52:35Z",
  "author": "sudhanshu-singh",
  "summary": "Yet another affordable powerhouse from OnePlus",
  "verdict": "The OnePlus 7T improves upon the last-gen version of the handset with a 90Hz refresh rate screen, some camera improvements, and faster charging. There are tons of other minor improvements, and it all makes up for a more refined and reliable overall smartphone. The 7T is an excellent low-cost flagship.",
  "pros": [
    "90Hz refresh rate display is brilliant",
    "Smooth UI experience",
    "Superb performance",
    "Android 10 out of the box",
    "Impressive cameras"
  ],
  "cons": [
    "No wireless charging",
    "No headphone jack",
    "Big camera bump"
  ],
  "article": [
    "Having released just one smartphone annually for the first few years of its existence, OnePlus has evolved to the point where, like other smartphone brands, it now releases multiple phones each year.",
    "The new OnePlus 7T is the fourth handset to join its current series – and this time around we don’t just have a new phone from the Chinese company, but also a new series of smart TVs",
    "We've shared our thoughts on the new displays in our OnePlus TV review, but here we’re bringing you our thoughts on the OnePlus 7T.",
    "It's a massive upgrade over the OnePlus 7. It's similar to the OnePlus 7 Pro, in a smaller form factor and without curved screen sides. Those wishing for a compact 7 Pro now have an option that hits a sweet spot between the two existing phones, giving users more options at a variety of price points.",
    "In comparison to the OnePlus 7, the OnePlus 7T comes with two significant upgrades: an improved display and better cameras. It retains the handy form factor of OnePlus 7, and has a new back design that’s immediately noticeable. Faster charging and a performance boost courtesy of the latest Snapdragon 855 Plus chipset are further upgrades.",
    "We've previously awarded 4 out of 5 stars to the OnePlus 7 for its value for money proposition; but the 7T comes at a higher price, so the question is, do the upgrades justify the added cost? Let’s take a look…",
    "The OnePlus 7T price was $599 / £549 / ₹37,999 for the 8GB of RAM and 128GB of storage version at launch. and This phone was announced in September 2019.",
    "That price has since dropped - after the company unveiled the OnePlus 8 - to $499 / ₹34,999. The price remains £549 in the UK, and you can't buy the handset in Australia.",
    "The OnePlus 7T shares a similar design language with the OnePlus 7. There’s the same slightly curved back and a waterdrop notch at the top of the screen, but unlike previous 'T' upgrades, you won't struggle to tell the 7 and 7T apart – this is mainly because of the circular camera housing, which OnePlus says is a nod to old-fashioned cameras.",
    "We’re not sure if OnePlus took inspiration from Moto or Nokia here, but the circular bump is reminiscent of phones from those brands.",
    "It's going to be a matter of personal taste whether or not you find this addition appealing, but OnePlus has a history of favoring a minimalist approach to phone design, and this doesn't follow in that tradition. So far we’re not fans of this odd camera bump – but that may just be because we like the neat vertical camera setup on the 7 Pro better.",
    "The OnePlus 7T has a matte-frosted glass back like the 7 Pro, whereas the OnePlus 7 has a shinier and smoother texture. As we mentioned, the 7T slots into the OnePlus lineup between the existing OnePlus 7 and OnePlus 7 Pro, that refers mainly to the design. The dimensions of the three phones differ by a small margin. The 7T measures 160.94 x 74.44 x 8.13mm and weighs 190g, making it slimmer and lighter than the OnePlus 7 Pro, and slightly taller and bulkier than the OnePlus 7.",
    "The small and light form factor makes it a little easier to handle than the 7 Pro. It’s easy to use with one hand, and fits snugly into a pocket – although we’d still recommend getting a case, as its smooth finish makes the 7T a little slippery – and there's plenty of glass to break here.",
    "We’re testing the Glacier Blue OnePlus 7T, but we're curious to see how the Frosted Silver looks in the frosted finish. The Glacier Blue looks like a faded version of the Nebula Blue on the 7 Pro, and if we had to choose between the two blues, we slightly prefer the Nebula. We may see more color variants down the line, as with previous generations of OnePlus devices, but so far there's no news on additional shades.",
    "The arrangement of ports and buttons on the 7T is identical to on the 7 Pro. The physical alert slider and the power/lock button are where we prefer them, on the right side. The power key falls naturally under the thumb, and you can access the alert slider without looking at your phone simply by moving your thumb up an inch.",
    "The volume key on the left sits below your index finger when you’re holding the phone in a natural orientation, while the USB Type-C port, SIM tray, and loudspeaker are at the bottom.",
    "Two design traits the 7T doesn’t inherit from the 7 Pro are its curved display and pop-up selfie camera. Instead, you get a OnePlus 7-like flat screen and a waterdrop notch that OnePlus says is around 30% smaller than the one on the OnePlus 7.",
    "The OnePlus 7T’s screen is a significant upgrade over the display on the OnePlus 7. On paper, it’s comparable to the screen on the 7 Pro, although attributes such as size, resolution and panel quality differ slightly.",
    "It’s a 6.55-inch Full HD+ AMOLED display with thinner bezels and boasts HDR 10+ and a 90Hz refresh rate. The OnePlus 7 Pro has a bigger 6.67-inch QHD+ display, while the OnePlus 7 has a smaller 6.41-inch FHD+ screen.",
    "You might not be able to differentiate between a 60Hz and a 90Hz display unless you’re a regular user of the latter – essentially, higher refresh rates mean the image on the screen refreshes more rapidly, resulting in smoother transitions on-screen.",
    "The benefits of the 90Hz display become apparent when you’re navigating the UI and gaming, while the HDR 10+ compatibility enhances video content to a considerable degree.",
    "There's a new E3 material used on the 7T that is said to reduce harmful blue light by 42% without compromising on colors. There is a video enhancer in the display settings that boosts colors and contrast when you play a video.",
    "Such jargon aside, we found the screen to be impressive. It's not as immersive and rich as the QHD+ display of the 7 Pro, but that's because you don’t have the curved edges that make for a truly bezel-less front – at the sides at least, and because of the lower resolution here.",
    "There are, however, a couple of positives of having a flat display – it's less reflective, and there’s less chance of accidental screen presses. As long as you're not a committed pixel peeper, this screen will do you just fine.",
    "The display calibration on the OnePlus 7T is quite similar to that on the OnePlus 7 Pro, although colors on the 7 Pro look a little cooler if you view the two screens side by side – skies look a little bluer, for example.",
    "The 7T’s screen is excellent for watching movies and TV shows, and for playing games, and our favorite feature is the super-smooth scrolling. In our OnePlus 7 Pro review, we said \"every phone should have this,\" and we’ve seen nothing here to change our opinion. Plus, with 1000 nits of brightness, the screen is beautiful, bright and is relatively easy to read even in sunlight.",
    "There's a new Reading Mode that allows you to view content in color, rather than only in black and white – you can choose between the two when you turn on the mode. It's certainly easy on the eyes, but we haven't spent enough time with the phone to tell if it’ll prove to be genuinely useful.",
    "The OnePlus 6T was the first phone from the brand to come with a fingerprint sensor, and at the time we found it to be one of the fastest on the market.",
    "OnePlus says screen unlocking is even speedier here than the one on OnePlus 7 – it claims the unlock time has been cut from 0.40 seconds to 0.21 seconds, and while we can’t vouch for the accuracy of that claim, it’s certainly fast, and we also found it to be reliably accurate. We can also confirm that it's even faster than the scanner on the Galaxy Note 10 Plus."
  ],
  "headers": {
    "6": "OnePlus 7T price and availability",
    "8": "Design",
    "17": "Display"
  },
  "links": {
    "OnePlus 7 Pro": "https://www.techradar.com/reviews/oneplus-7-pro",
    "OnePlus 7": "https://www.techradar.com/reviews/oneplus-7-review",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "OnePlus 6T": "https://www.techradar.com/reviews/oneplus-6t-review-india",
    "Galaxy Note 10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-note-10-plus-review-and-specs"
  }
}