{
  "source": "https://www.techradar.com/reviews/diesel-on-full-guard-25-review",
  "title": "Diesel On Full Guard 2.5 review",
  "category": "wearables",
  "updated": "2019-02-08T14:53:50Z",
  "author": "james-peckham",
  "summary": "A bold style choice, but a solid watch",
  "verdict": "The Diesel On Full Guard 2.5 won’t be the smartwatch for everyone, but for a select few it will be ideal. Lackluster battery life is made up for by a design that isn’t offered by anyone else in the smartwatch market. This is for the select few, but for those that like the design it'll be a great addition to their tech collection.",
  "pros": [
    "Bold look",
    "Large display",
    "Strong feature set"
  ],
  "cons": [
    "Unsatisfactory battery",
    "Heavy",
    "Performance isn’t great"
  ],
  "article": [
    "Perhaps one of the boldest smartwatches money can buy, the Diesel On Full Guard 2.5 isn’t for everyone – but it isn't designed for everyone either.",
    "Unlike the Apple Watch 4 or Samsung Galaxy Watch, this is intentionally built for those who like Diesel's style rather than a wider range of people. It’s big, it’s bulky and that's intentional; you’ll either love or loathe the design.",
    "It’s one of the updated watches made by Fossil but sporting a different brand's look and name. Fossil also makes Michael Kors, Skagen and other smartwatches.",
    "The company is in the process of updating its whole range of third-party brand watches with vastly updated tech including a GPS sensor and Google Pay capabilities, with the Diesel On Full Guard 2.5 being the latest to benefit.",
    "Fossil announced the Diesel On Full Guard 2.5 at the tail end of 2018 and it was on sale around the world by October of that year. The RRP for the watch is $325 / £319 / AU$549 but you may be able to find it for a touch cheaper.",
    "In the UK we’ve spotted it at around the £290 mark, while in the US it’s still around the RRP. This isn’t the cheapest smartwatch money can buy, but considering it’s a high-spec device with a premium design it’s not a terrible price either.",
    "If you like Diesel wrist wear, it’s likely you’re going to be a fan of the design employed here.",
    "It’s unique, but that’s not a bad thing. A lot of smartwatches – especially in the Wear OS space – have a tendency to look alike, so we’re happy to see Diesel try something a bit different to the rest of the market.",
    "It’s a large and heavy watch. Much like the original Diesel On Full Guard, this will suit those with larger wrists who like a bulkier device.",
    "It has dimensions of 47 x 56 x 13mm, and that may sound a lot on paper but we didn’t find the device to be overly thick on the wrist. It is large though.",
    "It’s a circular watch with a 1.39-inch display in the middle and there’s quite a thick bezel around the outside of that when you compare it to devices like the Apple Watch 4. The effect around the top of the watch looks perforated, and it's an effect that we like the look of.",
    "We used the version that’s a combination of black and red, but there’s also a lighter version with a silver body and strap, as well as a purely black version with a grey strap.",
    "That strap we had is made of silicone and while we found it got dirty quite quickly it has a nice design that many will find comfortable. It also does a good of holding the watch in place when you’re wearing it, despite the weight of the watch.",
    "However, if you're not into silicone you can also get the watch with other straps, including leather and metal. Some of these do cost a little more though.",
    "On the right hand side of the Full Guard 2.5 you'll find three buttons that will allow you to wake the device and navigate around. First off, a button disguised as a crown sits at the 3 o’clock mark. We particularly like this as rotating it allows you to cycle through menus on the watch’s display.",
    "Above and below it there are smaller buttons that can be tailored to your needs. By default the top button launches some Diesel features and the bottom button starts Google Fit, but you can change what these activate in the settings with ease.",
    "We found the display of the watch to be big enough that you can interact with it easily, the resolution is high at 400 x 400 and it's bright enough to comfortably use on a daily basis.",
    "Image Credit: TechRadar"
  ],
  "headers": {
    "4": "Diesel On Full Guard 2.5 price and release date",
    "6": "Design and display"
  },
  "links": {
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review",
    "Samsung Galaxy Watch": "https://www.techradar.com/reviews/samsung-galaxy-watch-review",
    "Diesel On Full Guard": "https://www.techradar.com/reviews/diesel-on-full-guard"
  }
}