{
  "source": "https://www.techradar.com/reviews/smallpdf",
  "title": "SmallPDF review",
  "category": "computing",
  "updated": "2020-10-22T08:57:23Z",
  "author": "sofia-wycislik-wilson",
  "summary": "An online PDF editor with lots of file conversion options",
  "verdict": "For PDF conversion, SmallPDF is superb, but its editing options are rather more limited when compared to the competition.",
  "pros": [
    "Lots of file conversion options",
    "Cloud-based and platform independent"
  ],
  "cons": [
    "No free version available",
    "No text editing",
    "Unrefined interface"
  ],
  "article": [
    "SmallPDF is a paid-for online PDF editor which will set you back €5 (about $5.50, £4.50, AU$8) per month, or €7 (about $7.50, £6, AU$11.50) per month if you would also like take advantage of the desktop version so you can work offline. There is a 14-day free trial available so you can see if it is going to be worth your money.",
    "On the face of things, there are lots of tools and option to work with, but this is somewhat exaggerated by the fact that every single option is listed individually. For instance, the conversion options to and from PDF are listed as eight individual tools rather than the one it really is.",
    "Splitting, merging, rotating, compression and page deletion are all also listed as separate tools, while if you select the Edit PDF option you will find that there are actually very few tools available in this mode.",
    "In fact, in Edit mode you're limited to adding text, images and shapes to an existing PDF; if you want to do anything else, you will have to save you work and move to another tool. It is a shame to see that there's no text editing available – the closest you can get is drawing a new text box over existing text so you can enter something new in its place.",
    "In use, SmallPDF can be a little frustrating, thanks largely to the way the various tools are set out. Rather than all being accessible from the same interface, tools are instead split across multiple menu – so PDF editing is in a different place to PDF conversion; this in turn is in a different place to PDF rotation; and PDF splitting is in yet another place.",
    "It would have made much more sense to have all of these options available on a page that mimics a desktop tool. In practice, the layout and organization of tools means that unless you just have a simple edit to perform, things will take longer than expected, particularly if you need to make use of two or more different tools."
  ],
  "headers": {
    "4": "User experience",
    "6": "You might also like"
  },
  "links": {
    "SmallPDF": "https://smallpdf.com/",
    "PDF editor": "https://www.techradar.com/best/free-pdf-editor"
  }
}