{
  "source": "https://www.techradar.com/reviews/sony-fe-35mm-f18",
  "title": "Sony FE 35mm f/1.8 review",
  "category": "cameras",
  "updated": "2019-09-03T02:00:52Z",
  "author": "matt-golowczynski",
  "summary": "Long-awaited 35mm f/1.8 optic shines",
  "verdict": "With fast autofocus, a great build and the ability to capture very sharp images at even its widest aperture, this is a stellar addition to the FE lineup.",
  "pros": [
    "Very fast autofocus",
    "Excellent sharpness – even at f/1.8",
    "Generally pleasing defocused areas"
  ],
  "cons": [
    "Some longitudinal chromatic aberration",
    "Vignetting at wider apertures",
    "Not cheap for such a lens"
  ],
  "article": [
    "It must be hard being Sony. No matter how many lust-worthy cameras and lenses you release, the downside of having such a popular camera system is that there's always something else everyone is clamoring for.",
    "The lens on test is a good example. Users of Sony's full-frame Alpha cameras, such as the A7 III and the most recent A7R IV, have been highlighting the 35mm f/1.8-shaped hole in the company's lens stable for some time.",
    "Such an option already exists for its APS-C bodies, and pricier 35mm alternatives from other corners are also available. But this latest arrival blends the advantages of a small size and light weight along with a wide f/1.8 aperture to justify its introduction.",
    "At $750 / £630 / AU$1,099 it's not quite the cheapest of its kind, but it's pretty consistent with similar lenses developed for full-frame mirrorless bodies in the past year or so.",
    "This is a relatively simple prime lens, with a classic wide-angle focal length and a respectably wide f/1.8 aperture. It's intended for full-frame camera owners, but it will also play happily with APS-C bodies like the new A6600 and A6100, whereupon its effective focal length increases to around 52.5mm in 35mm terms.",
    "The lens is made up of 11 elements in 9 groups, with a single aspherical element among these. This is on hand to suppress spherical aberration, and to help deliver \"outstanding\" corner-to-corner sharpness. Meanwhile, nine aperture blades on the inside help the diaphragm to stay circular for natural bokeh.",
    "A linear motor handles autofocus and Sony clams this is quiet enough for use during video recording. The minimum focusing distance of 22cm, meanwhile, is competitive against its closest rivals, so the lens should work well for close-ups as well as for everyday compositions.",
    "We don't expect a lens of this kind to be too much of a burden to carry around, and its size and weight compare very favorably to those of its peers.",
    "Its weight of 280g and 65.6 x 73.0mm dimensions make it a fair bit more portable than the Nikon Z 35mm f/1.8, for example, and just a little more convenient than the Canon RF 35mm f/1.8 IS Macro STM.",
    "Despite its tiny size, Sony claims the optic has been crafted with a dust- and moisture resistant design, which is just as well as similar promises have been made for its recent bodies.",
    "The lens is very simple in its design, with a deep focusing ring towards the front and an AF/MF switch towards the base. The focusing ring is metal, and has a fine-toothed finish, making it easy and pleasing to grip. Just above this switch lies a focus hold button, whose specific function can be customized to taste.",
    "The lens feels solid enough and its simplicity gives you the impression that little can go wrong here. The mount is also metal, so it should easily withstand wear-and-tear from being mounted and unmounted over years without any issues.",
    "There's little to grumble about with focusing speeds. Thanks to the combination of the focusing motor used here and the fact that the lens's elements are small and light, the lens is able to focus at great speed.",
    "With images, sharpness is already strong at f/1.8, and while it does improve a little once you stop down the aperture (or increase the f-stop), the difference between images captured wide open and those at f/5 or so are really nowhere near as pronounced as expected.",
    "One thing you'll notice at wider apertures, however, particularly when shooting subjects that contrast strongly with their backgrounds, is some longitudinal chromatic aberration around edges of details. This is only moderate but it's noticeable when examining images close up, and tricky to remove.",
    "So, while you don't necessarily need to stop down the lens for significantly better sharpness, you might want to decrease the aperture size a touch where possible to minimize this from forming, as it's either minimized or eliminated depending on how much you close the aperture down.",
    "There's also some slight pincushion distortion when shooting subjects with linear details although this won't be visible in the vast majority of scenes. Lateral chromatic aberration, which tends to form towards the edges of the fame, is also somewhat noticeable, although this can be removed through in-camera corrections – and raw files have a profile built into them that automatically lifts this away.",
    "Vignetting can also be lifted this way, which is just as well as a good helping of it exists in images captured at wider apertures (and even further down the aperture range). It does mean, however, that some bokeh takes on a cat's-eye shape at wider apertures, which becomes more rounded as you stop down. Out-of-focus areas in general, however, are rendered very pleasingly.",
    "By any measure, this is a fine lens. It's not uncommon to find such lenses to be a little soft at their widest apertures, but the FE 35mm f/1.8 delivers excellent sharpness whether you use it wide open or stopped down. This is complemented by very pleasing out-of-focus areas too.",
    "Autofocus is nice and fast, while the linear response when using manual focus will please both stills photographers and videographers alike. The fact that the lens barely weighs anything nor takes up much space makes it even more of a pleasure to use.",
    "What don't we like? Well, while not extortionately priced, it's not exactly cheap either. Perhaps more importantly, those capturing images at wide apertures – particularly in strong light – will have some longitudinal chromatic aberration to contend with, which is a bugbear of such optics and not easy to fix in post processing. That's not the only optical issue you may encounter, but it's the most problematic.",
    "Nevertheless, if you're a Sony user that's been patiently waiting for such a lens to arrive, you'll probably be very pleased with what it offers. If you're willing to stretch to it, you'll no doubt find it to be a fine partner to modern Alpha bodies – even those with more testing sensors."
  ],
  "headers": {
    "4": "Features",
    "7": "Build and handling",
    "12": "Performance",
    "18": "Verdict"
  },
  "links": {
    "A7 III": "https://www.techradar.com/reviews/sony-alpha-a7-iii-review",
    "A7R IV": "https://www.techradar.com/news/sony-a7r-iv-now-official-worlds-first-mirrorless-camera-with-a-61mp-full-frame-sensor",
    "A6600 and A6100": "https://www.techradar.com/news/sony-adds-to-its-mirrorless-lineup-with-the-a6600-a6100-and-new-lenses",
    "Canon RF 35mm f/1.8 IS Macro STM": "https://www.techradar.com/reviews/canon-rf-35mm-f18-is-macro-stm-review"
  }
}