{
  "source": "https://www.techradar.com/reviews/huawei-p30-review",
  "title": "Huawei P30 review",
  "category": "phones",
  "updated": "2019-07-04T13:30:40Z",
  "author": "tom-bedford",
  "summary": "Huawei's latest photography powerhouse",
  "verdict": "The Huawei P30 has one of the best cameras we've seen in a phone, with features like incredible optical zoom and night mode that other handsets could only dream of, but other than that it feels more like a decent mid-range handset than a flagship.",
  "pros": [
    "Fantastic camera",
    "Vibrant design",
    "Powerful processor"
  ],
  "cons": [
    "No wireless charging",
    "Huawei's UI not to everyone's taste",
    "Not as good as the P30 Pro"
  ],
  "article": [
    "Update: The Huawei P30 sees some serious camera competition from the OnePlus 7 Pro, so to decide which is the best for taking pictures once and for all, we took them both out for a camera comparison.",
    "We took ultra-wide, night sight, zoom, and many more kinds of pictures (including pigeon pics), to work out the strengths and weakness of each device. But which is better? Is one actually better, or are they both rather similar? Read our OnePlus 7 Pro vs Huawei P30 analysis here.",
    "Huawei’s P series of phones have become known for being fantastic devices for photography – that’s what the P stands for, after all – and with the Huawei P30 the company has clearly set out to create another handset that towers above the competition when it comes to its camera setup.",
    "Released on March 26 at a launch event in Paris alongside the Huawei P30 Pro, and a whole collection of other gadgets, Huawei wants the phone to ‘revolutionize’ the way people take pictures with their handset – but can the P30 deliver on this lofty promise?",
    "And even if the P30 had the best photographic capabilities in the world, there’s a lot more to a phone than its camera – so does it deliver in terms of the other key features we expect from a flagship device, and overall performance?",
    "There is a caveat to buying the P30 though. After Google suspended Huawei's future access to Android Play Store and security updates, there are serious question marks over the future of Huawei and Honor phones.",
    "While Google and Huawei have promised to support phones currently on the market, it's not clear how long they'll receive Android updates or access to the Google Play Store, which would severely curtail their usefulness compared to the competition.",
    "Huawei made the P30, as well as the P30 Pro, available immediately in Europe after launch on March 26 2019 – but it’s not available everywhere (see below for a note on US availability), and you’ll have to wait until April 16 to pick it up in Australia.",
    "Huawei smartphones are currently not available through US carriers or major retailers, though it's still possible to buy them. This usually means a higher cost or relying on an unverified online retailers, and software may not be optimized for US networks. Huawei is working to obtain clearance to market its phones in the US, so we could see this handset officially launched there in the future.",
    "The Huawei P30 will set you back £699 / AU$1,099 (roughly $910), which in the UK in particular is quite a hike over the Huawei P20’s launch price of £599 / AU$999 (roughly $780) but a good deal less than the Huawei P30 Pro’s entry-level 128GB variant, which costs £899 (roughly $1,170 or AU$1,660, although this version of the P30 Pro isn’t coming to Australia).",
    "There’s only one model of the Huawei P30 coming out, with 6GB RAM and 128GB internal storage, but there are enough color variations to give you a degree of choice at the checkout.",
    "If you’re looking at the Huawei P30 it’s probably because you want a phone for photography, and its triple-camera loadout is enough to rival the best of Samsung and Apple.",
    "The main camera is a 40MP wide-angle beast – Huawei calls it a Super Spectrum shooter, and it ‘sees’ RYYB (red, yellow, yellow, blue) light instead of the typical RGB (red, green, blue), enabling it to capture a wider range of colors for richly detailed images and, Huawei claims, making it particularly great in low-light conditions.",
    "In addition the phone packs a 16MP ultra-wide camera and an 8MP telephoto camera, the latter of which lends itself to snappier autofocus as well as 30x optical zoom, enabling you to get up close and personal even to distant subjects.",
    "All that sounds great on paper, and with the addition of a 32MP front-facing snapper for unnecessarily high-quality selfies, it seems like the Huawei P30 has the best camera setup on the market (other than the P30 Pro, which offers a 50x zoom and an additional ‘time-of-flight’ depth-sensing camera for better bokeh shots) – you’ll need to head to the Camera section of this review to check out how well it fared in practice.",
    "In terms of size, the Huawei P30 is the very definition of a mid-sized phone – at 149.1 x 71.4 x 7.6mm, and with a weight of 165g, it’s almost exactly the same size as the Samsung Galaxy S10, although the P30 is a little heavier.",
    "The back and front of the phone are covered in Corning Gorilla Glass, which together with the rounded edges and sleek design give the P30 a premium feel; however, the top and bottom of the handset are flat where the sides are rounded, and together with the fairly prominent camera bump on the rear it arguably makes for a slightly sub-premium look – although we’ve seen phones like the Xiaomi Mi 9 on which this array was even more ‘bumpy’.",
    "The bottom of the device houses the USB-C and 3.5mm headphone ports, and on the right side is the volume rocker and power button.",
    "This presence of the headphone jack is a little surprising given the Huawei P20 didn’t have one, and personally we’re glad to see it return – although the P30 did launch alongside the Huawei FreeLace wireless headphones, which connect to the device through the USB-C port for charging and setup, so the company was under no particular obligation to bring back the jack.",
    "The Huawei P30 stands out from other phones for its colorful body, as it comes in a range of gradient designs: Amber Sunrise (basically orange), Breathing Crystal (pale blue), Aurora (a more vivid blue), as well as standard black and white models.",
    "We used the Aurora model for our review, and people often pointed out how good it looked – it definitely appears distinct from other phones.",
    "The 6.1-inch OLED display takes up an impressive amount of the phone’s frontage, broken only by a ‘teardrop’ notch at the top housing the front-facing camera. The screen has a 2340 x 1080 resolution and supports Full HD+, allowing for a greater brightness range and more vivid colors.",
    "This display’s max brightness is noticeably brighter than the screens on other handsets we compared it to, but colors did seem a tiny bit paler – we only noticed this in side-by-side comparisons though, so the difference isn’t significant."
  ],
  "headers": {
    "7": "Price and availability",
    "11": "Best camera phone ever?",
    "15": "Design and display"
  },
  "links": {
    "OnePlus 7 Pro vs Huawei P30 analysis here": "https://www.techradar.com/news/oneplus-7-pro-vs-huawei-p30-the-ultimate-camera-test",
    "Huawei P30 Pro": "https://www.techradar.com/reviews/huawei-p30-pro",
    "Google suspended Huawei's future access to Android Play Store": "https://www.techradar.com/news/huawei-ban",
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Xiaomi Mi 9": "https://www.techradar.com/reviews/xiaomi-mi-9",
    "Huawei P20": "https://www.techradar.com/reviews/huawei-p20-review",
    "Huawei FreeLace": "https://www.techradar.com/reviews/huawei-freelace"
  }
}