{
  "source": "https://www.techradar.com/reviews/asus-rog-strix-xg35vq",
  "title": "Asus ROG Strix XG35VQ review",
  "category": "computing",
  "updated": "2019-03-01T11:13:20Z",
  "author": "jeremy-laird",
  "summary": "A great gaming panel, but at a pretty serious price",
  "verdict": "A great wide-aspect 35-inch gaming panel with 100Hz refresh and slick styling, but at a pretty serious price.",
  "pros": [
    "Punchy VA panel",
    "Decent feature set",
    "Good gaming performance"
  ],
  "cons": [
    "Very expensive",
    "Only 100Hz",
    "VA panel has a few niggles"
  ],
  "article": [
    "In the madness that is the current PC monitor market, it’s hard to know what matters. There are so many options, so many technologies and features to choose from.",
    "That’s especially true when it comes to gaming panels. Do you need 144Hz refresh, maybe even 240Hz? Is adaptive sync essential and if so is it G-Sync or FreeSync you should be aiming for? Is HDR a must-have feature? And what about size, aspect ratio, resolution and curvature? There’s a heck of a lot to take into account, that’s for sure.",
    "In that context, Asus’s ROG Strix XG35VQ has its work cut out. It isn’t the biggest and boldest gaming monitor you can get, measuring 35 inches across. It’s not the highest resolution gaming panel you can buy at 3,440 by 1,440 pixels, nor the highest refresh at 100Hz. It’s not HDR certified. Asus’s own ROG Swift PG27UQ and Acer’s Predator X27, for instance, combine 4K with 144Hz and HDR,.",
    "Instead, Asus would likely argue, it concentrates on the things that really matter for gaming and puts them in a high quality package. Think of it as the modern gaming monitor distilled down to its most important essentials and you’ll have a decent idea of what the Asus ROG Strix XG35VQ offers as a proposition. The problem is that it does that at a hefty price. But does it actually deliver?",
    "Despite being available for some time, the ROG Strix XG35VQ is still rocking a beefy $760 (£730, AU$1,059) price tag. That’s expensive compared to other 34 and 35-inch wide-aspect monitors aimed at gamers, such as the LG 34UC79G.",
    "Aesthetically the XG35VQ is very much a chip off the Asus ROG block. That means it’s slick and nicely screwed together, but just a teensy bit adolescent from a styling perspective.",
    "Features like the LED-powered Light Signature which projects an Asus logo onto your desktop surface just below the monitor’s stand, for instance, do little for the gaming experience, but inevitably contribute to the frankly rather high price. Ditto the ‘Aura’ mood lighting on the read of the screen enclosure.",
    "That said, the upside is a very solid feel and a sense of money well spent. That broadly applies to the technology on offer, too. In this instance, Asus has opted for a VA LCD panel, which bodes well for elements of the image quality like contrast and color saturation, if less so for viewing angles and response.",
    "The fact that Asus only claims 4ms for the XG35VQ’s grey-to-grey response times is likely a function of that VA panel. Asus does claim 1ms capability through its Extreme Low Motion Blur technology, but that requires relatively extreme measures that compensate for the relative slowness of the panel itself.",
    "It’s likewise perhaps not a huge surprise to find the refresh rate capped at 100Hz given the VA panel tech. That’s a worthwhile increase on the 60Hz norm for non-gaming panels.",
    "However, it looks a little undercooked in this age of 144Hz and even 240Hz gaming monitors. That said, you do get adaptive refresh in the form of AMD’s FreeSync technology.",
    "What’s more, thanks to Nvidia’s recent move to unlock its video cards for FreeSync, you can buy the XG35VQ safe in the knowledge that its adaptive refresh functionality will work with whatever graphics board you own, be that Nvidia or AMD. The same could not be said had Asus specified the XG35VQ with Nvidia-only G-Sync tech.",
    "Elsewhere, the 35-inch 21:9 aspect panel is surrounded on three sides by nice slim bezels, rocks an 1800r curvature and sports a 3,440 by 1,440 native res. That resolution is a good compromise between detail and performance.",
    "4K is great in theory. But it puts a massive load on your graphics subsystem. Giving up a few pixels allows you to game smoothly without the need for a $1,000/£1,000-plus video card.",
    "As for what you don’t get, that conspicuously includes HDR certification and USB Type-C connectivity. This arguably isn’t the best option for hooking up to the latest gaming laptops.",
    "While not an HDR certified monitor, the immediate visual impact of the Asus ROG Strix XG35VQ is at least on a par with the lower end of the HDR spectrum, for instance panels with DisplayHDR 400 certification.",
    "The 35-inch VA panel helps with that thanks to strong inherent contrast and punchy, saturated colors.",
    "In pure accuracy terms, of course, we’ve seen better than the XG35VQ. At default factory calibration, there’s some evidence of compression in both black and white scales. The viewing angles won’t scare the best IPS rather than VA-based monitors, either.",
    "Those niggles have relatively little impact in the real world, however, be that gaming or working in Windows. Indeed, in subjective terms the XG35VQ’s 100Hz refresh gives you most of that characteristically slick and smooth experience that’s commonly associated with 144Hz and faster panels. Yes, it is possible to tell the difference, subjectively speaking, between 100Hz and 144Hz, but it’s a relatively subtle distinction.",
    "As for response, Asus has coded five levels of pixel overdrive into the XG35VQ’s neat and accessible OSD menu. Ramp the overdrive right up and a little ugly inverse ghosting is visible. Set it around half way and the result is a quick and responsive panel, especially given the VA underpinnings.",
    "For the record, the XG35VQ’s FreeSync functionality worked straight out of the box with our Nvidia GeForce GTX 1080-powered test rig, which is great to see and is much more appealing that the previous state of affairs where adaptive refresh was locked to one or other GPU vendor.",
    "Work all that together with the 1800r curvature and 35-inch proportions and you have a pretty hot gaming panel. It’s fast, it’s smooth and it looks punchy.",
    "Asus has, of course, bequeathed the XG35VQ with oodles of image presets, few of which most users will sample. That said, the sRGB preset could come in handy for anyone planning on dual-purposing this monitor and not only playing games but also doing something resembling serious content creation.",
    "With that in mind, the 3,440 by 1,440 resolution is a reasonable compromise. It means a middle-to-upper tier graphics card, like an Nvidia Geforce GTX 1070 or an RTX 2060 will be able to make the most of that 100Hz refresh while also allowing for a reasonable amount of desktop working space.",
    "As a pure gaming panel, the Asus ROG Strix XG35VQ has a lot going for it but one major problem working against it. The latter is price. It damn expensive, even taking into account the experience on offer.",
    "By way of example, the LG 34UC79G has the same resolution, a 144Hz IPS panel, albeit one inch smaller and costs as much as $200 less. It look sand feel like a more expensive product. But it probably isn’t actually better for gaming and in some regards it’s short on spec.",
    "With all that in mind, the ROG Strix XG35VQ is a great gaming monitor with a fairly serious pricing problem.",
    "Images credit: TechRadar"
  ],
  "headers": {
    "4": "Price and availability",
    "5": "Design",
    "15": "Performance",
    "24": "Verdict"
  },
  "links": {
    "ROG Swift PG27UQ": "https://www.techradar.com/reviews/asus-rog-swift-pg27uq",
    "Predator X27": "https://www.techradar.com/reviews/acer-predator-x27-review",
    "LG 34UC79G": "https://www.techradar.com/reviews/lg-34uc97g-b",
    "Nvidia Geforce GTX 1070": "https://www.techradar.com/reviews/pc-mac/pc-components/graphics-cards/msi-geforce-gtx-1070-gaming-x-1323106/review",
    "RTX 2060": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060"
  }
}