{
  "source": "https://www.techradar.com/reviews/oppo-reno-10x-zoom-review",
  "title": "Oppo Reno 10x Zoom review",
  "category": "phones",
  "updated": "2019-10-16T18:44:56Z",
  "author": "tom-bedford",
  "summary": "Inventive design and smooth performance",
  "verdict": "The Oppo Reno 10x Zoom feels stylish in a way few phones do, from its smooth rear design to the asymmetrical and unapologetic pop-up camera. It may feel a little slow to use at times, thanks to the slow-to-respond user interface, but in general it’s a processing powerhouse that’ll do all you ask of it and more.",
  "pros": [
    "Sleek design",
    "Novel 'pop-up' camera",
    "Fast processor"
  ],
  "cons": [
    "Not actually 10x optical zoom",
    "UI feels a little slow to use",
    "A little heavy"
  ],
  "article": [
    "Oppo is one the newer Chinese smartphone brands – in the West, at least – and the Oppo Reno line, comprising the Oppo Reno itself and this handset, the Oppo Reno 10x Zoom, represents its first concerted effort to break into Western markets – and with the Reno 10x Zoom it does so with style.",
    "The Oppo Reno 10x Zoom is a decidedly high-mid-range handset, with an attractive pop-up selfie camera, cutting-edge chipset, and competitive camera lineup. If you want most of the features at a lower cost, the just-released Oppo Reno 2 is a good pick (and it even boasts one more lens in its rear camera) - but if you want the best, the Reno 10x Zoom is the one to choose.",
    "However, the phone might have a bit of trouble gaining traction thanks to its bizarre name. For a start the Reno name for a sub-brand is a bit baffling – it has nothing to do with the infamous gambling town in Nevada, USA, and at the launch event even Oppo seemed unsure of why the phones had such a name.",
    "On top of that, 10x Zoom isn’t exactly a catchy title for what is essentially a 'Pro' or 'Plus' model - nomenclature that is pretty standard for the industry.",
    "But beyond the premium specs, and the tongue-twisting title, the Oppo Reno 10x Zoom is a serious competitor to the established brands.",
    "You can currently pick up the Oppo Reno 10x Zoom in the UK, Australia, Europe, Middle East, and various Asian countries – Oppo told TechRadar it currently has no plans to bring the phone to the US however, so if you’re in the States and want this phone you’ll have to find a way to import it.",
    "The Oppo Reno 10x Zoom will set you back £699 / AU$1,199 / AED 3,299 (about $889), so it’s about the same price as the Huawei P30 Pro and the OnePlus 7 Pro, straddling the border between mid-range and high-end pricing.",
    "In comparison, you can buy the standard Oppo Reno for £449 (about $570, AED 1,899, AU$825– it seems that only the 10x Zoom is available in Australia at the moment).",
    "That’s quite a price difference, which Oppo feels is justified by the 10x Zoom’s larger display, better processor and extra camera, as well as a few other minor differences.",
    "The Oppo Reno 10x Zoom is quite a big phone – it’s not being marketed as the ‘plus-sized’ version of the standard Oppo Reno, but it could well be.",
    "Its body is 162 x 77.2 x 9.3mm, so it’s certainly a big device, especially in terms of its thickness as it ranks among the thickest handsets around. With this big body comes a big screen – we’ll get into that in the next section.",
    "The phone weighs in at 215g, so it’s one of the heaviest around too, weighing even more than the iPhone XS Max at 208g. This is something you come to realise while you’re using the handset – it never feels too heavy, but you can notice the difference between it and many of the more nimble phones on the market.",
    "In terms of design, the Oppo Reno 10x Zoom is one of the most streamlined phones we’ve seen, as there’s not even the slightest camera bump on the back – in fact, the only thing stopping the rear of the device being a completely smooth surface is what Oppo calls the O-Dot, a small round button that stops the phone lying flat on a surface, in order to protect the camera lenses.",
    "This almost-flat surface gives the phone a sleek and elegant feel – too elegant, perhaps, as lots of the time we tried to unlock the phone by holding our finger on the turned-off screen, only to discover the handset was actually upside down, and we had no camera bump or discerning features like a notch with which to orient ourselves.",
    "Speaking of a notch - or rather the absence of one in this case - we move onto one of the key selling points of the phone: the ‘shark-fin’ pop-up, which houses the front-facing camera as well as an LED flash for both the front and back of the phone.",
    "It’s a good-looking solution to the conundrum of where to house the front-facing camera on a phone, and it looks a lot more stylish than the rectangular pop-up seen on phones like the OnePlus 7 Pro.",
    "It’s a little slower to pop up or down than its competitors, but it’s also a lot sturdier, as you can press it down manually without the phone overreacting and bombarding you with warnings, as we found with the OnePlus phone.",
    "On the edges of the phone you’ve got the volume rocker on the left, the power button on the right, and a USB-C port on the bottom, along with the downwards-facing speakers – since most smartphones have the power and volume buttons on the same side, it can be annoying reaching for the displaced rocker, and it often necessitates two hands.",
    "There’s also no 3.5mm headphone jack, a feature the base-model Oppo Reno does have – that’s just a sign of the price range, as many other mid-range smartphones are dropping this feature too, even though the device is aimed at kids who’ll want to be listening to music non-stop.",
    "You can pick up the Oppo Reno 10x Zoom in Ocean Green (bluey-green), Mist Pink (whiteish pink) or Jet Black (you can guess what color this is). We picked up the former.",
    "The Oppo Reno 10x Zoom’s screen is a 6.6-inch beast – you won’t find many displays that big on handsets in the 10x Zoom’s price range.",
    "Despite that large size, and the fact that the pop-up camera means there’s no notch, the display only takes up 93.1% of the device’s face – that’s because there’s a thin top bezel, and slightly thicker bottom chin, which are perhaps the two main giveaways that this isn’t a premium device.",
    "The screen itself is an AMOLED display, so you’re getting high-end tech here, and that’s matched in the 1080 x 2340 resolution, resulting in a pixel density of 387 pixels per inch – pretty high, for a smartphone.",
    "As a result, the screen offers great quality when you’re viewing media, photos, or apps, with a high max brightness and colors that are generally bold, although perhaps not as much as on some other phones with similar screen tech, such as the Samsung Galaxy S10.",
    "All in all the screen quality is impressive for a handset at this price range, and you’d be hard-pressed to find a device with such high-end screen tech outside of the 'premium' tiers of handset."
  ],
  "headers": {
    "5": "Price and availability",
    "9": "Design",
    "20": "Display"
  },
  "links": {
    "Oppo Reno": "https://www.techradar.com/reviews/oppo-reno-review",
    "Oppo Reno 2": "https://www.techradar.com/reviews/oppo-reno-2",
    "Huawei P30 Pro": "https://www.techradar.com/reviews/huawei-p30-pro",
    "OnePlus 7 Pro": "https://www.techradar.com/reviews/oneplus-7-pro",
    "iPhone XS Max": "https://www.gsmarena.com/apple_iphone_xs_max-9319.php",
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10"
  }
}