{
  "source": "https://www.techradar.com/reviews/oneplus-6t-review",
  "title": "OnePlus 6T review",
  "category": "phones",
  "updated": "2019-06-27T20:20:42Z",
  "author": "james-peckham",
  "summary": "Still a serious value pick",
  "verdict": "The OnePlus 6T is the most accomplished phone we’ve ever seen from the company, and a bunch of new features, including an in-screen fingerprint scanner and a larger battery, add up to make this one of the best phones you can buy right now.",
  "pros": [
    "Top-end design",
    "Truly all-day battery life",
    "Powerful rear camera"
  ],
  "cons": [
    "No 3.5mm headphone jack",
    "No wireless charging",
    "Not a QHD display"
  ],
  "article": [
    "Update: The OnePlus 7 has launched alongside the OnePlus 7 Pro, so you might want to consider them alongside OnePlus 6T - though the latter is still the most affordable of the three.",
    "While OnePlus has been releasing two phones per year since the 3T in 2016, the company maintains it will only launch its follow-up 'T' devices when technology has progressed enough to improve a handset before the next full generation.",
    "The OnePlus 6T is the embodiment of that rationale, as it feels like a genuine step up from the OnePlus 6, which launched earlier in 2018.",
    "Don’t get us wrong: we loved the OnePlus 6. It scored 4.5 stars in TechRadar’s review, in which we praised it for clean software, lots of power and a premium glass design. The OnePlus 6T is just consistently better in almost every respect.",
    "There aren’t any eye-catching, must-have new features, but this is more than a stepping stone on the way to the OnePlus 7. And while it doesn't pack the cool new pop-up selfie camera or 90hz display of the OnePlus 7 Pro, the OnePlus 6T is still the reigning king of value - which is noticeably cheaper than its successors.",
    "Having said that, it's no longer new - a number of high-profile phones have launched since, such as the Samsung Galaxy S10, Pixel 3a and Huawei P30, as well as the OnePlus 7 and 7 Pro. So... is the OnePlus 6T still worth buying?",
    "The OnePlus 6T went on sale on November 6, 2018. Its price starts at $549 / £499 for the 6GB of RAM and 128GB of storage in the Mirror Black color. The same storage and color but with 8GB of RAM will cost you $579 / £529.",
    "Midnight Black versions of the phone have 8GB of RAM and cost £529 / $579 or $629 / £579 depending on whether you go for the 128GB or 256GB versions.",
    "In the US, T-Mobile is the exclusive carrier if you don't want to buy the phone outright. In the UK, it's a touch easier to buy the OnePlus 6T as it's available through O2, EE and Vodafone, as well as from Amazon, Carphone Warehouse and John Lewis. Currently the phone isn't available in Australia.",
    "It's worth noting also that there's a newer handset called the OnePlus 6T McLaren Edition, which comes with 10GB of RAM, faster charging and a different color and pattern on the back. This all comes at a premium though, with the McLaren Edition retailing for $699 / £649.",
    "However, if you want any version of the OnePlus 6T you should act fast, as it's starting to sell out and we doubt new stock will arrive once the OnePlus 7 has launched.",
    "OnePlus has embellished its design credentials a good deal in the last couple of iterations of its flagship phone, and the OnePlus 6 felt like the culmination of lots of hard work – a great-looking device that didn’t skimp on some of the essentials, as older phones in the series did.",
    "The OnePlus 6T isn’t much different to that – in fact, there are only a few changes – but those changes are worthwhile, and well implemented.",
    "The body is glass on both the front and back of the device, and you’ve got the choice of two colors: mirror black or midnight black. That’s right: you can have any color you like as long as it’s black, as Henry Ford famously said – although in fairness to OnePlus the reflective choice does look quite different to the matte version.",
    "We would expect OnePlus to introduce further colors along the line too. We may see red and white versions, as with previous generations of OnePlus devices, but so far there’s no news on extra shades.",
    "The phone feels comfortable to hold, and it’s easy enough to grip – with dimensions of 157.5 x 74.8 x 8.2mm it’s not a large device.",
    "The rear of the phone is relatively clear, as the fingerprint scanner has moved – more about that in the display section below – so now you’ve just got the two-sensor camera and a small flash below it. Otherwise the back of the phone is empty, which contributes to that comfortable feel in the hand.",
    "On the right-hand edge of the phone is a power on button, which is one of your options for waking the device – the other is a double tap on the screen - and above that is the signature OnePlus slider that allows you to mute your phone with a quick flick.",
    "This is something you also get on iPhone devices, but not many Android alternatives have it, and it’s something we find particularly useful when we want to quickly mute our device.",
    "On the left-hand edge of the device is the volume rocker, which is easy to reach. On the bottom of the phone is the USB-C port, flanked by a speaker and microphone.",
    "One of the big talking points surrounding this phone concerns something you won’t find on the bottom of the device – OnePlus has dropped the 3.5mm headphone jack, a decision that has upset a lot of OnePlus fans who want a physical way to plug in their headphones.",
    "Instead, OnePlus includes a 3.5mm to USB-C adapter in the box so you can still plug in your wired headphones, while it also encourages you to use Bluetooth headphones as an alternative. We don’t see this as such a big problem these days – after all, several other brands have already axed the jack – but it’s something that’s likely to put off some fans of the brand.",
    "It’s an especially odd decision considering the company has been making much of the fact that it’s included the headphone jack on every device while rival companies have dropped it. If you already own Bluetooth headphones it’s unlikely you’ll find this a problem, but it’s not going to sit well with everyone.",
    "The display is where lots has changed from the OnePlus 6 – that was the first OnePlus phone to lose most of its bezel and adopt a notch at the top of the display.",
    "It’s a similar affair here, but now the notch has been shrunk down to what’s referred to as a teardrop design. It takes up relatively little space, meaning there’s more screen at the top left and right of the device.",
    "The display is a 6.41-inch AMOLED screen, but as the body of the phone isn’t as large relative to the screen size it doesn’t feel like a big-screen phone when it’s in your hand. It’s 19:5:9 aspect ratio, so it’s a longer screen than on some other phones.",
    "On paper it’s an 86% screen to body ratio – that isn’t as high as some of the alternatives on the market, but it’s not something you’re likely to notice in day to day use.",
    "The resolution is 2340 x 1080, with 402 pixels per inch, and the picture quality is gorgeous. The AMOLED technology makes the colors pop, and we’re big fans of the picture quality you can get from a relatively low-resolution device in 2018.",
    "Perhaps the biggest upgrade of all is how you unlock the OnePlus 6T, and that’s by using the fingerprint sensor that’s now embedded in the screen.",
    "This is a new technology that we’re starting to see on more and more smartphones, including the Galaxy S10, Huawei P30 Pro, Oppo Find X, Vivo Nex, Huawei Mate 20 Pro. It means a fingerprint scanner can go on the front of your phone, where it’s easier to hit, without taking up space that could be used for more screen.",
    "It took us a while to get used to unlocking the device by holding our finger on the display, but once we did get used to it we found it to be secure, fast, and a joy to use.",
    "We did have the odd issue where it didn’t immediately register our fingerprint, and we do find the scanner on the Huawei Mate 20 Pro to be a tiny bit faster; however, the vast majority of the time it worked well enough, and we were perfectly happy to use it to unlock the phone.",
    "You can also have Face Unlock enabled at the same time, and when you’re using both technologies the response time is near-instantaneous response, with one of the methods allowing you to unlock your device quickly and easily."
  ],
  "headers": {
    "6": "OnePlus 6T release date and price",
    "11": "Design",
    "23": "Display"
  },
  "links": {
    "OnePlus 7": "https://www.techradar.com/reviews/oneplus-7-review",
    "OnePlus 7 Pro": "https://www.techradar.com/reviews/oneplus-7-pro",
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Pixel 3a": "https://www.techradar.com/reviews/google-pixel-3a-review",
    "Huawei P30": "https://www.techradar.com/reviews/huawei-p30-review",
    "OnePlus 6T McLaren Edition": "https://www.techradar.com/reviews/oneplus-6t-mclaren-edition-hands-on",
    "it's starting to sell out": "https://www.techradar.com/reviews/oneplus-7-review",
    "Huawei P30 Pro": "https://www.techradar.com/reviews/huawei-p30-pro",
    "Huawei Mate 20 Pro": "https://www.techradar.com/reviews/huawei-mate-20-pro-review"
  }
}