{
  "source": "https://www.techradar.com/reviews/steelseries-rival-710",
  "title": "SteelSeries Rival 710 review",
  "category": "computing",
  "updated": "2019-03-27T17:25:57Z",
  "author": "bill-thomas",
  "summary": "Rise up",
  "verdict": "While the SteelSeries Rival 710 is expensive, the sheer amount of features – not to mention the awesome performance – make the high price completely justified. There are some gimmicks here, but nothing that takes away from the experience.",
  "pros": [
    "Fantastic TrueMove 3 sensor",
    "Modular",
    "Feels great in hand"
  ],
  "cons": [
    "Expensive",
    "Gimmicky OLED display and haptic feedback"
  ],
  "article": [
    "When it comes to the best gaming mice, we would ordinarily try to find one that manages to reach a golden balance between price and performance. However, with the SteelSeries Rival 710, a marriage of high-end performance and customizability make it worth your attention, even if it’s more expensive than most high-end gaming mice in 2019.",
    "At $99 (£99, AU$140), the SteelSeries Rival 710 is a very expensive gaming mouse, and will automatically put it out of the reach of most users, making it a niche product – especially compared with its predecessor, the Rival 600 at $79 (£79, AU$139). However, its list of features make the high price feel justified.",
    "SteelSeries makes a point of marketing the OLED display and haptic feedback within the mouse, but those gimmicky features play second fiddle to the sheer amount of modular support on display.",
    "Right out of the gate, the SteelSeries Rival 710 is a large mouse. Now, typically we prefer larger mice, because they’re simply more comfortable. But, because of the OLED display, haptic engine and all the swappable components, SteelSeries was kind of stuck with making a larger mouse.",
    "However, to balance it out, it’s actually extremely comfortable in hand. Rather than the hard plastic of many other mice, the SteelSeries Rival 710 has a soft touch material covering almost the entire unit. This makes it one of the most comfortable mice we’ve used in a long time, especially for those long gaming sessions.",
    "There aren’t many buttons here, though. Just eight – with three programmable buttons on the side and a CPI switch behind the mouse wheel.",
    "You shouldn’t have to worry about the mouse getting worn out, either – not only are the mechanical split-trigger switches rated for 60 million clicks, but almost every piece of the mouse is swappable.",
    "The cable, the back plate, the rear logo and even the sensor can be removed and replaced by the user. Not only does this mean that you can fully customize this mouse, but it also means if more powerful sensors get released in the future, you can upgrade the Rival 710. Plus, with replaceable cables, cable wear shouldn’t be an issue.",
    "Out of the box, you’ll get two different cables, a 1 meter non-braided cable and a 2 meter non-braided cable – the latter of which we prefer.",
    "Then there are the more ‘unique’ features of the SteelSeries Rival 710. On the left hand side of the mouse, next to the three side buttons, is an OLED display. It’s not very large, but you can customize the image that appears, and you can even have it display a GIF. There’s no color support, but the customization options are endless.",
    "There’s also a haptic engine in the back of the mouse. You can program it to go off on a timer or after a certain button press. This is especially useful in games like League of Legends or DOTA 2, where you have one ability that you need to keep track of. It’s not going to be compatible with normal rumble functionality, like with an Xbox One controller, but maybe that’s something that can be implemented through software in the future.",
    "After messing around with these features, we really don’t see wide utility in them. They’re cool, and the vibration is potentially useful if you play cooldown-based esports. But, since we spent most of our time playing Metro 2033 and Resident Evil 2, we didn’t have much of a use for it.",
    "Both of these fancy features, along with the two-zone RGB lighting, are controlled through the SteelSeries Engine software. Through this app, you can control every aspect of your mouse, from lighting to button assignments – you can even adjust advanced settings, like angle snapping and polling rate. Software this powerful can be intimidating if it’s not done well, but we’re happy to report that it works flawlessly.",
    "The SteelSeries Rival 710 is an expensive mouse, sure, but it’s so full of features that the high price is justified for the right kind of user. This isn’t a mouse for anyone looking for prodigious value, but rather for the kind of person that likes having everything attached to their gaming rig be of comparable (and high) quality.",
    "That quality bleeds over into the actual performance of the mouse, too – as you may expect from a mouse you’re dropping 100 bucks on. The sensor is limited to 12,000 counts per inch (CPI), which is lower than the 16,000 we’ve seen in many other high-end mice.",
    "However, SteelSeries included the TrueMove 3 sensor, found in our favorite gaming mouse, the SteelSeries Rival 600. This is an incredibly accurate sensor, allowing for 1:1 tracking regardless of what you have the CPI set to.",
    "In our time with the SteelSeries Rival 710, we’ve found that performance is spot on. This mouse is buttery smooth no matter what game we’re trying to play. Even on high-resolution displays – our gaming PC is attached to both a 3,440 x 1,440 and a 4K monitor – this mouse was frustration free.",
    "There were no discernable micro-movements, either, which was especially useful when trying to play through Resident Evil 2 – we’re sure our hands were shaking a bit.",
    "It would have been nice to have the same secondary sensor that the Rival 600 has to reduce mouse movement when it’s off the mousepad. However, we’re nitpicking here.",
    "The SteelSeries Rival 710 is flat-out one of the best gaming mice on the market right now. The price might make you flinch – $99 (£99, AU$149) is a lot to ask for a mouse – but you’re generally getting what you’re paying for here.",
    "The OLED display and haptic feedback are a bit of a gimmick, but they’re not doing anything to actively detract from the experience. Even if they did, the modular nature of the mouse more than makes up for it.",
    "There are mice that are more price-efficient out there. But, if you’re looking for the best of the best, you really can’t go wrong with the SteelSeries Rival 710.",
    "Images Credit: TechRadar"
  ],
  "headers": {
    "3": "Design",
    "14": "Performance",
    "19": "Final verdict"
  },
  "links": {
    "best gaming mice": "https://www.techradar.com/news/best-gaming-mouse",
    "Rival 600": "https://www.techradar.com/reviews/steelseries-rival-600"
  }
}