{
  "source": "https://www.techradar.com/reviews/offcloud",
  "title": "Offcloud review",
  "category": "computing",
  "updated": "2019-03-20T09:00:35Z",
  "author": "mark-pickavance",
  "summary": "The middleman in a torrent sandwich",
  "verdict": "An effective way to manage heavy torrent traffic that allows bandwidth to be better exploited for maximum performance, with a bonus of user anonymity.",
  "pros": [
    "Easy to use",
    "No storage limits",
    "User anonymity"
  ],
  "cons": [
    "Lacks anti-virus"
  ],
  "article": [
    "A very large number of people use torrent technology to disperse and download very large files across the internet. While copyright infringement might represent a large part of its traffic, torrent technology also has many valid uses and users.",
    "What generally irks them is that they’re often limited not by their local internet speed, but the speed of the connection that those with the file they want.",
    "If only you could relocate those files to a manageable cloud location, and then download them at the best possible speed from there?",
    "Well, you can now, with Offcloud.",
    "The cost of this service is $9.99 per month or $69.99 per year if you pay annually upfront.",
    "There are no tiers or other complications, and you get an identical service and features irrespective of how you pay.",
    "You can also sign up for free, with the limitation being that you can only have three links active and you can only download 10GB of files from the service.",
    "Let’s be clear from the outset; we’re not here to judge what people use torrent for, the sites they access using it. It’s a technology like many others that can be used responsibly or not, and the choice is an individual one as to their ethical position.",
    "If you do use torrents, ethnically or otherwise, a tool like Offcloud could be incredibly useful.",
    "At its core, this is a cloud-based content management system, where you can point the service at a file you’d like, from a wide range of compliant locations, and it will move it to Offcloud storage, where you can download it at your leisure.",
    "The service is free to sign into, allowing users to understand better if this could be useful to them before parting with hard cash.",
    "Before you even sign up, you might want to visit this list here, detailing all the sites and services that work with Offcloud.",
    "Those that work with the service include the video sites Vimeo and YouTube, and cloud storage portals such as Box, Dropbox, Filecloud.io and dozens of others. And, for those of a delicate sensibility who don’t like them being mentioned by name, many the most popular porn hubs are also on this list.",
    "At the time of writing, there are 9 video and 177 Cloud storage sites available, and new ones are being added all the time.",
    "The interface for connecting content to the Offcloud service is web-based, and very clean design allows you to quickly add the links of files you need and manages those you’ve snagged.",
    "Files can either be directly downloaded with ‘Instant’ mode, using Offcloud as a staging area for the data stream. Or, the system can pull a file on to storage using ‘cloud’ mode where you can get it at a more convenient time for the computer to be downloading.",
    "And, the third option provides access to existing cloud storage accounts or even a remote FTP server called ‘Remote’.",
    "Remote could be especially useful for those that need to send a large file out saved on an internal NAS box to a remote location without providing direct access.",
    "To make torrent interaction a more seamless experience while browsing, Offcloud extensions exist for Google Chrome, Microsoft Edge, Firefox, Opera and Safari.",
    "These enable torrent files and magnet links to be directed to Offcloud for it to pull down.",
    "As there are no limits to the files that can temporarily run through Offcloud, the only restrictions are that some torrent sites have capacity caps. Others have daily quotas, but lots of them aren’t restricted in any way.",
    "What restrictions apply are listed on the previously linked page, if you’re unsure what the service limits are of the sites you want are.",
    "Our only reservation about Offcloud are the security aspects, or rather the lack of much protection from the contents you might download.",
    "As a user of this service will generally be downloading, not uploading, the security issues are somewhat different than that for a cloud storage solution.",
    "It appears that files aren’t encrypted on their journey across the Internet, which is both good and bad. It’s good, because Offcloud doesn’t need to process the file making it quicker, but it’s also no great because any technology scanning the packets should be able to determine what you’re downloading.",
    "Offcloud also doesn’t provide any anti-virus oversight, so they can’t warn you if a file you’ve just downloaded contains anything potentially dangerous to your system.",
    "Again, we assume they avoided doing this to keep the system fast.",
    "If you go looking for files on torrent sites downloading malware is a risk you are invariably taking, but it would be good if Offcloud at least warned you that the zips or Arc files you’re downloading contains executable code.",
    "However, it does have one very strong security aspect, in that it keeps the user anonymous from the torrent process.",
    "For those that want to use these services, but don’t want their ISP or other organisations keeping track of their activities, this might be the most important feature of Offcloud.",
    "Logically, putting another service between the client computer and a host torrent should make it slower to download, but the Internet works in both strange and mysterious ways.",
    "Some of the logic in this is that a file downloaded via torrent is often coming from numerous sources, including the original host but also those that have part of the file already.",
    "With the backbone link that Offcloud has, it’s able to get the most performance out of all those sources, before it funnels the result back to you via whatever broadband bandwidth is at your disposal.",
    "Exactly how much that translates into quicker downloads is dependent on too many things for precise quantification. But, in our tests using Offcloud, even in ‘Instant’ mode, was markedly quicker than a direct connection.",
    "The extra performance could be a critical advantage if you only have limited time to get a large file, and it isn’t possible to leave the computer permanently running.",
    "If performance is in the plus column, support is probably in the negatives list.",
    "Not that there isn’t any support, it’s just that it is a simple ticketing system where they come back to you in the fullness of time.",
    "A live chat would be nice but based on the relatively low cost of this service that they don’t include this facility isn’t a huge surprise. And, we suspect that most issues the support team fields are to do with problems at the torrent site end, and not on the Offcloud layer.",
    "Because of that, before you generate a ticket, it might be worth checking if the site you are using has issues or is experiencing downtime.",
    "Offcloud is a service for those people who want to keep torrents a step away from a direct connection for whatever reason.",
    "Speed might be one objective, management another, and legality a potential third.",
    "Whatever the need, Offcloud is the best tool we’ve seen to manage torrent traffic. It combines an approachable interface, understandable modes, and excellent performance.",
    "We’d prefer that the security side was user configurable for encryption and maybe virus scanning, but customers need to be aware of those pitfalls before they start using torrents period.",
    "Legalities of torrent use aside, for those that use them extensively, Offcloud is a cost-effective way to maximise their performance while maintaining their anonymity."
  ],
  "headers": {
    "4": "Pricing",
    "7": "Features",
    "23": "Security",
    "30": "Performance and support",
    "39": "Final verdict"
  },
  "links": {
    "torrent technology": "https://www.techradar.com/best/torrent-client",
    "Offcloud": "https://offcloud.com/",
    "cost of this service": "https://offcloud.com/",
    "here": "https://offcloud.com/list"
  }
}