{
  "source": "https://www.techradar.com/reviews/asus-pb60-business-mini-pc",
  "title": "Asus PB60 business mini PC review",
  "category": "computing",
  "updated": "2019-02-04T19:30:25Z",
  "author": "desire-athow",
  "summary": "Boasts a powerful processor and plenty of connectivity options",
  "verdict": "The Asus PB60 is a superb example of how powerful and versatile mini PCs can be. There are some niggles and odd choices here, but overall, this machine has to be on the shortlist of any business looking for a compact PC.",
  "pros": [
    "Compact size and modular design",
    "Excellent value for money",
    "Great connectivity options",
    "Support for three 4K monitors"
  ],
  "cons": [
    "No vPro support",
    "Bloatware"
  ],
  "article": [
    "Many have predicted the demise of the traditional personal computer, and while there has been a marked decrease in sales over the past decade, there are still use cases where Windows PCs pip laptops and Android devices. These are to be found mostly in business and gaming verticals, or in other words, the domains of power users.",
    "Businesses want mini PCs because they are versatile, powerful and offer connection options unmatched by laptops in the same price range. Check out the Asus PB60 for a good example which sports a CPU with six cores and up to 32GB of system memory.",
    "The Asus PB60 surprises with its size, having a metal chassis that measures only 175 x 175 x 34mm – that’s a metric volume of just over 1 liter. This PC sits in a growing category of ultra-powerful devices that have merged the best bits of portable hardware with desktop components. The power supply, for example, is similar to what you’d find on laptops (a 19V, 4.74A model) and so are the SODIMM memory modules. But the PB60 boasts connectivity worthy of a PC from the desktop world.",
    "On the front you have a USB 3.1 Gen 1 Type-C port, two USB 3.1 Gen 2 Type-A ports, and two USB 3.1 Gen 1 Type-A ports, one of which supports Battery Charging 1.2 technology up to 7.5W (5V). You also get two separate audio jacks (one for a headset, one for a microphone).",
    "Around the back you’ll find a wireless antenna jack, a punch-out port, a power input, two USB 2.0 ports, a DisplayPort, USB 3.1 Gen 2 connector, HDMI port, a Kensington security slot, a GbE LAN port plus a configurable port. The latter is an increasingly popular option that allows you to choose your port from up to four options: VGA, Serial COM connector, DisplayPort or HDMI port.",
    "There are plenty of air vents all over the PC to cool its innards, and Asus provides accessories for mounting your PC either on a stand vertically or behind a monitor via a VESA mount.",
    "An expansion module is also available that allows you to add a DVD optical drive. Asus has confirmed that at least one other expansion module will be released with legacy COM and parallel ports.",
    "The PB60 is built around an Intel Core i7-8700T CPU which is an interesting piece of kit, and one of five Intel processors that fall within the Coffee Lake-based 8700 family. The T model has the lowest TDP (35W) thanks to slower processor base and turbo clock speeds (2.4GHz and 4GHz respectively). Like its other siblings, the chip has six cores, 12 threads and 12MB cache.",
    "The integrated UHD Graphics 630 solution can support up to three concurrent 4K screens, which is great for shop-fronts and high resolution displays. As we mentioned earlier, it uses SODIMMs and supports up to 32GB RAM – a dual-storage design with one M.2 PCIe 3.0 x4 SSD and one 2.5-inch HDD provides up to a theoretical maximum of 8TB internal storage.",
    "Other notable specs include a Gigabit LAN port, 802.11ac Wi-Fi, Bluetooth 5.0 and a weight of 1.19kg.",
    "The PB60 is plenty fast thanks to a great set of components. We wouldn’t expect anything else from a device equipped with these parts.",
    "We encountered one snag in our testing, namely that the HDMI port of the PB60 suffered from some random hardware issues, sometimes producing a picture with odd blue dots, and at other times, displaying sliced images. We tried swapping cables but that didn’t help, and the monitor was not the culprit. Switching to the DisplayPort solved the issue.",
    "Opening the case to access the components requires the removal of one screw (you’ll need a screwdriver – some rivals make things easier with a thumbscrew). The upgradable parts are easily accessible and swapping components can be done within seconds.",
    "The PB60 also comes with a wired USB keyboard and mouse plus Windows 10 Pro. It’s also worth noting that Asus put this PC through a number of tests which, to quote the company, were designed to make sure the device “exceeds industry requirements”, and part of this is an initiative called CSM (Corporate Stable Model) which provides businesses with a stable product supply and enhanced aftersales support.",
    "As such, the PC comes with the Asus Control Center IT management software suite (CSM Edition, worth $60) that provides comprehensive control and monitoring facilities.",
    "Sadly there are some more questionable choices in terms of the installed software. We noted the presence of Deezer, Music Maker Jam, Plex, and Fitbit Coach amongst the default applications. These are clearly consumer apps that don’t really fit in a B2B environment. Another dubious choice is the inclusion of a McAfee security solution which produced pop-ups at regular intervals (see the above image) to ‘encourage’ us to upgrade to the premium version.",
    "The unit comes with a three-year onsite warranty with next business day service if a query is submitted before midday.",
    "We couldn’t find the Core i7 model we reviewed in the US. The Core i3 model (with 4GB of RAM and a 500GB HDD) costs $479 at Newegg while the i5 model with 8GB and a 256GB SSD retailed for $629. In the UK, the Core i7 version is available for £814 at Amazon.",
    "Lenovo offers an 8th-generation Core i7 iteration of its ThinkCentre M720 Tiny for $869 (via BHphotovideo) with a faster OPAL-secured NVMe drive but fewer connections and half the RAM.",
    "The HP ProDesk 400 G4 mini is the closest thing to the PB60 in HP’s portfolio. On sale at just under £795 in the UK, it doubles the on-board SSD storage, but cuts the number of ports available, although you get a wealth of HP business management software.",
    "Dell is the only vendor that allows full configuration of the hardware and the OptiPlex 7060 Micro is the model that competes best with the PB60. You can choose to have your memory in two slots to enable a dual-channel performance boost, and save money by eliminating the WLAN card, the keyboard and mouse, and systems management options.",
    "By default, the 7060 Micro comes with vPro and a three-year hardware warranty with onsite service after remote diagnosis. At $1,169 direct from Dell, it remains a competitive buy.",
    "This pint-sized PC is, all in all, a cracking piece of technology, but it takes more than hardware to convince businesses to stump up tens of thousands of dollars on a fleet of personal computers. The actual base units often represent the tip of the iceberg and Asus is still a minnow – against more established players like Lenovo, HP or Dell – when it comes to the bigger picture.",
    "That doesn’t mean this diminutive Asus PC is a bad product; far from it. The PB60 does, however, suffer from a couple of issues like the lack of vPro certification (although there’s a TPM chip) and bloatware that simply shouldn’t be present. Plus the competition is far too established for a relative newcomer like Asus to make a big splash.",
    "A version with vPro will be available as the PB60V, with another version with Nvidia Quadro graphics scheduled for later this year as the PB60G."
  ],
  "headers": {
    "2": "Design",
    "7": "Specifications",
    "10": "Usage and performance",
    "17": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "Core i3 model": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-6285437242046676000&murl=https%3A%2F%2Fwww.newegg.com%2FProduct%2FProduct.aspx%3FItem%3DN82E16883221546",
    "i5 model": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-7607660251043272000&murl=https%3A%2F%2Fwww.newegg.com%2FProduct%2FProduct.aspx%3FItem%3DN82E16883221548",
    "Core i7 version": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FPB60-B7064ZD-OSS-Intel-i7-8700T-Desktop-Adapter%2Fdp%2FB07H5PVHBB%2F%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-8831074911847790000-21",
    "BHphotovideo": "https://www.bhphotovideo.com/c/product/1430706-REG/lenovo_10t70027us_m720q_tiny_i7_8700_8gb.html?BI=20811&KBID=16572&SID=trd-us-5429192624903643000",
    "HP ProDesk 400 G4 mini": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FHP-ProDesk-Mini-PC-i7-8700T-Windows-black%2Fdp%2FB07H28CMM6%2F%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-3608243790725909500-21",
    "$1,169 direct": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3044619787812157400/https://www.dell.com/en-us/work/shop/desktop-and-all-in-one-pcs/new-optiplex-7060-micro/spd/optiplex-7060-micro/cto04o7060mffusc"
  }
}