{
  "source": "https://www.techradar.com/reviews/microsoft-surface-pro-x-review",
  "title": "Microsoft Surface Pro X review",
  "category": "computing",
  "updated": "2019-11-21T18:22:27Z",
  "author": "joe-osborne",
  "summary": "Microsoft’s answer to the iPad Pro has its ups and downs",
  "verdict": "While we applaud the Surface Pro X for its slick and refined, thin and light design, and comfy typing experience, the Surface Pro X is difficult to recommend for most people. It ends up being an ideal device for a very small group of users, thanks to the lack of a headphone jack and no support for a variety of apps.",
  "pros": [
    "Slick, refined design",
    "Comfortable typing",
    "Super thin and light"
  ],
  "cons": [
    "No headphone jack",
    "Basic performance for price",
    "Just OK battery life"
  ],
  "article": [
    "The Microsoft Surface Pro X is an undoubtedly stellar looking and feeling tablet. Microsoft’s newest attempt at an ARM-based Surface Pro device could have been impressive as well. It even boasts Microsoft’s first-ever original processor, the SQ1, which it co-developed with Qualcomm.",
    "However, it unfortunately falls short of expectations. We’re more than a little let down by a few key Pro X design choices. Particularly, this tablet/laptop hybrid doesn’t have an audio jack, and its battery life, while decent, is subpar compared to predecessors and contemporaries. And, that’s without getting into the pricing.",
    "At first glance, the Surface Pro X's price tag might seem rather appealing, especially next to some of its rivals. However, in reality, it's simply too pricey for the level of performance you’re getting. All told, we find the Surface Pro X hard to recommend for most people.",
    "Though if you’re just looking for a device that delivers basic performance, and you really love the way this device looks, you might find some Black Friday and Cyber Monday deals that’ll save you some cash.",
    "The price of entry into Microsoft’s future-gazing Surface Pro X is $999 (£999, AU$1,699) – that gets you 8GB of memory (RAM) and a 128GB solid-state drive (SSD). You can double the storage, which ups the price to $1,299 (£1,269, AU$2,149), and double the RAM (16GB) with a 512GB SSD, which costs $1,799 (£1,819, AU$2,899).",
    "All Surface Pro X models include Microsoft’s Qualcomm Snapdragon-based, 3.0GHz SQ1 system-on-a-chip (SoC) processor, as well as the 13-inch, 2,880 x 1,920-pixel (267 pixels per inch) PixelSense touch display in the signature 3:2 aspect ratio.",
    "You already know the kicker, don’t you? That’s right, these prices do not include the Type Cover with the stowable and automatically charging Surface Slim Pen. That will cost you an additional $269 (£259, AU$429).",
    "This means that the cheapest version of the complete Surface Pro X experience will cost you $1,269 in the US to start. That’s for the bare minimum of acceptable memory and storage these days, meanwhile a Surface Pro 7 goes for nearly $150 less and will get you a much stronger Intel Core i5 (Ice Lake) processor.",
    "While the Surface Pro X is certainly an expensive device, it's price starts to look a little more tempting when compared to its chief rival: the 12.9-inch iPad Pro. That starts at $999 (£999, AU$1,699) for half as much storage (64GB), with a similarly-sharp display and just one USB-C port.",
    "Its keyboard accessory costs an exorbitant $199 (£199, AU$299), while the tablet’s Apple Pencil goes for another $129 (£119, AU$199). All told, that’s $1,329 in the US to get a comparable experience to the complete Surface Pro X.",
    "So, unless you have a very specific use case that only the Surface Pro X can solve, there are a number of far more powerful, versatile and feature-rich (even thin-and-light) laptops out there for similar prices – just check out our best 2-in-1 laptops and best tablets with keyboards buying guides for some brilliant alternatives.",
    "The Surface Pro X simply trims and rounds out the classic yet dated Surface Pro design, bringing down its thinness and weight even further. Specifically, the Pro X measures 11.3 x 8.2 x 0.28 inches (287 x 208 x 7.3mm) and weighs 1.7 pounds (774g).",
    "The tablet feels impressively light, and slips easily into almost any bag – even with the Type Cover attached. Microsoft has also eliminated the hard angles of the classic Surface Pro design, giving the Pro X a much more rounded and modern look and feel that's closer to that of a smartphone.",
    "We appreciate these subtle design changes that make the Surface Pro X feel more like an iPhone XR than a Windows tablet – which is a compliment.",
    "There’s just one color option for the Surface Pro X: a matte black aluminum finish paired with a black Type Cover that drops the Alcantara fabric, and that’s unfortunate. This is certainly a sleek and unassuming look, to be sure, so it’s not all that bad.",
    "However, we have one massive problem with the Surface Pro X design. While it has gained not one, but two USB-C ports, there is no headphone jack on the tablet. This is essentially a $1,300 Windows laptop (after all, Microsoft claims that this tablet can replace your laptop) with no 3.5mm audio support.",
    "We know that the iPad Pro has also dropped the headphone jack, and folks didn’t break a sweat over that. However, no one in their right mind seriously expects a laptop experience from an iPad, while that’s exactly what we’ve been trained to expect from a Surface Pro. This is a major detraction in our book, and should be rectified in any followup device that Microsoft produces.",
    "As for typing on the new Type Cover, it’s plenty comfortable and impressively accurate for a keyboard cover, though it does bounce under key presses more noticeably than before. We also appreciate the ergonomic angle staying with the new stowaway barrel for the Surface Pen Slim.",
    "While we’re at it, let’s discuss the Surface Pen Slim. The stylus is now flatter than before in order to accommodate the new storing and charging functions. However, it feels just as pleasing and accurate to doodle and draw with. All of the standard pressure sensitivity is present, and the display's palm rejection is still spot-on.",
    "As for that display, it is a 13-inch PixelSense touchscreen with a 2,880 x 1,920 resolution (267 pixels per inch) and a 3:2 aspect ratio. This is a simply gorgeous screen with excellent color, and it's also impressively bright at 450 nits.",
    "Honestly, we’re left a little puzzled by the Surface Pro X design. It certainly looks and feels thinner, lighter and better than previous Surface Pro models. However, it dropped the headphone jack to achieve that thinness, and that’s a really tough pill to swallow.",
    "We’re getting similar vibes from the Surface Pro X’s power profile that we are from its design: some big sacrifices were made in the name of thinness, lightness and lasting power. Here’s the kicker: the latter point doesn’t even see a huge improvement.",
    "Unfortunately, because of the ARM-based SoC, we were only able to run Geekbench and our video-based battery rundown test on the Surface Pro X. That’s at least enough for us to compare it against its number one rival, the iPad Pro.",
    "So, how does Qualcomm’s 7-nanometer SoC compare against the Apple A12X Bionic? Well, it gets trounced, to be frank. We’ve seen the latest 12.9-inch iPad Pro achieve numbers 40% to 50% higher than the Surface Pro X in the Geekbench 4 single- and- multi-core tests.",
    "Granted, these are two different operating systems (OS), but both processors were designed specifically to perform within their respective OSes, so that explanation doesn’t fly these days.",
    "While day-to-day tasks, like checking your emails, browsing the web and creating documents in Microsoft Office, ran pretty well on the Surface Pro X, trying to do anything more strenuous than that could cause problems. You might get away with editing photos and other images on this tablet via Photoshop, but that’s about it.",
    "Microsoft promises up to 13 hours of mixed usage time for the Surface Pro X, touted as one of the tablet’s most appealing features due to its new ARM-based silicon. Well, we’re sad to say that this hasn’t panned out in our testing.",
    "The Surface Pro X did last longer than the Surface Pro 7 (6 hours and 2 minutes) in our video rundown battery test, but the older Surface Pro 6 (8 hours and 45 minutes) lasted nearly an hour longer than this version.",
    "This is more than likely due to the even sharper display within the Surface Pro X than its two predecessors, not to mention brand new silicon compared to the umpteenth iteration of the 14nm Intel processor in the Surface Pro 6.",
    "In the end, while the Surface Pro X battery life is undoubtedly long, it’s just not as long as Microsoft’s Pro 6, which holds the crown for longest lasting Surface Pro tablet to date.",
    "As with every Surface that has preceded it, the Surface Pro X isn’t feature-rich nor are there many key pieces of software to discuss – in fact, many apps aren’t supported at all, due to the underlying processor architecture – which has its ups and downs. The major benefit here is that there is basically no bloatware on this tablet at all, as it’s sold directly by Microsoft.",
    "Another gain is the Windows Hello facial recognition, using the tablet’s infrared camera next to its webcam, and is as quick and accurate as before. Just as they have before, we can open the tablet from its Type Cover and it’s already logged us into Windows 10. Talk about instant-on performance.",
    "That said, this Surface in particular has the added benefit of optional LTE connectivity through a nanoSIM slot. This makes for an always-connected device, but will cost additional cash on a monthly basis. It’s up to you whether this feature is worthwhile, but we’ll keep on tethering on our laptops via our iPhone."
  ],
  "headers": {
    "0": "Two Minute Review",
    "4": "Price and availability",
    "11": "Design",
    "21": "Performance",
    "26": "Battery life",
    "30": "Software and features",
    "33": "Don’t buy it if…"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "12.9-inch iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2018",
    "Apple Pencil": "https://www.techradar.com/news/mobile-computing/tablets/apple-pencil-everything-business-users-need-to-know-1304017",
    "best 2-in-1 laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "best tablets with keyboards": "https://www.techradar.com/news/best-tablet-with-keyboard",
    "iPhone XR": "https://www.techradar.com/reviews/iphone-xr-review",
    "Windows laptop": "https://www.techradar.com/news/best-windows-laptop",
    "Surface Pro 7": "https://www.techradar.com/reviews/microsoft-surface-pro-7-review",
    "Surface Pro 6": "https://www.techradar.com/reviews/microsoft-surface-pro-6",
    "Windows Hello": "https://www.techradar.com/how-to/software/how-to-use-windows-hello-1301455",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review"
  }
}