{
  "source": "https://www.techradar.com/reviews/panasonic-gx920-gx940-4k-hdr-tv",
  "title": "Hands on: Panasonic GX920 / GX940 4K HDR TV review",
  "category": "televisions",
  "updated": "2019-02-22T10:47:07Z",
  "author": "henry-st-leger",
  "summary": "Go big, go home",
  "verdict": "The GX920 is thrilling in a lot of ways, with its wide HDR format support, wide 75-inch screen, and brand-new HCX Pro chip making a case for Panasonic’s LCD flagship, but none of these features really help it stand out either.",
  "pros": [
    "HDR10+ and Dolby Vision",
    "OLED-quality processor"
  ],
  "cons": [
    "Edge-lit display",
    "Can't match OLED range"
  ],
  "article": [
    "The Panasonic GX920 occupies a strange place in the company’s 2019 TV range. Panasonic has made no secret of its aim to move high-end consumers (or ‘prosumers’ as they’re known) towards OLED displays rather than LCD, and the four OLED TVs announced for this year show a general move away from their cheaper (and less visually impressive) alternatives.",
    "Labelled the GX920 in the UK, and GX940 across the EU and Canada, this 4K HDR television is the highest-spec LCD from Panasonic this year, and will only be available in a massive 75 inches – for the TV enthusiasts wanting something big, something capable, but which won’t cost the same several thousand pounds as the average OLED television. (Price is still unconfirmed though.)",
    "Ahead of its launch around June, we’ve run through our first impressions of the GX920 smart TV after getting our eyes on the 4K HDR set for the first time.",
    "What makes the GX920 slightly simpler is that it only ships in one size. This 75-inch TV will take up space, for sure – full dimensions come in at 1,680 x 1,046 x 413 mm – but you’re also getting a massive, impactful display that’s bound to impress in any living room that has room for it.",
    "The body of the GX920 is supported by a four-pronged stand that may take up more space than some, but is likely needed to balance such a large-scale screen. Otherwise the silhouette is near-identical to Panasonic’s OLED sets, albeit with a slightly thicker panel.",
    "So far we’ve only seen it in a slightly uninspiring silver-gray, with a metal bezel hugged by a dark plastic casing at the rear.",
    "In terms of audio, you’re getting a pretty standard 20W (2x10W) speaker built into the rear. The drivers are compatible with Dolby Atmos, though you’ll need some additional surround sound speakers if you really want to get a real home cinema experience. (For comparison, Panasonic’s OLED range ship with 50W speakers as standard.)",
    "As Panasonic’s flagship LCD, it’s interesting to see how the GX920 fares against the higher-end OLED televisions.",
    "In terms of color contrast or black levels, the comparison doesn’t seem fair – those are OLED's strong points, after all. But the inclusion of the same HCX Pro Intelligent Processor as the 2019 OLEDs should mean similar frame rates, motion handling and color processing, even if the quality of the panel itself varies between the sets.",
    "This is still a 4K UHD television – with a UHD Premium stamp of approval – and you can expect a high level of visual detail, with the HDR capability to make those extra pixels really pop with color. You’d expect a high-end LCD television to feature a full-array backlight, too – for maximum precision control over the levels of brightness across the screen – but Panasonic has opted for a cheaper edge-lit panel here instead.",
    "There may be an element of not wanting the LCD panel to compete too well with the OLED sets on offer, but it means that the TV’s brightness isn’t as consistent across the display. While the GX920’s specs claim to feature ‘local dimming’, it’s going to be a good deal less precise on an edge-lit panel, where light is shot out of the bottom of the set instead of evenly across the back of the panel.",
    "Panasonic was one of the collaborators behind HDR10+, a premium HDR standard that uses ‘dynamic metadata’ to vary levels of contrast and brightness scene by scene during videos. As a direct competitor to the more widely used Dolby Vision, last year’s Panasonic TVs attempted to get by with just its own product, and it wasn’t exactly convenient for those wanting to watch all the high-quality video currently on the market.",
    "Thankfully Panasonic has relaxed slightly, and even a couple of LCD sets (the GX920 and GX800) will feature both Dolby Vision and HDR10+. That alongside Hybrid Log Gamma broadcasting (for dual SDR/HDR signals) and HLG Photo (for HDR photography) means that viewers have access to every commercially-available HDR standard on the market.",
    "The GX920 is thrilling in a lot of ways: its wide HDR format support, wide 75-inch screen, and brand-new HCX Pro chip making a case for Panasonic’s LCD flagship.",
    "But none of these features really help it stand out either – especially in comparison to the far more fleshed-out OLED offerings like the GZ1000 or GZ1500, while the edge-lit panel might hold back what would otherwise be a set with a lot of potential. As ever, the price difference will be what makes or breaks the GX920 – and we’ll keep this review updated as and when more information trickles in."
  ],
  "headers": {
    "3": "Design and features",
    "7": "Picture quality",
    "13": "Early verdict"
  },
  "links": {
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "four OLED TVs announced": "https://www.techradar.com/news/panasonic-announces-double-the-oled-tvs-for-2019",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "75-inch TV": "https://www.techradar.com/news/best-75-inch-4k-tvs",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Hybrid Log Gamma": "https://www.techradar.com/news/hybrid-log-gamma-what-you-need-to-know-about-hlg",
    "HLG Photo": "https://www.techradar.com/best/best-lg-tv"
  }
}