{
  "source": "https://www.techradar.com/reviews/dauntless",
  "title": "Dauntless review",
  "category": "gaming",
  "updated": "2019-11-27T17:01:43Z",
  "author": "lloyd-coombes",
  "summary": "Worth a monster punt?",
  "verdict": "Forward-thinking additions like cross-play at launch and a stacked battle pass make Dauntless an enticing world to jump into, and one that’ll only grow in the months and years to come.",
  "pros": [
    "Excellent action",
    "Varied enemy design",
    "Plenty of content",
    "Non-intrusive microtransactions"
  ],
  "cons": [
    "Shallow world-building",
    "Overly small environments"
  ],
  "article": [
    "For the uninitiated, Dauntless is a new free-to-play sensation from the team at Phoenix Labs.",
    "Following the Monster Hunter template of killing big monsters to earn gear to kill even bigger monsters, is it worth your time? Or is it nothing more than a simple distraction while you wait for Monster Hunter World: Iceborne to arrive in September?",
    "Jumping into the boots of a customized slayer, your job is simple: accept quests, hunt Behemoths, get paid and do it over again. This core loop mirrors Monster Hunter albeit with some key differences….",
    "So what actually differentiates Dauntless from the critically acclaimed Monster Hunter World? Firstly, early quests encourage you to change up your play style regularly - using the sword is great, but why not try the hammer?",
    "Secondly, there’s very little in terms of story to be found here. The narrative setup has you follow your tutorial and then you’re let loose in the town of Ramsgate to pick up quests, forge gear, and speak to vendors at your leisure.",
    "Thankfully, Behemoths are excellently designed and you’ll want to keep heading out onto expeditions just to see them all. Because they are framed as more mystical beasts than Monster Hunter’s more organic ones, there are very few design constraints imposed on them. This means while in one quest you may battle a gigantic owl (the Shrike) with razor sharp talons, the next you’ll be dodging the hedgehog-like Quillshot’s spines as they rain down like mortars. There are currently 18 monsters to be found, and each have different variations and no two feel exactly alike, meaning you and your team will be looking to hunt in packs.",
    "Unlike Monster Hunter World, each locale feels almost like a palette swap - there are snowy regions, wooded regions, lava covered regions, all standard-fare. Monsters are indigenous to certain places, but none offer different gameplay considerations and are mostly too small to consider each pursuit a “hunt” per se. It’s more a case of “get to the high ground and oh, there’s the Behemoth”, before launching a flare to notify your team.",
    "Thankfully, the game is great fun to run around and gather resources in because running from hill to hill, using jump pads and sprinting towards a monster feels so much more liberating than Capcom’s more methodical movement options.",
    "Graphically, Dauntless is a much friendlier looking game than a game all about cutting bits off of monsters should be. Its character models have exaggerated features, and the character creator is full of plenty of options to reflect your own style. At times it looks to resemble the 'How To Train Your Dragon' movies, albeit with a lot more purple and strong lines around its characters and monsters. There’s nothing wrong with that, either - Dauntless looks approachable.",
    "That isn’t to say there isn’t depth to be found here. Combat is excellent, with Dauntless casting off any Monster Hunter comparisons with much faster-paced animations and shorter battles (at least to begin with). Some weapons, like the PS2-era Kratos-esque chain blades are built for rapid attacks, while the hammer hits hard but hits slow. Those looking to attack from afar can use dual pistols, and while they have some flashy effects they never feel as immediate as using one of the five types of melee weapon.",
    "Dauntless’ dodge roll might be its greatest addition to combat. Rolling has a small window of invincibility, meaning you can use it to negate plenty of attacks before retaliating. This leads to a constant back and forth of dodging, slashing, and dodging again and it feels great to master.",
    "Of course, this combat gets chaotic when three other players hop in to help with the hunt, and with elemental effects for gear you’ll soon see swathes of fire from your team, or ice-tinged strikes occurring in tandem. There’s a deceptive amount of strategy to be found in Dauntless, and as your prey gets tougher you’ll need to think more about how you’ll take it on. Thankfully, the game supports cross-play, offering PlayStation, Xbox and PC gamers the chance to play together, with Nintendo Switch joining the hunting party later this year.",
    "There is, of course, a sizeable Behemoth in the room - the game’s free-to-play nature. While there are boosts that can improve stats, these are doled out regularly by completing quests and are randomized.",
    "It’s not ideal, but in a co-operative title it arguably matters far less than in a player-versus-player environment. You can also buy a wealth of cosmetic items that change the look or color of your item, or simply buy the game’s season-long Battle Pass. This (as per Epic’s juggernaut free-to-play game Fortnite), offers a wealth of unlockables fitting the theme of the season. At the moment, you can earn Ninja outfits and new dyes for costumes, as well as emotes, and custom flares. All feel fun, and fit in nicely with Dauntless’ overarching design aesthetic.",
    "All told, there’s more content in Dauntless, a free-to-play title, than many full-priced titles in today’s market. It doesn’t have the depth of Monster Hunter, but it offers a much more accessible jumping on point with inventive monster designs and exciting but easy to learn combat. It’s free, so what have you got to lose?"
  ],
  "headers": {
    "3": "How to maim your dragon",
    "8": "Swords, chains, and guns - oh my!",
    "12": "Free to play - no, really",
    "14": "Verdict"
  },
  "links": {
    "Monster Hunter World": "https://www.techradar.com/news/monster-hunter-world-review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review"
  }
}