{
  "source": "https://www.techradar.com/reviews/dyson-v11",
  "title": "Dyson V11 review",
  "category": "appliances",
  "updated": "2020-01-14T15:41:42Z",
  "author": "joel-burgess",
  "summary": "Dyson doubles down on its flagship cordless vacuum.",
  "verdict": "While we were very impressed by the V11’s built in sensors, LCD display and suction power, it can be a little heavy and it still doesn’t have the battery for long cleans. Fortunately, it makes vacuuming really easy, so you don’t have to clean for as long.",
  "pros": [
    "Sleek build",
    "Improved suction",
    "Effective cleaning heads",
    "Responsive auto-mode",
    "Battery time display",
    "Spare head attachment"
  ],
  "cons": [
    "Expensive",
    "60 min max lifespan",
    "Can feel heavy"
  ],
  "article": [
    "Dyson’s 2018 V10 Cyclone vacuum cleaner was powerful enough for the company to feel confident ditching any future commitment to corded vacuums.",
    "Now, more than a year later, it’s doubled down on its cordless commitment by giving the new Dyson V11 more power so you have less work to do – even if it isn't quite as hands-free as a robot vacuum cleaner.",
    "The V11 may tout the same 60 minute maximum lifespan as the V10, but Dyson have put a lot of resources into developing the V11’s improved suction power, fade free battery performance and smarter energy conserving features.",
    "So while the V11’s overall lifespan hasn’t changed, you should ultimately clean faster and use less power, allowing you to get more cleaning done without actually putting in any extra time.",
    "Starting at $599.99 (£499 / AU$1,099), the Dyson V11 certainly doesn’t come cheap. Dyson have released different packages in the US, Europe, and Australia, so for simplicity, we’ve outlined the prices and availability of each model by territory below:",
    "United States In the US, you can get two different models of the new cordless vacuum. Both come with the new High Torque cleaner head (more on that later) and a range of additional cleaning accessories.",
    "The cheapest is the $599.99 Dyson V11 Animal, which comes with seven additional accessories and a Nickel/Purple coloring. Interestingly the V11 Animal, in the US, doesn’t come with the LCD display, opting for a simpler LED lighting array that shows the mode and a high medium or low battery level. Alternatively US customers can get the Dyson V11 Torque Drive, which comes in either copper or blue coloring and is accompanied by an additional ‘Mini soft dusting brush’ head and the LCD screen with battery countdown timer for $699.99.",
    "United Kingdom UK customers will also be able to choose from two versions of the V11. Here both come with the LCD screen, but only the more expensive model has the Torque Drive cleaner head.",
    "The entry UK model is the Dyson V11 Animal, which comes with eight additional accessories, but doesn’t include the Torque Drive cleaner head, for a total of £499.",
    "If you want the Torque Drive cleaner head, you’ll have to pay £100 more for the Dyson V11 Absolute.",
    "Australia Australian customers have even more choice, with three different models of the V11 up for grabs. All three come with the Torque Drive cleaner head and LED display screen, differing only in the number of included cleaning accessories.",
    "The Dyson V11 Torque Drive costs AU$1,099 and comes with five tools, the dock and the wand attachment. The V11 Torque Drive misses out on the soft roller head that will reduce scuffing on delicate hard floor surfaces. For this you'll need the Dyson V11 Absolute, which costs AU$1,199 and includes that soft roller head.",
    "Lastly, you have the Dyson V11 Absolute Pro which costs AU$1,249 and comes with an additional extension hose, a mattress cleaning tool, and a flexible crevice tool, on top of all the attachments of the V11 Absolute.",
    "The Dyson V11 looks very similar to its predecessor the V10, with a sleek futuristic design that isn't an eyesore if you forget to stow it away in the cupboard.",
    "Like the V10, the new Dyson V11 features an “in-line configuration” where the motor, bin, and cyclone array are all aligned, meaning “air is drawn into the cyclones in a straight line” – which helps maintain inertia and increases the suction power.",
    "Another similarity is the front-facing barrel arrangement that allows you to attach heads directly to the unit for a bench-top vacuum or to the far side of a tube for floor applications. What is new to the V11 however, is the ability to clip your accessories onto the vacuum itself – a useful touch for anyone who's found they need another head when on the far side of the house.",
    "Behind the barrel you’ll find the V11’s cyclone array, which consists of 14 cyclones in total. Dyson says that they generate “forces of more than 79,000g to fling microscopic particles into the bin”, including pollen and bacteria.",
    "The V11’s 0.2 gallon (0.75 litre) bin capacity is the same as the V10’s, which was 40% bigger than that of the V8. It has however acquired a new pump action sliding mechanism that projects the bin out away from the cyclonic cylinder to dispense contents quickly and easily, which will save users from having to pry out stubborn debris.",
    "The biggest change to the design of the new V-series vacuum is the inclusion of an LCD display. The display shows the current mode of the vacuum, the estimated remaining battery life and any other warnings or alerts that might be relevant."
  ],
  "headers": {
    "4": "Price and availability",
    "13": "Design"
  },
  "links": {
    "robot vacuum cleaner": "https://www.techradar.com/news/best-robot-vacuums"
  }
}