{
  "source": "https://www.techradar.com/reviews/sony-xperia-5-review",
  "title": "Sony Xperia 5 review",
  "category": "phones",
  "updated": "2019-11-12T12:38:06.443Z",
  "author": "tom-bedford",
  "summary": "Honey, I shrunk the Xperia 1",
  "verdict": "The Sony Xperia 5 is similar to the Xperia 1 in many ways, so much so that it barely feels like a different phone. That means most of the Xperia 1’s issues are also present in the Xperia 5, such as the dim screen and unreliable fingerprint sensor. However the reduced size does bring a few blessings, like extended battery life and comfortable one-handed use, making the Xperia 5 a slightly preferable phone in many respects.",
  "pros": [
    "Hand-friendly size",
    "Aspect ratio great for movies and gaming",
    "Impressive processor performance"
  ],
  "cons": [
    "Unreliable fingerprint sensor",
    "Screen is still rather dim",
    "Design feels a little archaic"
  ],
  "article": [
    "The Sony Xperia 5 heralds the return of Sony’s popular compact handset range – it’s a scaled-down version of the Xperia 1 from earlier in 2019 with similar specs, cameras and design, but in a smaller form factor.",
    "Sony Xperia phones are designed to be great for watching movies and TV shows, and for playing games, and to that end the Xperia 5 has a 21:9 screen, powerful speakers and a supercharged chipset, just like the Xperia 1; the screen size is scaled down here, but the rest is the same.",
    "But surely a smaller screen makes this phone worse for consuming content? And has Sony had to make sacrifices elsewhere too in order to make the Xperia 5 a compact powerhouse, or is it just as good as its bigger sibling?",
    "In the UK the Sony Xperia 5 became available to buy on October 2, 2019, and in the US its release date was a month later. It doesn’t look like the handset will come to Australia, though.",
    "The Sony Xperia 5 price is $799 / £699 (roughly AU$1,200), which makes it a fair amount more affordable than the Xperia 1, which cost $949 / £849 (roughly AU$1,365) when it was released.",
    "Saying that, Xperia 1 deals have seen its cost drop a fair amount, to the point where you can sometimes pick it up for less than the Xperia 5’s launch price.",
    "The Xperia 5 price, while more affordable than the Xperia 1, is still pretty high. The Huawei P30, with one of the most impressive camera arrays we’ve seen in a smartphone, and the OnePlus 7 Pro, with 8GB RAM and 256GB storage, both launched at that exact price (at least in the UK), and they’re available for a lot less now.",
    "That means the Sony Xperia 5 is going to have to work hard to justify its price tag.",
    "The Sony Xperia 5 bears a strong resemblance to recent Sony phones – that is to say, it’s a relatively long and thin device that’s rather angular. The Xperia 5 is smaller than some of Sony’s other handsets though, and it has a lot in common with the popular Xperia Compact handsets in that regard.",
    "The dimensions of the handset are 158 x 68 x 8.2mm, with a weight of 164g, which gives you an idea of just how slender this phone is. For the most part it's easy to use the Xperia 5 with one hand, unlike many other smartphones nowadays, making it great for people who struggle with larger devices.",
    "On the bottom of the device is a USB-C port, and on the right are the volume rocker, side-mounted fingerprint scanner, power button and a dedicated camera button.",
    "The SIM card tray is on the left side, but it’s so small that you’ll barely notice it. Unlike on most handsets, this doesn’t require a tool, so you can open it with your hand – and the device restarts when you do so. This can be annoying for people who like to fiddle a lot, but the SIM tray also houses a microSD card slot, which takes cards up to 512GB, which you can easily access.",
    "The buttons protrude enough for them to be easy to find and press without having to look – we’ll explore what it’s like to use the fingerprint scanner and camera button more in the Interface and Reliability, and Camera, sections respectively.",
    "The rear of the Xperia 5 houses the three cameras in a bump that’s one of the thickest we’ve seen on a phone. The array is offset to the left side of the rear, unlike on the Xperia 1 where the cameras were central, and apart from size this is the sole way you can tell the handsets apart. The bump sticks out somewhat, and while it’s not the worst offender we’ve seen it’s quite noticeable, and after we’d used the Xperia 5 for a while, the edges started to scuff.",
    "The device is built around an aluminium frame, with Corning Gorilla Glass on the front and back. It feels sturdy, and we (inadvertently) subjected it to a few drops and knocks without it showing a scratch; we were quite wary of damaging the phone on account of that long, thin body, although unlike the Xperia 1, we didn’t feel like we could snap the Xperia 5 in our hands.",
    "The Xperia 5 is available in black or blue finishes. It misses out on the purple, white and gray colors the Xperia 1 came in, which is a shame given they were all pretty stylish options.",
    "Overall the Sony Xperia 5 design feels a little archaic – there’s nothing wrong with it, but it would sit better with the phones of several years ago, or handsets from budget brands, than with the latest handsets from the likes of Huawei, Samsung and Oppo, which have more dynamic and interesting designs.",
    "The Sony Xperia 5 screen is long and thin compared to the displays on most other smartphones thanks to its 21:9 aspect ratio. A few Sony phones have used these screen dimensions now, starting with the Sony Xperia 10, and now that several non-Sony phones have employed this aspect ratio too, we’ve at the point where it isn’t really a novelty any more.",
    "The reason for this aspect ratio is to improve the movie-viewing experience – we’ll get more into this in our Movies, Music and Gaming section. Another design feature intended to enhance the cinematic experience is the relatively thick bezel at the top of the display – this houses the front-facing camera and top speaker, which means there’s no need for a notch or punch-hole camera, so the screen isn’t broken up by anything that could ruin your viewing experience.",
    "For general use, however, the 21:9 display is a little more awkward – while it’s useful for dual-screen functions, it means options at the top of apps can be harder to reach, even on this compact phone.",
    "The Xperia 5 screen is a 6.1-inch OLED display, with a 1080 x 2520 resolution. It isn’t 4K, which is a significant departure from the Xperia 1, and it also has a lower resolution, at 449 pixels per inch as opposed to 643.",
    "Does this mean it’s a poor screen? Well, it’s not perfect, but this isn’t because of the downgrades Sony has made; rather, it’s because one of our biggest problems with the Xperia 1 is back: the surprisingly low max brightness of the display.",
    "With the Xperia 5 placed alongside another handset you can tell that the Sony phone is dimmer, and when using the device outside in bright conditions it can be a little challenging to see the screen. Generally, the display is acceptable, but we’d certainly like Sony to bump up the max brightness on future phones, especially since we’ve had this problem with other devices from the company."
  ],
  "headers": {
    "3": "Price and availability",
    "8": "Design",
    "17": "Display"
  },
  "links": {
    "Xperia 1": "https://www.techradar.com/reviews/sony-xperia-1-review",
    "Xperia 1 deals": "https://www.techradar.com/deals/mobile-phone-deals",
    "Huawei P30": "https://www.techradar.com/reviews/huawei-p30-review",
    "OnePlus 7 Pro": "https://www.techradar.com/reviews/oneplus-7-pro",
    "Sony Xperia 10": "https://www.techradar.com/reviews/sony-xperia-10-review"
  }
}