{
  "source": "https://www.techradar.com/reviews/samsung-nu7100-ue49nu7100",
  "title": "Samsung NU7100 (UE49NU7100) review",
  "category": "televisions",
  "updated": "2021-02-02T12:45:47Z",
  "author": "henry-st-leger",
  "summary": "Solid 4K on a budget",
  "verdict": "The Samsung NU7100 may be 4K on a budget, but offers a mostly smooth, crisp picture with few artefacts. It doesn’t have the light output to really make its HDR compatibility count, but for the low price you’re getting a truly high-quality picture.",
  "pros": [
    "Low price",
    "Crisp 4K picture",
    "HDR10+"
  ],
  "cons": [
    "Basic HDR",
    "Edge-lit",
    "No Bixby"
  ],
  "article": [
    "As the manufacturer behind one-third of the TVs shipped worldwide, it’s statistically likely that you’re going to be buying a Samsung TV over any other brand – and the Samsung NU7100 (or NU7120 in the UK) is a good example of why.",
    "The NU7100 offers 4K Ultra HD resolution and High Dynamic Range (HDR) on a budget. It sits at the bottom of Samsung’s 4K UHD range, below the Samsung NU8000, carrying broadly the same specs as the Samsung NU7300, just without the curved screen.",
    "The UE49NU7100 retails at £479 (AU$1,299), although you can source it for as low as £388 at the time of writing (from Amazon) if a 43-inch TV isn't too small for you.. Although the 49-inch model reviewed here isn't available in the US, there's a comparable 50-inch that sells for $449.",
    "For the price there are inevitably some corners cut, but if you’re after a sub-$500 / £500 television you could do a lot worse. Read on to find out why.",
    "Considering the Samsung NU7100’s price, it’s no surprise that you’re not getting premium materials, although for many potential buyers, that won’t matter: most people will be buying for the picture, not the frame.",
    "That said, the build is clearly plastic, rather than metal, and you’re not getting the premium design of a QLED TV or Samsung’s The Frame.",
    "The set has two feet lifting it 78.6mm off the ground, and measures 1102.8 x 637.8 x 59.7 mm without the feet attached. The design is generally unassuming, but smart-looking, with a plain coloring and a small silver tag with the Samsung logo on the bezel below the screen.",
    "On the rear, you get Samsung’s usual ribbed casing, with the ports built into the set rather than running through the external connections box found on more premium sets. When it comes to ports, the NU7100 packs in three HDMI 2.0 (one with ARC), two USB, Ethernet, Common Interface, and an optical output for external hi-fi setups.",
    "We reviewed the 49-inch model – however you can see all the NU7100 model sizes for the US, UK, and Australia in the box below. Keep in mind though that you won’t see all the benefit of 4K with only a 43-inch display.",
    "Finding the best smart TV platform can be tough, but Samsung’s Eden UI is certainly up there. It makes use of a scrolling menu pane, and it’s easy to flick between different applications and lays out information cleanly, with your most popular apps and channels appearing closest to the left side of the screen.",
    "New for this year's version, selecting apps will also bring up a second menu above the icon, allowing you to skip straight to certain shows or videos you were watching the last time you used the app.",
    "You get the usual hoard of app options to choose from, whether more traditional broadcasting from ESPN (in the US), BBC Sport and iPlayer (in the UK), the huge content libraries of Netflix and Amazon Prime Video, or other streaming platforms like YouTube and Spotify.",
    "Viewers in the UK who are hoping for UK-specific catch-up services from YouView or Freeview Play won’t find them here, but you won’t be short for content to watch.",
    "The only real downside on the TV’s smarts is the omission of Bixby, Samsung’s in-house voice assistant, meaning you won’t be able to search for shows, films, or apps with voice commands. That said, considering some of the issues we've noticed with Bixby on other devices, you’re not going to miss it.",
    "All told, Samsung’s set does a great job of upscaling HD/SDR images for the ultra HD display. You can get a small amount of distortion at the very edge of objects or faces, but you have to be looking pretty hard for it. The upscaling works brilliantly fast, too, limiting blur and providing a detailed, well-processed image that enhances HD images rather than detracting from them.",
    "As a word of caution, however, you only get a 60Hz refresh rate – what Samsung somewhat misleadingly calls 'Motion Rate 120’ – rather than 120Hz, but you’ll only notice the drop in refresh rates with fast-moving images or action-packed shots. In these instances you’ll see a slight juddering where frames seem to be skipped, but it’s a small issue with what is otherwise a smooth, composed picture experience – and Samsung had to cut corners somewhere, after all.",
    "Samsung’s latest sets offer a few picture settings for you to choose between, too. The Standard setting is turned on by default, while Natural and Dynamic ramp up the processing for a more vivid, but often unnatural-looking picture. We found Movies the best general-use mode, as it brings a more consistent coloring, even if the images don’t ‘pop’ as much as they could.",
    "Despite being the cheapest 4K TV in Samsung’s 2018 range, the NU7100 offers a wonderfully crisp 4K picture. Images are detailed and sharp, without the slight distortion often seen when upscaling images from HD. But even if the pixels are sharp, the color contrast has to keep up with the level of detail demanded of it.",
    "The NU7100 is HDR-ready, meaning it can play content in the HDR10 format for a wider color gamut and greater levels of contrast than standard dynamic range (SDR) content. It can even support HDR10+, a premium HDR format (like Dolby Vision) that uses ‘dynamic metadata’ to vary levels of contrast in each scene, and the HLG (hybrid log gamma) broadcasting format, which codes both SDR and HDR images into one signal.",
    "Colors are certainly richer when displaying HDR content, and what’s most impressive is that the basic level of HDR on offer still manages to look balanced and natural. Samsung’s NU7100 can only do so much with its mid-range specs, but it manages to deliver a composed picture with few artefacts, and a clear step up from the SDR images. It’s notoriously difficult to balance the demands of high-end display technology with low-end processors, but Samsung’s NU7100 set has managed it with aplomb.",
    "Not surprisingly given its price tag, the NU7100 isn’t able to offer the full range of depth and color accuracy to really make 4K movies and videos pop, which may partially be due to the set’s low brightness and edge-lit backlight. You don’t get the sort of light and shadow control of higher-end sets, which tend to come with more precise dimming zones, and there are times when bright lights on-screen can bleed into the surrounding area.",
    "Watching Star Trek: Discovery in 4K HDR, the deep blues and reds of the show’s galactic landscapes truly jump out at you, though reflective surfaces – like the gold detailing on the cast’s uniforms – can have a bit too much shine to them.",
    "Like many TVs in this price range, what the NU7100 offers is a kind of ‘beginner’s HDR’: better than SDR, and a great taste of HDR’s potential richness and depth, even if it’s not enough to fully justify the label.",
    "Samsung hasn’t been fussy about keeping the NU7100 as slim as possible, and that means it’s managed to fit in some decent 20W speakers. These are rear-facing, meaning the sound is directed away from you, rather than towards you, and you won’t hear much by way of lower frequencies.",
    "Overall we felt the audio is fine for talking heads or the average sitcom, although you won’t get much of a sense of scale or impact in action flicks or when playing bass-heavy tracks.",
    "Voices are still detailed, and the volume packs a punch – though you’ll probably want an external hi-fi system if you want more bass than the NU7100’s mid-range speakers can manage.",
    "The Samsung NU7100 is competitively priced, and with a fantastic picture for the sub-$500 market. If you’re angling for a curved display, though, the NU7300 has pretty identical specs, and may tempt you away.",
    "Elsewhere, the Philips PUS6753 offers a class-leading 4K picture with Philips’ lively Ambilight technology, which projects on-screen colors onto the wall behind – it’s a touch more expensive at £549 (again, UK-only), but well worth the investment.",
    "The Samsung NU7100 treads the line between its budget credentials and 4K HDR specs impressively, offering a sharp and smooth picture that leverages its basic HDR capabilities to great effect. Its smart TV platform is easy to use too, even without Bixby voice commands, and Samsung’s budget 4K set manages to deliver a fine all-around experience for a very affordable price.",
    "If you want true HDR, you’ll have to invest in something more pricey. But if you’re looking for a cheap, capable 4K set with a wide color gamut, the NU7100 is simply one of the best sub-$500/£500 sets you can buy today.",
    "Everything you need to know about the new TV launches of 2019:",
    "The Philips TV range 2019: everything you need to know from OLED+ to ‘The One’",
    "Sony TV lineup 2019: every Sony Bravia and Master Series set coming this year",
    "LG TV catalog 2019: here’s every LG TV model coming this year",
    "Samsung TV catalog 2019: here’s every new Samsung TV coming in 2019",
    "Panasonic TV lineup 2019: the one Panasonic TV we've seen so far"
  ],
  "headers": {
    "4": "Design",
    "9": "Smart TV (Eden)",
    "14": "HD/SDR performance",
    "17": "4K/HDR performance",
    "23": "Sound",
    "26": "Other panels to consider",
    "28": "Verdict"
  },
  "links": {
    "4K Ultra HD": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Samsung NU8000": "https://www.techradar.com/reviews/samsung-nu8000-un55nu8000",
    "Samsung NU7300": "https://www.techradar.com/reviews/samsung-nu7300-series-un55nu7300-ue55nu7300",
    "43-inch TV": "https://www.techradar.com/news/best-40-inch-tv",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "Samsung’s The Frame": "https://www.techradar.com/reviews/samsung-the-frame-tv-2018",
    "HDMI 2.0": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "ARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "best smart TV": "https://www.techradar.com/news/best-tv",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Amazon Prime Video": "https://www.techradar.com/reviews/amazon-prime-review",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Freeview Play": "https://www.techradar.com/news/freeview-play",
    "Bixby": "https://www.techradar.com/how-to/what-is-bixby-our-guide-to-samsungs-voice-assistant",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Philips PUS6753": "https://www.techradar.com/reviews/philips-55pus675312-4k-tv",
    "The Philips TV range 2019: everything you need to know from OLED+ to ‘The One’": "https://www.techradar.com/news/philips-tv-2021-every-oled-miniled-and-ambilight-tv-coming-this-year",
    "Sony TV lineup 2019: every Sony Bravia and Master Series set coming this year": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
    "LG TV catalog 2019: here’s every LG TV model coming this year": "https://www.techradar.com/news/lg-tv-2021",
    "Samsung TV catalog 2019: here’s every new Samsung TV coming in 2019": "https://www.techradar.com/news/new-samsung-tv-2021",
    "Panasonic TV lineup 2019: the one Panasonic TV we've seen so far": "https://www.techradar.com/news/panasonic-tv-2021"
  }
}