{
  "source": "https://www.techradar.com/reviews/hive-active-heating-2-review",
  "title": "Hive Active Heating 2 review",
  "category": "appliances",
  "updated": "2021-07-12T10:14:58Z",
  "author": "marc-chacksfield",
  "summary": "Hive turns up the heat in the smart home wars, with a super-stylish thermostat, sensors, bulbs and camera system.",
  "verdict": "Hive Active Heating is simple, stylish and smart. It's easy to use and offers a great way to make your home smarter. And the more Hive products you add to it, the better it becomes.",
  "pros": [
    "It's intuitive and easy to use",
    "The thermostat system has a great design",
    "Alexa integration is fantastic"
  ],
  "cons": [
    "You need a professional to set it up",
    "No motion sensing to turn heating on",
    "Adding products can get pricey"
  ],
  "article": [
    "For many people, the prospect of turning their regular, boring home into a smart one still seems a little bit scary and very time-consuming. Luckily, the Hive Active Heating 2 is looking to change all of that and make upgrading your home easier, quicker and worth it in the long-run, making it, in our eyes, one of the best smart thermostats you can buy.",
    "One of the main reasons why building up your smart home can seem scary is because there's an assumption that you have to go 'all in' and upgrade everything to really see the benefits. This isn't how it works. At least not anymore.",
    "Smart systems like Hive allow you to start off small and then gradually add some smarter devices to your home one step at a time. That means you don't blow your budget and can choose the products that suit you - rather than being caught up in the hype.",
    "A key component to any smart home, in our opinion, is a smart heating system. Over the years we've seen a number of these hit the market – including, most famously, the Nest series of smart thermostats – and each brings something new to the table.",
    "A number of Hive products have been discounted for Amazon Prime Day 2020. Check out our pick of the best below:",
    "Like the others, Hive is a smart heating system – however, over the past few years, the brand has been expanding to offer up a whole-home smart setup.",
    "It’s this modular approach to creating a smart home that all users will benefit from: you can use Hive to heat your house, exclusively, or you can allow it to take control of lights, sensors and more, all of which are easy to control through the accompanying Hive app.",
    "The initial installation is the hardest part of the Hive setup but it’s something you don’t actually need to do yourself. Hive's British Gas connection means that once you purchase the product the installation of Hive is included, although it's worth noting that you don't have to be a British Gas customer to use the smart home system.",
    "For its initial price you get a wireless thermostat controller, the Hive hub, a receiver that connects up your boiler to the controller and a person to come install the thing.",
    "Yes, the price is a little steep but the technology you are buying into - more on this later in the review - is worth it.",
    "Hive is also boasting on its website, that by using its system over the course of a year you can save hundreds on your heating bills.",
    "The installation was hassle-free on our part. We have a combi boiler - two boilers in a house can also work, you just have to choose the multi-zone package which allows you to control the boilers separately - and already had a rudimentary wireless system attached. The installer simply replaced this with Hive and the whole process took under an hour.",
    "The Hive hub was also set up in this time. The hub is the beating heart of Hive. It connects up to your router and is the thing that each Hive product connects to. Again, setup for this was within that hour time, and included a walkthrough of the app."
  ],
  "headers": {
    "4": "Update: Hive smart thermostat Prime Day deals"
  },
  "links": {
    "best smart thermostats": "https://www.techradar.com/news/best-smart-thermostat",
    "Amazon Prime Day 2020": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "purchase the product": "https://www.awin1.com/awclick.php?awinmid=6363&awinaffid=103504&clickref=trd-us-1360125875683610000&p=https%3A%2F%2Fwww.hivehome.com%2Fshop%2Fhive-active-heating"
  }
}