{
  "source": "https://www.techradar.com/reviews/skullcandy-indy",
  "title": "Skullcandy Indy review",
  "category": "audio-visual",
  "updated": "2019-06-20T18:30:14Z",
  "author": "lewis-leong",
  "summary": "A solid pair of true wireless headphones held back by poor fit",
  "verdict": "The Skullcandy Indy have a fun, punchy sound and good noise isolation... that is if you get a good fit. Unfortunately, their design makes it difficult to get a good fit, which is a shame as its price and performance would have made it a good value.",
  "pros": [
    "Fun, punchy sound",
    "Good noise isolation",
    "Sweat- and dust-resistant"
  ],
  "cons": [
    "Too much bass, little resolution",
    "Hard to get a good seal",
    "Limited ear tip and wing selection"
  ],
  "article": [
    "Skullcandy got into the true wireless headphone space with the Push Truly Wireless headphones. We liked them for their excellent fit, good noise isolation and physical controls. However, the bass was too bloated and messy for us to recommend.",
    "The Skullcandy Indy are the company’s second attempt at a true wireless headphone and its design is dramatically different from the push: The Indy looks like a black, in-ear version of the Apple AirPods with a mic/battery stalk that points down. Unlike the AirPods, the Indy is an in-ear headphone that requires getting a good seal for good sound quality and noise isolation... which can be a problem.",
    "Unfortunately fit is the Achilles Heel for the Skullcandy Indy as its stalks make it difficult to get a good fit. That's a shame because we actually enjoy their sound quality for their affordable $80 (£70, about AU$128) price.",
    "Admit it, the Skullcandy Indys look like a blacked-out version of the Apple AirPods. Both headphones feature long downward-pointing stalks which house the mic and batteries. Both the AirPods and Indys feature touch controls as well but the Skullcandys actually let you adjust volume and control playback.",
    "The Skullcandy Indy are an in-ear design, which means you have to insert the headphones into your ears for the best sound quality and noise isolation. The advantage of this design is to provide the most bass response and noise isolation.",
    "Unfortunately, the in-ear design and the long stalks mean getting a good fit is extremely difficult. We tried every combination of ear tip included in the package (S, M, L) but never got a good fit for more than a few minutes at a time. That’s because the stalks rest against your jaw, which moves the headphones out of place when yawning, talking or chewing.",
    "Though, we eventually found our best fit by removing the “Stability Ear Gels”, we discovered that the headphones are extremely difficult to remove from the case without the added grip of the ear gels since the magnets holding the headphones in the case are so powerful. Either way, it's a lose-lose situation.",
    "Speaking of the case, it’s quite bulky compared to most true wireless headphones and only nets 16 hours of total listening time. When competitors are getting over 24 hours of total playback from similarly sized cases, the battery life of the Indy is a little disappointing. The case also charges via microUSB instead of USB-C, which is annoying if you want all your gadgets to use a single type of cable.",
    "If you get a good fit, the sound quality of the Skullcandy Indy is fun and punchy with tons of bass. Bass takes center stage with the Indy as it does with most Skullcandy products. That helps make music exciting but, in our opinion, it’s far from accurate and can be fatiguing after a while.",
    "Some mid-range frequencies are obscured by bass bleeding into the register but it’s not terrible. Highs are vibrant without being harsh. They are also slightly rolled off, meaning they lose energy at the top end of the frequency spectrum. This ensures highs never sound harsh but it hinders detail. Overall, sound quality is soft thanks to the heavy bass tuning and lack of resolution.",
    "The bad news is that the soundstage is quite narrow and music sounds like it’s coming from the center of your head instead of around you. That’s expect for a headphone at this price, but it's still a bit of a disappointment.",
    "In terms of battery life, we had no problems hitting the claimed 4 hours on a single charge and getting another 3 charges out of the case.",
    "The Skullcandy Indy would have been a solid pair of true wireless headphones if it weren’t for its poor fit. If you’re lucky enough for the Indy to fit your ears, you’ll like the headphone’s exciting, bassy sound and good noise isolation.",
    "For the rest of us, however, there are better alternatives like the Sol Republic Amps Air 2.0, which are more expensive at $130 (£150, AU$199) but they’re worth it for bass-lovers. The Samsung Galaxy Buds and NuForce BE Free5 are also good alternatives that cost around $100 and, if you're willing to pay a bit more, there's always the RHA TrueConnect, our favorite true wireless headphone so far in 2019."
  ],
  "headers": {
    "3": "Design",
    "8": "Performance",
    "12": "Verdict"
  },
  "links": {
    "Push Truly Wireless": "https://www.techradar.com/reviews/skullcandy-push-truly-wireless-earbuds",
    "true wireless headphone": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Apple AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review",
    "Sol Republic Amps Air 2.0": "https://www.techradar.com/reviews/sol-republic-amps-air-20",
    "Samsung Galaxy Buds": "https://www.techradar.com/reviews/samsung-galaxy-buds",
    "NuForce BE Free5": "https://www.techradar.com/reviews/optoma-nuforce-be-free5",
    "RHA TrueConnect": "https://www.techradar.com/reviews/rha-trueconnect"
  }
}