{
  "source": "https://www.techradar.com/reviews/lacie-mobile-ssd-2tb",
  "title": "LaCie Mobile SSD 2TB review",
  "category": "computing",
  "updated": "2019-03-25T19:00:20Z",
  "author": "desire-athow",
  "summary": "An Apple exclusive with a suitably premium price tag to match",
  "verdict": "The LaCie Mobile SSD 2TB would have been a must-buy had it been priced $100 cheaper. However, as it stands, it’s hard to recommend this drive unless you absolutely need to get a space grey storage device to match the color scheme of your Apple MacBook.",
  "pros": [
    "Great design",
    "Comes with LaCie toolkit and data recovery services",
    "Three-year warranty"
  ],
  "cons": [
    "Extremely expensive"
  ],
  "article": [
    "LaCie can be considered to be the Apple of the storage world with extravagant, often futuristic, bold designs and premium pricing. LaCie is owned by storage giant Seagate, and this French company has a longstanding partnership with Apple, as both target the same audience and complement each other.",
    "Case in point, the LaCie Mobile SSD 2TB, which we are reviewing today, is only available – at the time of writing – from the Apple Store, and carries a price tag of $499, making it one of the most expensive 2TB external solid-state drives on the market.",
    "The launch of the Mobile SSD 2TB (it is also available in 500GB and 1TB versions) marks the 30th anniversary of LaCie. The designers – who in the past worked with the likes of Neil Poulton and Philippe Starck – have opted for a diamond-cut design with edges that, in their own words, reveal tone and texture.",
    "The all-aluminum space grey design complements the Apple MacBook range and while this drive is lightweight (101g) and compact (97 x 78 x 9.1mm), it can also withstand falls of up to 3m. It’s a tough customer, in other words.",
    "Other than the USB Type-C connector, the white LED status light and the LaCie logo (plus the usual printed bumph such as serial numbers on the rear), the casing is devoid of anything that might distract the user from its minimalist vibe.",
    "The Mobile SSD doesn’t contain any software, but you can download a free software toolkit that can help you optimize the drive (basically reformat the drive to NTFS). There’s also a shortcut to a landing page where you can register your drive to get free Rescue Data Recovery Services.",
    "The drive is likely to use a customized version of the Seagate BarraCuda SSD, which uses 3D TLC NAND flash memory and comes with a five-year warranty (LaCie offers two). Most importantly, its quoted read/write speeds are 560/540MBps using 128KB blocks.",
    "In practice, however, we never really approached these numbers with read and write speeds hovering around 440MBps and 426MBps respectively in CrystalDiskMark. The Atto benchmark produced very similar figures at 440MBps and 422MBps respectively. That’s fast, but not as fast as some of the speedier models we’ve tested.",
    "A 10GB file took 36 seconds to be transferred, which is fast enough for some tasks. That’s more than twice as quick as an external hard disk drive, but four times slower than the Samsung X5, an external SSD which is equipped with NVMe and Thunderbolt 3. The LaCie drive was never more than just a tad lukewarm during our testing.",
    "The LaCie Mobile SSD 2TB is one of many products with a 2TB capacity, including, surprise, surprise, a number of lesser-known companies who seem to repackage third-party SSDs in their own enclosures.",
    "Amongst the better known brands are SanDisk with its Extreme Portable SSD ($369 at Amazon), Samsung’s popular T5 Portable SSD ($409 at Amazon), G-Technology with its IP67-rated G-Drive Mobile SSD ($388) and WD with its 2TB My Passport SSD ($350 at Amazon).",
    "Of the flurry of tier-2 vendors, three models caught our eye: the FreeTail Swift, a 2TB external SSD that comes with a three-year warranty and a shocking price tag of $290. Then there’s the Sabrent Rocket Pro 2TB which is an NVMe model, making it far faster than any SATA-based effort if you have a USB 3.1 Gen 2 port. At $450, it is also cheaper than the LaCie. Last but not least, the Titanium One comes with a 50GB pCloud cloud storage account and a three-year warranty for only $300.",
    "The other option is to do-it-yourself. Grab the Intel SSD6 660p M.2 2280 internal SSD, for example, for $230 from Amazon, shove it inside a compatible enclosure, and you’ve got yourself a pretty decent external SSD for under $250.",
    "The LaCie Mobile SSD is the most expensive SATA-based SSD currently on sale, and while there’s absolutely nothing intrinsically wrong with it, we find it hard – very hard – to recommend it over other external SSDs, especially when the LaCie Portable SSD is considered. At $420, it lacks the stylish design of the Mobile SSD but keeps everything else, including the bundled data recovery services.",
    "Seagate does sell a 4TB (3.84TB to be precise) SSD in the form of the IronWolf NAS-focused model, but it is unlikely that a 4TB LaCie Mobile SSD will emerge soon. Instead, it would make perfect sense to get a Thunderbolt 3 version of this drive sooner rather than later, given that all MacBook laptops currently sport two of these super-speedy ports.",
    "LaCie already has an offering called the Bolt3 but it is a desktop-bound model that uses two M.2 SSDs in RAID 0 mode. A 2TB Thunderbolt 3-toting Mobile SSD is a no-brainer."
  ],
  "headers": {
    "2": "Design",
    "5": "Performance and usage",
    "9": "The competition",
    "13": "Final verdict"
  },
  "links": {
    "LaCie Mobile SSD 2TB": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1432586171222601500&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fus_smb_83039%2Fshop%2Fproduct%2FHMU42ZM%2FA%2Flacie-2tb-mobile-ssd-high%25E2%2580%2591performance-external-ssd-usb-c-usb-30-thunderbolt-3",
    "Samsung X5": "https://www.techradar.com/reviews/samsung-x5-portable-ssd",
    "FreeTail Swift": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FFreeTail-Swift-Ext-External-FTES500B35%2Fdp%2FB078FW9LMM%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6052352863104352000-20",
    "Sabrent Rocket Pro 2TB": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSabrent-Rocket-External-Aluminum-SB-2TB-NVME%2Fdp%2FB07N15HD51%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1112465498898225400-20",
    "Titanium One": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07F2DZK2Z%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2840208120104155600-20",
    "pCloud": "https://www.techradar.com/reviews/pcloud",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Intel SSD6 660p": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FIntel-660p-2-0TB-80mm-978351%2Fdp%2FB07GCLLKDC%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1120702729953718800-20",
    "LaCie Portable SSD": "https://www.bhphotovideo.com/c/product/1440710-REG/lacie_sthk2000800_2tb_portable_usb_3_1.html?BI=20811&KBID=16572&SID=trd-us-4335885070043594000"
  }
}