{
  "source": "https://www.techradar.com/reviews/olympus-om-d-e-m1x",
  "title": "Olympus OM-D E-M1X review",
  "category": "cameras",
  "updated": "2019-03-08T12:07:08Z",
  "author": "matt-golowcyznski",
  "summary": "The pro-grade DSLR killer?",
  "verdict": "Where to begin? A solid build, great handling, speedy autofocus, excellent response, lovely 4K video, sound image stabilization... Sure, there isn't quite enough here to justify such a hefty premium over the existing E-M1 Mark II or some rival models, but the E-M1X is still a hugely pleasing camera to use.",
  "pros": [
    "Excellent handling in both orientations",
    "Speedy autofocus",
    "Highly responsive touchscreen",
    "Image stabilization works brilliantly",
    "Great 4K video with low rolling shutter"
  ],
  "cons": [
    "Viewfinder can be unclear in low light",
    "Noise appears early in ISO range",
    "Menu system still a bit awkward",
    "AF tracking can lose subject easily"
  ],
  "article": [
    "This past year has seen massive upheaval in the photography industry, with fresh systems launched from all corners, and growing collections of lenses to support them. But Olympus's latest OM-D E-M1X is more familiar, taking the company's existing OM-D format and strengthening it in key areas.",
    "Indeed, Olympus appears to be targeting many different photographers with this model. On one hand, fast burst shooting, hybrid phase- and contrast-detect autofocus, and new deep-learning-based autofocus options for moving subjects show the E-M1X is being pitched at those drawn to the likes of the Nikon D5, Canon EOS-1DX Mark II and Sony A9.",
    "Yet, with even more refined image stabilization than before, and high-resolution capture settings, it's clearly also as viable an option for those shooting medium-format landscapes on a tripod as it is for those capturing handheld shots in low light. So just how well can it satisfy everyone?",
    "The OM-D E-M1X is, quite clearly, the most advanced camera Olympus has produced to date, and the spec sheet shows it to be taking the fight to its competitors, which is just as well given how much stronger the combined threat from established systems and newer ones showing plenty of of promise now is.",
    "Unlike almost all of its peers, the camera has a 20.4MP Live MOS Four Thirds sensor, which is significantly smaller than full-frame types and smaller still than APS-C ones. The focus on sports and action shooting means resolution clearly isn't the priority, although it will be interesting to see just how much longer the 20MP barrier for sensors of his kind remains.",
    "If you do need to capture something at a higher resolution, however, Olympus has you covered. Its High Res shot mode works on the now-familiar principle of capturing a number of images in quick succession before blending them together to create a single composite file. Here, this is output at a maximum 50MP when capturing JPEGs (a smaller 25MP option is also available) or raw files in the handheld mode, and 80MP (10,400 × 7,792) when shooting raw frames in the Tripod mode. You can capture raw files and JPEGs simultaneously, and you end up with both the unprocessed raw files and the composite when capturing raws.",
    "This neatly gets round the 20MP limitation of the sensor, and 50MP/80MP files will almost certainly be enough for times when 20MP just doesn't cut it. Those who imagine that they'll end up using this mode with any frequency might be interested to learn that the Panasonic S1R does something similar, but at 187MP – although quite who needs that kind of file size is another matter.",
    "The OM-D E-M1 II already had an excellent five-axis image stabilization system built into the camera, and the one in the E-M1X appears to be even better. Whereas the E-M1 Mark II offered a maximum 6.5EV stops of correction when using the M.ZUIKO Digital ED 12-100mm 1:4.0 IS PRO lens, the new camera's system adds a further stop to make it 7.5 stops with the same lens. 7EV stops are promised with the M.Zuiko Digital ED 12-40mm f/2.8 PRO, although the system will also work with all other Olympus lenses, albeit not quite to the same extent.",
    "When it's speed rather than resolution that's the priority, the OM-D E-M1X will happily shoot at 15fps with its mechanical shutter (with focus, exposure and white balance locked to the first frame), and at 18fps with autofocus and auto-exposure when using the Silent mode; if you're happy to forgo autofocus and auto-exposure, you can boost that to 60fps with the electronic shutter. The previously seen Pro Capture mode also shoots 35 frames before you press the shutter-release button, which is ideal if there's a critical moment that can't be missed.",
    "Much like on some pro-level DSLRs, this is all possible thanks to there being two processing engines on board the E-M1X. Here, they're the most recent TruePic VIII engines, which also allows for 4K video to be recorded in both DCI and UHD formats, at a maximum 24fps and 30fps respectively. The full width of the sensor is used to capture this, which means there are no crop factors to worry about aside from those to satisfy the aspect ratio of the footage being recorded, and you can also record at up to 120fps in Full HD if you need to.",
    "This is complemented by a raft of further options to please the videographer, from 3.5mm ports for microphones and headphones through to image stabilization from the sensor to help steady footage, as well as time code and a new OM-Log400 gamma curve. Footage can also be output through the micro HDMI port in 8bit 4:2:2.",
    "Alongside the audio and micro HDMI ports is a USB 3.0 Type-C port, and it's possible to use this to charge the two batteries while they're in the camera. With two BLH-1 batteries rather than the single one found in the OM-D E-M1 II, it's no surprise that battery life is almost double that of the E-M1 II at 780 frames, although this is according to CIPA; Olympus reckons that if you enable the Quick Sleep mode you can actually achieve around 2,580 frames on a single charge of the two batteries, which is mighty impressive."
  ],
  "headers": {
    "3": "Olympus OM-D E-M1X: features"
  },
  "links": {
    "Nikon D5": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/nikon-d5-1312739/review",
    "Canon EOS-1DX Mark II": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/canon-eos-1d-x-mk-ii-1314141/review",
    "Sony A9": "https://www.techradar.com/reviews/sony-alpha-a9",
    "Panasonic S1R": "https://www.techradar.com/reviews/panasonic-lumix-s1r-review"
  }
}