{
  "source": "https://www.techradar.com/reviews/startech-thunderbolt-3-dual-4k-docking-station",
  "title": "Startech Thunderbolt 3 dual 4K docking station review",
  "category": "computing",
  "updated": "2019-09-10T18:21:08Z",
  "author": "desire-athow",
  "summary": "A unique proposition that aims to augment the capabilities of your portable device",
  "verdict": "The Startech Thunderbolt 3 dual 4K docking station is a straightforward and easy to use product but unless you have a definite use case for the integrated SSD enclosure you will be better served by other, cheaper alternatives that often have more ports.",
  "pros": [
    "Integrated M2 slot",
    "3-year warranty",
    "All USB ports are fast-charge",
    "Decent price"
  ],
  "cons": [
    "Fewer ports than the competition"
  ],
  "article": [
    "Innovating in a vertical as dull as docking stations is difficult; there’s only so many ways you can improve on connectivity options, form factor or chassis design. And yet, the TB3DK2DPM2 ($355 at Amazon), a docking station from Startech, adds something that is innovative but is it actually useful?",
    "There’s nothing revolutionary about the design of this docking station; Startech stuck with the traditional elongated black metal brick design. It only has 11 connectors and ports; Caldigit has 15 in comparison.",
    "In the front, there’s a Type-C port, a USB 3.1 with fast charge, an SD card reader and two audio connectors. At the back there is an Ethernet port, another full size USB port (again with fast charge), two USB type-C Thunderbolt 3 connectors (one of which will provide power to your laptop), a full size DisplayPort and a proprietary power port.",
    "The power supply unit provided is a hefty unit but with a 150W output (of which 85W is dedicated to the laptop), this is essential. Startech provides multiple cables to cater for a global audience; though you will only need one and the rest will usually go to waste.",
    "As for its unique selling point, it comes in the shape of an M2 slot found underneath the device, that can be removed by taking out two screws. There’s no power button (or an auto power off feature) which means that the device is constantly on even after you disconnect the laptop.",
    "Despite the dock providing 85W, a warning (see below) related to its lack of power popped up on our test machine, a Dell XPS 15 convertible laptop (circa 2018) which, ahem, comes with a 130W power supply unit. Interestingly, it recognises it as a 65W PSU, not an 85W one.",
    "The docking station was quickly recognised by our test machine; just make sure that you connect the right ports using the right cable and always during the initial phase, after Windows has started.",
    "The Thunderbolt 3 dock has a built-in PCIe M.2 SSD enclosure that supports transfer speeds up to 1.5GB/s. It is a lot slower than other Thunderbolt 3 storage solutions but still far faster than SATA-based solutions.",
    "We tested the Kingston A2000 which boasts a read/write speed of up to 2.2GBps/2GBps and managed to get up to 1.07GBps and 0.99GBps on read/write respectively which is far slower than Kingston numbers and far slower than the up-to speeds claimed by Startech.",
    "Why? Probably due to overheads and bandwidth allocation put in place to guarantee quality of service; a single Thunderbolt 3 cable may have to carry data to two 4K monitors and other peripherals connected to the docking station.",
    "But there’s a bigger overarching question: after having initially warmed up to the idea of having a docking station with an integrated storage, we struggled to see any useful use cases.",
    "Using it as a fixed backup is probably the most common scenario a business (or more likely a professional) may buy it this for. The price of M2 solid state drives has been steadily declining over the past 12 months and you can find a 512GB one for as little as $59 at the time of writing. A local backup and a cloud-based backup offsite one are essential fixtures in a basic 3-2-1 backup strategy.",
    "You should be able to power two 4K monitors (hence its name) or one 5K monitor at 60Hz; that’s 5120 x 2880pixels through the Thunderbolt 3 USB-C port (courtesy of an Alpine Ridge chip). The dock’s SD slot supports SD 4.0 and UHS-II with transfer speeds up to 270MB/s for speedy file transfers while the the GbE port (with PXE Boot and WoL support) provides reliable wired network access.",
    "The explosive growth of thin and light laptops equipped with Thunderbolt 3 has attracted the attention of scores of accessory manufacturers with laptop vendors upselling these to improve their margins on a sale.",
    "There are more than 50 Thunderbolt 3 docking stations on the market according to the information on the official Thunderbolt technology website, so in other words, whatever the niche you’re operating into, you are bound to find your dock.",
    "Some of them come with legacy ports, full-size DisplayPort connectors or even HDMI ports, while others lack power delivery capabilities, or they offer built-in storage, like the LaCie 2big Dock. The two that we have reviewed recently from Caldigit and OWC do not offer the extra free storage connector.",
    "Both are also significantly cheaper at around $300. The suggested retail price of the Startech Thunderbolt 3 docking station is higher with a 15% premium. You could therefore either buy an external empty TB3 enclosure or an external TB3 storage device like the outlandishly capable OWC Envoy Pro EX Thunderbolt 3 1TB portable SSD which retails for $280.",
    "We are very much conflicted when it comes to this docking station. On one hand it is an innovative product and yes innovation needs to be applauded. On the other hand, there’ s limited use cases for the built-in storage feature and you might be better served by going for a cheaper Thunderbolt 3 docking station with a separate compatible storage device. It will provide you with a far more flexible, faster and cheaper option. Yes it won’t look good but it will be more practical.",
    "That’s not to say that the Startech Thunderbolt 3 dual 4K docking station is a bad product, far from that. But it is difficult to consider it as a must buy if you need more ports and don’t need a built-in storage to start with."
  ],
  "headers": {
    "1": "Design",
    "5": "In use",
    "13": "Competitors",
    "17": "Final verdict"
  },
  "links": {
    "TB3DK2DPM2": "https://www.startech.com/Cards-Adapters/Laptop-docking-stations/Thunderbolt-3-dock-dual-4k-60hz~TB3DK2DPM2",
    "$355 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FStarTech-com-Dual-60Hz-Thunderbolt-Dock%2Fdp%2FB07J37NFSH%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1266115339948250400-20",
    "Dell XPS 15 convertible laptop": "https://www.techradar.com/reviews/dell-xps-15-2-in-1",
    "cloud-based backup": "https://www.techradar.com/best/best-cloud-backup",
    "4K monitors": "https://www.techradar.com/news/best-4k-monitors",
    "Alpine Ridge chip": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "Caldigit": "https://www.techradar.com/reviews/caldigit-ts3-plus-thunderbolt-3-docking-station",
    "OWC": "https://www.techradar.com/reviews/owc-thunderbolt-3-docking-station",
    "O": "https://www.techradar.com/reviews/owc-envoy-pro-ex-thunderbolt-3-1tb-portable-ssd-2019",
    "WC Envoy Pro EX Thunderbolt 3 1TB portable SSD": "https://www.techradar.com/reviews/owc-envoy-pro-ex-thunderbolt-3-1tb-portable-ssd-2019"
  }
}