{
  "source": "https://www.techradar.com/reviews/ruark-r5-hi-fi-music-system",
  "title": "Hands on: Ruark R5 Hi-Fi Music System review",
  "category": "reviews",
  "updated": "2019-02-23T15:21:58Z",
  "author": "olivia-tambini",
  "summary": "Style and substance",
  "verdict": "We thought the R5 sounded brilliant, and we loved the design – but, its hefty price tag might put off casual listeners and relegate it to the world of audiophiles.",
  "pros": [
    "Elegant design",
    "Warm, wide soundstage",
    "Lots of connection/streaming options"
  ],
  "cons": [
    "No 'smart' features built in",
    "Pricey"
  ],
  "article": [
    "British audio company Ruark's latest product, the R5 High Fidelity Music System, is designed to appeal to music and design enthusiasts alike, with a combination of cool mid-century design and state-of-the-art audio tech.",
    "We had the chance to see it in person at the Bristol HiFi show. Read on for our initial thoughts of the high tech music system.",
    "There’s no word yet on an official release date, but Ruark says the R5 will be available to buy in the next few months for $1300 (£999 / AU$1800 based on current conversion rates.)",
    "Decent Hi-Fi systems tend to cost anywhere from $200 to over $5000, with the price being bumped up if you need to buy additional stereo speakers as well.",
    "So, although $1300 may sound like a lot of money to spend, the Ruark R5 actually sits comfortably in the middle of the price scale when it comes to high end music systems.",
    "Thanks to its gently curved shaped and fabric grille, the R5 has a mid-century quality to it – and we thought it looked very stylish.",
    "The cabinet is crafted from a walnut veneer, that's been specially tuned and damped to provide a high level of audio quality, while the fabric grille comes in a soft grey color.",
    "You can also get the R5 in a grey lacquer finish if you don't like the wood look, but we preferred the walnut finish, which we thought gave the system a lovely retro quality.",
    "Like previous Ruark devices, the top of the music system features a ‘Rotodial’ controller, which allows you to control playback.",
    "It also features an remote control that’s identical to the inbuilt Rotodial controller, so you can control your music without having to get out of your seat. Although we didn't get to test the controller at the Bristol Hi-Fi Show, Ruark says that don’t even have to point the remote at the system as it works via radio communication.",
    "The OLED display looked great, and added a modern touch to the otherwise retro design.",
    "Overall, we felt the design was very attractive, and it feels as though Ruark has put a lot of thought into the user experience with the inclusion of the radio-controlled remote.",
    "The Ruark R5 has a great deal of high-end audio technology underneath that walnut and fabric exterior.",
    "Designed to act as an all-in-one music system, the Ruark R5 features a multi-format CD player, DAB/FM and internet radio tuners, as well as support for aptX HD Bluetooth, and Wi-Fi streaming.",
    "You can also hook it up to your turntable thanks to a dedicated RIAA turntable input, or charge your devices using the USB playback/charging port.",
    "When we tested it, we noticed that it can reach high volume levels with ease, partly thanks to Class A-B amplifiers in a 2:1 stereo configuration.",
    "This has the added effect of creating a wide soundstage; whether you can truly achieve a stereo sound without two speakers is somewhat contentious though, and it's something we will be testing more thoroughly when we come to do our full review of the R5.",
    "Still, the soundstage felt pretty wide in the short time we spent with the Hi-Fi music system.",
    "We listened to an Elvis Presley rendition of 'Fever', and we were impressed by the warm and punchy bass notes, and the clarity and resonance of Presley's voice.",
    "The power of the bass frequencies is partly down to the R5's use of a neodymium magnet system – that's the most powerful naturally occurring magnet in the world – which means the speakers' drivers displace a large volume of air when they vibrate.",
    "This, coupled with the systems built in long-throw subwoofer, means that the R5 should excel when it comes to bass frequencies.",
    "However, we were actually more impressed by the R5's treatment of treble frequencies; the finger clicks that underpin the sultry bass runs in 'Fever' sounded remarkably realistic and clear.",
    "We also listened to a live acoustic version of Willy DeVille's cover of 'Spanish Harlem', and we were similarly impressed by the treatment of the treble frequencies.",
    "Tinkling piano riffs sounded full and resonant, while DeVille's gruff vocal had a grainy, analogue quality, that we felt really suited the R5's outwardly retro appearance.",
    "As we only had a short time with the R5, we'd like to see how it handles more contemporary music styles, electronic instruments, and drum machines when we carry out our full review.",
    "Based on the brief time we spent testing the Ruark R5 Hi-Fi Music System, it comes across as a very capable, high-end system that can replicate music in a way that's very faithful to the original recordings.",
    "We really liked the retro design, and we could imagine it being an attractive focal point in most homes.",
    "At $1300, it's by no means cheap, but audiophiles may be able to justify that price based on the amount of audio tech that's built into the music system – and it felt like the combination of neodymium magnets, stereo amplifiers, the long throw subwoofer, and the specially tuned cabinet really paid off sonically when we tested it.",
    "For that price however, you may be wondering why the R5 doesn't have any voice assistant smarts built in to it, and we felt as though the user experience would really be elevated if you could double the system up as a control hub for your smart home.",
    "Of course, when we write our full review we will be able to really put the R5 to the test, and investigate whether it can truly create a stereo soundstage without any external speakers – and whether we feel we're missing out on built in smart features."
  ],
  "headers": {
    "2": "Price and availability",
    "5": "Design",
    "12": "Features and performance",
    "25": "Early verdict"
  },
  "links": {
    "turntable": "https://www.techradar.com/news/best-turntables",
    "most powerful naturally occurring magnet in the world": "https://www.wisegeek.com/what-are-neodymium-magnets.htm"
  }
}