{
  "source": "https://www.techradar.com/reviews/transfercloudio",
  "title": "Transfercloud.io review",
  "category": "computing",
  "updated": "2019-03-22T09:00:36Z",
  "author": "mark-pickavance",
  "summary": "Torrent meets cloud, hides destination",
  "verdict": "An overly simplified solution for connecting Torrents to cloud storage that relies on the user to organise the whole process and the storage space available. Unless you pay for the top tiers, it could become a tedious exercise to manage the space provided.",
  "pros": [
    "Browser-based",
    "Keeps torrents anonymous"
  ],
  "cons": [
    "Limited features",
    "Bandwidth collateral damage",
    "Micro-management exercise"
  ],
  "article": [
    "The number of people using torrent download technology might be a concern to some, but to others, it’s an opportunity to address some of the snags and be paid to iron out a few of the wrinkles.",
    "One of these businesses looking to enhance the torrent experience is Transfercloud.io with its cloud-based torrent file capture service.",
    "Transfercloud.io offers four tiers of service called Basic, Premium, Power and Monster. And, you can pay monthly, bi-annually or yearly, with the biggest discounts to those who commit to an annual subscription.",
    "Each tier offers a greater number of concurrent downloads, more torrent slots and a bigger storage space for torrents you’ve yet to download from them.",
    "For $4.99 per month, the Basic tier allows a single concurrent download, two slots, and a maximum amount of temporary cloud storage of 50GB.",
    "The Premium tier increases that to 5 concurrent downloads, 10 slots and up to 200GB of space, but the cost is $9.99 per month.",
    "Power and Monster both cost $15.99 per month, with Power providing 10 concurrent downloads, unlimited slots and 500GB of space, where Monster has only 5 downloads and slots but gives you 2TB of workspace for the same money.",
    "If the amount of space isn’t enough, it can be boosted by 500Gb or 1TB for an additional $5.95 or $10.90 per month, respectively.",
    "Compared with others, like OffCloud, this pricing seems more competitive, although at the lower tiers more management will be needed to avoid running out of storage, and the Basic is only of use to those that only download occasionally.",
    "Transfercloud.io also have a free 7-day trial that allows a single download, one slot, and has a limit of 1GB and a maximum of 10 files per day.",
    "Initially, we thought that Transfercloud.io was a very similar service to OffCloud, as they serve the same Torrent user base.",
    "However, the deeper we got into this facility, the more we realised that it has a subtly different approach that might work well for some, and not so brilliantly for others.",
    "To use Transfercloud.io requires only a browser. There is no client app for desktop or mobile. It’s purely web-based.",
    "Once you’ve signed up, you can add a cloud service for your files to be transferred once they’ve been successfully downloaded by the service.",
    "Currently, the cloud storage options include Amazon S3, Mega.nz, Amazon Cloud Drive, OpenDrive, Dropbox, Google Drive, OneDrive, OneDrive for Business, pCloud, HiDrive and Yandex. And, for those with a NAS box handy, you can also use an FTP, SSH SFTP or WebDAV server as a target.",
    "With a place or places for the files to go defined, you can now add a torrent using either a URL, magnetic torrent or uploading a torrent file. And, you can also download video files directly via a URL.",
    "With a torrent added the home page tells you how much has downloaded until it hits 100%, or occasionally, a little more than that number due to an oddity of the way Torrents work.",
    "Our first attempted failed because the movie Plan 9 from Outer Space we tagged (from a legal source) was bigger than the free version quota. Although it doesn’t tell you how big a file is, and as the source didn’t either, we don’t know why it exceeded those limits.",
    "Oddly, the same file not via a torrent was within our limits, and it successfully arrived on the Transfercloud.io storage after a short time.",
    "One annoyance that we noticed was that if you fail to direct the download to a specific cloud storage account when you initiate it, that can’t be changed either during the download or after.",
    "You can directly download the file to your computer, but not redirect a file on local server storage to the cloud, irritatingly.",
    "Files that are downloaded and then sent to the cloud storage remain on the system, but you can’t directly download them. The only option you have is to remove them, another housekeeping job that would be better if automated.",
    "Overall, the features of this service are very minimalistic and there are a dozen ways that it could be easily improved.",
    "There is no estimated time of arrival, no current download speed on files, no alert system and no file sizes. Surely some, or all, of these could easily be added?",
    "The system has a user account and password, and you must sanction the various cloud storage providers when you connect them, but that’s about the full extent of security of this system.",
    "We saw no evidence that files are scanned for malicious packages, emphasising the need to take precautions against infected torrents unless your cloud providers have this functionality.",
    "For the majority of torrent users being malware aware is part of the mindset.",
    "The one big advantage of using this type of facility is that it keeps the client computer a step away from the torrent process, something that ISPs might warn you about, even if the Torrents you are downloading aren’t copyrighted content.",
    "As with any system dependent on file transfers between cloud services and client computers predicted performance isn’t qualifiable in any meaningful way. Any part of the chain can either have the best possible connections or the worst. And, the way torrents works to make the most of available resources, but not always successfully.",
    "Our experience is that downloading the file to Transfercloud.io took the longest portion of the time, and then the move to cloud storage was generally rapid.",
    "This performance hints that Transfercloud.io has decent backbone bandwidth, certainly better than the torrent clients it is interacting.",
    "What would be useful would be a means to have email updates sent, telling you if a file has been captured and successfully moved to the cloud.",
    "How long it then takes to move it down to a client system will depend on the quality of the local broadband and the service used, as ever.",
    "With three different moves going on, the chance of one of them being slow for whatever reason is high, and technically this will consume triple the amount of Internet bandwidth than a direct Torrent download to a client computer.",
    "Along with the limited features, the other snag with this solution is that what this service represents is the classic find-the-lady sleight-of-hand game. Where the files move around, and where they end up is obscured from those with vested interests, hopefully.",
    "That is good for anonymity of the user but less marvelous for internet bandwidth and users file management.",
    "Because to download a torrent you need to have sufficient space on Transfercloud.io to start, or it will be cancelled. And, to keep what storage you have on the service free for that to happen you need to move it to a cloud storage facility once it has completed at Transfercloud.io.",
    "Torrents by their very nature aren’t predictable, and it can be that the one source of a download goes offline leaving a few MB’s to complete and that space is now locked up till they come back, unless you cancel it entirely.",
    "Equally, if you want to download lots of files, you’ll need to have plenty of space on the Cloud service you use for them to live before you get a chance to bring them down to a local computer.",
    "If this sounds like a less enjoyable version of whack-a-mole, that’s a fair analysis.",
    "A design choice it appears was made to encourage you to take the Premium or Monster tier, as an escape from having to micro-manage the storage facilities in the chain.",
    "We’d contest that Transfercloud.io would work best for those with a NAS box with terabytes of space on it. However, if you’ve got one of those you could just run a torrent client on it and avoid the additional costs and transfers.",
    "We’re unconvinced that the approach taken by Transfercloud.io is the one that most torrent users need. But for some, it might provide the right level of anonymity and cloud storage integration that they want, at a price they’re willing to pay."
  ],
  "headers": {
    "2": "Pricing",
    "10": "Features",
    "24": "Security",
    "28": "Performance",
    "34": "Final verdict"
  },
  "links": {
    "Transfercloud.io": "https://transfercloud.io/",
    "four tiers of service": "https://transfercloud.io/pricing.html",
    "Basic tier": "https://transfercloud.io/pricing.html",
    "Premium tier": "https://transfercloud.io/pricing.html",
    "Power and Monster": "https://transfercloud.io/pricing.html"
  }
}