{
  "source": "https://www.techradar.com/reviews/jaybird-x4",
  "title": "Jaybird X4 review",
  "category": "audio-visual",
  "updated": "2019-11-18T15:26:41.961Z",
  "author": "andrew-williams",
  "summary": "Make it rain",
  "verdict": "With an IPX7 water-resistance rating and redesigned wing tips, the successor to Jaybird's X3 wireless earbuds are good-sounding sports earphones prepared for wet weather.",
  "pros": [
    "Engaging sound",
    "Firm fit",
    "Useful sound-customization"
  ],
  "cons": [
    "Some hardness on upper mid treble",
    "Slow-to-respond remote"
  ],
  "article": [
    "Earphones don’t need to be upgraded every year. But that’s more-or-less what Jaybird has treated its X-series range to.",
    "The big upgrade for the 2018-2019 Jaybird X4 is advanced water resistance. An IPX7 certification means these are among the most sweat and weather-proof earphones in existence.",
    "They are made for sport fans, and are perfect for runners. Thanks to good sound and OK comfort, just about anyone should be happy with a pair of Jaybird X4 earphones. There’s plenty of competition, though, including the cheaper OnePlus Bullets Wireless and the more precise-sounding V-Moda Forza Metallo Wireless.",
    "The Jaybird X4s are just about the most flexible kind of wireless earphones. You don’t have to recharge them every three hours like a true wireless pair. And as there’s no chunky neckband you can slip them in a pocket.",
    "Jaybird has used the same style through the whole X family, which began all the way back in 2013. There are some significant changes this time, though.",
    "All the earlier Jaybird X earphones have a signature in-ear hook to keep them firmly in place suring exercise, with an internal honeycomb structure to make it strong and flexible at the same time. The Jaybird X4 earphones, however, opt for something more conventional.",
    "Here the hooks are thick spokes of silicone, making them even more flexible. In theory this could make the Jaybird X4s less stable in your ear, an important factor for any exercise earphone, but this design works perfectly well. As the thickness of the hook tapers, there’s a good thick base to keep its structural integrity. They’re not going to fall out.",
    "A lighter top part also makes the Jaybird X4 earphones easier to fit. You can more or less just shove them in your ears without risking hurt to your cartilage. There’s also the option to remove the hook entirely.",
    "Some of you may want to do this when not out running or in the gym. The fins do apply consistent pressure to the inside of your ears, which may not feel that comfy long-term for some ear shapes.",
    "The Jaybird X4 hook and tips are separate. This leaves a visible ridge on the earpieces, used to keep the hooks in place, but as long as you pick the right tips they still have a good hold in your ear, hook-free. You get three sizes of fins in the box, and four pairs of tips. These aren’t in the usual wide array of sizes, as two are silicone, while the other two are expanding Comply foam.",
    "Earphones like this also have some spare cabling that runs behind your back, to make sure they’ll fit even the biggest-necked of protein guzzlers. Leave too much spare and it flaps around annoyingly as you run, so Jaybird uses a handy little plastic lozenge that keeps this chaff in check. There’s no genius design solution here, but Jaybird’s cable fastener is a lot less fiddly than some.",
    "The only clear way the Jaybird X4 earphones set themselves apart, in terms of hardware, is with IPX7 water resistance. This means they are designed to withstand submersion in water for 30 minutes. They are not made for swimming, but you can give them a rinse after a run. Other IPX7 rivals include the Plantronics BackBeat Fit and the cheaper Anker SoundCore Sports, but such strong water resistance is a rarity.",
    "The proprietary charging style is one technique that probably helps out in this. You don’t use a microUSB or USB-C port here. Four little metal contacts sit on the back of the in-line remote, and these hook into a little USB dock. Charging takes around an hour, which is fine, but lose it and you’ll have to buy a replacement. These cost $6.99 (£5.99 / AU$24.95) from Jaybird, which is surprisingly cheaper than you’ll find them on eBay.",
    "The price isn’t painfully high unless you live in Australia, but the inconvenience of the whole process of losing, re-ordering and then waiting for shipping is worth considering if you are a serial accessory misplacer.",
    "Jaybird says the battery lasts eight hours, and the reality is a little under this in our experience, perhaps seven hours. Using an Android phone you can see the rough battery level in the notifications drop-down. And a nice American lady Jaybird X4 reads out the charge level whenever the pair is turned on, to the nearest 10 per cent.",
    "For quite a feature-packed pair of wireless earphones, the Jaybird X4 remote is surprisingly shaky. There’s a lag of almost two seconds between pressing the central button and your music playing/pausing. This is not down to device-wide lag in the Bluetooth connection. Watch a YouTube video with them connected and you’ll see just enough lag to notice a slight lip sync discrepancy, but nothing major.",
    "So why the button lag, Jaybird?",
    "Like many pairs these days, the Jaybird X4 jettison track rewind and skipping with the remote in favour of digital assistant support. You access Google Assistant or Siri by long-pressing the middle button. Those to either side alter volume.",
    "The Jaybird X4 earphones juggle the audio priorities of sporting earphones well, and are well-suited for daily use. They have some extra bass energy and power, very welcome during runs and gym workouts. But not to the extent they sound juvenile or bloated.",
    "After using them for a few weeks, we’ve completely bedded into this style. Only after comparing to the slightly more restrained SoundMagic E11 did we remember that extra low-end punch was there.",
    "There’s also a little extra energy in the treble compared to some at the price, which again makes the sound more engaging and lively. The tuning isn’t audiophile-grade stuff, and with some music the treble can shuffle over into slight sharpness. However, this is not the kind of sibilance that crops us whenever a vocalist sings a word with “s” in it. The Jaybird X4 earphones are not particularly fatiguing.",
    "The mids are a little more subdued, and factors like soundstage separation and mid-range texture are roughly what we’d expect from a well-regarded headphone series at the price. They are fine, not mind-blowing. Don’t take this as too half-hearted praise. While the Jaybird X4 earphones don’t set any new standards for audio, their signature has a wide appeal and compares well with other popular models in this class.",
    "Things get more interesting when you download the Jaybird MyTune app. The primary use for it is to tweak the EQ of the X4. This is common, but Jaybird has gone further with community-created presets and those picked by athletes Timothy Olson and Rory Bosio. Apparently Ultra-Tail runner Bosio has terrible taste in EQ.",
    "Some of the community presets are worth checking out. Golden Ears HD, for example, really helps bring out texture and definition in the mids. Some of these also show the driver’s limits, making the hardness in the upper frequencies more noticeable.",
    "There are plenty of Jaybird X4 presets that also boost the bass, which might be handy for workouts.",
    "MyTune ultimately proves Jaybird has done a very good job with its own default “flat” tuning. However, the ability to tweak some of its limitations is welcome.",
    "The Jaybird X4 earphones are a sensible step forward from the Jaybird X3, if not a must-upgrade pick for those who already own a pair of X-series earphones. They increase water resistance to IPX7, letting you rinse them off with confidence. Very few earphones have such good waterproofing.",
    "Jaybird’s new style of in-ear fins may not suit all ears. But they do ours, and make fitting them easier than previous generations.",
    "Sound quality offers a good mix of an exercise-friendly tone without going overboard. And the companion app lets you thoroughly customise the character of what you're hearing. Jaybird does need to work on improving the response speed of the remote, though."
  ],
  "headers": {
    "3": "Design",
    "18": "Performance",
    "26": "Verdict"
  },
  "links": {
    "OnePlus Bullets Wireless": "https://www.techradar.com/reviews/oneplus-bullets-wireless",
    "wireless earphones": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Jaybird X3": "https://www.techradar.com/reviews/jaybird-x3"
  }
}