{
  "source": "https://www.techradar.com/reviews/sony-fe-600mm-f4-gm-oss-review",
  "title": "Hands on: Sony FE 600mm f/4 GM OSS review",
  "category": "cameras",
  "updated": "2019-06-11T14:11:58Z",
  "author": "matt-golowczynski",
  "summary": "The sports photographer's dream?",
  "verdict": "This is a serious lens, finished to a high standard and able to be customized to the level befitting its premium billing. It appears to be very well corrected for aberrations and and capable of impressively sharp images – and naturally, none of this comes cheap.",
  "pros": [
    "Stellar sharpness",
    "Vignetting and distortion appear low",
    "Comprehensive control panel",
    "Fast autofocus system"
  ],
  "cons": [
    "Huge and somewhat heavy",
    "Expensive"
  ],
  "article": [
    "We managed to get our hands on a pre-production sample of the new Sony FE 600mm f/4 GM OSS, the company's latest addition to its G Master lens line, as well as a Sony A9 running Sony's latest version 5 firmware.",
    "In our brief time with the lens we were able to shoot a game of polo, and wildlife at a nature reserve, to see how it performed when faced with different subjects. While the pre-production nature of the lens means we can't draw any definitive conclusions as to its performance, we have a much better idea of what it looks set to offer professional users shooting sports, wildlife and anything else that requires a long focal length and a relatively wide aperture.",
    "Aimed at the pro user, this is a lens that doesn't leave much off its spec sheet. The optics make use of three fluorite elements and a pair of extra low (ED) pieces of glass, as well as the largest extreme aspherical (XA) element yet. Sony says the latter is extremely difficult to manufacture, but stresses its importance in combating spherical aberration and helping to keep bokeh super-smooth.",
    "The A9 and A7-series cameras designed to be used with the lens may all pack their own image stabilization systems, but on an optic such as this a lens-based system is still worth including, due to the type of shake that needs to be corrected. Here, the system has three modes: Mode 1 for normal photography, Mode 2 for panning, and Mode 3 for unpredictable sports, and these are selected via a switch on the barrel.",
    "The optic employs dual XD linear motors – the same type as used inside the FE 400mm f/2.8 GM OSS – to help keep focusing fast, and focusing options are fairly comprehensive. You have the ability to enable and disable full-time Direct Manual Focus (DMF) through a switch on the lens, and there are four focus-hold buttons around the barrel that can be customized to taste. You also have a deep focusing ring with linear response, and a two-mode focus-limit switch.",
    "It's also possible to use filters, although these are fitted at the back of the lens via a drop-in system, rather than more conventionally on the front, which means they can be considerably smaller than they would otherwise need to be. The lens also ships with a humungous carbon fiber lens hood to keep out stray light, and the supplied hard case has dedicated space for all this, with individual compartments for filters and teleconverters.",
    "This is a (necessarily) large lens, particularly when you have the deep lens hood fitted. Sony may be keen to stress how competitively the lens weighs, but this is still a heavy optic that you’ll want to be using on a monopod or suitable tripod. The fact that you can only use it on the relatively lightweight A9 and A7 series bodies appears to give it an advantage over its DSLR rivals, but when you consider how unlikely it is that it will be used off a tripod this is arguably not signifiant.",
    "The barrel has the same control panel as the existing FE 400mm f/2.8 OSS G Master optic, which houses the options to switch between auto and manual focus, image stabilization and full-time DMF. This appears to be purposefully designed to help photographers who might be switching between the two with any frequency.",
    "Interestingly, the fact that you can use the FE 400mm f/2.8 OSS G lens with both 1.4x and 2x teleconverters means you can already achieve something similar when using this lens with the 1.4x teleconverter (560mm f/4 effective). So quite whether there will be many photographers who feel the need to use both lenses is uncertain.",
    "The only difference between the panel of the two lenses appears to be in the focus limit ranges, with this being understandably a little longer here. The switches all appear to move easily, and they're relatively flush with the outer casing, so it's difficult to knock them accidentally.",
    "Autofocus accuracy and speed is critical on a lens like this, so it's great to find that the Sony FE 600mm f/4 GM OSS can lock onto a subject very quickly, and work well with the camera's tracking system to stay with it as it moves around the scene. We've had the opportunity to test this previously with the FE 400mm f/2.8 GM OSS lens, and we can't see it working any differently here; it works very well and we were impressed with our hit rate during the polo match.",
    "A lens like this is likely to be used wide open most of the time, so it's great to find that sharpness is already superb here. The images below show just how well the lens can do here, particularly with less demanding relatively static subjects, such as with the texture of the buffalo's face and the individual hairs around the horse's eye. Of course, the highly effective focus tracking on the A9 used here has also meant that things stayed fine when faced with fast-moving subjects.",
    "Raw files from the A9 have a profile built into them that automatically rectifies chromatic aberration, so it's no surprise that this doesn't appear to be an issue in images. Automatic correction for vignetting or distortion isn't baked into files in the same way, but fortunately neither of these appear to be an issue. We should expect a little vignetting at wide apertures, but it appears to be remarkably well controlled.",
    "With a maximum aperture of f/4, you don't quite get the same subject-to-background separation as you would enjoy with an f/2.8 lens, but it's still possible to get very nicely defocused backgrounds (below).",
    "Together with the most recent version 5 firmware update for the A9, and its existing action-focused lens offerings, Sony shows no signs of slowing down in its ambitions to make its Alpha line the first choice for sports and wildlife photographers.",
    "Of course, with an asking price of £12,000 / £13,000 (we're still waiting on pricing for Australia) this is a lens that will only make its way to photographers who absolutely need it, such as pro sports photographers attending next year's Olympics. True, the FE 400mm f/2.8 OSS G Master isn’t priced that much cheaper, although that’s no doubt explained in part by the aperture being a whole stop faster.",
    "We're certainly encouraged by the sharpness of the lens, at even the widest aperture, together with its control over aberrations and the autofocus system's capability and speed – although considering the performance of previous G Master lenses, this probably shouldn't come as much of a surprise.",
    "And yes, it's crazily expensive, and out of the reach of many, but then it's not exactly a mass-market offering. This is precisely the kind of lens Sony needs to have in its portfolio if it's to show how serious it is at tempting pro photographers away from the dominant DSLR players.",
    "All sample images captured with a pre-production lens. All images: TechRadar"
  ],
  "headers": {
    "2": "Features",
    "6": "Design and handling",
    "10": "Performance",
    "14": "Early verdict"
  },
  "links": {
    "Sony FE 600mm f/4 GM OSS": "https://www.techradar.com/news/sony-fe-600mm-f4-gm-oss-announced-the-longest-g-master-optic-yet",
    "Sony A9": "https://www.techradar.com/reviews/sony-alpha-a9",
    "version 5 firmware": "https://www.techradar.com/news/sony-a9-finally-gets-its-real-time-tracking-boost-through-v50-firmware"
  }
}