{
  "source": "https://www.techradar.com/reviews/azulle-access3-mini-pc",
  "title": "Azulle Access3 Mini PC review",
  "category": "computing",
  "updated": "2019-04-15T18:30:42Z",
  "author": "desire-athow",
  "summary": "A device in search of an audience, or a truly ground-breaking product?",
  "verdict": "The Azulle Access3 Mini PC is an HDMI stick that does the job well enough. However, we were never really convinced by the form factor, which is attractive in theory, but ends up being a bit of a mess when put to the test of real-world usage.",
  "pros": [
    "Relatively cheap",
    "CPU is more powerful than expected",
    "Decent design"
  ],
  "cons": [
    "Form factor has too many flaws",
    "32GB of storage is far too small (and slow)",
    "64GB upgrade is far too expensive",
    "Not all SKUs are available to buy"
  ],
  "article": [
    "Azulle is a newcomer to our labs – it’s a US-based company, and one of the hundreds of smaller outfits dotted around the world that exist to fill niches left open by the big manufacturers (Lenovo, Dell, Acer, Apple, HP, Toshiba and so on).",
    "One of its products, the Access3, delivers an entire computer in a form factor smaller than your average smartphone. That form factor, commonly known as an HDMI stick or PC stick, has been around for a few years already, but demands for better performance mean that it has had to evolve.",
    "Intel pioneered this form of miniature PC four years ago with the launch of the Compute Stick. Others, like Archos, Asus, Hannspree and Dell have followed suit, but with mixed results to say the least. The format simply hasn’t caught on for a number of reasons, but the form factor of Azulle’s Access3 doesn’t solve the outstanding issues; it only mitigates them.",
    "At 128 x 49 x 18mm (at its thickest), this is a pocketable computer, but bear in mind that it is useless without its 15W (5V, 3A) power adaptor, and of little use without the HDMI cable that connects it to a display. A foldable antenna and an HDMI male plug add slightly to its girth.",
    "The Access3 weighs 133g while its accessories (a power supply unit and a 13-inch HDMI cable) add another 167g for a total weight of 300g. Remember, you need those accessories for the HDMI stick to work.",
    "The first thing we noticed about this product is the concentric, ribbed design of the top and bottom of the black metal enclosure. This, according to the manufacturer, helps to dissipate heat generated by the components inside. Unlike most HDMI PC sticks in the past, this one doesn’t have an active fan and is therefore completely silent.",
    "On its underbelly is a removable sticker that warns that the device might get warm when running CPU intensive applications, and that users should “exercise caution when handling the device after prolonged use”. You’ve been warned!",
    "Physical connectors are limited to two USB 3.0 ports plus a GbE Ethernet port, a microUSB connector that serves as a power port, and there’s an antenna along with a microSD card slot. Last but not least, there’s a power button, a 3.5mm audio jack and a Kensington slot.",
    "All in all, it is a very solid, sturdy PC that will take more than a few knocks; just make sure that these knocks don’t happen anywhere near the HDMI port.",
    "Our review sample of the Access3 was powered by an Intel Celeron J4105 CPU which is a new addition to the Azulle range. This is a desktop processor and with a TDP of 10W, it dissipates nearly 60% more heat than the N3450, for example. A higher TDP can be easily explained by the higher base frequency (1.5GHz) from the four cores and a bigger cache (4MB).",
    "There was also 4GB of system memory and 32GB of storage, the bulk of it being already occupied by Windows 10. Sadly this might prove to be problematic in the future with operating system updates likely to demand more storage, which makes the current storage setup entirely ill-suited. As expected, it offers 802.11ac Wi-Fi courtesy of an Intel 3165 chip.",
    "When the Azulle Access3 Mini PC is connected to the mains, a red light comes on, and it turns blue when you press the power button. The device runs Windows 10 Pro but can be configured with Windows 10 IoT Enterprise edition.",
    "As for performance, it delivered some solid numbers, far ahead of the previous generation and the usual batch of older Atom CPUs that are normally used in HDMI PC sticks.",
    "The processor is about as fast as a Celeron N4100, which has a lower power consumption. Both cost the same but while the J4105 has a much higher base frequency, it also has a higher TDP. Our guess is that the N4100 – which are popular with laptop and tablet vendors – are thin on the ground currently due to an ongoing Intel processor shortage.",
    "Storage performance on the other hand turned out to be sub-par. A combination of slower eMMC storage and only having a small amount of free space meant that benchmark results were amongst the worst we’ve seen on a mini PC.",
    "Note that you should, in theory, be able to power the device using a powerful portable battery charger: one that can deliver 3A per port. We haven’t tested this but there’s no reason why it shouldn’t work.",
    "If you are specifically looking for a high-performance HDMI PC stick, there’s almost no competition around, with one exception.",
    "The CS525 is Intel’s latest iteration of the Compute Stick, and it also happens to be the most powerful stick around, being equipped with a Core m5-6Y57 CPU. At over $480 it is far more expensive than the Access3, especially as it doesn’t come with an operating system. But with vPro compatibility and a TPM 2.0 security chip, the CS525 ticks the right boxes for those looking for a more capable PC stick.",
    "What you do find is that there are plenty of HDMI sticks based on much older hardware (like the three-year old Intel Atom x5-Z8350 processor) with as little memory and storage as the vendors can get away with (usually 2GB RAM and 32GB storage). Do not fall into these cost-saving traps as you’ll likely end up effectively paying in other ways, such as lost productivity.",
    "Generally speaking, though, you will find a wealth of mini PCs, many with VESA mounts, that you can buy for around $200 with more memory and better performance. The Beelink J45 (Pentium J4205/4GB/128GB for $200), the Chuwi GBox (N4100/4GB/64GB for $200), the Kodlix GN41 (N4100/8GB/64GB for $230), the Acute Angle PC (N3450/8GB/192GB for $200) or the Alfawise T1 (N4100/4GB/64GB for $187).",
    "How good is the Access3? Before asking that, you should ask yourself whether your business really needs a PC in an HDMI stick format. We have yet to find a compelling reason to use one of these and would generally suggest that you stay away from them for a number of practical reasons.",
    "Those reasons include the HDMI cable or the power lead not being long enough, and also the device is often left dangling in the air as there are no VESA mounts. Furthermore, there are no expansion capabilities, the HDMI stick form factor is not stable – it will move with the slightest nudge – and we could go on with other niggles."
  ],
  "headers": {
    "2": "Design",
    "9": "Specifications",
    "11": "Usage and performance",
    "16": "The competition",
    "20": "Business take"
  },
  "links": {
    "Compute Stick": "https://www.techradar.com/reviews/pc-mac/intel-compute-stick-1292183/review",
    "Archos": "https://www.techradar.com/news/computing/pc/this-63-windows-10-pc-is-barely-bigger-than-a-pack-of-gum-1297810",
    "Asus": "https://www.techradar.com/reviews/pc-mac/asus-vivostick-1303340/review",
    "Hannspree": "https://www.techradar.com/news/computing/pc/pocket-sized-pc-on-a-stick-puts-windows-8-1-on-your-tv-or-monitor-1281464",
    "Dell": "https://www.techradar.com/news/the-best-dell-laptops",
    "CS525": "https://www.insight.com/en_US/buy/product/BLKSTK2MV64CC/INTEL/BLKSTK2MV64CC/Intel-Compute-Stick-STK2mv64CC--stick--Core-m5-6Y57-16-GHz--4-GB--64-GB/",
    "Beelink J45": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-7128151064587440000&p=https%3A%2F%2Fwww.gearbest.com%2Fmini-pc%2Fpp_009214097533.html%3Fwid%3D1433363#goodsDetail",
    "Chuwi GBox": "https://www.techradar.com/reviews/chuwi-gbox",
    "Kodlix GN41": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-1375837289694577200&p=https%3A%2F%2Fwww.gearbest.com%2Fmini-pc%2Fpp_009429314152.html%3Fwid%3D1433363",
    "Acute Angle PC": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-9149862000287101000&p=https%3A%2F%2Fwww.gearbest.com%2Fmini-pc%2Fpp_009597087471.html%3Fwid%3D1433363",
    "Alfawise T1": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-1299325339779638000&p=https%3A%2F%2Fwww.gearbest.com%2Fmini-pc%2Fpp_1698829.html%3Fwid%3D1527929"
  }
}