{
  "source": "https://www.techradar.com/reviews/vizio-m-series-quantum-m658-g1",
  "title": "Vizio M-Series Quantum (M658-G1) review",
  "category": "televisions",
  "updated": "2019-09-27T17:38:46Z",
  "author": "christian-de-looper",
  "summary": "The Vizio M-Series delivers quantum dot tech at an affordable price",
  "verdict": "The Vizio M-Series Quantum TV offers an excellent image quality that leverages quantum dot technology at a relatively affordable price. It’s not perfect – but in this price range, it comes pretty darn close.",
  "pros": [
    "Great image quality",
    "Excellent HDR performance",
    "Lots of smart home integration",
    "Sound is good"
  ],
  "cons": [
    "Poor upscaling",
    "Remote design is old"
  ],
  "article": [
    "Samsung pioneered the use of quantum dots in its QLED TVs, but Vizio has now adopted the tech with open arms. Last year, the company launched the first P-Series Quantum and now it’s expanding the arguably groundbreaking tech to even more TVs, in even more price ranges. Enter the Vizio M-Series Quantum.",
    "The Vizio M-Series Quantum brings quantum dot tech to the midrange, coming in at an affordable $800 for the highest end model, and getting even cheaper if you’re happy with a smaller TV or one with slightly fewer features. But in a world of Hisense ULED TVs and ultra-affordable TCL offerings, the midrange TV market is seriously heating up. So is the Vizio M-Series Quantum worth the cash? Absolutely.",
    "The Vizio M-Series Quantum comes in a few different sizes, all of which are available to buy right now. Here we’re reviewing the 65-inch model (M658-G1 that costs $799), but it’s available in a 55-inch (M558-G1, $599), 50-inch (M507-G1, $398), and a much-smaller 43-inch model (M437-G0, $349), too.",
    "It’s important to note that not all models in the Vizio M-Series Quantum are created equal: there are multiple models with similar names that have different specs.",
    "There’s another 65-inch M-Series Quantum with only 20 dimming zones and 400 nits brightness called the M657-G0 which is listed at the same price as this model, and if you’re buying a 55-inch model, get the one with 90 dimming zones and 600 nits brightness not the model with 16 dimming zones and 400 nits brightness. To make things easier, check the model number – and make sure it ends with G1, not G0.",
    "Vizio TVs generally aren’t the cutting edge of TV design, but they still look great: The Vizio M-Series Quantum offers a sleek and stylish build that should look great on any TV stand or entertainment center. There are super thin bezels around the edges with a slightly thicker bezel on the bottom, but you’ll hardly notice the thicker bottom bezel. The TV comes with strong metal legs that are nice and thin, which also helps give the TV a generally premium feel.",
    "On the back of the TV, you’ll get all your ports and connectivity. There are a total of four HDMI ports, including one that supports HDMI ARC, as well as an ethernet port, USB port, optical digital audio output, and stereo analog audio output. It’s a nice selection of ports, however it’s important to note that the TV doesn’t support HDMI 2.1, so you won’t get features like variable refresh rate. It’s not a big deal, especially for a TV in this price range, but still something to note.",
    "The included remote is fine, but in an era of super-simple remotes like the Apple TV 4K remote and the Roku remote that comes with every single Roku TV, it’s starting to look a little dated. On the remote, you’ll get six quick-access buttons for apps like Netflix and Amazon Prime, along with an input control, menu button, and so on. There are also channel buttons and a directional pad. Safe to say, you’ll likely find it easy to control the TV -- though it might take a few minutes to get used to the range of buttons on offer by the remote.",
    "Design TL;DR: The Vizio M-Series Quantum is modern-looking and classy. The remote may not be the most up-to-date, but it gets the job done, and it’s not totally ugly.",
    "The Vizio M-Series Quantum features Vizio’s SmartCast 3.0, and while it certainly gets the job done, and has a ton of super smart features, it’s not the most intuitive interface out there. It certainly isn’t as fast or as robust as the likes of Roku or Apple’s tvOS, but it's not the worst TV operating system, either.",
    "SmartCast is aimed at combining access to streaming apps with services like AirPlay and Google Cast. It’s faster than it has been in the past, but it still takes a few seconds to load and switch between items on the main interface.",
    "Said interface generally prioritizes content that it thinks you might be interested in, pulled largely from Vizio’s own content offerings. There’s also a row of streaming apps, and while not every single app is there, all the main ones are – including YouTube, which was briefly missing from SmartCast earlier this year.",
    "SmartCast also gives you access to Vizio’s WatchFree, which is basically a free live TV streaming app. It’s a nice touch, and while it doesn’t include all your favorite channels, you might find a couple diamonds in the rough. Plus, it’s free – so it’s hard to complain.",
    "Perhaps the best thing about SmartCast, however, is how many smart features it offers. These days, not only does SmartCast support Google Cast, but it also offers AirPlay 2, can be controlled with Google Assistant or Amazon Alexa, and can even integrate with HomeKit. HomeKit support may not be that helpful for everyone, but for HomeKit users it's awesome to be able to integrate the TV with smart home automations and switch it on with your phone.",
    "Smart TV TL;DR: Generally speaking, SmartCast is fine, but hopefully Vizio will continue refining it over time. We love how many smart home features have been added to the system, but now that they’re there it’s time for the company to focus on making it a little more intuitive, and a lot more responsive.",
    "Vizio hasn’t always been great at upscaling HD and SDR content, but it has gotten better over the past year or so. To that end HD and SDR performance is actually pretty good on the M-Series Quantum, though it still lags a little behind its more expensive competitors.",
    "For the most part, upscaled HD content looks good on this 4K panel, and even SDR content could be optimized for natural-looking colors and a bright image. HD content definitely didn’t look as impressive as native 4K/HDR content, but, for the most part, you’ll still enjoy your older TV shows and movies distraction-free.",
    "That said, there were some issues. For example, in darker scenes there was noticeable blooming, while at times, and at closer distances, there’s still quite a bit of graininess. During the review of this TV I just happened to be on my second watch-through of Parks and Recreation and found that in some night scenes blooming in the sky was distractive. That wasn’t always true – the TV did pretty well in bright scenes – but you may still notice some issues with clarity when it comes to HD/SDR content.",
    "Vizio has stepped things up when it comes to the specs on the M-Series Quantum. The 65-inch model we reviewed offered an impressive 90 local dimming zones and a brightness of up to 600 nits – and both of those things are far above average for a TV in this price range. Sure, a brighter image and more dimming zones don’t necessarily make for a better image quality, but they certainly can help. Vizio is also including Quantum Dot tech in these mid range TVs – which in theory, should help make for more vivid colors and a better overall image.",
    "Watching 4K HDR content is actually very enjoyable. The TV supports both HDR10 and Dolby Vision, and as a result, content like David Attenborough’s Planet Earth II on Netflix looks great. Colors and natural and defined, and there’s plenty of brightness to make for a ton of contrast. The local dimming helps too. The TV doesn’t quite approach OLED levels of black all the time, but it does at least some of the time thanks to local dimming.",
    "There are a number of different viewing modes on offer, though some are better than others. By default, the TV is set to Vivid, but we found that Vivid is a little over the top in terms of making colors look a little washed out and unnatural. We ended up setting the display to the Standard setting most of the time. At times, the Calibrated mode looked great too.",
    "The TV comes with motion smoothing, but you can either turn it on or off – however you can’t set it to different levels of motion smoothing. The panel itself supports 60Hz video, so the motion smoothing isn’t quite as effective as it would be on a TV with a 120Hz panel, but that might be a good thing for some. (If you’re looking for the soap opera effect, it might be worth looking into the higher-end P-Series Quantum, which offers a 120Hz panel.) That said, even with the slower 60Hz display, the TV was able to keep up with fast-moving scenes.",
    "Gaming with the TV was a pleasure too. While I wasn’t able to test out full 4K gaming given the fact that I only have a PS4 (not Pro) and a Switch, the TV was still very responsive and content consistently looked great.",
    "The speakers on the Vizio M-Series Quantum are fine, but they’re definitely not as high-quality as the picture is: The TV offers two 20 Watt speakers, and they actually sounded better than we expected. Generally built-in speakers are less than impressive, but these speakers got nice and loud, with at least some low-end. Not a lot, but some.",
    "Mid range was fine, and there wasn’t a ton of detail in the high end, but again some of it was there. The speakers did clip at times, especially at louder volumes.",
    "Generally speaking, even a relatively inexpensive pair of stereo speakers will sound better than the speakers built into the TV. If, however, your budget is capped out after buying the TV, the speakers will be fine.",
    "Vizio continues its winning streak with the Vizio M-Series Quantum. The TV may not offer all the features as the P-Series Quantum, but it still offers an excellent image quality, some super smart features, and decent audio for a TV’s built-in speakers.",
    "In fact, we would argue that the TV is arguably the best in its price range. It offers a better image quality and more features than offerings like the TCL 6-Series (which still offer excellent value for money) but if you’re looking for an excellent TV in the sub-$800 price range, then the Vizio M-Series Quantum is the way to go."
  ],
  "headers": {
    "2": "Vizio M-Series Quantum price and release date",
    "5": "Design",
    "9": "Smart TV (SmartCast 3.0)",
    "15": "HD/SDR Performance",
    "18": "4K/HDR Performance",
    "23": "Sound",
    "26": "Final verdict"
  },
  "links": {
    "QLED TVs": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "P-Series Quantum": "https://www.techradar.com/reviews/vizio-p-series-quantum-pq65-f1",
    "HDMI ARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "Apple TV 4K": "https://www.techradar.com/reviews/apple-tv-4k"
  }
}