{
  "source": "https://www.techradar.com/reviews/alienware-pro-gaming-keyboard-aw768",
  "title": "Alienware Pro Gaming Keyboard AW768 review",
  "category": "computing",
  "updated": "2019-04-01T18:39:35Z",
  "author": "bill-thomas",
  "summary": "Out of this world",
  "verdict": "The Alienware Pro Gaming Keyboard AW768 manages to hit a fantastic price to performance ratio, with some odd design choices along the way.",
  "pros": [
    "Affordable",
    "Cherry MX Brown switches",
    "Looks great"
  ],
  "cons": [
    "Odd macro key placement",
    "No dedicated media buttons",
    "Plastic build"
  ],
  "article": [
    "Everyone knows about Alienware at this point. The Dell-owned company has made a name for itself throughout the years for making expensive, but gorgeous, gaming PCs like the Alienware Aurora R7. Of course, gaming PCs aren’t everything – so Alienware has stepped into the peripheral game with products like the Alienware Pro Gaming Keyboard AW768.",
    "Just as you would expect from a keyboard made by Alienware, it has an angular, futuristic design and is packed to the brim with RGB lighting. But, what’s more impressive is what’s under the hood here: Cherry MX Brown switches, a 1 millisecond (ms) polling rate and dedicated macro keys.",
    "That all sounds great, right? Well, for the most part it is, and it matches all of these great features with an attractive price that might make it one of the best gaming keyboards on the market – as long as you can put up with some of the minor quality of life issues.",
    "What might sound surprising to any old, jaded PC gamer out there is that the Alienware Gaming Pro AW768 is a surprisingly affordable gaming keyboard. You can get this keyboard for just $99 (£111, AU$184). For a fully mechanical keyboard from a brand like Alienware – that’ll likely blend in seamlessly with most gaming PCs – that’s a great deal.",
    "The bonus to hitting this price point for Alienware is that it automatically puts it in the same league as the Corsair K68 RGB – which lacks some of the features that the Alienware AW768 includes, like dedicated macro keys and a volume dial. However, the Alienware keyboard is not water resistant.",
    "There is one serious bugbear we have regarding the value of this device: the palm rest isn’t included in the package. If you prefer a palm rest for your keyboard, you’re looking at an extra $25 (£25, about AU$35). We think that’s an obscene amount of money to charge for a palm rest, and unfortunately it wasn’t included in the unit sent to us for review.",
    "When we first opened the Alienware Pro Gaming Keyboard’s package, we could have sworn that it was wrapped in a smooth, aluminum body – it was definitely hefty enough. However, the entire thing is constructed from plastic. Don’t go thinking this means it’s flimsy, though – there is no give to this keyboard, and it’s extremely sturdy. It just doesn’t feel as nice to the touch as it looks.",
    "The RGB lighting here is similarly deceiving. Rather than being able to customize the lighting however you wish, on a per-key basis, you’re instead given six zones, each representing a set of keys and/or ambient lights. This does prevent you from making your keyboard look god-awfully tacky, but we would have expected more customization from a company like Alienware. Sometimes, you just want to dive in and make something as absurd as possible, right?",
    "There is a collection of six macro keys on the left side of the keyboard, and while they’re certainly useful, we ended up unbinding all of the macros we set while gaming. This is because, in the heat of the moment, it’s extremely easy to reach over and hit the wrong key – setting off a macro when you really didn’t want to. We’re sure this is a problem that diminishes over time, just be prepared to pencil in some time to train your muscle memory.",
    "However, the media keys didn’t make a lot of sense to us. On the top right hand corner of the keyboard, there is a volume wheel that’s unnecessarily wide, with a mute key to the left of it. Now, we don’t know about you, but when we’re in the middle of a Civilization VI binge, we put on a playlist, and go to town. It would have been nice to have the media control buttons next to the volume wheel, instead of having to hit “Fn + F12” every time we wanted to skip a track.",
    "The Alienware AW768 is an undoubtedly beautiful gaming keyboard, it’s just that some of the design decisions don’t make a ton of sense to us.",
    "Luckily, the Alienware AW768 is a very competent keyboard, and is sure to please anyone looking for a comfortable gaming experience.",
    "Because it’s using Cherry MX Brown switches, the keyboard is great for pretty much everything you’re trying to do. Gaming and productivity work feel great in equal measure, and the noise is under control enough to use it at night without keeping the entire neighborhood awake.",
    "The best keyboard switches ultimately boil down to personal preference, and Cherry MX Brown switches are the best for beginners who don’t quite know what they’re looking for yet – much like Alienware’s gaming PCs.",
    "It’s great on paper, too – with 45g of actuation force, 2mm actuation distance and a 4mm travel, the keyboard is responsive and tactile, even if it may edge on the shallow side for some users.",
    "We, however, do most productivity work on a 2018 MacBook Pro, so there was a significant learning curve. However, once we got into the groove of things, it took little time to get back to our normal typing speed. Given the vast difference between these keyboards, this only speaks to the benefit of the Alienware AW768.",
    "In games, though, these switches are a dream. We’ve been in a bit of a nostalgic mood these past few weeks, and are replaying Deus Ex: Human Revolution. And, while it’s not a competitive title like Overwatch, the game plays like a dream: the switches feel just right, and kept us alive during some frustratingly difficult boss battles.",
    "On top of it all, this keyboard should last you a long while: the keys are rated to last for up to 50 million keystrokes, which will take an unbelievably long time to reach. When it comes to raw performance per dollar, the Alienware AW768 is a compelling gaming keyboard.",
    "The Alienware Pro Gaming Keyboard AW768 is a fine keyboard for the money – for a hundred bucks, you’re getting reliable performance and attractive aesthetics with only a few quality of life compromises.",
    "If you’re an Alienware fan, and you’ve already splurged on one of its gaming PCs, it’s easy to recommend this gaming keyboard. And, even if you’re not, you could do far worse for the money – there are plenty of ‘mecha-mechanical’ keyboards out there that are much worse value propositions. We’re just surprised that Alienware put out a keyboard this good at this price point – it’s a company known to put a premium on its brand name.",
    "If you’re looking for one of the best gaming keyboards that somehow manages to combine aesthetics, performance and value, you’re going to have a hard time finding a better gaming keyboard than the Alienware AW768. That alone should be enough to convince a good deal of users."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "11": "Performance",
    "18": "Final verdict"
  },
  "links": {
    "gaming PCs": "https://www.techradar.com/news/the-best-gaming-pc",
    "Alienware Aurora R7": "https://www.techradar.com/reviews/alienware-aurora-r7",
    "best gaming keyboards": "https://www.techradar.com/news/gaming/10-best-gaming-keyboards-1295703",
    "Corsair K68 RGB": "https://www.techradar.com/reviews/corsair-k68-rgb",
    "2018 MacBook Pro": "https://www.techradar.com/reviews/macbook-pro"
  }
}