{
  "source": "https://www.techradar.com/reviews/xiaomi-redmi-note-7",
  "title": "Xiaomi Redmi Note 7 review",
  "category": "phones",
  "updated": "2019-05-27T16:00:56Z",
  "author": "sean-cameron",
  "summary": "A top phone at a low price",
  "verdict": "With great battery life, a good screen, a decent camera and a powerful chipset, the Redmi Note 7 is a great budget smartphone. The heavy MIUI software skin and lack of NFC prevent it from being an instant classic however.",
  "pros": [
    "Stellar battery life",
    "Strong performance",
    "Vibrant, big screen"
  ],
  "cons": [
    "Camera over-promises, under-delivers",
    "Overblown software",
    "Slightly dim screen"
  ],
  "article": [
    "If 2018 was the year of the notch, 2019 is the year of the 48MP smartphone. From Honor to OnePlus - it seems that every manufacturer is seeking to cash in on the trend.",
    "Xiaomi has certainly opted not to be left behind, releasing multiple different devices sporting an inflated megapixel count. Of these, the Redmi Note 7, its budget champion, is the cheapest.",
    "But more than a camera, it also comes with an array of numbers and acronyms picked to win any specification war at the price point. That is to say, it arrives with a 4,000mAh battery, an octa-core Snapdragon 660 chipset, a glass rear, a bright 1080p screen with a stretched aspect ratio and a trendy teardrop notch.",
    "For under £200 (roughly $260/AU$370), it certainly does seem to be a steal, but with a host of manufacturers competing in this hotly sought area, does the Redmi Note 7 do enough to cement its place at the top?",
    "Currently in the UK, the 3GB/32GB variant of the Redmi Note 7 is available directly from Xiaomi for £179 (around $230/AU$330). No availability has been confirmed for the US, or for Australia.",
    "Global versions of the device are available from a number of different vendors as an import, often for a lot less, but carrying the obvious dangers of no warranty, and with the possibility that customs charges may be applied.",
    "It must be said again, the Redmi Note 7 is a collection of megapixels with a phone attached. Hidden within its rear camera housing these sit, in theory gathering buckets of data. In the day to day, the camera does function a little differently - instead gathering information from four pixels at a time and combining them.",
    "This means that despite the jaw-dropping megapixel count, image output is generally limited to 12MP, but benefits accordingly from improved dynamic range and low-light performance.",
    "Powering all of this is the Snapdragon 660, the same octa-core chipset powering the likes of the Nokia 7 Plus.",
    "Built on a 14nm fabrication process, this offers improved heat management, performance and power efficiency compared to older chips, and the likes of the Snapdragon 636 in the Redmi Note 6 Pro. The processor is backed up with either 3 or 4GB of RAM.",
    "In addition a powerful chipset and camera, the Redmi Note 7 also benefits from an almost all glass build. Though it sports plastic sides, it has a toughened glass rear to add a premium feel to proceedings, though it isn’t quite as striking as the likes of the Honor 10.",
    "However, there is no NFC, which will be a deal-breaker for those who like to make contactless payments with their phone.",
    "From the front, the Redmi Note 7 is every inch a modern smartphone. Sporting an insignificant teardrop notch, the display covers almost everything, really giving that immersive experience. And at 6.3 inches, it is a large panel, though it doesn’t really feel it due to the slim body.",
    "The sides of the device are made from a glossy plastic which isn’t quite as premium as the likes of the stainless steel rails on the iPhone XS, but still maintains a relatively durable feel. One small concern is the fact that the plastic is glossy, meaning it will pick up scratches as though they’re going out of style without the included TPU case.",
    "Turning to the rear, the situation is once again a full sheet of glass. While it does feel nice in the hand, the same concerns around durability once again apply.",
    "That's especially true as this is a device with a death wish. No matter the surface or the incline, the Redmi Note 7 will find a way to slide off and plummet towards the floor.",
    "At 186g, it certainly isn’t an insubstantial device, however due to the light materials and the slim nature of the handset, it isn’t heavy in the hand and still delivers a nice heft that cheaper devices can sometimes lack.",
    "In all, this is a well-built handset which follows current trends to a T, if not setting any new ones itself.",
    "At 6.3 inches, there is little else to notice on the Redmi Note 7 at first glance other than its massive screen.",
    "With only a small notch cutting in, this is a panel made for watching videos and consuming content. At 1080 x 2340, it is also sharp enough to please all but the most ardent of pixel peepers while also offering a resulting bump in battery life over QHD+ phones.",
    "In general use, we found that while the screen has no major flaws, it also doesn't really stand out.",
    "Although the brightness does go high enough for most situations, a direct hit from the summer sun will see legibility vanish. And while it is possible to tune colors mostly to your liking using the screen calibration tool, out of the box a strong blue cast is obvious in the whites.",
    "Regardless, viewing angles are good - in all this is a screen which fits the price point exactly and is what one might expect. What that means to the average consumer will depend on their expectations, but for most it is likely to be more than enough."
  ],
  "headers": {
    "4": "Xiaomi Redmi Note 7 price and availability",
    "6": "Key features",
    "12": "Design",
    "18": "Screen"
  },
  "links": {
    "Nokia 7 Plus": "https://www.techradar.com/reviews/nokia-7-plus-review",
    "Redmi Note 6 Pro": "https://www.techradar.com/reviews/xiaomi-redmi-note-6-pro",
    "Honor 10": "https://www.techradar.com/reviews/honor-10-review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review"
  }
}