{
  "source": "https://www.techradar.com/reviews/cloudberry-backup",
  "title": "CloudBerry Backup review",
  "category": "computing",
  "updated": "2019-03-18T09:00:35Z",
  "author": "mark-pickavance",
  "summary": "Full of fruity backup goodness",
  "verdict": "Local, cloud, hybrid backups of files or system images, CloudBerry ticks almost all the boxes. While it doesn’t support mobile devices, Cloudberry is a comprehensive solution for securing desktop and servers alike.",
  "pros": [
    "Local, cloud and Hybrid Backup",
    "Windows, Mac, Linux and VM",
    "Bare metal restoration",
    "Can secure MS SQL Server and MS Exchange"
  ],
  "cons": [
    "No mobile app"
  ],
  "article": [
    "Backing up a desktop computer can be a fraught exercise. Although, it’s much less stressful than having a hardware failure that results in data loss.",
    "Part of the issue is that the Windows 10 PC doesn’t come with a fully featured tool to secure the data and the operating system or restore either easily in the event of a disaster.",
    "Addressing this issue are plenty of third-party backup tools that can make copies of files to external storage, network drives or into the cloud.",
    "However, there are very few applications that can do what CloudBerry Backup offers in a single package.",
    "The quoted price for a single computer is $49.99 as a one-time fee for a Windows desktop PC and a maximum of 5TB of storage used. The Windows Server license is $119.99 and has a 1TB storage limit.",
    "If you want to secure SQL or Exchange server fees of $149.99 and $229.99 per machine is levied respectively, or you can have an Ultimate edition that covers desktop, server, Exchange and SQL for $299.99. And, that version has no limits on storage used, if you have a large cloud storage facility.",
    "The cheapest version if that offered on the Apple Mac and Linux (Ubuntu, Debian, Fedora, Red Hat, CentOS or Suse) systems, as it costs just $29.99.",
    "For those wanting to secure VMware or Hyper-V virtual machines pay $299.99.",
    "All the CloudBerry products have a 15-day free trial enabling testing without obligation.",
    "And, for home users, there is an entirely free version that doesn’t offer system imagining, but could be very useful to many people.",
    "Detailing the features of CloudBerry backup is no easy task, as it slices and dices the job of securing files in so many ways.",
    "The first choice it presents you is what type of backup you want, with the options (if you have the licenses) to backup Files, Image-Based, MS SQL Server or MS Exchange.",
    "Once you’ve chosen, you then get to decide is it a local or cloud backup, or a hybrid combination.",
    "Hybrid is the smart choice if you have an external drive or NAS, as you have a single backup that makes two copies, one being on the cloud.",
    "Destinations for the backup can be a local file system or the popular choices of Amazon S3, Amazon Glacier, Azure, Backblaze B2, Google Cloud or OpenStack.",
    "These aren’t all the cloud choices, just the ones it puts at the top of the list.",
    "CloudBerry supports another 52 services currently, including Wasabi, Google Drive, Azure Files, FTP, Cisco, HP Cloud, Oracle Cloud and Rackspace, to mention just a few.",
    "In short, unless you wrote your own Cloud storage facility, CloudBerry will probably work with the one you are currently using.",
    "The files backed up can either be placed as is, on the server in a specific folder where they can be accessed freely. Or, they can go into an encrypted volume that can only be accessed through CloudBerry, and this option also supports file versioning and will also carry NTFS permissions into the backup.",
    "Should you be working collaboratively or have files open when the backup runs, you can force VSS (Volume Shadow Copy Service) to handle that scenario for you.",
    "Backups can have a global retention policy or a per-backup one, with the option never to delete files irrespective of what happens to them on the computer, or after a grace period defined by you.",
    "File backups can be scheduled, real-time or manually executed, and you can pause the backup for periods if that suits you.",
    "And, these are just the options for file backups, as you can also image the entire machine, and CloudBerry will create a USB key that can be used to restore the computer if the internal storage is destroyed or stolen.",
    "Normally, at this point of the review, we’d mention that product ‘B’, does something that CloudBerry doesn’t or there is an obvious missing feature or option. But frankly, it is hard to come up with anything here.",
    "We would have liked to have seen a companion mobile app, although if you use a mobile and sync into the cloud, you can automate the movement of that elsewhere using this software.",
    "We’ve also seen other complain that CloudBerry is complex, which by necessity it is in places. However, if you want this level of functionality with all the options, then you will need to answer numerous questions to create exactly the backup you need.",
    "Once you’ve created a few backup plans, it becomes very straightforward, and you can easily edit existing ones if they need to be tweaked.",
    "The CloudBerry solution is as secure as you want to make it.",
    "You can rely on the security of the cloud service where the backup will reside to keep out the unwelcome, or you can encrypt using AES 256-bit encryption using keys that you keep and maintain.",
    "Unless you use the same password for everything, the chance of anyone guessing both the cloud service login and the one for the CloudBerry backup is remote, although not impossible.",
    "How fast this works in both backing up and restoring is mostly dependent on the broadband bandwidth available and that available at the target cloud storage facility.",
    "Typically, when you first create a multi-gigabyte backup, it will run for some considerable time to secure all the files, possibly overnight.",
    "Once over that hurdle, the backup process is much slicker, as it only moves the new files out to the storage when it runs. As a policy, it might be best to create a backup that runs manually at first and then edit it to real-time going forwards.",
    "If a real-time backup slows down the system, then hourly ones are a good alternative that should reduce the overhead.",
    "What’s important to realise is that this service isn’t meant to sync machines, it is designed to be a backup, and entirely focused on that one objective.",
    "The price of this product isn’t a huge factor, because depending on how much data you have the bigger cost is going to be the cloud storage bill in providing a safe place for it.",
    "Unless you intend to image all your machines combining the desktop product with a 1TB cloud drive from Microsoft or Google provides an excellent means to secure your files for a modest initial outlay and monthly subscription.",
    "For those looking for Server solutions, combining this with an inexpensive S3 service could secure terabytes for only a few dollars a month, and this software adds deleted file retention and versioning to the security of backing up everything.",
    "Overall, CloudBerry is right up there with Backblaze as one of the backup tools that all those responsible for securing the contents of computers should try at least once.",
    "Most IT professionals won’t find it daunting or complex, and they’ll be able to get the most out of their cloud storage service to deliver a robust disaster recovery plan using it."
  ],
  "headers": {
    "4": "Pricing",
    "10": "Features",
    "27": "Security",
    "30": "Performance",
    "35": "Final verdict"
  },
  "links": {
    "backup tools": "https://www.techradar.com/best/best-cloud-backup",
    "Windows desktop PC": "https://www.cloudberrylab.com/backup/windows.aspx",
    "Windows Server license": "https://www.cloudberrylab.com/backup/windows/server.aspx",
    "SQL": "https://www.cloudberrylab.com/backup/windows/sql-server.aspx",
    "Exchange server": "https://www.cloudberrylab.com/backup/windows/exchange.aspx",
    "Ultimate edition": "https://www.cloudberrylab.com/backup/windows/ultimate.aspx",
    "Apple Mac": "https://www.cloudberrylab.com/backup/linux/ubuntu.aspx",
    "Linux": "https://www.cloudberrylab.com/backup/linux/ubuntu.aspx",
    "VMware": "https://www.cloudberrylab.com/backup/vm/vmware.aspx",
    "Hyper-V": "https://www.cloudberrylab.com/backup/vm/hyper-v.aspx"
  }
}