{
  "source": "https://www.techradar.com/reviews/alfawise-x1-mini-dlp-portable-projector",
  "title": "Alfawise X1 Mini DLP portable projector review",
  "category": "computing",
  "updated": "2019-04-02T18:00:31Z",
  "author": "desire-athow",
  "summary": "This isn’t the smallest projector we’ve ever reviewed, but it’s damn close",
  "verdict": "A promising compact and affordable projector. It’s a shame that the Alfawise X1 doesn’t exactly deliver what we’d expect from it. It is noisy and lacks some important features. If you are looking for something basic, then add this to your shortlist. Otherwise, pay a bit extra to get something much better.",
  "pros": [
    "Integrated battery",
    "Affordable",
    "Tiny form factor"
  ],
  "cons": [
    "No keystone correction",
    "No Bluetooth",
    "Small speaker",
    "Quite a noisy fan"
  ],
  "article": [
    "Projectors usually make you think of massive boxes with humongous lenses, and a powerful, almost laser-like light emerging from them. That’s one end of the spectrum – on the other are tiny, almost toy-like models, called pico projectors like the MiNi Ray, the Aaxa M5 or the Sony MP-CD1. They swap performance (or display quality) for convenience and portability.",
    "The arrival of DLP (Digital Light Processing) has heralded a new era in the world of portable mini projectors, although we’re not yet at the MEMS level (as seen in the Voga V and the Blackview Max 1). Here’s another candidate, the Alfawise X1, which is one of the smallest commercial projectors on the market.",
    "Alfawise is a newcomer to TechRadar and also produces electric scooters, 3D printers and mini PCs.",
    "The Alfawise X1 is small, though not as small as the MiNi Ray, but compact enough to fit in a handbag or backpack. Presented as a small cube with 55mm edges and weighing a mere 161g, it’s hard to believe that this device packs a reasonably powerful connector with an integrated battery (albeit a small one).",
    "With a gunmetal finish and a metal chassis, it looks relatively upmarket. The projector lens and opening are located next to the Alfawise logo. A manual focus wheel is located nearby with four buttons on one side (power, volume up and down, and enter). On the other side are the LED status light, power connector, audio out and mini-HDMI with a large air opening and a microSD card reader.",
    "Flip the pico projector over and you will see a screw thread that fits the head of the small bundled toy-like stand; the latter lifts the device by about 21cm. Other accessories include a remote control, an HDMI converter, a power supply unit (5V,2A) plus a microHDMI-to-HDMI cable.",
    "If reviews have taught us one thing over the years, it’s that the laws of physics are immutable. The size of the X1 means that it can only do so much; it has a native resolution of 854 x 480 pixels, but can take resolution inputs of up to Full HD.",
    "It employs DLP technology rather than MEMS which means that it will need some active cooling – in the shape of a heatsink fan – to take care of heat dissipation. In use, the device was loud, with our sound meter registering peaks of 66dB when located just next to it. That’s somewhere between a vacuum cleaner and conversational speech from a meter away.",
    "A 700mW down-firing speaker provides the strict minimum in terms of audio. Don’t expect anything spectacular – there’s no Bluetooth support, so any standalone projection will likely be limited to a small crowd.",
    "We managed to get a 31cm screen diagonal from 33cm away, and generally, the ratio of screen diagonal to distance is roughly 1:1. Alfawise quotes a brightness of 100 Lumens with a 1000:1 contrast ratio which translates into decent, sharp pictures when viewed from nearby – but the image is murkier, more washed out, and dimmer, the brighter the room and the further away you are from the screen.",
    "The device supports a number of file formats and is compatible with SD cards up to 64GB in size. Bear in mind it doesn’t support videos with resolutions higher than Full HD and with Dolby audio encoding. Also, because of copyright issues, you won’t be able to run Netflix wirelessly with the device, as well. Alfawise claims that the X1 is compatible with the iPhone’s AirPlay which will allow for screen mirroring.",
    "As for the bundled battery, it is a 2500mAh model which should power the device for up to two hours depending on whether you’re connecting it directly via HDMI or using Wi-Fi.",
    "There are a number of pico projectors from companies you’ve likely never heard of, plus a few well-known brands.",
    "The AAXA P2-A is about the size of the X1 and is actually cheaper at $200. The brand is one of the better-known projector specialists having been reviewed on TechRadar before. It sports a fully working Android-based system (albeit a very old version) with a 1.8Ah battery and AV inputs.",
    "At just under $300 we have the Viewsonic M1, which is more expensive but capable of so much more. It has HD resolution plus an ingenious integrated stand that protects the projector lens when not in use. It sports a three-year warranty, better audio thanks to two Harman Kardon speakers, and uses a USB Type-C connector.",
    "For about the same amount of money, Anker proposes the Nebula Capsule, a pico projector about the size of a can of fizzy drink, with a dedicated app, omni-directional sound thanks to a 5W speaker, and Android 7.1. When not projecting content, you can even use it as a Bluetooth speaker.",
    "Last but not least, the $259 Optoma LV130 promises to deliver 300 Lumens of brightness in a pint-size box complete with a 6.7Ah battery. There’s no smart functionality, no app, and no remote control like some of its competitors. However, Optoma is a known quantity, being one of the better projector manufacturers out there.",
    "It’s difficult to identify exactly who the X1 will appeal to. Servicing the sort of headcount that the Alfawise device targets – a huddle of five people, for example – can be done with a laptop that has a decent display, unless you only have a smartphone at your disposal.",
    "The Alfawise X1 focuses on a very niche market where business users want to get an affordable portable projector that comes with its fair share of compromises. The pictures were decent in the dark, but struggled for clarity on a large projector screen in broad daylight (or a brightly lit room), which is where meetings will usually happen.",
    "If you bear all this in mind and aren’t fazed by the limitations of the X1, a purchase will get you a tiny projector with below average performance at a reasonable price. That’s not a terrible outcome, by any means, but we’d still suggest that you evaluate other pico projectors from the list above before buying the X1."
  ],
  "headers": {
    "3": "Design",
    "6": "In use",
    "12": "The competition",
    "17": "The business take"
  },
  "links": {
    "MiNi Ray": "https://www.techradar.com/reviews/pc-mac/monitors-and-projectors/data-projectors/mini-ray-projector-1317660/review",
    "Aaxa M5": "https://www.techradar.com/reviews/aaxa-m5-mini-projector",
    "Sony MP-CD1": "https://www.techradar.com/reviews/sony-mp-cd1-mobile-projector",
    "Voga V": "https://www.techradar.com/reviews/voga-v",
    "AAXA P2-A": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FAAXA-Android-Smart-Pico-Projector%2Fdp%2FB072QDGKLZ%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1221728659418305500-20",
    "Viewsonic M1": "https://www.whathifi.com/viewsonic/m1/review",
    "Nebula Capsule": "https://www.techradar.com/reviews/nebula-capsule-projector",
    "Optoma LV130": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07GY4G5N2%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3407366618685737500-20"
  }
}