{
  "source": "https://www.techradar.com/reviews/elephone-soldier-ruggedised-smartphone",
  "title": "Elephone Soldier ruggedised smartphone review",
  "category": "phones",
  "updated": "2019-08-22T08:59:17Z",
  "author": "desire-athow",
  "summary": "A device shrouded in mystery",
  "verdict": "The Elephone Soldier is the best mainstream ruggedised smartphone on the market and punches well above its weight. If you can live with its (minor) shortcomings, you can land yourself a real winner.",
  "pros": [
    "Absurdly cheap",
    "128GB storage",
    "A lot of unique features",
    "Standout features"
  ],
  "cons": [
    "Super high resolution is not put to use",
    "MicroUSB port",
    "Still on Android 8.0",
    "No NFC",
    "No documentation regarding the Pogo connector"
  ],
  "article": [
    "It is the first time that we’ve reviewed an Elephone smartphone and we couldn’t have chosen a better phone. The Soldier is the first ruggedised smartphone from the Chinese manufacturer and it comes with some unique features that not only add intrinsic value to the device but also make it stand out from the crowd of ruggedised smartphone we’ve seen lately.",
    "There’s something refreshing about the Soldier. Perhaps, it is its relative disregard of design conventions; it has rounded corners rather than the usual octagonal one. It has a hard plastic back rather than the soft rubbery one that we usually see elsewhere.",
    "Elsewhere there are elements that reminds us that this could be the Frankenstein of ruggedised smartphones. Red rubber parts to improve grip, an undocumented Pogo connector at the back, a rather (red) conspicuous SOS button located underneath the rear camera lens, a near unusuable hook-up design and a dedicated physical flashlight (with accompanying switch).",
    "The highlight though has to be the compass at the back that will work regardless of whether the phone is on or off. This is a phone Bear Grylls would have been proud of, especially with its IP68 rating.",
    "There’s a recessed fingerprint reader on the right hand side next to the power button and the volume rocker. On the left hand side is a customizable button and the SIM tray. The bottom edge contains a flap behind which you can find a microUSB port (rather than a Type C) and a 3.5mm audio connector.",
    "Other than the compass, the SOS button and the Pogo connector, the back contains a camera sensor, the ubiquitous LED flash and a speaker grill. Note the profusion of screws, a dozen in all on the edge. Other than a USB cable and a pin tray, there’s only an 18W (9V, 2A) power supply unit; no headphones supplied.",
    "Elephone opted for a three-year old Mediatek CPU, the X25 (MT6797T). a 10-core CPU that despite its high core count, didn’t really ignite our benchmark tests; more on that later.",
    "A standout feature is the display; with nearly 3.69 million pixels spread over 5.5-inch, it has one of the highest pixel densities we’ve seen on a ruggedised device.Its usefulness though is dubious given that this is primarily an out-and-about device that has more to gain from a bright(er) display when outdoors.",
    "There’s a 16-megapixel front facing camera and a 21-megapixel rear Sony sensor which are amongst the best - at least on paper - we’ve seen on a rugged smartphone. Cat-6 LTE and 802.11ac is on offer with Bluetooth 4.1; as for most other ruggedized smartphones, you can only run two SIM cards or one SIM card and a microSD card. Not all three concurrently. Last but not least, there’s an FM radio, NFC connectivity and a 5Ah battery to keep the smartphone running.",
    "Let’s cut to the chase, the Soldier’s performance is weaker than we were expecting but we can’t put our finger on why exactly. The CPU setup rather than the storage subsystem appears to be the culprit (although random write speeds were amongst the worst we’ve recorded to date). It might be down to the tri-core configuration setup.",
    "Another significant factor is the pixel resolution; at 2560 x 1440, the GPU of the Soldier needs to push 78% more pixels compared to a full HD model like the Cat S61 and more than 3x that of the Cubot Quest. What’s more, we’re unsure why Elephone though that option for more pixels would make the phone better.",
    "In fact, if performance is what you yearn for, it achieved the exact opposite based on the benchmarks.",
    "Also worth noting, the SIM tray was a bit of a pain to get out; you will need a pin to pull it. The phone tends to warm up as well under load, more than we were expecting. The IPS display is excellent in normal usage, vibrant colours, warm tones and viewing angles. Nothing too splashy or aggressive with the oomph of the extra pixels coming into play. Note that the system keys are capacitive buttons located outside of the usable display area.",
    "This Soldier runs on a heavily customized version of Android 8.0 with the latest security update from August 2018. Ouch. Don’t expect to have an update to Android 9.0 or 10.0 anytime soon; this is the bet you usually take with smaller Chinese smartphone vendors.",
    "There are few extraneous apps; other than the ubiquitous app toolbox that will supposedly appeal to DIYers and outdoor professionals, there’s hardly anything that needs to be uninstalled right away.",
    "The closest competitor to the Soldier is the Ulefone Armor 2 which retails for just under $200. It has more system memory (6GB) but half the storage (64GB). Its screen is smaller with a lower resolution and it rocks Android 7.0. Cameras and battery are inferior as well. It also sports a more industrial look compared to Elephone’s candidate.",
    "So here we have it, the first Elephone smartphone that we have reviewed. It is a decent, better-than-average, feature rich ruggedised smartphone, one that is surprisingly affordable and is probably the best mainstream ruggedised smartphone on the market.",
    "We urge Elephone to carry on innovating and introducing a refreshed version of the Soldier, with a newer processor, a screen with a lower resolution and a Type-C connector. It would also be great to find out, finally, why there is a Pogo connector at the back of the phone."
  ],
  "headers": {
    "1": "Design",
    "6": "Hardware",
    "9": "Performance and in use",
    "15": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "Cat S61": "https://www.techradar.com/reviews/cat-s61",
    "Cubot Quest": "https://www.techradar.com/reviews/cubot-quest-rugged-smartphone",
    "Ulefone Armor 2": "https://www.techradar.com/reviews/ulefone-armor-2"
  }
}