{
  "source": "https://www.techradar.com/reviews/motorola-one-action-review",
  "title": "Motorola One Action review",
  "category": "phones",
  "updated": "2019-09-04T14:32:28Z",
  "author": "jon-mundy",
  "summary": "Motorola calls Action on an affordable Android One phone",
  "verdict": "Like the Motorola One Vision immediately before it, the Motorola One Action is a strong and stylish Android One phone with exemplary poise and performance. Anyone on a strict budget looking to shoot lots of fluid video should take particular note.",
  "pros": [
    "Crisp Android One OS",
    "Strong performance",
    "Smooth, easy to shoot video"
  ],
  "cons": [
    "21:9 aspect ratio isn’t widely enough supported",
    "Camera isn’t phenomenal"
  ],
  "article": [
    "We’ve grown accustomed to the Moto G family dominating the budget smartphone market by now. But more recently, Motorola has introduced an intriguing second strain of classy-but-affordable handsets in the form of the Motorola One family.",
    "Earlier this year the Motorola One Vision allied advanced camera features to an attractive, elongated design and a pure version of Android 9 Pie. The results were rather impressive.",
    "Now the Motorola One Action is here with a broadly similar offering at a slightly lower price. This time, though, it’s more concerned with improving your videos than your everyday snaps.",
    "The Motorola One Action is available to buy in the UK and other parts of Europe right now. You’ll find it on sale from a variety of UK retailers, including Argos, John Lewis and Amazon at an RRP of £219 (about $265, AU$390).",
    "That’s £50 cheaper than the Motorola One Vision, and around the same price as the Moto G7.",
    "Over in the US the Motorola One Action won’t be available until October, while availability in Australia is yet to be confirmed.",
    "Just like the Motorola One Vision before it, the Motorola One Action packs its two headline features into its name.",
    "The first is the baseline feature for this entire family of devices: Android One. Google’s purebred strain of Android 9 Pie features none of the bloat of competing efforts from the likes of Huawei, Xiaomi and Samsung.",
    "Everything is crisp-edged and thematically consistent in a way that precious few custom UIs manage to be. The Settings menu, the app tray, the app folders and all of the UI elements - all use a single coherent design language originating from the creator of Android itself.",
    "That Google-spawned coherence extends to the Motorola One Action’s app offering. All the basics are handled by Google’s own peerless suite of apps, and there are no duplicates. Gmail handles email; Calendar deals with your schedule; Chrome is your only web browser. This really shouldn’t be a stand-out feature in 2019, but it’s crazy how many Android phones still get this fundamental part so wrong.",
    "We’ll delve more into the UI a little later, but all you need to know for now is that the Motorola One Vision feels as smooth, frictionless and downright classy as any other £200/$250(ish) smartphone - and a fair few more expensive phones at that. An awful lot of that comes down to Android One.",
    "If Android One is the baseline, then the true stand-out feature of the Motorola One Action lies in the ‘Action’ part of its name. It’s rare that we see a new phone doing interesting things with video recording, and rarer still in a budget phone. But that’s precisely what’s happening here.",
    "The Motorola One Action’s triple camera rather unusually incorporates a 16MP sensor that’s dedicated to video capture. Not only that, but it captures 117-degree footage, all while held in portrait orientation.",
    "To be clear, this means that you get ultra-wide 1080p horizontal/landscape footage while holding the phone normally. This latter point might not sound like a major change on paper, but in practice it makes filming feel far more secure.",
    "Holding your phone horizontally for stills is one thing - you’re actively trying to hold still in such situations after all. But filming is a far more active, kinetic affair that can often lead to slips and drops. With this simple 90-degree flip, you can hold onto the phone far more securely while panning or moving.",
    "The actual footage captured is very fluid too, with electronic stabilization smoothing out the bumps, and quad-pixel technology using a pixel-binning technique to maximize sharpness.",
    "The Motorola One Action and the Motorola One Vision aren’t just members of the same family - they’re practically twins.",
    "This is another long, thin device with a front-filling display at a healthy 84% screen to body ratio, punctured only by a punch-hole selfie camera. The rear of the device is a glossy plastic fingerprint magnet, with curved edges and a familiar lozenge-shaped camera module.",
    "You also get the same rear-mounted fingerprint sensor as the Vision, which neatly contains the Motorola symbol. It’s a speedy, reliable example of the form, too.",
    "When it comes to comparative dimensions, the Motorola One Action is half a millimeter thicker at 9.15mm and four grams lighter at 176g. Which really doesn’t prove significant in the hand.",
    "One interesting design difference between these two phones is that the Motorola One Action is only IPX2 water resistant compared to the One Vision’s IP52 rating.",
    "You’d think that the phone being targeted at the GoPro brigade would need to be a little more rugged, but the Vision is technically the more dust resistant. Neither of them is going to be able to fend off anything more than a light shower on the liquid resistance front.",
    "Thankfully, the Motorola One Action’s 6.3-inch display is just as decent as its older brother’s. It’s a 1080 x 2520 LCD, which allows for ample pixel density and strong peak brightness.",
    "Perhaps the standout feature of this screen is its length. With a 21:9 aspect ratio, it’s much taller than most phones, making it a little tricky to wield one-handed. It’s simply not possible to reach a good portion of the screen with the hand you’re holding it in.",
    "Still, the quality’s the thing here. It’s not like it’s unusual to find a strong screen at this price point any longer (see the Honor 20 Lite for proof), but the Motorola One Action certainly doesn’t let itself down."
  ],
  "headers": {
    "3": "Motorola One Action release date and price",
    "6": "Action movie star",
    "16": "Design and display"
  },
  "links": {
    "Motorola One Vision": "https://www.techradar.com/reviews/motorola-one-vision-review",
    "Moto G7": "https://www.techradar.com/reviews/moto-g7-review",
    "Honor 20 Lite": "https://www.techradar.com/reviews/honor-20-lite-review"
  }
}