{
  "source": "https://www.techradar.com/reviews/urbanears-ralis-portable-bluetooth-speaker-review",
  "title": "Urbanears Rålis portable bluetooth speaker review",
  "category": "audio-visual",
  "updated": "2019-08-29T17:57:26Z",
  "author": "tom-bedford",
  "summary": "A reliable speaker, if not exactly pocket-sized",
  "verdict": "The Urbanears Rålis is quite large – it’s not the kind of portable speaker you can throw in your bag or pocket – but big size means big power, and the impressive bass and battery life more than makes up for the extra heft.",
  "pros": [
    "Great sound quality",
    "Long-lasting battery",
    "Looks pretty good"
  ],
  "cons": [
    "Quite heavy",
    "Too big to transport in a bag",
    "Top buttons can be rather confusing"
  ],
  "article": [
    "Swedish brand Urbanears is expanding its audio reach: after a range of bluetooth headphones like the Plattan 2 and the multi-room Baggen speaker system, it has released its first portable Bluetooth speaker in the form of the Rålis.",
    "The Rålis has a handbag-like design, and it’s pretty big for a device you’re expected to take camping or to soundtrack your barbeque but it also has good enough specs to justify this – at least on paper.",
    "So how well does the Urbanears Rålis work as a portable Bluetooth speaker, and should you consider it over one of its many competitors? We set it up, lit the barbeque, and played some tunes to find out.",
    "You can pick up the Urbanears Rålis for $199.99 / £169.99. It’s not currently sold in Australia, but that roughly converts to AU$300;so when it does launch there, you’ll likely be able to pick it up for around this much.",
    "The speaker is available from Amazon, but you can also pick it up from the Urbanears website if you’d prefer.",
    "That means it’s available at roughly the same price tag as the JBL Charge 4, a comparable Bluetooth speaker that’s somewhat more portable but may not get you the same sound quality. There are other similar devices that are more affordable, though, like the UE Wonderboom 2 which is quite a bit cheaper.",
    "Urbanears is known for the ‘Scandi-chic’ design it employs in all of its products (if ‘Scandi-chic’ sounds like a daunting concept, just picture Ikea’s aesthetic and you’re pretty much there), and this is apparent in the monochromatic design of the Rålis.",
    "You can pick it up in red, gray, or blue variants (we tested the blue model for our review), and each one defines ‘minimalist design’.",
    "The Rålis is a box, which is a rather unflattering term for a good looking device, but it’s the most apt description. The box has rounded corners, and comes in dimensions of 195 x 138 x 184mm – it’s pretty big for a ‘portable’ speaker, and it’s rather heavy too at 2.8kg. The strap feels pretty robust though, so you never need worry about dropping it when carrying the speaker around.",
    "The speaker has tweeters on both its front and back, so we only call the latter the ‘back’ based on the presence of its array of ports – there’s a plug for the power, a 3.5mm jack so you can plug your smartphone or portable audio player in directly if you’d like, and a USB output that lets you charge your device from the Rålis.",
    "On one side of the Rålis you’ll find the power button and Bluetooth button, and on top there’s volume up, volume down, previous track, play, and next track buttons. The buttons don’t depress much, and there’s little to distinguish them save a small logo on the top of each, so if you’re using the speaker in the dark it can be a little hard to work out which button you’re trying to press.",
    "Something else worth mentioning? There’s a woofer on the back. That’s not to be taken for granted on a portable bluetooth speaker of this size, and it’s very appreciated – we’ll get into that in the ‘Performance’ section later.",
    "In terms of protection, the Rålis has IPX2, which protects it from water droplets at certain angles. That’s not exactly extensive coverage, and while it’ll save you from the first signs of rain, you better not get caught out in a storm with the speaker.",
    "Presumably some of the Urbanears Rålis large body is taken up by a battery, as Urbanears states the speaker will last for 20 hours of playback without charging. In our experience, we’d say that’s roughly right – there’s no power status bar so it’s hard to track power drain (which is likely a bit of a nuisance if you want to know how long you have left before the speaker runs out), but we got at least 18 hours playback without charging.",
    "Urbanears also states that it takes about two hours to charge up to full, and again this is hard to verify, but the Rålis certainly lasted a while after charging for a short while.",
    "The USB port on the back of the speaker lets you charge up any other devices, as long as you have a compatible cable, which makes the device very useful if you’re using it somewhere far away from civilization (i.e. exactly the kind of places you’d bring a portable speaker). It’s not hugely quick to charge, but it’s better than nothing.",
    "Connecting devices to the Rålis via Bluetooth was blissfully easy – all you need to do is turn your phone, laptop or tablet’s Bluetooth settings on and find the speaker. When some speakers or headphones need certain apps downloaded to pair, the simplicity here was much appreciated.",
    "You can connect up to three devices to the Rålis via Bluetooth at once, which means you don’t need to constantly turn off the connectivity on all your devices every time you want to play from one. This is certainly convenient, and it means multiple people can assume the role of DJ without also passing around one device.",
    "We did find, however, that this functionality has its drawbacks. When we were playing music on the speaker through our phone, and then started using a laptop (that was also connected) for other purposes, the phone playback would constantly stop. This was rather annoying, and we had to disconnect the laptop before the issue was resolved.",
    "The Urbanears Rålis has two 5W tweeters, one on either side, and a 10W woofer hidden on the back of the device. When we say ‘hidden’, we mean physically, because when you start to play music on the speaker you’ll notice it straight away.",
    "By that, we mean that bass played on the speakers is powerful, surprisingly so for a portable device. If you play music while it’s on a surface, you can sometimes feel the surface shake, and at high volumes you can feel it tremble even as you hold it.",
    "This makes it great for outdoor settings like campfires or parties, when you’ll want some loud booming music, and songs that rely on this kind of bass or drum line sound fantastic as a result. Bass is undoubtedly the strong point of the Rålis; when we played songs like These Days by Rudimental or Losing Streak by The Eels, the powerful bass emphasized some already great songs.",
    "Of course, not all songs need earth-shattering bass, and so the bass is in fact also the weakest aspect of the Rålis, as you can’t toggle it. When listening to Knocking at Your Door by O.A.R., the bass line drowned out many of the other parts, and the effect was most audible with classical music. In Dvorak’s Carnival Overture, the eclectic lower range in the opening section drowns out all the higher parts, and Aaron Copland’s Fanfare for the Common Man opens with percussion so loud and powerful it nearly gave us a heart attack.",
    "Another small issue with the bass is that, because the woofer is on one side, bass is audibly more powerful on this side than the other. The Rålis has tweeters on both sides, so music sounds great from any angle, but the bass is clearly more prominent if you’re facing the woofer.",
    "The dual-tweeter arrangement is definitely a good feature though, and it means you can place the Rålis just about anywhere and hear it perfectly, instead of having to crank up the volume.",
    "Treble sounds fine when it’s not being overshadowed by the bass, and in songs like Night Moves by Bob Seger you could hear every string of the guitar when it was strummed. The frequency range caps pretty high, at 20,000Hz, but you’re only going to be able to appreciate this when the high notes aren’t being drowned out by the bass.",
    "Overall, the Urbanears Rålis’ music quality was rather impressive, and if you like heavy bass, you’ll love the performance this speaker provides. We would have liked the option to dial it back somewhat, but this is still the best speaker from Urbanears so far.",
    "If there’s one word that’s most apt to describe the Urbanears Rålis, it’s ‘heavy’.",
    "Firstly, the speakers’ physical design was heavy. It’s a good-looking, minimalist piece of kit, and you’ll certainly look stylish carrying it to your barbeque, but you better not skip arm day if you’re planning to do that, and it’s so big that it pushes the definition of ‘portable’ speaker.",
    "The bass is even heavier though, and the music quality slants heavily towards lower frequencies. Overall performance doesn’t leave much to be desired, at least not for a speaker at this price tag, but if you’re not a fan of heavy bass in your music you definitely won’t like the Rålis.",
    "Overall, your impression of the speaker will depend on what you’re looking for – if you don’t mind the speaker’s bulk, or you love deeply bassy music, this’ll be perfect for you, but if you’re looking for something you can drop in your handbag, or that will let you enjoy the higher parts of your songs with clarity, you might want a different piece of kit."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "13": "Features",
    "19": "Performance",
    "27": "Verdict"
  },
  "links": {
    "Plattan 2": "https://www.techradar.com/reviews/urbanears-plattan-2-bluetooth-headphones",
    "Baggen": "https://www.techradar.com/reviews/urbanears-baggen-wireless-speaker",
    "portable Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FUrbanears-Ralis-Portable-Bluetooth-Speaker%2Fdp%2FB07QP4W2XP%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2454404309362115600-20",
    "Urbanears website": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-6616860104669563000/https://www.urbanears.com/us/en/ralis.html",
    "JBL Charge 4": "https://www.techradar.com/reviews/jbl-charge-4",
    "UE Wonderboom 2": "https://www.techradar.com/reviews/ultimate-ears-wonderboom-2"
  }
}