{
  "source": "https://www.techradar.com/reviews/acer-spin-5",
  "title": "Acer Spin 5 review",
  "category": "computing",
  "updated": "2019-07-18T20:17:29Z",
  "author": "jason-cipriani",
  "summary": "Mid-range is only a frame of mind name",
  "verdict": "At a mid-range price, it's easy not to expect much from the Spin 5, but that'd be wrong. The Spin 5 offers decent performance, design and battery life for the price.",
  "pros": [
    "Solid performance",
    "Decent battery life",
    "Build quality and design"
  ],
  "cons": [
    "Mediocre display",
    "Dull speakers"
  ],
  "article": [
    "Acer's Spin lineup of laptops spans across multiple categories and operating systems, with the Spin 5 claiming the mid-range Windows 10 laptop slot. With a total of four different screen orientations, the Spin 5 doubles as a tablet or a movie streaming screen just by rotating the display.",
    "Budding artists and note-takers can purchase the Acer Active Stylus separately, an AAA-battery powered pen for sketching and writing, for $49.99 (about £40, AU$70).",
    "The Acer Spin 5 looks appealing, and doesn't slouch when it comes to performance and battery life – but how does it compare to something like Lenovo's Flex 6 14 or Microsoft's Surface Book 2? Fairly well. Let's take a closer look.",
    "Acer sells the Spin 5 across the globe, with various models and configurations depending on your locale. In the US, the Spin 5 ranges in price from just under $700 to right at $1,200. The model listed here is priced at $799. The top-end model gets you an Intel Core i7-8565U, 16GB of memory and a 512GB SSD.",
    "We couldn't find the exact model Acer loaned us for testing outside of the US. In the UK, you'll pay £799 for a Spin 5 with an Intel Core i5-8250U, and the same memory and storage as the model we're testing. In Australia, you're looking at AU$1,799 for a Spin 5 with an Intel Core i7-8565U, 8GB of memory, and a 512GB SSD.",
    "We'd love to see Acer offer another model in the US and UK with a 512GB SSD, keeping the processor and memory the same as our review unit.",
    "At $799 (about £635, AU$1,135), you're getting a laptop with mid-range specs that compares favorably with the Flex 6 14 priced at $849 (about £640, AU$1,136). For a more powerful, and arguably better-designed convertible, the Surface Book 2 will set you back $1,499 (£1,499, about AU$2,600).",
    "The Spin 5's exterior isn't something that's going to attract a lot of attention, but it sure is svelte. The brushed metal on the lid and the silver bezels around the housing look sleek. Overall, the Spin 5 measures 12.8 x 8.9 x 0.6 inches and weighs 3.53 pounds. It's small enough to toss in a backpack or messenger bag and not weigh you down.",
    "There's a decent amount of ports on the Spin 5, going from HDMI, USB-C, and two USB 3.0 ports on the left to an SD card reader, headphone jack and a USB 2.0 port on the right.",
    "With the Spin 5 display's ability to rotate nearly 360-degrees, putting the power button next to the keyboard isn't the best place for it. Instead, there's a volume rocker and power button on the right side of the housing.",
    "A large trackpad is centered with the keyboard, meaning it's slightly off-center with the laptop's housing as a whole. There's a fingerprint reader in the top-left corner of the trackpad. We've bemoaned this sensor placement in the past, and while it's still not the ideal location, our fingers don’t encounter any interference when dragging files or moving around the trackpad. There's a smoothness to the trackpad that we appreciate, but we've struggled with the exact location of where the trackpad registers a right-click near the lower-right corner.",
    "The keyboard keys are evenly spaced and have just enough play in them to make an easy transition from, for example, Apple's wireless keyboard to the Spin 5.",
    "One of the most important aspects of any convertible laptops is its hinges. The hinges need to be sturdy and reliable, while also smooth and easy to manipulate. Adjusting the Spin 5's screen and rotating it from tent mode back to standard laptop orientation is seamless, and there's very little bounce or movement with the display when typing on the keyboard.",
    "The speakers are just below the display, sandwiched between the two hinges. There's plenty of volume, but the sound is easily distorted and hollow.",
    "We couldn't even get through a trailer for season three of Stranger Things without distortion with the Spin 5's volume set to 50%. Lower levels ease the distortion, but then you're left balancing volume level with ambient noise and distortion.",
    "It suffices to say that headphones are your best bet if you plan to watch video or listen to music on this laptop.",
    "Our lone complaint about the overall design is the size of the bezels surrounding the screen. With most laptops, including gaming laptops, now featuring bezels that take up very little space, it was jarring the first time we opened the Spin 5 and were greeted with thick black bars.",
    "The 13.3-inch multitouch display in the Spin 5 has an FHD resolution of 1,920 x 1,080 pixels. Color saturation and brightness are just fine in spite of the bezels, but where we think the display begins to fall short is in its clarity.",
    "When watching various YouTube videos we noticed blurriness, especially in fast-moving clips. The overall picture just isn't as crisp as we would like.",
    "Images Credit: TechRadar"
  ],
  "headers": {
    "3": "Price and availability",
    "7": "Design"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Lenovo's Flex 6 14": "https://www.techradar.com/reviews/lenovo-flex-6-14/2",
    "Microsoft's Surface Book 2": "https://www.techradar.com/reviews/microsoft-surface-book-2-13-inch",
    "£799": "https://www.awin1.com/awclick.php?awinmid=12590&awinaffid=103504&clickref=trd-us-1374687768549484000&p=https%3A%2F%2Fuk-store.acer.com%2Fspin-5-convertible-notebook-sp513-52n-grey-1",
    "AU$1,799": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7254350331484112000&xs=1&url=https%3A%2F%2Fwww.acer.com%2Fac%2Fen%2FAU%2Fcontent%2Fmodel%2FNX.H62SA.003&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Facer-spin-5"
  }
}