{
  "source": "https://www.techradar.com/reviews/asus-f1-projector",
  "title": "Asus F1 Projector review",
  "category": "audio-visual",
  "updated": "2019-08-02T14:55:01Z",
  "author": "nick-rego",
  "summary": "Petite powerhouse",
  "verdict": "For entertainment or gaming buffs, the Asus F1 projector is a good pick. Its compact size makes it easy to carry around for some co-op gaming or a spot of backyard cinema, without having to fiddle about with external speakers.",
  "pros": [
    "Great volume levels",
    "Very portable"
  ],
  "cons": [
    "Sticky onboard controls",
    "No Airplay support",
    "Expensive"
  ],
  "article": [
    "Projectors are always great to have at home, and certainly make you feel like you’ve got your own private cinema experience. What makes the Asus F1 projector extra-special is that you can set up that cinema experience in mere minutes – whether it’s in your living room or in someone’s backyard.",
    "This somewhat dainty projector may look like the runt of the litter, but it surprisingly does very well when it comes to entertainment and gaming. Throw in a set of great-sounding speakers, and you might never want to leave your house again.",
    "The Asus F1 projector is available at a price of $899 (AED 3,300 / £711 / AU$ 1,287), which in our opinion is a bit on the high end for a Full HD projector. For a little over $200 extra, you can splurge for a much brighter Full HD projector, or dip into your wallet for a 4K projector instead for that true home cinema experience.",
    "What makes the F1 immediately stand out is its design. The F1 looks a lot like an Asus Republic of Gamers product, with its sharp edges, glossy black finish, and trapezoid shape. There’s nothing on the box that tags it with the ROG brand, but in the US this product is definitely being marketed as being under the ROG umbrella.",
    "The top of the projector discreetly houses the projector’s controls, for when you don’t have the bundled remote with you.",
    "There are buttons for power, changing input source, adjusting keystone, and finally a small joystick for navigating through menu options. The joystick is a bit fiddly at times, and we found that occasionally we had to press down hard on it in order to register a command.",
    "At the back you’ve got your connectivity options, which include two HDMI ports, VGA, and a USB Type-A port for charging other devices. It would have been handy to include another USB port to read things off a USB drive directly, so that you don’t have to connect a PC or other device instead.",
    "There are two 3W stereo speakers and an 8W subwoofer built into the F1, along with Harmon Kardon audio technology. They’re surprisingly loud and more than capable of filling a medium-sized room, however we do recommend using a home theatre setup or soundbar if you want a proper audio experience.",
    "One feature we loved about the F1 is that it has a small camera hidden in the front, which it uses to automatically focus on the projected surface so you don’t spend ages fiddling about with a focus wheel. It works pretty well, and during most of our projection tests the F1 was able to automatically bring the image into focus in under 15 seconds, along with keystone correction.",
    "Finally at the bottom you have various mounting points to attach the F1 from a ceiling projector mount, or even hook it onto a sturdy camera tripod. There are also two narrow slots on each side which softly cycle through various RGB colors. We’re not quite clear why on earth Asus would want to include this in a projector as it’s both unnecessary and also not visible when the projector is ceiling-mounted. You can of course change the RGB lighting should you wish to, but we prefer to keep it turned off.",
    "There’s also a little flip stand that pops out from the bottom to position the projector at two different projection levels when it’s kept on a flat surface.",
    "For actual projection, the F1 does a fairly decent job in medium-lit rooms. We set it up in our boardroom which has a good amount of light streaming in, and the projected image was still bright enough to be seen clearly, including text.",
    "In a completely dark room the image quality improved massively, so despite the F1 churning out just 1200 lumens, it’ll be bright enough for most living rooms to project onto a blank wall.",
    "Sound from the internal speakers was loud enough to hear both vocals and music clearly, but this is only when the projector is placed in front of you. Should you choose to ceiling-mount the F1, you’ll have to figure out a better audio solution. But for a quick movie night at a friend’s place or spot of gaming action, you should be perfectly fine.",
    "Speaking of gaming, the F1 did surprisingly well when we connected it to a Nintendo Switch for a bit of Mario Kart fun. Colors were bright and crisp, and you can choose to project at Full HD at 60Hz, or at 720p for 120Hz. There’s decent performance on both modes, so whether you’re playing via a PC or console, you’ll get decent frame rates and little noticeable lag.",
    "The F1 also supports wireless projection via Android or Windows 10, but there’s no such luck for anyone on an iPhone or Mac. When paired with an Android smartphone the response time was fairly quick, and so was streaming content via YouTube. On Windows 10 however, there was a noticeable lag with video content, so this is best used for presentations only.",
    "What makes the Asus F1 Projector so likeable is its unique design, stellar sound, and decent image projection. Its setback is its price, which puts it as a more expensive Full HD projector than other contenders on the market.",
    "Take the BenQ TK800 for example, which is much brighter and comes in at around $999.99. Or even the BenQ HT2550, which brings the 4k experience to your home for $1,249.99. If you’re not bothered with getting maximum brightness from a projector and can regularly use the F1 in a mostly darkened room, then it’s worth getting to enjoy a private cinema experience at home."
  ],
  "headers": {
    "2": "Price and availability",
    "3": "Design and features",
    "11": "Performance",
    "16": "Final verdict"
  },
  "links": {
    "Projectors": "https://www.techradar.com/best/4k-projector",
    "speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "BenQ TK800": "https://www.techradar.com/reviews/benq-tk800",
    "BenQ HT2550": "https://www.techradar.com/reviews/benq-ht2550-4k-hdr-projector"
  }
}