{
  "source": "https://www.techradar.com/reviews/amazon-echo-dot-2nd-gen",
  "title": "Amazon Echo Dot (2nd Generation) review",
  "category": "audio-visual",
  "updated": "2021-11-09T15:03:40Z",
  "author": "jon-porter",
  "summary": "Amazon's smallest Echo remains a firm favorite",
  "verdict": "The Amazon Echo Dot is a great product. Despite shrinking in size and price, it maintains almost everything that made the original Echo so great.",
  "pros": [
    "Small, subtle design",
    "Stellar voice recognition",
    "Line-out functionality is useful"
  ],
  "cons": [
    "Sound quality could be better",
    "No digital audio output"
  ],
  "article": [
    "The Amazon Echo Dot got a refresh from Amazon in 2018, with even cuter looks and some extra fabric on its exterior. But the original Echo Dot is still a winner in our eyes too, so here are our thoughts on the first version of the Dot, which has already established itself in many a smart home.",
    "When Amazon launched the first Amazon Echo way back in 2014, it seemed a ground-breaking (and not to mention risky) move for smart home tech. And it quickly became one of the must-have home gadgets for just about everyone.",
    "Thanks to that, it’s now an iconic bit of tech and it’s been a true delight to see family members and friends who usually turn their nose up at the latest bit of kit welcoming the Echo range - and Alexa - into their homes.",
    "It wasn't long after that that the Amazon Echo Dot came along to bring Alexa smarts in a much more compact package. The puck-shaped device takes all the best bits of the Echo and condenses it down into something you can put anywhere.",
    "Sure Amazon had to make compromises, but just like the Echo, the Amazon Echo Dot lets you speak out commands to Alexa and get responses beamed back down from the cloud. The key difference is that everything is reduced: the price, the size, and unfortunately, the audio quality.",
    "Amazon lifted the lid on a brand new next-generation Echo Dot in 2018, which sounds and looks better. But how does its predecessor measure up against the new arrival, and other Alexa-powered options like the Amazon Echo Spot and Amazon Echo Show?",
    "While the smaller Echo Dot does compromise on sound quality to match its tiny size and price tag, it's just as smart as its stablemates and, arguably more impressive than many of its non-Alexa rivals.",
    "UPDATE: Amazon has refreshed the Dot with the all-new Amazon Echo Dot with Clock. Amazon has taken one of the most-requested Alexa commands (\"Alexa, what time is it?\") and visualized it, a clock in an Echo Dot is a great idea and makes it even more invaluable in your smart home.",
    "The Echo smart speaker range was a means for Amazon to take its AI-powered voice assistant Alexa and turn it from a piece of software made primarily for searching through video catalogs, into a much more handy general assistant that would see to all the modern-day demands of a connected smart home.",
    "Just a few short years later and now Alexa has grown from an interesting curiosity into a very capable voice assistant living in plenty of homes across the globe. It can help with everything from telling you the weather and turning off your smart lights, to playing music from Spotify, with new features constantly being added.",
    "Over the years, Amazon's smart speakers have gained hundreds of new skills, learned to talk to dozens of new smart home products and – thanks to the Drop-In function – now allow you to chat with anyone, anywhere by calling either their smartphone or Echo device.",
    "The Amazon Echo Dot may be tiny in comparison to the rest of the line-up, but it takes what made the original Echo great and slims down the built-in speaker.",
    "What this leaves you is an integrated speaker that's capable without being great, and the option to connect the Dot up to any external speaker you please instead: you can plug in a cable or use Bluetooth.",
    "The advantage of doing away with a more capable built-in speaker is of course a much smaller piece of hardware: you can stick the Amazon Echo Dot just about anywhere you like.",
    "The Dot's small form factor makes an enormous amount of sense, particularly for those who aren't sure about how a smart speaker will (both literally and metaphorically) fit into their current smart home setup.",
    "Its small form, in addition to its radically reduced price tag of $39.99 / £34.99 / AU$79, makes the Dot the perfect way to get Alexa into your home without the fuss or investment, and therefore it's one of our most recommended products to friends and family members who aren't sure about making the leap into more high-end, pricey connected gadgets.",
    "That still applies to the new version Amazon has now unveiled of course, but if you've got kids and you're not sure how they'd get on with Alexa, check out the Amazon Echo Dot Kids Edition – it comes with some unique, child-friendly perks, including a two-year damage replacement warranty, a colorful rubber case in either red, blue or green, and a year's subscription to the FreeTime Unlimited kid-focussed service.",
    "Having said that, when the Kids Edition was launched, Alexa got a kid-focussed upgrade across all its Echo devices too. From Pac-Man to Lego to the Beano, your children will be able to enjoy everything from spoken puzzle games to stories, straight from any Echo speaker.",
    "See how we got on when we used the Echo Dot over the course of a week.",
    "The Echo Dot is a great-looking product. It's around the same circumference as the full-size Echo, but the Dot lacks a volume ring, meaning it has an additional two buttons on its top to control volume directly (plus mute and listen buttons).",
    "The Dot also has the same light ring found on the Echo, which indicates when Alexa is listening to you through its seven-microphone array, or whether the speaker is muted (useful if you're watching a movie and don't want to be interrupted when Alexa thinks it's heard the trigger word).",
    "The most striking difference from the Echo is the Dot's height. At just 32 mm (1.26 inches) tall the device is a full 20 cm (7.9 inches) shorter than its bigger brother. It's not as small as a dongle like the Chromecast Audio, but it's pretty dinky all the same.",
    "Its size means it's much easier to tuck away in a nook or cranny of your choosing, although naturally you'll want to make sure it’s still able to hear you speak.",
    "We found that the Echo Dot worked well in the kitchen, where it was able to easily fit on top of a microwave, but placed next to a stereo was also good, so long as the hardware wasn’t too close to the speakers (which makes it hard for the microphones to pick up commands properly).",
    "Around the rear of the device is a micro USB port to provide power to the speaker, as well as a 3.5mm port to allow the Dot to connect to an external speaker. Unfortunately there's no option for digital output, like with the Chromecast Audio's hybrid 3.5mm analogue and optical port.",
    "Anyone who's had to set up an internet-connected speaker before shouldn't have any trouble at all setting up the Echo Dot. Once it's plugged in, you can connect to a Wi-Fi network via the Alexa app.",
    "In the second step of the set-up process you select whether you want to use its diminutive built-in speaker, or an external speaker via either Bluetooth or a 3.5mm jack (not included) – this can always be changed at a later date.",
    "For example, if you set the speaker up to output its sound through its 3.5mm line-out, you can switch to its internal speaker by simply unplugging its jack. If you want to disconnect it from a Bluetooth speaker you can instruct Alexa with your voice to \"disconnect\" (more on this later).",
    "The Dot maintains the Echo's exceptional ability to recognise your voice while giving you the option of improving upon its biggest flaw – the sound quality – with an additional external speaker located close by.",
    "Being able to use an external speaker is an excellent option, and means we regularly ended up using the Dot like a Chromecast to listen to tracks off Spotify, where it was surprisingly intuitive at getting songs and artists playing.",
    "In order to do so you'll need to provide your Spotify login details, and set it as your default music service over the standard Amazon Prime Music. Once that's done you can simply say \"Alexa, play Royal Blood\" and be almost instantly serenaded by the rock duo (for example).",
    "But the biggest problem with using a pair of external speakers is that, unlike the Echo Dot itself, these are not meant to be 'always on' devices.",
    "This leaves you in a bit of a dilemma. Either you leave the Echo Dot connected to a speaker that's left permanently on and using power, or you rely on the Dot's tinny internal speaker.",
    "What we ended up doing was juggling the two. We'd leave the Dot unplugged the majority of the time to avoid wasting too much power, and then plug it into an external speaker when we wanted to listen to some music or a podcast.",
    "The process is a little more seamless if you're using Bluetooth to connect your Dot to an external speaker, since in this instance you can simply instruct Alexa to \"connect\", and it'll automatically pair the Dot with the most recently connected Bluetooth device.",
    "It would have been nice to have a similar option when using line-out, or alternatively be able to choose a type of speaker output with a voice command. It would be great to be able to say \"Alexa, play White Stripes through external speaker\", rather than having to mess around with unplugging and replugging in cables.",
    "We were impressed with how well the Alexa was able to pick out our voice, even while music was playing loudly from a nearby speaker. There's naturally a limit to how far you can push this (it's not magic), but it's not something you have to think about balancing during a normal, non-deafening, music session.",
    "Outside music, the Echo Dot has exactly the same amount of smarts as the full-size Echo. You can use it to set timers while you're cooking, have it give you a one-minute news roundup while you're eating your cereal in the morning, or even order an Uber if you've entered your Uber login details into the Alexa app.",
    "Developers have already made more than 30,000 skills (voice-activated apps) for Alexa, and while there's always room for improvement, it's great that Amazon (and third-party apps) are constantly paving the way for Alexa to lean more and more skills – and in doing so become more and more useful.",
    "And it's not just skills that are constantly updated: earlier in the year, Amazon added music and live radio to its 'Routines'. Launched in 2017, Routines are a way to get your smart assistant to accomplish multiple tasks with a single command – say \"Alexa, I'm home\" for example, and you could have your lights, heating and TV switched on in one fell swoop. Now, though, you could add whale sounds from Spotify to that Routine for those particularly stressful days.",
    "More recently, Amazon has rolled out a new feature that enables the developers of skills to tell Amazon the kind of questions their tool can answer. What this means is that if a user makes a vague request, the new feature will scan all of the skills in its database to find the one most likely to respond appropriately – less thinking on your part, and more thinking on Alexa's.",
    "We've also recently seen a slew of new voices for Alexa, as well as a new Brief Mode that makes Alexa less likely to respond to your voice (to stop the voice assistant constantly interjecting in conversations).",
    "In contrast, Alexa Brain’s head, Ruhi Sarikaya, is looking to create more \"friction-less\" interaction with the personal assistant. In the future, that will mean Alexa will be able to continue conversations more naturally - e.g. you can ask about the weather today, the weather tomorrow and the weather next week, all without pausing the conversation to say \"Alexa\" in between in each query.",
    "Although some of these new, smarter updates to Alexa are yet to land, the promise of these upgrades and improvements means this tiny Dot really is worth the investment... and we suspect its successor will be too.",
    "See how Alexa stacks against to those other digital assistants",
    "Unsure which Echo speaker to buy? Check out our guide to the best Amazon Echo speaker: the Dots, Spots, Shows and Pluses compared.",
    "The Echo Dot packs a lot into a tiny package. It's got the same excellent voice-recognition chops as the full-size Echo, but it dispenses with the bulky speaker that some people will agree wasn't great for serious music-listening in the first place.",
    "Using a decent external speaker with the Dot is a game-changer, and it feels great to be able to quickly get songs or even just have the radio playing. It was so quick and easy that we found ourselves listening to music at times when we wouldn’t normally have made the effort, such as when we were passing through the kitchen in the morning.",
    "Finally, its size means you can tuck it away into a corner of a room, where you’ll soon be using it for everything from checking the time and weather, to setting timers and alarms.",
    "Using an external speaker is an excellent feature, but we wish this was handled just a little better. It would be great to have a voice command to switch between the Dot's internal speaker and an external one.",
    "There are a lot of skills already available for Alexa, but there's also plenty of unexplored potential. This is something that’s a little out of Amazon’s hands, in some ways it's good that there's so much room for potential.",
    "Digital audio output would be a great addition for audiophiles, too.",
    "Amazon's Echo Dot is a great little product. It maintains almost everything that made the original Echo so great, while also bringing a substantial cut in price.",
    "Being able to use an external speaker means the Dot is genuinely a great way to listen to music around the house, but its internal speaker is also surprisingly adept at dealing with simpler requests.",
    "If you're curious about the Amazon Echo experience, then the Dot is a great way to try it out at a much cheaper price, and in some ways its audio output options mean it’s actually the superior device.",
    "We're not quite living in the age of Tony Stark's Jarvis just yet, but if developers continue to rally behind Alexa by developing ever more intelligent skills, then the future may be just around the corner.",
    "Every week it seems there's either a new update to Alexa's voice recognition and skills, or at least news of one on its way, and this sense of constant innovation is what really sets Amazon and its Alexa voice assistant apart from the rest.",
    "Of course there's a new generation of Amazon Echo Dot in town now, which we found to have a better look and audio quality in our initial review. But that doesn't mean the original Dot still isn't a great starting point for smart home fans – especially now it may get a price reduction because it's been upgraded.",
    "Image Credits: TechRadar."
  ],
  "headers": {
    "8": "Amazon Echo Dot: Alexa and features",
    "19": "Amazon Echo Dot: design and set up",
    "28": "Amazon Echo Dot: performance",
    "46": "We liked",
    "49": "We disliked",
    "52": "Final verdict"
  },
  "links": {
    "got a refresh": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-dot-1328595/review",
    "Amazon Echo": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review",
    "a brand new next-generation Echo Dot": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-dot-1328595/review",
    "Amazon Echo Spot": "https://www.techradar.com/reviews/amazon-echo-spot",
    "Amazon Echo Show": "https://www.techradar.com/reviews/amazon-echo-show",
    "Amazon Echo Dot with Clock": "https://www.techradar.com/reviews/amazon-echo-dot-with-clock-review",
    "Amazon Echo Dot Kids Edition": "https://www.techradar.com/news/amazon-echo-dot-kids-edition-makes-alexa-voice-assistant-child-friendly",
    "Alexa got a kid-focussed upgrade": "https://www.techradar.com/news/amazon-echo-adds-alexa-skills-built-for-kids-pac-man-sesame-street-and-more",
    "added music and live radio to its 'Routines'": "https://www.techradar.com/news/amazon-alexa-routines-can-now-include-music-and-live-radio",
    "the best Amazon Echo speaker: the Dots, Spots, Shows and Pluses compared.": "https://www.techradar.com/news/best-amazon-echo-speaker-the-lineups-dots-spots-shows-and-pluses-compared",
    "new generation of Amazon Echo Dot": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-dot-1328595/review"
  }
}