{
  "source": "https://www.techradar.com/reviews/huawei-p-smart-2019",
  "title": "Huawei P Smart (2019) review",
  "category": "phones",
  "updated": "2020-01-16T10:54:15Z",
  "author": "basil-kronfli",
  "summary": "A great-value phone that we’ve basically seen before",
  "verdict": "The Huawei P Smart (2019) lacks the oomph we’d want for heavy multitasking and 3D gaming, but it has loads of storage for the price, a decent camera, best-in-class design and a killer screen. While it’s a shame there’s no case in the box given the fact its plastic body scratches very easily, it’s excellent value for money.",
  "pros": [
    "Slick design at a great price",
    "Runs Android 9",
    "Ample storage"
  ],
  "cons": [
    "No case in box – and plastic back scratches easily",
    "Camera images overly processed",
    "Mono speaker"
  ],
  "article": [
    "The Huawei P Smart (2019) launched at the same time as the eerily similar Honor 10 Lite, which we’ve already reviewed and which we loved. It offered “great value for money, an excellent screen and design and plenty of storage” – all qualities matched by Huawei’s new entrant.",
    "There are a couple of differences in terms of design, camera specs and box contents. The P Smart (2019) has a lower-resolution selfie camera, while the 10 Lite includes a case in the box – the P Smart (2019) doesn’t.",
    "That means, just like the Honor 10 Lite, the P Smart (2019) has its sights set on pricier mid-range contemporaries like the Nokia 7.1, Motorola One and Honor’s own Honor 8X, as well as slightly cheaper alternatives, such as the Nokia 3.1. Plus.",
    "There were many fantastic budget devices released in 2019, yet the Huawei P Smart (2019) from late 2018 weathered them all to stay at the top of our list of the best cheap phones a year after its initial launch. If that's not a compelling reason to consider it as your new phone, we don't know what is!",
    "After Google suspended Huawei's future access to Android Play Store and security updates several months after the P Smart (2019) came out, there are serious question marks over the future of Huawei and Honor phones.",
    "While Google and Huawei have promised to support phones currently on the market, it's not clear how long they'll receive Android updates or access to the Google Play Store, which would severely curtail their usefulness compared to the competition. The P Smart (2019) likely won't be affected, but it's dubious whether there will be a P Smart (2020).",
    "Huawei smartphones are currently not available through US carriers or major retailers, though it’s still possible to buy them. This usually means a higher cost or relying on unverified online retailers, and software may not be optimized for US networks. Huawei’s other products, including laptops and tablets, are readily available in the US, and the firm is working to obtain clearance to market its phones, so we could see the P Smart (2019) officially launch in America in the Future.",
    "You can buy the Huawei P Smart (2019) in the UK, India, China, and Europe – no US or Australian release has been confirmed.",
    "At £199 ($255, AU$360), the Huawei P Smart (2019) costs the same as the Honor 10 Lite, and undercuts the bigger Honor 8X, as well as the excellent Nokia 7.1 by a fair margin.",
    "Since release, that price has deprecated somewhat, and you can generally pick it up for 25% lower than its launch price, and sometimes for even less during sales periods.",
    "The Huawei P Smart (2019) looks great, sporting a teardrop notch design, as seen on the OnePlus 6T, and a streamlined body.",
    "Its plastic back and sides form a high-gloss shell that feels like plastic. The screen is LCD tech, which can’t compete with OLEDs when it comes to depth and punch, but alongside the Honor 10 Lite, the Huawei P Smart (2019) still sports the tiniest bezels and one of the best resolutions for the price.",
    "Most phones that cost under £200 only offer 32GB storage, but the P Smart has a generous 64GB, of which about 50GB is available to the user – that’s on a par with many flagships that cost three times its price. As for battery power, there’s a 3400mAh unit inside, the life of which can be optimized via a host of power-saving options.",
    "Despite the great-looking design, and the decent storage and battery specs, however, the P Smart (2019) is ultimately a mid-range phone with mid-range internals. Inside, there’s a Kirin 710 chipset coupled with 3GB RAM – respectable, but not excellent.",
    "At 8mm thick and 162g, the P Smart is light, largely owing to the fact that, unlike the glass-backed Honor 10 Lite, its back and sides are a unibody plastic shell with a high-gloss effect.",
    "While the back does look like glass, especially if you’re looking at one of the color options that features a gradient finish, it's plastic through and through. Despite this, though, it feels smooth in the hand, and while it’s light it doesn’t feel hollow.",
    "However, the fact that it’s plastic means it scratches much more easily than glass, so if you want to keep your Huawei P Smart (2019) looking pristine, get a case on it from day one – while it comes with a pre-fitted screen protector, unlike the Honor 10 Lite there’s no soft plastic protective case, which given this phone’s susceptibility to scratches is a noticeable omission.",
    "There are plenty of color options here: Midnight Black, Aurora Blue and Turquoise Blue, with the latter two options sporting a gradient finish, as introduced on the Huawei P20 Pro and carried over to the Mate 20.",
    "The rear fingerprint scanner is in the middle of the phone and easy to hit, with the ridged edges easily identified when you extend a digit.",
    "The camera surround on the back of the P Smart (2019) houses a dual-camera module that’s slightly raised from the phone’s body. On the bottom of the phone is a single downwards-firing speaker, as well as a micro USB port and a headphone jack.",
    "Huawei has also managed to squeeze a notification light in below the screen – which is both handy and unexpected given how small the bezels are – rounding off the look and feel of this excellently priced package very nicely.",
    "A Full HD resolution display measuring 6.21 inches dominates the front of the P Smart (2019). It’s long, with a 19.5:9 aspect ratio, and it’s also very light on bezels, delivering an almost 90% screen-to-body ratio according to Huawei – better than many flagships.",
    "With a resolution of 2230 x 1080 pixels, the P Smart’s screen isn’t just competitive for the price – the 415ppi pixel density also wins out when compared to displays found on much pricier phones like the iPhone XR’s, the screen on which clocks in at 326ppi.",
    "The phone’s screen is really bright for a mid-ranger too. Off-angle and outdoor viewability are good, and it’s easy to see the screen in all but the brightest conditions.",
    "We’ve already said the P Smart is light on bezels – in fact the bezels are absolutely tiny, and the notch isn’t as intrusive as that found on an iPhone X for example. Instead, there’s a small protrusion, known as teardrop or water-drop notch (Huawei calls it a ‘Dewdrop’, just to be different), which houses the 24MP selfie camera.",
    "Another bonus is that there are plenty of screen calibration tools in the settings. Eye Comfort mode, color calibration and more give you control over everything from the screen tone to its emission of blue light, which can interfere with sleep."
  ],
  "headers": {
    "6": "Price and release date",
    "10": "Key features",
    "14": "Design",
    "21": "Screen"
  },
  "links": {
    "Honor 10 Lite": "https://www.techradar.com/reviews/honor-10-lite-review",
    "Nokia 7.1": "https://www.techradar.com/reviews/nokia-7-plus-review",
    "Motorola One": "https://www.techradar.com/reviews/motorola-one-review",
    "Honor 8X": "https://www.techradar.com/reviews/honor-8x",
    "Nokia 3.1. Plus": "https://www.techradar.com/reviews/nokia-31-plus",
    "best cheap phones": "https://www.techradar.com/news/best-budget-smartphone",
    "Google suspended Huawei's future access to Android Play Store": "https://www.techradar.com/news/huawei-ban",
    "OnePlus 6T": "https://www.techradar.com/reviews/oneplus-6t-review",
    "Huawei P20 Pro": "https://www.techradar.com/reviews/huawei-p20-pro-review",
    "Mate 20": "https://www.techradar.com/reviews/huawei-mate-20",
    "iPhone XR’s": "https://www.techradar.com/reviews/iphone-xr-review"
  }
}