{
  "source": "https://www.techradar.com/reviews/sennheiser-pxc-550-ii",
  "title": "Sennheiser PXC 550-II review",
  "category": "audio-visual",
  "updated": "2019-12-20T18:00:55Z",
  "author": "simon-lucas",
  "summary": "The Sennheiser PXC 550-IIs offer a compelling alternative to its Momentum Wireless range",
  "verdict": "Build and materials quality, battery life and sound quality are all impressive. Only latent treble troubles prevent a whole-hearted recommendation.",
  "pros": [
    "Judicious sound",
    "Good battery life",
    "Subtly premium looks"
  ],
  "cons": [
    "Struggles on trebly recordings",
    "Not showy",
    "Competition from other Sennheiser cans"
  ],
  "article": [
    "To have one pair of premium wireless on-ear noise-canceling cans in Sennheiser’s audio range is only sensible. The addition of a second at essentially the same price point looks a bit weird. But that’s exactly what Sennheiser has done with the PXC 550-II headphones – an upgrade to the previous PXC 55O model with the latest Bluetooth standard and enhanced audio and smart capabilities.",
    "‘A bit weird’ isn’t usually the first phrase that comes to mind when considering Sennheiser. The audio brand generally offers high-performing products at sensible prices, as shown by the excellent Momentum Wireless – which, on a head big enough to carry them off, are actually quite stylish. But now that Sennheiser has released a new pair of on-ear wireless cans at a similar £299/$349/AU$540 price point, which are you meant to choose?",
    "The PXC 550-II headphones are a bit cheaper than the Momentum Wireless, a bit more sober in appearance and definitely not as big. Is that enough to open up a whole new crowd of customers who don’t fancy Momentum Wireless – or any of the other wireless noise-canceling on-ears currently flooding the market?",
    "We think it might – and you can find out why in this PXC 550-II review.",
    "To a great extent, over-ear headphones all look the same - the best a company can hope for is some individual stylistic fiddling around the edge of a long-established design template. With the PXC 550-IIs, Sennheiser has gone for a sophisticated and understated look – while hoping this doesn’t simply make the model look dull.",
    "If understated designs appeal to you, then the PXC 550-IIs may be right up your alley. They’re made from tactile soft-feel plastics and pleasant synthetic leather, and their comparatively modest dimensions mean even the smaller-eared user won’t feel swamped. There’s plenty of (smooth, silent) adjustment in the headband, and the earcups articulate effortlessly on their hinges. They fold usefully flat, and a trifling 227g weight make them a strong proposition for long-haul users.",
    "Aside from an unobtrusive Sennheiser logo at each end of the headband, there’s nothing showy about the PXC 550-IIs whatsoever. So while they unarguably feel like the money’s-worth, whether or not they look it is debatable.",
    "Like a lot of wireless on-ears, the PXC 550-IIs focus its functionality around the right earcup. It’s home to a button for Bluetooth pairing, which also summons a voice assistant with a longer press, with support for aptX Bluetooth 5.0, low-latency and AAC functionality too. There’s also a slider for engaging or deactivating active noise-cancellation, and a micro-USB input for charging the battery. Sennheiser claims you’ll get 20 hours of use with noise-cancellation activated, or 30 if you leave it switched off – both figures seem eminently achievable.",
    "The right earcup is also where you’ll find the touch-controls. Play/pause, skip forward/back, volume up/down, mic mute/unmute and call answer/reject can all be facilitated with a touch or swipe. The PXC 550-IIs are also tricked out with a selection of mics to use for phone calls, voice control and active noise-cancelation.",
    "Behind the acoustic cloth on the inside of this hard-working earcup is a 32mm full-range driver. There’s another in the left earcup, obviously – but apart from some noise-cancellation mics, that’s it for the left-hand side. (Left-handers, you’re marginalised once again.)",
    "The PXC 550-IIs can be used in conjunction with Sennheiser’s handsome Smart Control app. There is some EQ customisation available here, as well as degrees of noise-cancelation (‘anti-wind’ to reduce wind-borne noise, ‘adaptive’ to respond to changing levels of external noise, and simply ‘on’).",
    "It isn’t just the design that’s sophisticated and understated, though. On initial acquaintance the Sennheiser PXC 550-IIs might sound a little reticent – but persevere just a little longer and they reveal a balanced and quite carefully-judged listen.",
    "Once through an all-court test like Never Catch Me by Flying Lotus is almost enough to explain the PXC 550-IIs in their entirety. They’re extremely disciplined where the lowest frequencies are concerned, controlling the start and stop of individual bass sounds with real rigour. There’s proper texture and detail to the bottom end too, rather than the uniform drone that less-capable alternatives serve up. The bass-hungry may crave a little more impact, but everyone else should admire just how naturalistic the Sennheisers’ low-frequency reproduction sounds.",
    "At the opposite end of the frequency range, there’s real shine and attack. Coarser recordings than this can be problematic (more on this in a moment), but in the majority of circumstances the PXC 550-IIs demonstrate exactly the sort of treble bite that’s required. And, again, it’s loaded with details of texture and timbre.",
    "And between these frequency extremes, the midrange is just as information-rich and characterful. No nuance is too subtle or fleeting to escape the Senheisers’ attention – and it’s integrated into the overall sonic picture deftly, without undue emphasis.",
    "The presentation is broad, well defined and reasonably three-dimensional, and each part of the frequency range in integrated seamlessly (as should be the case from a single-driver design like this). These Sennheiser cans probably play things a bit safe, but there are sufficient low-level harmonic details revealed to keep things interesting, and enough dynamic headroom to offer a proper idea of power and attack.",
    "So far, then, the PXC 550-IIs do more than enough to make the idea of spending another £50 on Sennheiser’s Momentum Wireless a bit of a daft idea. But switch from the painstakingly recorded Flying Lotus tune to the altogether more aggressive (and ramshackle) delights of Girl Band’s extraordinary Why They Hide Their Bodies Under My Garage? and a few localised problems emerge.",
    "With a recording like this one, the sure-footed high-frequency bite of the PXC 550-IIs turns feral. The brilliance and shine becomes coarse and hard, and the more you nudge the volume upwards the more the PXC 550-IIs threaten to become shrill. Any recordings including latent treble aggravation aren’t going to suit these Sennheisers at all. It’s perhaps all the more jarring because the PXC 550-IIs have sounded so composed and assured until now.",
    "The impression of unshowy composure on the PXC 550-IIs returns strongly when considering its noise-cancelling capabilities. Even with the active noise-cancelation is set to its bluntest ‘on’ position, external noise isn’t completely banished – alternatives like Microsoft’s Surface Headphones do better work in isolating you from the world – even if the work the PXC 550-IIs do is still impressive. The ‘adaptive’ and ‘anti-wind’ settings, however, seem interchangeable in terms of the effect they have on your listening.",
    "As far as call quality goes, Sennheiser’s careful beam formation of mics works well. Clarity and intelligibility are more than acceptable – and that makes using a voice assistant a lot less painful than it can be with some alternative models. Google Assistant, Amazon Alexa and Siri are all available (though Sennheiser’s exemplary mic deployment can’t do anything to make Siri more intelligent).",
    "Ultimately, the Sennhesier PXC 550-IIs sound a lot like they look: sensible, pricey, and grown-up.",
    "Whether the anonymity of their looks is enough to tempt customers in meaningful numbers is debatable, but the (almost) unshakeable virtuosity of their performance will surely entice more than a few – as long as they’re not fans of overtly trebly music, that is."
  ],
  "headers": {
    "4": "Design",
    "7": "Features",
    "11": "Performance",
    "20": "Our verdict"
  },
  "links": {
    "Momentum Wireless": "https://www.techradar.com/reviews/sennheiser-momentum-wireless-2019-review"
  }
}