{
  "source": "https://www.techradar.com/reviews/photoshop-for-ipad",
  "title": "Photoshop for iPad review",
  "category": "computing",
  "updated": "2019-11-20T16:23:46Z",
  "author": "dave-stevenson",
  "summary": "Photoshop lands on the iPad, but is it any good?",
  "verdict": "A promising sign of things to come – your full Photoshop documents on an iPad, to be shuttled invisibly back and forth between your tablet and your computer. Smooth operation, even with very large files, is let down by the very spotty selection of tools – but this is an app whose updates we’ll be watching keenly.",
  "pros": [
    "Runs smoothly on iPad",
    "Opens large files with all layers"
  ],
  "cons": [
    "Limited tool selection",
    "Not much selection refinement",
    "No filters (yet)"
  ],
  "article": [
    "A year after it was announced by Adobe, Photoshop – real, full-fat, compatible-with-all-your-files Photoshop – has finally arrived on the iPad.",
    "Software doesn't come with any more pedigree than this: more than 30 years of imaging expertise underpins the Photoshop brand, and Adobe's claim that the iPad version is compatible with many of the tools and image formats of the full-fat desktop version will have illustrators, designers and photographers salivating into their lattes.",
    "The launch comes at the perfect time for Adobe. Its transition to a subscription-based model, complete with multi-platform applications and cloud storage, has – with a few caveats – been successful, so bringing the ability to not just view, but open and edit files stored on the cloud makes perfect sense.",
    "Photoshop for iPad is, like the rest of Creative Cloud, a subscription product. That puts it at odds with other excellent iPad editing software such as Affinity Photo, but bear in mind that any subscription that includes Photoshop for iPad also includes other apps.",
    "The cheapest you can get the app for is the $9.99 / £9.98 / AU$14.29 cost of Adobe's Photography Plan, which includes not just Photoshop for iPad but also Photoshop on the desktop, and Lightroom Classic. Alternatively, there’s a Photoshop-only package or the pricier All Apps bundle.",
    "All this means that working out whether Photoshop for iPad is good value in terms of your particular requirements is difficult. But before we consider the cost, the question that looms large is: is it good enough to replace Photoshop for the desktop?",
    "The initial Photoshop for iPad interface is certainly promising. It’s (thankfully) pared back compared to the desktop version, so the first impression is that it's uncluttered. Still, Photoshop users will be comfortable enough – many of the tools look familiar and have plenty of promise. The left-hand side houses familiar-looking controls such as brushes and the Clone Stamp, Crop and Rotate tools, while the opposite side of the screen is home to – hoorah! – the Layers panel.",
    "Overall, the app runs responsively. We set it a fairly tough challenge – opening a 1GB PSD file with a dozen or so high-resolution layers, and it ran smoothly on our 9.7-inch 2019 iPad. We encountered the occasional crash, which could make Photoshop for iPad a little frustrating to use; there was no particular pattern to or obvious cause of crashes, but we never lost any work, so the save feature appears fairly robust.",
    "Getting your images into Photoshop for iPad is straightforward – you can import from your iPad’s camera roll or take a picture using the onboard camera, but professionals will most likely load work from their Creative Cloud storage. This works well, and Photoshop for iPad saves as you go.",
    "There are also plenty of options for getting your images out of Photoshop. Tap what most will consider the 'Share' button at the top of the screen and you can opt to create PNG, JPEG, PSD or TIFF files, with various options for quality and compression available for each. Files can then be sent via Messages or Mail, saved to your camera roll, or sent to other services such as Files or Dropbox, depending on what you have installed.",
    "The big inclusion here is support for layered PSD files – there can’t be many, if any, professional Photoshop users who don’t use layers in more or less every file they work on.",
    "The implementation of layers in Photoshop for iPad is pretty full-on: in addition to creating new layers duplicating layers you can create adjustment layers (called 'clipped adjustments' here) and layer masks, and adjust layer opacity and blending modes, as well as performing layer management tasks such as merging layers or flattening images.",
    "The rest of the tools, however, are hit-and-miss to put it mildly. Being able to use layer masks isn’t much use without the kind of powerful automatic selection brushes we’re used to in Photoshop on the desktop, and although Photoshop for iPad does have a Quick Selection Tool, it’s nothing like as accurate as using the Pen Tool and Refine Edge. Quick and dirty cuts; yes. Fine-edged, repro-ready cutouts? Forget it.",
    "There are good points elsewhere: cloning and healing tools are both included, and both work well, although for virtually any fine-toothed work you’ll want at least an Apple Pencil, if not something even more refined.",
    "Elsewhere, 'sparse' barely begins to cover the tool selection. There's no Dodge or Burn tool (although as in the desktop version of Photoshop you can make localized exposure adjustments using adjustment layers). No filters or smart filters (the latter has a placeholder menu, but although it’s probably safe to say it’s on its way, it isn't here yet). There's also no support for Adobe Camera Raw, which means photographers with new images to work on will want to put them through Lightroom before opening them in Photoshop.",
    "Text support, meanwhile, is little short of abysmal: you can choose a font, and its size and weight, as well as paragraph alignment, and… that’s it. No kerning, no line spacing, no tracking, no sub-script or super-script.",
    "If you’re thinking of signing up for Creative Cloud in order to get your hands on Photoshop for iPad, don’t. Compared to its alternatives – Affinity Photo looms large – there's such a paucity of tools available here that you’ll be constantly running up against brick walls in terms of what you can actually do.",
    "There are bits we like: overall the app runs really smoothly, the occasional crash notwithstanding. The tools which are actually present are powerful, particularly when it comes to working with layers, where Photoshop for iPad comes very close to fulfilling Adobe’s eye-popping claim that it’s the full version of its flagship software, but on a tablet.",
    "At best, Photoshop for iPad in its current form is a potentially useful tool for illustrators and graphic designers who are happy to rough-out a concept on a tablet before refining it to client-ready perfection on a proper computer. It simply doesn’t offer enough flexibility, or enough tools, to let you actually finish a document.",
    "And yet… Adobe is currently going to great pains to stress that it’s early days for Photoshop for iPad, and that refinements, stability improvements and new tools are all coming. Right now, though, you’d be mad to think that Photoshop for iPad was in any way ready for the big time – but you’d also be mad not to check in on it in a few months, just in case.",
    "Affinity Photo has gone from also-ran to serious competition in the four years since its release. It’s outstandingly competent on the desktop, and the iPad version has always been a supremely strong offering. That impression is only bolstered when you hold it up next to Photoshop for iPad – Affinity Photo offers an almost overwhelmingly better selection of tools all round. More advanced selection tools, HDR merging, a wealth of adjustment layers and lots more makes this an outstanding way to spend £19.99 / $19.99 / $30.99, whether you’re a professional or not.",
    "Read our in-depth Affinity Photo review",
    "Costing the equivalent of just one months’ Adobe Creative Cloud Photography subscription, Procreate isn’t just a great alternative to Photoshop for iPad, it’s a fantastic app in its own right for graphic designers. Where Affinity Photo and (hopefully, one day) Adobe Photoshop aim to keep both illustrators and photographers happy, Procreate’s focus is squarely on drawing and digital artistry, with a huge range of brushes to keep artists happy and – who knows – maybe drag a few illustrators away from their Wacom tablets."
  ],
  "headers": {
    "6": "Design and interface",
    "10": "Tools: what's here and what's missing",
    "16": "Final verdict",
    "20": "Affinity Photo",
    "22": "Procreate"
  },
  "links": {
    "Affinity Photo": "https://www.techradar.com/reviews/pc-mac/software/graphics-and-media-software/image-editing-software/serif-affinity-photo-1295010/review",
    "Affinity Photo review": "https://www.techradar.com/reviews/pc-mac/software/graphics-and-media-software/image-editing-software/serif-affinity-photo-1295010/review"
  }
}