{
  "source": "https://www.techradar.com/reviews/sennheiser-ambeo-3d-soundbar",
  "title": "Sennheiser Ambeo 3D Soundbar review",
  "category": "televisions",
  "updated": "2020-06-12T02:46:30Z",
  "author": "cliff-joseph",
  "summary": "Sennheiser’s first soundbar provides dazzling 3D sound – but at quite a price",
  "verdict": "It’s seriously expensive, but immersive Dolby Atmos support and audiophile sound quality prove that the Ambeo Soundbar is one of a kind.",
  "pros": [
    "Superb sound quality",
    "Effective Dolby Atmos",
    "13 separate drivers"
  ],
  "cons": [
    "Humongous price, size and weight",
    "No AirPlay or AptX for Bluetooth",
    "Wi-Fi streaming requires Google Home"
  ],
  "article": [
    "Sennheiser is best known for its range of headphones and professional microphones, but it recently extended its ambitions to home audio as well, with the introduction of its new Ambeo Soundbar.",
    "This move might be intriguing for anyone who's a fan of Sennheiser headphones, but you’ll need pretty deep pockets as the Ambeo Soundbar is very much a high-end piece of kit at $2500 (£2200 / AU$3,999), and the sheer size and weight of the soundbar means that it may simply not be suitable for many homes.",
    "It works hard to earn its keep, though. The bulky soundbar is packed with the latest audio technologies, including Dolby Atmos and DTS:X for surroundsound audio, as well as Sennheiser’s own Ambeo ‘virtual 3D’ sound system. Sennheiser clearly has its sights set on the home cinema market with the Ambeo, although the bar's Wi-Fi connectivity means that it can double up as a pretty impressive music system as well.",
    "Not sure if you should invest in Sennheiser's high-end soundbar? Read on to get our full thoughts on this ambitious 5.1.4 beast.",
    "'Beast' might be the best way to descibe the Ambeo Soundbar – it weighs a full 18.5kg (around 40 pounds) and measures 126.5cm wide, 13.5cm high and 17cm deep (49 x 5.3 x 6.6 inches, W x H xD), so you’ll need a pretty sturdy cabinet or stand to support that weight. It’s also quite picky about the layout of the room around it.",
    "Sennheiser recommends that the Ambeo sits at roughly chest-height when you’re sitting down in front of your TV, and you need to leave plenty of room on either side of it as well.",
    "That's because the imposing soundbar houses no less than 13 separate drivers – six woofers and three tweeters on the front, which provide the left and right channels and centre channel for voices and dialogue. There’s an additional tweeter facing out to the left and right on each end of the speaker, plus two upward-firing drivers located on the top of the soundbar in order to provide the height projection required for Dolby Atmos.",
    "The tweeters on the ends of the soundbar require you to leave a gap of 1-5m on each side of the soundbar in order to enhance left/right separation, while the two top drivers mean that you also have to leave at least 10cm between the soundbar and the TV screen above it.",
    "To get it setup properly we had to rearrange the furniture in our lounge in order to accommodate the Ambeo Soundbar, and even then it barely had the required amount of empty space that it needs in order to flex its audio muscles. That said, Sennheiser does sell an optional wall-mount kit for the Ambeo Soundbar, priced at £50/$60, which would have been handy in my home, but many people may simply find that they don’t have enough room for the Ambeo.",
    "Tucked around the back of the Ambeo Soundbar you’ll find an impressive set of input and output options: There are three HDMI 2.0 inputs for connecting devices such as a media player or games console, and one HDMI eARC output for connecting your TV. The Ambeo also includes one optical input, a pair of RCA connectors for analogue input, and one additional RCA connector for a separate sub-woofer.",
    "Somewhat misleadingly, Sennheiser refers to the Ambeo Soundbar as a ‘5.1.4’ speaker system, which incorrectly implies that it contains a sub-woofer of its own (it does not) but that doesn't mean it's lacking in the bass department.",
    "Last but not least, you'll also find an Ethernet port for connecting to your home network, along with wifi and Bluetooth as well, so there are plenty of options for streaming music as well as watching films and TV.",
    "Once the soundbar is setup, getting started is very straightforward, as Sennheiser’s Smart Control app for iOS and Android devices guides you through the set-up process, including the initial calibration system that involves plugging a microphone into the soundbar so that it can listen out for a series of tones as the app analyses the acoustic layout of your room.",
    "The handheld remote control provided by Sennheiser allows you to quickly adjust volume, select input sources, and to choose from a number of audio presets, such as Movies, Music, Sport and News. The Smart Control app duplicates these controls on the screen of your mobile devices – which is handy, as the LCD screen on the front of the soundbar itself is so small that it’s virtually useless – but also provides more detailed equalizer controls so that you can fine-tune the sound for each preset.",
    "Thankfully, after rearranging the furniture, it only took a couple of minutes to run through the installation process and sit back with a selection of Hollywood blockbusters. Our first port of call was the 30th anniversary reissue of Tim Burton’s Batman – and we were sold on the sound quality as soon as we heard the menacing opening notes of Danny Elfman’s score: The strings had a deep rich texture, with a threatening undercurrent of bass, yet there was also a striking contrast with the lighter chimes that hung gently in the air.",
    "The Dolby Atmos effect lived up to its name, creating a highly immersive atmosphere in the opening scenes, as a young family walk through the bustling streets of Gotham City, with crowds and traffic moving all around. Michael Keaton’s first appearance as Batman is dramatic as hell, with the flapping noise of his cloak filling the room as he swoops out of the shadows and declares – “I’m Batman…”. But it’s the appearance of the Bat-copter later in the film that shows the Ambeo Soundbar at its best, with the sound convincingly zooming and soaring around the room as the Bat-copter swoops through the clouds.",
    "Batman shows the precision of the Ambeo’s sound, but the more recent Avengers: Infinity War shows its power and sense of scale. The waves of sound as Black Panther leads his army across the plains of Wakanda really get the pulse racing. The Ambeo’s 500W amp ensures that Thor’s lightning strikes rattle the floorboards, yet the dialogue remains crisp and clear even in the midst of battle – “this is my friend – he’s a tree…”.",
    "Admittedly, the Ambeo Soundbar never quite manages to place sound right behind us – that’s a lot to expect from any single-piece speaker system, but it does a magnificent job of filling the room with rich, detailed sound. The Ambeo proves that it works well with sport on TV too. The BBC’s Wimbledon coverage doesn’t use Dolby Atmos, but the Ambeo’s ‘upmixing’ feature does a good job of projecting the cheering crowds to fill the room as Dan Evans finally clinches his 12th break-point.",
    "The only area where the Ambeo Soundbar falters is when you switch from video to listening to some streaming music. Any computer or mobile device can use Bluetooth to pair with the soundbar, although it’s disappointing to see that such an expensive speaker system doesn’t support the AptX codec.",
    "Wi-Fi streaming relies on Google’s Chromecast technology – which requires you to install the Google Home app – and there’s no support for Apple’s AirPlay, which seems like another short-sighted omission as Chromecast can be a bit awkward on iOS devices, and there may also be people who simply prefer to avoid Google Home because of Google’s intrusive data-harvesting habits.",
    "You can work around this if you’re familiar with UPnP servers, but Sennheiser’s reliance on Google Home for Wi-Fi streaming could deter some people.",
    "It’s hard to fault the sound quality of the Ambeo Soundbar, which makes it perhaps the most impressive single-piece soundbar we’ve ever had the pleasure of listening to. The Dolby Atmos 3D effects work surprisingly well, and the Ambeo upmixing option can enhance non-Atmos films and TV shows too.",
    "It’s not perfect – Sennheiser’s reliance on Google Home to provide wifi streaming seems like an odd choice – but the sheer sound quality of the Ambeo Soundbar ensures that it justifies its wallet-breaking price tag."
  ],
  "headers": {
    "4": "Design",
    "9": "Features",
    "14": "Performance",
    "21": "Final verdict"
  },
  "links": {}
}