{
  "source": "https://www.techradar.com/reviews/livefine-automatic-pill-dispenser",
  "title": "LiveFine Automatic Pill Dispenser review",
  "category": "appliances",
  "updated": "2019-11-08T11:09:45Z",
  "author": "mark-pickavance",
  "summary": "The carousel of meds",
  "verdict": "A simple but effective system for handling even complicated medication doses with relative ease. It could be better made and cheaper, but it does the job without much fuss or mistakes.",
  "pros": [
    "Big capacity",
    "Lockable",
    "Flexible"
  ],
  "cons": [
    "Needs a tipping cradle"
  ],
  "article": [
    "For those that take daily medication taking the right dosage at the correct point in the day is often vital. And, the LiveFine Automatic Pill Dispenser is designed to achieve those two objectives without confusing the person taking the pills or the caregiver than organises their doses.",
    "At nearly $80, this might look like an expensive pillbox. But it has some useful features that introduce an often-needed level of control to taking of medication that might be invaluable for some.",
    "Direct from LiveFine, this dispenser with the clear cover costs $79.99, a recent reduction from the previous price of £129.99. The version with the solid lid where the medication can’t be seen inside is $89.99, and this was previously $119.99.",
    "It can also be bought from Amazon and other online retailers, and it is available outside the USA via several vendors.",
    "This product is also sold under several alternative brand names in different regions.",
    "To provide the full title of this product, officially this is the LiveFine Automatic pill dispenser 28-day medication organiser with alarm reminder.",
    "It comes in two variants that can have either a clear cover or an opaque white one. That choice impacts the ability to see their medication inside the carousel or not, and either situation might have advantages for some users.",
    "In each of the 28 compartments, up to 18 aspirin sized pills can be stowed, allowing for a monthly cycle of daily dosage or more complicated daily plans to be managed.",
    "For example, the device can alert the user up to six times a day and open a different compartment at each alert. Or, you could have a morning, lunch and evening dispense, with enough pills for nine days.",
    "If this sounds potentially complicated, then LiveFine has tried to make it easy to follow for the person charged with configuring and filling the dispenser.",
    "The unit comes with a set of printed inserts made for the different daily profiles, and once inserted, the compartments are automatically labelled with the time and day of the week.",
    "With the medication loaded, a key can lock the carousel and the unit will then follow the programming of the timer to alert the user when to take pills.",
    "The alert can be visual, audible or both, and it is possible to set one of four tones designed to be heard by people with different types of hearing impairment.",
    "Initiated by the battery-backed timer, the alert will continue for up to 30 minutes, and when the dispenser is picked up it will sense the movement and stop the alert, and the medication can be tipped out.",
    "Once using the device has been established, it should eliminate dosage mistakes and allow the taking of reasonably complicated medication plans without the need for extra supervision.",
    "What we also liked is that it keeps a basic record of what pills aren’t dispensed by default. If the alarm sounds for 30 minutes and no pills are collected, no medication is dispensed, but the carousel will rotate to the next event position.",
    "That the medication wasn’t dispensed and when this failure occurred will be obvious to the person refilling it the next time they go to refresh the contents.",
    "What it won’t stop is a person dispensing the pills and then not taking them, but that’s a problem that not even the most expensive pill dispensing devices can fix.",
    "The undoubted strength of this solution is the flexibility of it, allowing the dispenser to be quickly modified if the dosage pattern changes.",
    "Sometimes products that are relatively simple work the best, mostly because there is relatively little to go wrong. The LiveFine Automatic Pill Dispenser fits into that category because it manages the job of dispensing medication is a remarkably straightforward way.",
    "With 28 slots, it allows plenty of scope for different time cycles with up to a month of pills ready to be dispensed.",
    "It also has a lock that should keep the curious and overly enthusiastic pill takers from taking more than they should. Although, LiveFine do accept that it is possible to force it open, given enough strength or appropriate tools.",
    "Our only real reservation about this device is that it is on the large side, and it requires both hands to be used to pick it up and catch the dispensed pills. That dexterity requirement might prove challenging for some people with coordination issues. It could probably do with an ancillary tipping mechanism, something we’ve seen on other similar products.",
    "It also isn’t the strongest device and could easily be damaged if it is dropped or abused in some other way.",
    "Medication can also be abrasive, and if it is used every day over time, the compartments are likely to become worn and damaged.",
    "Luckily LiveFine makes a replacement tray, a replacement key for the lock and fresh dosage rings for those that use this device to the point where it needs an overhaul.",
    "Overall, this isn’t the cheapest of pill dispensers even at its new lower price, but most of the existing customers seem very happy with it, and the control it gives them over their daily medication regime."
  ],
  "headers": {
    "2": "Price and availability",
    "5": "Design",
    "19": "Final verdict"
  },
  "links": {}
}