{
  "source": "https://www.techradar.com/reviews/nintendo-ring-fit-adventure-review",
  "title": "Nintendo Ring Fit Adventure review",
  "category": "gaming",
  "updated": "2019-11-06T16:11:31Z",
  "author": "vic-hood",
  "summary": "A surprisingly fun game hidden within a subversive workout device",
  "verdict": "This exercise-focused peripheral might not be for everyone, but if you want to spice up your boring workout with a light-hearted adventure game then the Ring Fit Adventure might be for you. It's a great way to fit in some exercise under the guise of an RPG. Just don't expect it to be as effective as the gym.",
  "pros": [
    "Surprisingly fun RPG",
    "Targets specific muscle groups",
    "Mini-games galore",
    "Can customize workouts"
  ],
  "cons": [
    "Only works with one game at launch",
    "Pricey peripheral",
    "Ring has poor grip",
    "Novelty factor may wear off"
  ],
  "article": [
    "Nintendo is on a never-ending quest to get us exergaming. You probably still have a dusty Wii Balance Board knocking about in a closet somewhere from the company's last foray into the exercising world, but now there's a new peripheral in town that promises to take you on a fun fitness-filled quest.",
    "Nintendo Ring Fit Adventure is marketed by the House of Mario as a game first, and an exercise device second. The action-RPG game sees you squatting, crunching and downward-dogging your way to success, as you set out on a quest to defeat a hench, bodybuilding dragon called Dragaux. And that's just the story mode, there are also plenty of mini-games and individual workouts to focus on specific parts of your body.",
    "Despite this emphasis on health and fitness, Nintendo wants you to focus on how surprisingly fun the game is. The extra dose of endorphins at the end of every level, in Nintendo’s opinion, is just an added bonus.",
    "But is Ring Fit Adventure worth your money? We break down the pros and cons of Nintendo's latest peripheral and how it stacks up as a fitness device.",
    "Nintendo Switch Ring Fit Adventure features two new pieces of hardware for the Nintendo Switch: the Leg-Strap and the Ring-Con. The left Joy-Con slides into a pouch on the Leg-Strap, which then is attached to your upper thigh using Velcro.",
    "Meanwhile, the Ring-Con is a pliable wheel that you hold in both hands (much like a Pilates ring). The right Joy-Con then slides into the top of the Ring-Con. The ring itself is made of plastic with fabric handles on the left and right hand side.",
    "The Joy-Cons track your in-game movements so the game can precisely tell, for example, how far your're raising your knees when jogging or if your posture is correct during overhead presses.",
    "Alongside the hardware, Ring Fit Adventure comes with the actual game in physical cartridge form.",
    "Keep in mind Ring Fit Adventure is for use with the Nintendo Switch and must be used in docked mode, so don't expect to hook it up to the Switch Lite. It probably could work but the actual screen would be so small that it doesn't seem worth it. It certainly would be a pain to try and follow the exercise instructions.",
    "While we found the actual Ring-Con comfortable to hold, and barely noticed the Leg-Strap at times, the grip can be a pain. When using the Ring-Con to do thigh presses for example, we found it often slipped or went springing across the room. We also found the strap is susceptible to sliding, but that was a minor issue.",
    "Where Ring Fit Adventure deviates from Nintendo’s workout projects of years past is that this time there’s more focus on the game aspect and less of a focus on using the peripheral as a platform for other games to tap into. In fact, as far as we know right now, the only game that uses the Ring-Con and Leg-Strap accessories is Ring Fit Adventure.",
    "Once you've attached your Leg-Strap and calibrated the Ring-Con, you can configure the game to match your fitness level. This is based on your age, weight and how much of a workout you're looking for (which is asked every time you start). The game then alters the Ring’s level of resistance to match this level, while also adjusting things like the number of reps required.",
    "In addition, using just the two Joy-Cons and the Ring-Con, Nintendo can measure your acceleration, angle and position you’re in, plus use the IR sensor to track your heart rate. It feeds all this data into the game, which it then translates to role-playing game-like stats such as damage output when fighting enemies.",
    "It should go without saying that, without the game, the ring peripheral doesn’t really work. So Nintendo is only selling a physical version as part of a boxed set.",
    "However, if you can't be bothered being glued to the game while Ring Fitting then you can pop your Switch on sleep mode and keep the Ring-Con turned on, pressing or pulling it when you please while watching TV or whatever. This 'Multitask Mode' means the Ring-Con will track these presses up to 300 times (making a little beep with each tracked push or pull) and rewards you when you return to the game.",
    "If you're aiming for a more specific workout then we would advise taking advantage of the game's 'Quickplay' and 'Custom' modes. Quickplay allows you to choose 'Simple' workouts that focus on particular muscles or 'Sets' which groups together exercises to focus on particular areas of the body. Custom, on the other hand, lets you pick your own specific exercises and create your own workout. We found this much more useful when looking for a 'legit' workout experience.",
    "The central premise of Ring Fit Adventure's 'Adventure' mode is that there’s an evil villain named Dragaux who represents everything we all hate about gym culture. He’s snobby. He’s critical. He’s egotistical. He’s the guy at the gym who grunts, leaves the machines sweaty and offers improper advice to anyone around him.",
    "As previously mentioned, you goal is to take him down by battling against a horde of aggressive creatures, all of whom are susceptible to one of five color-coded skills that target different exercises. For example, a muscle crab is weak against abdominal skills, while other creatures might be susceptible to skills that workout your legs or arms. The last two skills, yoga and general fitness, combine different muscle groups and work against different colored enemies altogether.",
    "Because Ring Fit Adventure is an RPG, however, there’s also a numbers component behind every attack – and you’ll need to craft items and level up your attacks to do more damage.",
    "That said, there are four main parts to the game. The level overview screen is where you’ll spend most of your time and it allows you to outfit your character however you’d like and plan your attacks for the next level.",
    "Once you pick a level, you’ll be asked to start jogging – this moves your character on a set path where you can collect coins and items by aiming and squeezing or stretching the Ring.",
    "Run far enough in a level and eventually you’ll come up against the enemies we mentioned earlier. Each of the themed worlds have different enemies, and you’ll have to pick the right attacks to take them down. After you beat the enemies and make it through the level, you’ll get experience points which then level up your character, making your attacks more powerful and putting you one step closer to beating Dragaux.",
    "If you would like to keep up the game aspect of Ring Fit then you can access mini-games through the 'Quickplay' mode. These games include the likes of Thigh Rider, which sees you thigh pressing to jump your vehicle over a variety of obstacles before making one last big jump in hopes of gaining the most distance. Your results are then collected on a leaderboard so you can go head-to-head with friends online or in person.",
    "The nice thing about Ring Fit Adventure - for those who aren't gym buffs - is that it doesn't feel like a workout. Don't get us wrong, it's certainly challenging, but it's much easier to squat when there's a visible goal in the form of watching a yoga mat being damaged.",
    "While the Ring Fit is undoubtedly fun and adds a bit of extra oomph to your workout, we can't help but worry it won't have a lasting appeal – especially for its price tag.",
    "While there are plenty of modes to try out, and some excellent individual routines to test, after several days of testing the game we began to grow bored. The novelty simply began to wear off and the game no longer had the same attraction.",
    "Nintendo hasn't mentioned any post-launch content, but something like that would be ideal in keeping the game fresh and exciting so this doesn't happen.",
    "Despite all the bells and whistles, Ring Fit Adventure boiled down to another exergaming experience that doesn't quite hold our attention and, due to this, we don't think it's worth the pricing.",
    "Ring Fit Adventure is definitely an improvement on the Wii Fit. It offers a more challenging workout, under the guise of a fun, adventure RPG. The renewed focus on the game aspect means that you’ll almost ignore the fact that you’re working out and will be more likely to return to it day after day.",
    "However, it's likely Ring Fit Adventure may become just another novelty exercise item you throw in the closet and we're concerned it doesn't have the depth to keep people engaged for long periods of time.",
    "If we examine the two elements - the workout peripheral and the game - separately then neither is overly astounding. However, paired together, it works. Nintendo has utilized what most of us want when doing exercise -distraction. What better way to do that than with a game?",
    "But at the £69.99/ $79.99 / AU$125 price tag, we can't help but consider that it's much cheaper to simply buy a Pilates ring and watch some YouTube while you exercise.",
    "While the Ring-Con can be used without a screen - and photos we took were all outside - Ring Fit Adventure is primarily for use indoors, as the Switch must be docked."
  ],
  "headers": {
    "4": "Design",
    "10": "The Ring Fit vs a traditional gym",
    "16": "Subversive workouts",
    "24": "Little lasting appeal",
    "28": "Final verdict"
  },
  "links": {
    "Wii Balance Board": "https://www.techradar.com/reviews/gaming/gaming-accessories/nintendo-wii-fit-balance-board-318500/review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review"
  }
}