{
  "source": "https://www.techradar.com/reviews/havit-low-profile-mechanical-keyboard",
  "title": "Havit Low Profile Mechanical Keyboard review",
  "category": "computing",
  "updated": "2019-03-19T18:54:48Z",
  "author": "michelle-rae-uy",
  "summary": "Performance and features in a slim body",
  "verdict": "Who says you’ve got to spend more to get more? Havit’s Low Profile Mechanical Keyboard proves that you can have it all: great performance, full programmability, beautiful design, and a price tag that will put its more expensive competitors to shame.",
  "pros": [
    "Fully-programmable keys",
    "Short travel",
    "Thin, sleek design"
  ],
  "cons": [
    "Loud",
    "No multimedia buttons"
  ],
  "article": [
    "With keyboards, you can hardly expect a lot. As long as it does what it’s supposed and it’s comfortable to use, then you don’t really have anything to complain about. With keyboards built for gaming, you’ll probably need a little more – better actuation, high responsiveness, more accuracy, and of course, RGB lighting – but the idea is pretty much the same. It has to do what it’s supposed to do and whether it’s comfortable enough to not cause finger and wrist fatigue.",
    "But with its Game Series RGB Low Profile Mechanical Keyboard, Havit has taken keyboards to a new level, and it’s so good, it will leave you wondering how you’ve survived this long without its features.",
    "At $69 / £64 / AU$99, the Havit Low Profile Mechanical keyboard also offers full customization, not to mention a super slim and compact body, for a very immersive, seamless, and fun experience. Let’s get into details.",
    "Slim, sleek, and strong would be the adjectives that come to mind when you’re using the Havit Game Series RGB Low Profile Mechanical Keyboard.",
    "This beauty is indeed very thin at only 0.89 inches and very compact so that not only does it take up less space in your desk, but it’s also portable.",
    "It’s also one of the sleekest mechanical keyboards we’ve seen, not as boxy as others and with a tapered silver trimming around the edge of its otherwise ordinary white lettering on black design. And of course, it’s made from durable alloy, which feels well-made and hard to bend , so you know it can withstand a lot of abuse during gaming.",
    "A few other things we appreciate about its design include the rubber pads at the bottom that really keeps the keyboard in place. The RGB keys themselves, have a 3mm travel and boast 1.4mm response distance due to the Kailh blue switches they use. Soft key presses bounce back nicely, so you don’t have to jam on it too hard to get some form of feedback. Combined with its matte finish, and this keyboard is very comfortable to use even when you’ve been at it for several hours.",
    "The only things to complain about, if we’re going to be nitpicky, are the fact that it’s not wireless and that its missing its multimedia buttons. However, considering that this keyboard is completely customizable – and we’re talking everything from changing the RBG lighting and movement to assigning functions – you’ll hardly miss these two things.",
    "There’s also the fact that it is a little loud. Sure it comes with the territory of buying a keyboard with Kailh Blues that are designed to be clicky, but these are also the only kind of key switches available on the Havit Low Profile Mechanical Keyboard, so you can’t pick something quieter like a tactile or linear switch. Then again, even “silent” mechanical keyboards are louder than the membrane ones so key clacking sounds can’t really be avoided.",
    "Overall, we’re giddy over the Havit Low Profile Mechanical Keyboard’s design, especially when combined with its features, which we will get to next.",
    "The Havit Low Profile Mechanical Keyboard is chock-full of features, so much so that even if this were the crappiest functioning keyboard on the planet, you’ll most likely find it appealing enough to consider buying. Thankfully, it’s also very functional. But we’ll talk about its performance later; let’s list all its awesome features first.",
    "One of the best things about this keyboard is its fully customizable set of keys. That’s right; all 104 of them, even the Shift, Enter and Control keys, are fully customizable through the Havit driver or software. And we’re not just talking reprogramming the keys to assign characters.",
    "Using the software, you can reprogram each key to (1) assign one character or a combination of up to three characters, (2) assign a macro, (3) be turned into a media button, or (4) play a sound, launch a program, and even open a file or folder. At this point, you might as well get rid of your mouse! The software will also allow you to disable a key or return it to its default setting with a press of a button.",
    "To create macros, you just need to click on the software’s Macro Management. It lets you make as many macros as you want.",
    "Personally, this reviewer loves this keyboard’s RGB presets and lighting control the most. Havit has taken its RGB game to a whole new level. First of all, at default, each of the Profile Mechanical Keyboard’s Function and Arrow keys can assign different RGB presets. That’s 16 different presets total, some of which light up the most used keys for different gaming genres, others activate different lighting effects. A few even have different variations of the same effect… you know, in case you’re tired of pink and want to switch to blue.",
    "And it doesn’t end there. You can also utilize the same software to customize each of these presets or create your own effect. So it’s definitely worth sitting down with this keyboard for a good hour or so to really design it based on your needs and preferences.",
    "A few other bells and whistles included in the software are the Game Mode, which allows you to lock or disable the Windows, Function, and Desktop keys to prevent you from accidental pressing them while playing games; and the WinLock mode, which only locks the Windows button.",
    "The software also allows you to change the response time, with options ranging from 2ms to 20ms, and the USB report rate ranging from 125Hz to 1000Hz. Lastly, it lets you create your own profiles – up to six – so that you can save all your different customizations and use them when needed.",
    "The Havit Low Profile Mechanical Keyboard is rock solid in its performance – excellent actuation especially when gaming with a great bounce back (though that physical bounce back is something you would need to get used to if you’re a mostly membrane keyboard user). There isn’t any discernible lag or latency, and no missing keystrokes even when you’re button mashing. It’s also super responsive when gaming and is able to detect any intentional presses.",
    "When playing Shadow of the Tomb Raider, for example, we were able to heal quickly in the middle of a heavy battle by pressing F1, even though we were pressing other keys at the same time. We were also able to throw our pickaxe at just the right time by pressing E to avoid from falling to our doom.",
    "Because it’s a mechanical keyboard, it’s more reliable, not to mention more durable and longer lasting. That means that whether you’re playing a game or doing actual productivity work on your computer, it’s going to be more accurate than membrane keyboards. That’s because each key has its own switch, and any presses are less likely to be registered unless you're purposely doing it.",
    "That’s the case with this keyboard. But because it also boasts soft keys that are 7mm thinner than traditional mechanical keyboard keys, it’s so much easier and more comfortable to use. And because it’s a wired keyboard, you won’t have to worry about battery life or connectivity.",
    "Overall, we cannot find fault in the Havit Low Profile Mechanical Keyboard’s performance and design, not to mention are giddy over its incredible and fun features. It is highly accurate, super responsive, and very comfortable to use, making it perfect not only for productivity but especially for gaming. And if you want the fully immersive gaming experience, with zero interruptions and all the RGB lighting effects your heart could ever hope for, it also boasts full programmable keys and lighting.",
    "The best part is they dropped the prices on these babies to $69 / £64 / AU$99, so with everything you’re getting from this little keyboard that could – from excellence in performance to adaptability and flexibility in its features – you’re scoring a bargain.",
    "Image Credits: TechRadar"
  ],
  "headers": {
    "3": "Design",
    "10": "Features",
    "18": "Performance",
    "22": "Final verdict"
  },
  "links": {
    "Shadow of the Tomb Raider": "https://www.techradar.com/news/shadow-of-the-tomb-raider-review-a-fitting-end-to-lara-crofts-redemptive-reboot"
  }
}