{
  "source": "https://www.techradar.com/reviews/call-of-duty-modern-warfare-2019-review",
  "title": "Call of Duty: Modern Warfare (2019) review",
  "category": "gaming",
  "updated": "2019-11-27T17:00:40Z",
  "author": "vic-hood",
  "summary": "Stay frosty",
  "verdict": "Call of Duty: Modern Warfare (2019) sees the franchise move back in a promising direction, flaunting stunning graphics, fast-paced action and more multiplayer modes than you can shake a stick at. But the biggest change is in tone, with the campaign shifting to darker, more mature content that has split opinion and tests player's morals. It's uncomfortable at times, but it's the most thought-provoking instalation the series has seen yet - for better or worse.",
  "pros": [
    "Nvidia ray tracing on PC",
    "Provocative - more strategy and thought required",
    "Change in tone and format",
    "Plenty of multiplayer modes"
  ],
  "cons": [
    "Mechanics formula is largely unchanged",
    "Provocative - hits close to home",
    "Rewrites history in some places"
  ],
  "article": [
    "Following a US convoy down the dusty streets of fictional Urzikstan, we scan what's left of the desolate buildings on either side of us for the slightest bit of movement.",
    "We're heading towards a hospital to capture terrorist Al-Qatala leader 'The Wolf,' fresh after an attack on London's Piccadilly Circus. It seems like a pretty straightforward Call of Duty level: get down the street, inevitably meet some terrorist snipers on the buildings we're watching, have a big ol' firefight and continue on to victory.",
    "Then an IED goes off. Below our feet. Killing several members of the convoy. Taking us completely by surprise. We were watching the roofs. They usually attack from the roofs.",
    "It's this which epitomizes Modern Warfare, a shake-up in formula that is far too real and leaves you feeling a bit more than uncomfortable. My father survived an IED in Baghdad - and this in-game moment hitting out of nowhere was a shock, for better or worse. But there's also the question: does Infinity Ward have the right to capture that moment, put it in their game and monetize it?",
    "Which is the big draw for the Modern Warfare reboot: it's incredibly provocative. Before you ever lay hands on the game, you'll hear about specific levels which may have gone too far or how it has ripped its missions \"straight out of the headlines\".",
    "Take, for example, the already notorious 'Clean House' mission which sees you raiding a Camden town house in London, following the aforementioned terrorist attack on Piccadilly Circus, killing the plain clothes residents and even encountering a mother cradling her baby.",
    "However, while the controversy of Modern Warfare is an important aspect, it is not the be-all and end-all. This review will examine the controversial parts of Modern Warfare alongside the aspects we look at in every game review. We questioned whether to do this or not, but at the end of the day it's a question of what Infinity Ward marketed Modern Warfare as, and what it has delivered. In some cases those two things don't match up and, in that case, it's not a political issue but one of whether consumers will get what they paid for. Here at TechRadar, that's what matters: you.",
    "We will not be questioning whether Modern Warfare has gone too far, what we will lay out is everything we think will actually be important to you before you consider buying this title - regardless of politics or personal feelings.",
    "So, strap in, and let's break the whole thing down.",
    "[Warning: Spoilers ahead.]",
    "Let's start with the general premise of Modern Warfare's campaign. Loosely based on the Gulf War, Modern Warfare sees you primarily playing as CIA officer Alex and SAS Sergeant Kyle Garrick (accompanied by familiar face Captain Price) who are working to recover stolen chemical gas that has been hijacked by a terrorist organization in Urzikstan.",
    "While Alex is embedded with rebels in the fictionalized country - battling against the Russian forces who have occupied it - Garrick begins by dealing with the conflict's impact on London, in the form of a terrorist attack, before branching further afield. We're trying not to spoil too much.",
    "Yeah, there's quite a bit of pro western propaganda in Modern Warfare and even an instance where history has been rewritten to make the US look better. In a mission titled 'Highway of Death', you are told how the Russians bombed this vital road during the invasion and killed those trying to escape. It's a clear reference to the real Highway of Death incident of 1991- which, in reality, the US military slaughtered Iraqi forces who were retreating - but told from a completely different perspective.",
    "Herein lies the conundrum of the game, it's very clearly political and yet both Activision and the game's developer say that it's apolitical. This is blatantly disingenuous and, at worst, a clear re-writing what is tantamount to a war crime for the sake of storytelling. Either way, it's impossible to overlook and will ultimately color how you feel about the world and the tragic, multifaceted events that are now being purposely, profoundly obfuscated.",
    "And we're not the only ones who feel that way: The anti-Russian propaganda is so over-the-top, in fact, that the PlayStation Store in Russia isn't selling the title and prominent Russian streamers have quit the game over its depictions of some events.",
    "However, despite these clear issues, it is difficult to deny that Modern Warfare is more relatable than other CoD games. Whether that's a good or bad thing will really depend on your own personal experience, but the missions and scenarios portrayed are certainly more familiar than fighting Nazis in World War II - even if they can be hard to swallow.",
    "There's one instance when you're trying to fend off Russian reinforcements in a base and the game cuts to you playing as one of the US air reinforcements. You fly over the base, and using thermal imaging, identify and gun down dozens of Russians. But through this view they are seen only as white moving objects.",
    "It feels like the point Infinity Ward is trying to make is that this is how the military view the enemy in that scenario but its a dangerous broad stroke. It's also unsettlingly familiar, as we recall the news footage of attacks in Syria showing similar scenarios.",
    "We struggled with the fact that we enjoyed the familiarity, despite the many issues with it. This is the type of war we have watched happen from our TV screens and read in the newspapers. Obviously we will feel an affinity to it. However, that doesn't mean that Modern Warfare can ever truly capture that experience. Not even close. For us - or Infinity Ward - to think it could is ignorance.",
    "It's worth noting that you don't have to play the campaign if you don't want to. There is still the less troubling multiplayer - a CoD staple - which has a multitude of modes to keep you occupied, including a co-op option. We'll come back to those in more detail later on. However, you won't unlock most of the game's Operators unless you complete the campaign.",
    "Multiplayer is Call of Duty's bread and butter, largely responsible for the franchise's loyal fan base. And while it largely remains unchanged, the game introduces a few features introduced that makes things a lot smoother.",
    "For one, Modern Warfare has console-PC cross-play for the first time in the franchise's history. In a blog post Activision confirmed that \"most\" of its post-release content will launch across all platforms simultaneously. So new maps, modes and missions will be available to everyone at the same time - finally.",
    "And this crossplay introduction doesn't seem to have affected the matchmaking in a huge way, it still takes only a few seconds to be sorted into a multiplayer match.",
    "In addition, there's a couple of new multiplayer modes (on top of the classics like Team Deathmatch) for you to try out. Firstly, there's Gunfight which is an intense 2v2 mode where two teams play in multi-round cage matches across three small custom maps. Every two rounds, teams swap to opposite sides of the map. All four players will have the same loadout which will typically be comprised of a primary and secondary weapon as well as a tactical grenade and a piece of lethal equipment. The first team to win six rounds are the winners.",
    "If you prefer bigger teams, then you can enjoy 6v6, 10v10 and 20v20 matches - alongside a new mode called Ground War which supports up to 100 players and is essentially a large scale, much longer match.",
    "While these modes are an interesting change, they don't do huge amounts to shake up the Call of Duty formula. So if you're happy with a tighter version of the usual CoD multiplayer with a dash of new content then you should be pleased. Remember, there's no Zombie mode this time around, but killstreaks and perks are back.",
    "In addition to classic multiplayer, there's also Special Ops which can be played by up to four players together, with the main aim being to work together to “stop and sever a global terror organization’s access to weapons, funds, intelligence, and hardware\".",
    "Special Ops is divided into two game modes: missions and operations. Operations are multiplayer-only matches that feature unique objectives and a certain amount of freedom in terms of how you approach it.",
    "Missions, meanwhile, can be played with others or solo. These missions are less sprawling than Operations and more focused on testing your skills with certain weapons or tools. On completing a mission, your performance will be given a star rating.",
    "Special Ops is a nice palate cleanser between quickplay multiplayer modes, when you fancy a bit more direction and narrative but also want to work with others.",
    "Now, let's talk about where Call of Duty: Modern Warfare truly shines: its graphics.",
    "Modern Warfare is stunning: every facial expression, each detail-clad environment and beautifully-shot cinematic. We were playing on a standard PS4 and were still blown away by the graphics.",
    "Each cinematic feels like stepping into an interactive war epic, while (being a London resident) we can say that the details of maps such as Piccadilly circus are pretty spot on - even if they're largely fictionalized.",
    "It's no surprise as Modern Warfare uses a brand new engine for the series, the first time the games have used a new engine in 14 years. And we're definitely big fans.",
    "It's worth bearing in mind that if you choose to play on a Nvidia ray tracing capable GPU, then you can enjoy even better graphical performance. Make sure to check out our Call of Duty: Modern Warfare performance test on PC.",
    "Other games have struggled to dethrone Call of Duty as the king of first-person shooters and Modern Warfare is a testament to this. The gunplay in Modern Warfare is tight and incredibly smooth, with each bullet feeling suitably weighty and every kill feeling earned.",
    "Likewise, movement is fluid, though the restricted mantling is a bit of a pain, allowing you to quickly manoeuvre through maps with relative ease - there's even the ability to slide now (thanks, Apex Legends).",
    "While the UI itself is clean and simple, you have the option in some cases to make things more \"realistic\" by removing it altogether. This means you simply see what your player would see, without any directions on how much ammo you have, what guns are in your arsenal or where you are on the map. It's considerably more difficult, and one for those who appreciate a challenge.",
    "What we found most interesting about Call of Duty's combat is how much more aware players need to be of their environment - as you would in a real war. As previously mentioned, one foot out of place resulted in an IED explosion but actually the game - particularly the campaign - is riddled with these scenarios: tripwires, clandestine enemies, and dangers that push you to stay constantly aware.",
    "And the enemies themselves arguably showcase this best. Most of Modern Warfare's enemies don't actually look like a stereotypical enemies at all. There's no malevolent man twirling his moustache or a clearly marked Nazi looming over you, instead you have plain-clothed NPCs - most of the time.",
    "This seems like an to attempt to teach you a whole new lesson about being trigger-happy. The immediate reaction in CoD levels is to run and gun, clear rooms and shoot your way to victory. But actually, you need to be a bit more aware of who you're shooting at.",
    "For example, in a level involving an incident in the Embassy, you are clearing the building of terrorists, ultimately running from room to room lighting up the bad guys. However, some have grabbed Embassy employees as hostages. Something you maybe don't realize, as you run down halls and immediately shoot everyone on sight before noticing one was a civilian and having to question whether to restart the mission to lift that guilt.",
    "This is made even harder in scenarios when the lighting is dim or smokey, where you can often find yourself accidentally shooting members of your own team before failing and being told \"friendly fire will not be tolerated\". The shooting of civilians, on the other hand, will.",
    "The civilian casualties feel like a point Infinity Ward is trying to make that once again feels uncomfortable - both in moralism and in practice. Often civilians are almost impossible to avoid, especially when you're in the full swing of things. But it feels like a commentary on how 'easy' it is for military personnel to accidentally kill civilians in those situations. It's an extremely complex issue, and it's not Infinity Ward's place to explore it.",
    "When it comes to Call of Duty: Modern Warfare, the story, obviously, is troubling. While we can't cover all the aspects of it, we can't help but feel that Infinity Ward overstepped moral boundaries in its quest to deliver something more impactful to players.",
    "In our opinion, it is not Infinity Ward's place to be trying to teach people about the 'moral conflicts' involved in war through a videogame, as it will never truly capture that experience. The fact the game was marketed like it's capable of doing so is uncomfortable, but what one person finds morally ambiguous, won't necessarily have the same impact on someone else.",
    "That's disappointing because, as a game, it's the best the franchise has ever been. It's a wonderfully tight shooter, with impressive graphics and plenty of much-needed feature additions that shift the series in a promising direction.",
    "The change to a darker, more mature tone is what the series needed but the aforementioned issues mean that it falls short in that regard. There's still a way to go.",
    "However, if you love Call of Duty primarily first-person shooter - with little interest in its narrative - then you will probably enjoy Modern Warfare. We would definitely warn those who have partaken in active military service to proceed with caution."
  ],
  "headers": {
    "10": "Closer to home",
    "20": "So you definitely want to hear about multiplayer...",
    "30": "Art of war",
    "35": "Critical combat",
    "44": "Final verdict"
  },
  "links": {
    "apolitical": "https://www.pcgamer.com/infinity-ward-says-modern-warfare-isnt-political/",
    "Operators": "https://www.techradar.com/how-to/call-of-duty-modern-warfare-operators-every-cod-skin-and-how-to-unlock-it",
    "blog post": "https://blog.activision.com/call-of-duty/2019-09/Incoming-Intel-The-Modern-Warfare-Open-Crossplay-Beta-Starts-Thursday",
    "Gunfight": "https://www.techradar.com/how-to/call-of-duty-modern-warfare-gunfight-mode-essential-gunfight-tips-and-tricks",
    "killstreaks": "https://www.techradar.com/how-to/call-of-duty-modern-warfare-killstreaks-list-of-every-cod-killstreak-reward",
    "perks": "https://www.techradar.com/how-to/call-of-duty-modern-warfare-perks-best-cod-perks-for-your-playstyle",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "Call of Duty: Modern Warfare performance": "https://www.techradar.com/news/call-of-duty-modern-warfare-performance",
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review"
  }
}