{
  "source": "https://www.techradar.com/reviews/lenovo-legion-y7000p-review",
  "title": "Lenovo Legion Y7000P review",
  "category": "computing",
  "updated": "2019-04-10T17:11:49Z",
  "author": "michelle-rae-uy",
  "summary": "A lot of gaming goodness for the price",
  "verdict": "The Lenovo Legion Y7000P is a fantastic gaming laptop. It comes with enough firepower to run most games, even very graphics-hungry ones, without too much trouble. And, with a barely four-figure starting price, this is one of the best budget gaming laptops available. The only issue is that the Y7000P is only available through a small selection of retailers.",
  "pros": [
    "Powerful",
    "Effective cooling system",
    "Surprisingly long battery life",
    "Great price"
  ],
  "cons": [
    "Mediocre soundstage",
    "Hard to find at retail",
    "Weird port placements"
  ],
  "article": [
    "The Lenovo Legion Y7000P is a rare monster. What initially seems to be just another variant in the long line of budget gaming laptops is actually a powerful machine. The Y7000P sports an Intel Core i7 processor, Nvidia graphics and enough RAM capable of providing for just about any current gaming need. It comes with a more than competent display and most of the peripherals hold up to scrutiny as well.",
    "The laptop boasts a minimalist gamer form factor with a matte black case and white-only backlighting. The Y7000P’s no frills approach has most of the ports hidden in the back of the machine, for better or worse, and included software is limited to two Lenovo programs specifically for gamers. It comes with more surprises as well: longer-than-expected battery life and a heat management system that seems to handle cooling better than most.",
    "It’s not a perfect machine, with some flawed features such as a mediocre sound stage and the lack of an SD card reader, but the biggest drawback is that the Lenovo Legion Y7000P is so hard to find.",
    "The Lenovo Legion Y7000P is somewhat of a ghost in terms of availability. Very few retailers carry the model, and a search through the Lenovo website comes up empty. It turns out that the Y7000P is only available through a few large retailers, such as Amazon. However, when it does turn up, it may be had for a reasonable $999 (about £765, AU$1,400). This is for a more basic system than reviewed, with just 8GB RAM and missing the second hard drive.",
    "Similarly priced machines such as the Asus Rog Strix Edition or the HP Omen 15 share a lot of qualities with the Y7000P, but in one way or another, tend to fall short. The Asus comes with an i5 processor and GTX1050 Ti, for example.",
    "The Y7000P is actually a variant of the Legion Y530, and with various customizations can range from $829.99 (about £640, AU$1,170) to $1,499.99 (about £1,150, AU$2,115).",
    "The design of the Y7000p is somewhat unique in that it offers up a mature minimalist look that is still clearly meant to evoke a gaming laptop. The back of the display panel has a matte yet chic aluminum lid, while the rest of the computer is encased in sturdy matte black plastic. The only accents to the computer are the aggressively slanting vents in front and back, and the white backlighting on the keyboard, power button and display panel. All in all, it is one of the more attractive gaming laptops we’ve come across.",
    "While the laptop is not covered in ports, it does have enough for just about any need. It also has a USB-C port for those who want to use a blazing fast external hard drive. Most of the ports are on the back, however, which is a strange choice and can make laptop placement awkward, especially since the AC adapter port is right there in the middle. Also, we would have liked to see an SD card reader included in the port selection.",
    "The cooling system within this laptop may be one of the most noticeable positives here. Most gaming laptops tend to get noticeably hot under stress, usually right under the keyboard. Yet with the Y7000P, even under the duress of graphics-heavy AAA games, the laptop’s two fans and three heat pipes seem to keep temperatures down with ease.",
    "That’s not to say we couldn’t hear the fans as they were running quite often, however. This is not a quiet computer.",
    "The trackpad on the Y7000P is more than decent for most productivity needs, and we don’t experience any real issues with missed presses. Its left of center positioning does result in some accidental palm presses, which is a little frustrating. Good thing there is a hotkey to lock the touchpad during gaming. And, you more than likely will be using an external mouse when gaming anyway.",
    "The keyboard is not the most gaming centric one we’ve come across. It only has a few gaming related hotkeys, such as touchpad lock and display selection, with the rest of the hotkeys dedicated to media shortcuts. The keyboard only offers white backlighting that can be set to three levels (off, medium and bright). Keep that in mind if RGB lighting is important.",
    "However, the keyboard does have a textured matte feel to it that makes typing a pleasant experience. The keys seem to be wider and taller than on most keyboards, particularly the arrow keys (which are crucial in gaming), but it just takes some adjustment to get used to. And, it also has just the right amount of travel, 1.7mm, for quick and accurate responses. While this may not be on par with competitive gaming keyboards, it’s more than enough to handle the demands of most games.",
    "The sound quality on the Y7000P, courtesy of stereo Harman speakers, is pretty balanced without the kind of tinny high notes that cheap speakers tend to produce or the overwhelming bass with which other computers seem to overcompensate. Music and in-game sound effects are relatively accurate sounding, and games with great sound, like Far Cry 5, are pleasing to listen to. There is no ear fatigue involved here.",
    "The sound stage was a let down, however. Not that it isn’t there; we can hear some semblance of movement in the games and movies we’ve been testing. However, it tends be narrower than usual, which can keep you from feeling fully immersed.",
    "The 15.6-inch Full HD display, on the other hand, is a pleasure to use. While the display runs at a serviceable 60Hz refresh rate, it is still accurate and responsive without any issues. Images are sharp, and the color reproduction is more than enough for any gamer’s needs. When running games like Assassin’s Creed Odyssey, it is a pleasure to just experience the scenery of the game, whether it is riding a horse through the countryside or sailing out to sea.",
    "The only issue with the screen is that the backlighting on the lower left side shows through a little when the screen is reproducing dark colors. We’re not sure whether this is just an issue with our review model, but it’s a flaw nevertheless.",
    "The webcam that comes included is 720p and is decent compared to most that come standard on laptops. However, its placement at the bottom of the display panel makes for weird positioning."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "13": "Display, camera and sound"
  },
  "links": {}
}