{
  "source": "https://www.techradar.com/reviews/anker-soundcore-liberty-air",
  "title": "Anker Soundcore Liberty Air review",
  "category": "audio-visual",
  "updated": "2019-07-04T11:22:43Z",
  "author": "gerald-lynch",
  "summary": "Functional and affordable entry into the true wireless sphere",
  "verdict": "Anker’s Soundcore Liberty Air true wireless earphones are comfortable, lightweight and loud, but may struggle with distortion.",
  "pros": [
    "Great fit",
    "Attractive price",
    "Pocketable battery case"
  ],
  "cons": [
    "Can distort at louder volume levels",
    "Better battery life available elsewhere"
  ],
  "article": [
    "Anker has made its name on affordable, dependable products. The cheap, cheerful, and often no-frills approach to design has made it a go-to brand for those looking for bargain gadgets. The Anker Soundcore Liberty Air takes those principles, and applies it to the burgeoning true wireless earphone market.",
    "With a solid feature set and an attractive price, there’s lots to like here. But it’s also notable where some price-cutting concessions have been made.",
    "The Anker Soundcore Liberty Air true wireless earphones are available now, with an RRP of £99.99 / $79.99 (about AU$140). That’s very affordable for a pair of true wireless buds, and we’ve already seen as much as a fifth knocked off that price tag already, making them a good pair to keep an on for deals hunters around those key Amazon Prime Day and Black Friday shopping seasons.",
    "If you look at the competition, the Liberty Air earbuds most closely resemble the Apple AirPods, which cost $159 / £159 / AU$229. Apple’s buds are smarter with their seamless connectivity setting for iPhones, but that's a feature wasted on anyone not part of Apple's mobile ecosystem. In terms of the budget space, we keep coming back to the superb Funcl AI, available for $79, which converts to roughly AU$110, or £60, from sellers like Amazon. We currently consider the RHA TrueConnect our best true wireless earbuds, but you're looking at around double the price for the quality they bring. Definitely consider them if you have the cash, though.",
    "If you’re familiar with other true wireless headphone brands, you’ll know what to expect here. The Liberty Air buds connect over Bluetooth, and have their own power supplies in their toothbrush head-like stems. This means they can connect to your phone without the need for any wires whatsoever. They’re then popped into a pill box shaped battery case, which itself is rechargeable, re-juicing the buds between listening sessions.",
    "Anker’s design is one that follows the look of the market-leading Apple AirPods, albeit the pair we tried came in a black shade rather than a white finish. Each bud has a little stem that hangs just out of your ear, rather than the bud-only design of some true-wireless headphones. They’re a gloss black finish, with touch sensitive buttons on both buds and, while a little larger than the Apple AirPods, are incredibly lightweight and comfortable in the ear.",
    "The case itself opts for a matte-black finish, with a microUSB charging port on the bottom, a snap-shut hinged lid and magnetic crevices for storing and charging the earbuds on the inside. A three-dot LED light indicates how much power is in the charging case – the buds themselves have the capacity for five hours of playback between charges, while the case stores enough power for a further three charges, for a maximum playback time of 20 hours. We found this to be broadly accurate, but expect mileage to vary based on how loudly you play your music.",
    "Anker’s Soundcore Liberty Air earphones are water resistant to a rating of IPX 5 – that means they’ll be protected from damage if you take them on a sweaty jog, but won’t survive a swim or a shower. Either way that’s useful, though you’ll want to make sure even perspiration has been wiped off before popping them back into the charging case.",
    "The pairing process is simple – take the Anker Soundcore Liberty Air earbuds out of their case, and give them a chance to pair with each other, indicated by a little white light on their shells. Then long press the touch-sensitive button on one of the buds to make them discoverable to your music playing device, and you’re good to go. Once paired once, they’ll automatically reconnect to each other, and your device, when taken out of their box. They usually do this more quickly than you can get them into your ears, which is excellently responsive.",
    "The buttons can be used to answer calls and skip tracks, depending on the amount of times you tap either bud. Compared to most similar true wireless earbuds, these controls were responsive and reliable. Likewise, activating a phone’s smart assistant, such as Google Assistant or Alexa, through the Anker Soundcore Liberty Air earbuds was reliable and useful – more so than in the majority of buds we’ve tried at this price point. The built-in microphones seem clear enough to work well with temperamental voice assistants, and for making calls.",
    "We’ve experienced a few minor problems in connectivity during testing: one momentary audio cut out while listening to an album, and an occasion during one song where audio would cut from one earbud to another. They were momentarily lapses though, and we're confident that connectivity stability, overall, shouldn't be a problem for the Anker Soundcore Liberty Air.",
    "Anker claim that the Liberty Air buds should have superior audio performance, as they’re built using a Graphene-enhanced design, but in practice they sound good, if unremarkable. Their buds can admirably passively block external sound, and as they go quite loudly, almost negate the desire for them to have active noise cancelling capabilities.",
    "What was surprising was how powerful their bass performance can be. Listening to the Childish Gambino album ‘Awaken, My Love!’, we were surprised at how strongly the sub bass elements came across (even if they did sound a bit flabby). They certainly won’t bother audiophile grade alternatives, but for no-fuss day-to-day commuting use, they could be a perfect travel companion.",
    "Detail can be crisp and close to complete – we had no trouble picking out details from the multi-layered Doves track, 'There Goes the Fear', for instance.",
    "Where they may struggle however is when pushed to the extremes of their volume capabilities. It’s here that we started to hear unwanted pops and crackles, with the Liberty Airs struggling to control their output. More gentle recordings suffer here, where unwanted distortion can appear quite prominently.",
    "The Anker Soundcore Liberty Air earbuds are a neat, affordable true wireless headphone package. They’re a comfortable fit, have a nicely designed charging case, and have above average sound quality – especially welcome given the price point.",
    "However, we’ve found that they do tend to distort a bit when playing music loudly, which could frustrate given there’s no active noise cancellation onboard to encourage you to dial down the volume.",
    "They're a solid choice regardless. The true wireless earbud market is getting increasingly competitive, and it's getting easier to find an affordable pair. But Anker's done enough here to keep its budget-friendly reputation confidently defended.",
    "All image credits: TechRadar"
  ],
  "headers": {
    "2": "Price and availability",
    "4": "Design",
    "8": "Connectivity and smart features",
    "11": "Sound",
    "15": "Verdict"
  },
  "links": {
    "true wireless earphone": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-2019-cyber-monday-2019-uk",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "Funcl AI": "https://www.techradar.com/reviews/funcl-ai-true-wireless-headphones-review",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FFuncl-AI-Bluetooth-SweatProof-Microphone%2Fdp%2FB07LBSWV36%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1174216249995044000-20",
    "RHA TrueConnect": "https://www.techradar.com/reviews/rha-trueconnect",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around"
  }
}