{
  "source": "https://www.techradar.com/reviews/beelink-t4-windows-thin-client",
  "title": "Beelink T4 Windows thin client review",
  "category": "computing",
  "updated": "2019-11-29T18:59:41Z",
  "author": "desire-athow",
  "summary": "The cheapest Windows 10 PC is here",
  "verdict": "The Beelink BT4 is a computer that does what it says on the box. It has no lofty aspirations but, given that it costs just over $100, manages to convince us that it is a capable thin client, just as long as you don’t ask it for too much.",
  "pros": [
    "Very cheap",
    "DisplayPort",
    "Very small footprint"
  ],
  "cons": [
    "Storage performance is very low",
    "Warms up quite a bit",
    "No card reader"
  ],
  "article": [
    "Intel belatedly acknowledged and apologised to its customers for CPU shipment delays that have been a bit of a distraction for the chip giant. Smaller vendors outside of the usual suspects (Dell, Lenovo or HP) have had to make do with scraps.",
    "Beelink is one of them and has been forced to be very creative in finding parts for its latest entry level Windows thin client, the BT4, not to be confused with the BT4 or the BT3 Pro. This is why they didn’t have any other choice but to use a processor that will be five years old next year.",
    "The Chinese PC manufacturer is not an unknown quantity; over the past three years we examined the Beelink L55, the M1, the A1 and the BT7 and they all left a good impression during their reviews.",
    "The T4 is tiny at 106 x 106 x 17.7mm. It feels solidly built out of a black matte plastic shell and has plenty of holes, all over its enclosure to keep it cool. It won’t win any awards with its conservative design but at least it is utilitarian.",
    "Other than its proprietary power port, it comes with two USB 3.0 ports, a USB 2.0 one, one DisplayPort (yes, a DP), an HDMI port, a Gigabit Ethernet and an audio jack plus a power off button at the front, one that lights up when the device is on. There are no card readers.",
    "Because of the ongoing stock issues with Intel processors, Beelink has had to opt for the Intel Atom X5-Z8500. This is an obsolete CPU, let’s not kid ourselves, one based on the Cherry Trail architecture with four cores, a base frequency of 1.44GHz, 2MB cache and a TDP of 2W.",
    "The rest of the hardware specification is very much what you’d expect from a computer that costs not a lot more than $100. 4GB LPDDR3 memory, 64GB eMMC storage, Bluetooth 4.0 and 802.11ac. There were two HDMI cables in the box that came with it as well as a VESA bracket to place the device behind a monitor.",
    "The whole thing is powered by a 12W (5V,2.4A) power supply unit, which means you could potentially use a portable battery charger to get it running, with some simple DIY.",
    "Beelink’s T4 runs quiet thanks to a lack of fan but it does get rather warm because of the oversized heat sink that is used to dissipate the extra heat. In terms of performance, it was slightly worse than what we’d expected which we think is partly due to its abysmal storage subsystem.",
    "The eMMC storage hit double digits on write speeds, the first time we had something that slow for the past year or so. This helps explain why the BT4 is near the overall bottom list when it comes to general performance.",
    "The biggest surprise of the day has to be the inclusion of a DisplayPort connector something you don’t find on products in that price range and although we didn’t test it, you should, in theory be able to run two 4K monitors, albeit at 30Hz. Don’t expect any gaming though, just bog standard office tasks or even for interactive displays.",
    "If $110 is all you can afford to buy a computer then the BT4 is a compelling offer although spending a bit more can, as you’d expect, bring better performance.",
    "The BMAX B1 has a faster Celeron N3060 processor and an extra USB port. On top of that there’s a spare M2 slot and a VGA port, great if you want to use a legacy projector or screen. It costs a tenner extra and would be our preference if you don’t need a DisplayPort.",
    "We did not review the Beelink BT3 but on paper, it looks like the best of the lot thanks to a Celeron J3355 CPU which has a much higher base clock speed. It also supports a SATA storage device like a 2.5-inch hard drive plus it has four USB 3.0 ports and two HDMI connectors.",
    "If you can extend a bit further to $130, then consider the Acute Angle PC which not only has a fabulously inspiring design but also twice the memory and three times the onboard storage. It doesn’t have a card reader though and has only one video connector.",
    "It is easy to slag off the BT4 as being a slow computer but one needs to bear in mind that it is one of the cheapest Windows 10 computers on the market, a remarkable feat given that it costs less than what Microsoft charges for a retail version of Windows 10 Home edition.",
    "Once you adjust your expectations as to what this computer is really about, then it becomes easier to live with it. We like the fact that it has a DisplayPort connector which is a bit of a surprise but couldn’t help but wish that Beelink added a card reader as well.",
    "Hats off to Beelink though for being able to put together a device that may not be a powerhouse but will definitely make a perfectly decent HTPC or thin client for those on a budget."
  ],
  "headers": {
    "3": "Design",
    "5": "Hardware",
    "8": "In use and performance",
    "11": "Competition",
    "15": "Final verdict"
  },
  "links": {
    "Windows thin client": "https://www.techradar.com/best/best-thin-client",
    "L55": "https://www.techradar.com/reviews/beelink-l55-thin-client-mini-pc",
    "M1": "https://www.techradar.com/reviews/beelink-m1-mini-pc",
    "BT7": "https://www.techradar.com/reviews/pc-mac/pc-mac-desktops/beelink-bt7-mini-pc-1324365/review",
    "interactive displays": "https://www.techradar.com/best/best-interactive-kiosk-providers",
    "BMAX B1": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-9655757129094984000&p=https%3A%2F%2Fwww.gearbest.com%2Fmini-pc%2Fpp_009332349280.html%3Fwid%3D1433363",
    "Beelink BT3": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-1181568890782048800&p=https%3A%2F%2Fwww.gearbest.com%2Fmini-pc%2Fpp_009749578193.html%3Fwid%3D1433363",
    "Acute Angle PC": "https://www.techradar.com/reviews/acute-angle-aa-b4-desktop-mini-pc",
    "Windows 10 Home edition": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938"
  }
}