{
  "source": "https://www.techradar.com/reviews/hands-on-alcatel-3l-2019",
  "title": "Hands on: Alcatel 3L (2019) review",
  "category": "phones",
  "updated": "2019-02-25T14:13:21Z",
  "author": "john-mccann",
  "summary": "A low cost, big screen, dual camera Android phone",
  "verdict": "",
  "pros": [
    "Large, bright display",
    "Dual rear camera",
    "Low price"
  ],
  "cons": [
    "Older Android version",
    "No fingerprint scanner"
  ],
  "article": [
    "The Alcatel 3L (2019) is the cheaper sibling to the new Alcatel 3 (2019), and the two handsets have a lot in common.",
    "In fact, there are just four differences (or concessions, if you will), between the 3 and the cheaper Alcatel 3L - the L stands for 'Light' we're told.",
    "The 3L drops the fingerprint scanner, packs a slower Snapdragon 429 chipset, comes with less RAM and storage and features a less premium design.",
    "There are still positives though, with the Alcatel 3L boasting a 5.94-inch display, dual rear cameras, face unlock, AR emoji and an attractively low price tag.",
    "The Alcatel 3L price is €139 (around $160, £120, AU$220), although it's not clear at what point it will go on sale this year. We'll update this article when we know more.",
    "The Alcatel 3L, from the front, looks pricier than it is, with a large display taking up most of the front and a small notch housing the selfie camera giving it a slightly premium style.",
    "Pick it up, and the budget nature of the phone becomes more apparent, with a textured plastic rear that does feel cheap, but also provides plenty of grip.",
    "The rounded edges of the phone make it easy to hold in one hand (it measures 151.1 x 69.7 x 7.99mm and weighs 145g) and it's available in two colors: blue and black.",
    "There's a headphone jack on the top of the handset, while the power and volume keys on the right are easy to hit.",
    "The screen is 5.94 inches tall, with a 19.5:9 aspect ratio and features a HD+ (720p) resolution.",
    "On close inspection you will notice the lack of clarity in the display, but this is expected when you consider the price. It's still perfectly usable with clear, bright images and text.",
    "The notch, the size of the single front facing camera, is centrally located in the notification bar and doesn't really get in the way.",
    "The Alcatel 3L (2019) packs a dual camera setup on the rear, with the main 13MP sensor sitting above a 2MP depth sensing lens.",
    "This provides a portrait mode background blur feature within the camera, and during our time with the phone we found it to be serviceable.",
    "It's not going to take award winning snaps, but the camera is good enough at this price point.",
    "A more surprising addition is AR emoji, allowing you to control the facial expressions of on-screen characters. There are three animals and two humans to pick from and the face tracking works surprisingly well for a budget device.",
    "The quality of the AR emoji isn't as good as the experience you get on the iPhone XS or Samsung Galaxy S10, and the characters appear to have a slightly more limited range of movement, but it's nevertheless fun to use.",
    "Another feature packed into the new Alcatel 3L camera is automatic scene recognition. It can detect 21 different scenes and adjust settings to give you the best shot for your situation without you even knowing.",
    "We were unable to try this out during our hands on time with the phone, but look out for how it performs in a full review.",
    "Under the hood, the Alcatel 3L comes with a quad-core Snapdragon 429 chipset and just 2GB RAM. It's not going to set the world alight with performance, but there's enough in the tank to keep Android 8 Oreo ticking over.",
    "The Alcatel 3L also comes with 16GB of internal storage, although only around 9GB will be available for you to use once the Android operating system is taken into account. You'll want to keep an eye on your storage space if you plan on downloading a lot of apps, or taking an excessive number of photos.",
    "The good news is you can expand on this storage via the microSD slot, which supports cards up to 128GB in size.",
    "Rounding off the Alcatel 3 is a sizable 3,500mAh battery, although there's no fast charging support.",
    "The Alcatel 3 (2019) could be one of the budget hits of 2019 with what appears to be a great balance of features, power and style for a price that is hugely attractive.",
    "It remains to be seen if it can cope when loaded with apps and games, and the camera is passable at best, but with AR emoji, face unlock, a fingerprint scanner and large display there's little not to like.",
    "MWC (Mobile World Congress) is the world's largest showcase for the mobile industry, stuffed full of the newest phones, tablets, wearables and more. TechRadar is reporting live from Barcelona all week to bring you the very latest from the show floor. Head to our dedicated MWC 2019 hub to see all the new releases, along with TechRadar's world-class analysis and buying advice about your next phone."
  ],
  "headers": {
    "5": "Design and display",
    "12": "Camera",
    "19": "Specs and performance",
    "23": "Early verdict"
  },
  "links": {
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "MWC 2019": "https://www.techradar.com/news/mwc-2019-what-to-expect-from-the-biggest-mobile-show-of-the-year"
  }
}