{
  "source": "https://www.techradar.com/reviews/sega-genesis-mini-review",
  "title": "Sega Genesis Mini review",
  "category": "gaming",
  "updated": "2019-09-12T13:30:28Z",
  "author": "matt-hanson",
  "summary": "Sega does what Ninten…did",
  "verdict": "Packed with games, hidden bonuses and lovely touches, the Sega Genesis Mini is a faithful reproduction of Sega’s classic console, and a brilliant buy for fans of the original and newcomers alike.",
  "pros": [
    "Loads of games",
    "Very good value",
    "Lovely touches",
    "Fun bonuses"
  ],
  "cons": [
    "Feels a little plasticky",
    "Controllers are a bit light",
    "CRT filter isn’t great"
  ],
  "article": [
    "To coincide with the 30th anniversary of its iconic 16-bit console, Sega has released the Sega Genesis Mini, a compact reimagining of the console (known as the Mega Drive outside of the US) that comes pre-packed with 40 classic games – plus two bonus titles.",
    "With Nintendo having scored some pretty noticeable success with its NES Classic Mini and SNES Classic Mini miniature remakes of its classic consoles, it’s not too surprising to see Sega take a similar approach. For anyone who grew up in the 1990’s, the fact that old rivals Sega and Nintendo are going head to head again is rather thrilling.",
    "While this isn’t the first time Sega Genesis games have been available in a mini console, it’s the first time Sega has made an official product. That means you get the official branding and iconic shrunk-down design of the model 1 Genesis. For Sega fans and collectors, this makes it an essential purchase over those third-party consoles.",
    "The Sega Genesis Mini goes on sale on September 19, 2019 in North America (and in Australia as the Sega Mega Drive Mini), and October 4, 2019 in Europe, Africa and the Middle East, priced at $79.99/£69.99/AU$139.95.",
    "A huge part of the appeal of these official mini consoles is that their designs are beautiful (yet shrunken down) recreations of the classic consoles, though with a few modern twists, and like Nintendo’s offering, the Sega Genesis Mini is an accurate model of the original Genesis, with a working power switch, and a reset button that all work like they did on the original. The volume slider is only decorative, however.",
    "Even the flaps for the cartridge slot work, though of course you cannot insert any cartridges into it – original ones won’t fit, and the games that the Sega Genesis Mini run are all pre-installed in its memory.",
    "Still, it’s a lovely touch, and if you really want to relive your old-school gaming days, you can still hold open the cartridge flaps and give the Genesis a blow before running any games.",
    "It’s all shrunk down to a size that can easily fit in the palm of your hand – it really is impressively small. The attention to detail will make the heart of any old nostalgic gamer flutter with appreciation, and the only criticism we really have is that it does feel a little light and hollow, and therefore a bit too delicate. We’re used to our Genesis/Mega Drives being big chunky tank-like devices that can withstand a lot of punishment.",
    "It also appears that mini (yet non-functioning) add-ons for the Sega Genesis Mini, including a mini 32X and Mega CD will be made available in Japan as separate purchases. These are purely decorative, but it’s a nice touch that shows how much passion Sega has put into this. Shame they are Japan-only at the moment.",
    "You also get two controllers, which are faithful replicas of the original Genesis controllers. They are the same original size, rather than mini versions, and in our view that’s a good move, as it means we can rely on good old muscle memory to take over as we play the classic games. Having a smaller controller could ruin that – and potentially feel uncomfortable as well.",
    "There are changes to the Sega Genesis Mini as well, however. A HDMI out around the back lets you plug it straight into a modern TV, and power is supplied via MicroUSB and power adapter. All cables you need are included in the box.",
    "On the front, the two controller ports of the original are replaced by USB ports – as the new controllers have USB connections. This means you can’t plug in your original controllers. Thankfully, the new controllers are such faithful reproductions of the originals, that we don’t mind about that.",
    "Overall, the design of the Sega Genesis Mini is a complete joy, with lovely details and touches that show how much of a celebration this device is, while the few nods to modernity are welcome conveniences.",
    "One of the highlights of the Sega Genesis Mini is the user interface, which makes it easy to dive into your favorite games. The games are laid out on the menu screen, and are displayed with their original boxart. On selecting a game with the A button of the controller, a window appears giving you a summary of the game, including the year it was released and number of players.",
    "On the main menu you can choose to change the way the titles are sorted, including by alphabetical, genre or number of players – as well as by release date, which is the default.",
    "You can also press the B button to change the layout of the main menu into a virtual game shelf, where you can browse the titles using the spines of their cases. It’s a nice feature, though we prefer the default look.",
    "There’s also a Settings menu that lets you tweak certain aspects of the Sega Genesis Mini. From here, you can change the system language. In a nice touch, if you change the language to certain selections – such as Japanese – the visuals change to reflect the language (including original game artwork). Also, some games are only available in different languages, and this allows you to unlock even more region-specific titles.",
    "You can also change the screen settings to original 4:3 aspect ratio, or stretch them to 16:9 widescreen (yuck), and you can also enable a CRT filter to make modern TVs look like older CRT televisions, with scan lines and tweaked colors. Honestly, we preferred playing the games without the filter, as they look fantastic on modern TVs, while the filter made them look a bit dull.",
    "You can also choose the wallpaper that displays when you run the games in their correct 4:3 aspect ratio. There’s not a huge amount of choice, but it’s good to have options.",
    "However, perhaps the nicest thing about the main menu is the music that plays while you’re in it. It’s both brand new and retro, as it’s been specially composed by Yuzo Koshiro (the composer for iconic games such as Streets of Rage and Beyond Oasis). The track was even created using the YM2612 sound chip, the same one used in the original Genesis. Again, it’s a fantastic detail that shows the love that has been put into the Sega Genesis Mini.",
    "When playing games, you can save games – something you couldn’t do with the original hardware – by pressing and holding the Start button, or pressing the Reset button on the console.",
    "The games selection of the Sega Genesis Mini is very generous, with 40 classic games that span the history of the console, plus two bonus titles.",
    "The games are:",
    "Not only is that a healthy amount of games, but many of them are bonafide classics. There’s also a few deep cuts that some people won’t have played the first time around. So, while many people might not feel the need to pay for yet another copy of Sonic 2, the sheer amount of hours of gameplay you’ll get out of the Sega Genesis Mini is hard to beat.",
    "In contrast, the NES Mini has just 30 games, while the is even less with 20. As Sega fans, it pains us to say that while no one game really matches the heights of Mario 3 on the NES Mini, or Super Mario World on the SNES Mini, but as an overall package, the Sega Genesis Mini easily wins.",
    "Meanwhile, the PlayStation Classic, Sony’s attempt at producing a shrunk-down version of its classic console, has just 20 games as well.",
    "So, the Sega Genesis Mini easily wins for the sheer amount of games it offers, pleasing both fans of the original, as well as newcomers, thanks to a compelling selection of classic, well-known and obscure hits.",
    "Performance-wise, the Sega Genesis Mini does an excellent job of replicating the classic console, with both visuals and sound looking and sounding how we remembered. In fact, by going into the digital HDMI port, rather than old-school RF ports of older TVs, the visuals looked cleaner and more vibrant than ever.",
    "As we mentioned earlier, the CRT filter is aimed at giving people who want that old-school look a choice, but we preferred it off.",
    "The Sega Genesis was never the best performing console – many of its games were a bit too ambitious for the hardware, for example when playing two player Sonic 2, the original console would struggle. But on the whole, the Sega Genesis Mini does an excellent job of running games in a way that’s authentic, while also making sure their performance isn’t hampered for nostalgia’s sake.",
    "The interface makes picking and loading up games easy, and games pop up nice and quickly. We’ve been playing many of these games for decades now, and they perform as we remembered them, though purists may be able to detect small changes from the original hardware. But for most people, the Sega Genesis Mini performs brilliantly, faithfully reproducing the experience of playing classic games, while adding a few modern touches that makes the whole experience much more pleasant.",
    "The ports are handled by M2, which explains the quality, since the company had previously worked on Sega Ages and Sega 3D Classics, so its had plenty of experience with bringing Genesis games to modern hardware.",
    "One thing we did noticed when playing was that the Sega Genesis Mini controllers, while the same size as the original controllers, are a bit lighter, which took a bit of getting used to. If you’ve never played on the Genesis before, then this probably won’t be an issue, but for Genesis/Mega Drive aficionados, or anyone who likes a bit of heft with their controllers, it may feel a little odd at first.",
    "You can use Retro-Bit Sega Genesis 6-button controller as well. We’ve not tried it with any other USB games controllers, however.",
    "When Sega first announced the Sega Genesis Mini, many people might have thought it was a cynical attempt to ape Nintendo’s success with its miniature versions of its classic consoles. Perhaps, at first, it was. But the amount of love – evident in the little details, the hidden bonuses and sheer amount of content – that has been poured into the Sega Genesis Mini means this is more of a celebration than a cash grab.",
    "If you’re a Sega fan then you’ve probably owned Sonic The Hedgehog 2 on more platforms that you care to remember, but the Sega Genesis Mini does enough right to make you happy to buy it one more time. The fact that it comes packed with 41 other games – many of them rightly considered classics – for a decent price, makes it a very compelling purchase for anyone with fond memories of the original console.",
    "And if you’ve never played the original Genesis, then this is an affordable way to catch up on some brilliant games you missed out on.",
    "It offers better value for money than Nintendo’s consoles, thanks to the amount of games, and while it doesn’t seem to be able to be hacked like the PlayStation Classic, it provides a much better overall experience.",
    "Overall it’s a fantastic package and a worthy way to celebrate the 30th anniversary of one of the best consoles ever made."
  ],
  "headers": {
    "4": "Design",
    "13": "User interface",
    "21": "Games",
    "27": "Performance",
    "34": "Verdict"
  },
  "links": {
    "NES Classic Mini": "https://www.techradar.com/reviews/nintendo-classic-mini-nes",
    "SNES Classic Mini": "https://www.techradar.com/reviews/snes-classic-mini",
    "PlayStation Classic": "https://www.techradar.com/reviews/playstation-classic"
  }
}