{
  "source": "https://www.techradar.com/reviews/honor-10-lite-review",
  "title": "Honor 10 Lite review",
  "category": "phones",
  "updated": "2019-01-14T17:00:25Z",
  "author": "basil-kronfli",
  "summary": "Affordable smartphones never looked so good",
  "verdict": "The Honor 10 Lite might lack the oomph we'd want for heavy multitasking and 3D gaming, but it has loads of storage for the price, a decent camera, best-in-class design and a killer screen.",
  "pros": [
    "Striking design at a great price",
    "Runs Android 9",
    "Ample storage"
  ],
  "cons": [
    "Micro USB port feels dated",
    "Camera images overly processed",
    "Mono speaker"
  ],
  "article": [
    "Update: After Google suspended Huawei's future access to Android Play Store and security updates, there are serious question marks over the future of Huawei and Honor phones.",
    "While Google and Huawei have promised to support phones currently on the market, it's not clear how long they'll receive Android updates or access to the Google Play Store, which would severely curtail their usefulness compared to the competition.",
    "The Honor 10 Lite is the latest in a recent wave of mid-range smartphones that look like flagships, following the Nokia 7.1, Motorola One and Honor’s own Honor 8X.",
    "This time around, Honor has used the same core internals found in the excellent 8X and put them into a smaller body, and the result is that Honor now has a mid-range portfolio of big and regular-sized phones, its own, lower-cost alternatives to the iPhone XS and XS Max, Pixel 3 and Pixel 3 XL and the Galaxy S9 or S9 Plus.",
    "You can buy the Honor 10 Lite now in the UK, India, China and Europe – no US or Australian release has been confirmed.",
    "Costing £199 ($255, AU$360), the Honor 10 lite undercuts the bigger, already excellent Honor 8X, as well as the excellent Nokia 7.1 by a fair margin.",
    "With solid specs therefore, on paper the 10 Lite is an excellent-value option – and without giving too much away too early, after two weeks with the phone we can absolutely confirm that it is.",
    "The Honor 10 Lite punches way above its weight when it comes to its design – it looks great, and makes the 'water drop' notch design, as seen on the OnePlus 6T, more affordable than ever.",
    "It also has a premium look and feel. Despite featuring a plastic back and sides, it feels richer than the pricier Samsung Galaxy A7, and looks better too.",
    "While it can't compete with the A7's OLED screen in terms of quality, the Honor 10 Lite's smaller bezels makes it a more striking package.",
    "The phone has plenty of storage too. Most phones in this price range feature just 32GB storage, but the 10 Lite gives users a generous 64GB, of which about 50GB is available to the user.",
    "This is a mid-range phone with mid-range power, courtesy of a Kirin 710 processor paired with 3GB RAM. The upshot is less power-hungry internals that put less pressure on the sizeable 3400mAh battery.",
    "The Honor 10 Lite is a great-looking mid-range smartphone.",
    "In the box you get a clear case to keep your phone protected, and there's a screen protector pre-fitted as well, to stave off superficial screen damage.",
    "At 8mm thick and 162g, the 10 Lite is indeed light, owing largely to its plastic body. The sides sport a chrome effect and feel really nice in the hand – smooth, without being too slippery.",
    "As for the back, it looks like glass, and feels like it too, even sporting an ergonomic, premium glass-like curve. Be warned though: it's plastic – and plastic scratches much more easily than glass, so if you’re picking up an Honor 10 Lite, get the case on before you slip it in your pocket.",
    "There are plenty of color options here: Sky Blue, Midnight Black and Sapphire Blue, with some options sporting a gradient finish, as introduced on the Huawei P20 Pro and carried over to the Mate 20.",
    "The rear fingerprint scanner is in the middle of the phone and easy to hit, with the ridged edges easily identified when extending a digit.",
    "There are two cameras on the rear – again, not too bad for the price – and they’re slightly raised from the body. While camera bumps aren’t great, when you put the included case on the 10 Lite both case and lenses are relatively flush, so the bump becomes unnoticeable.",
    "On the bottom of the phone are a single downwards-firing speaker, a microUSB connection and a headphone jack.",
    "It’s easy to miss unless it’s flashing, but Honor has managed to squeeze a notification light in below the screen which is both handy and unexpected given how small the bezels are, rounding off the look and feel of this excellently priced package very nicely.",
    "Appropriately for a phone of the 10 Lite's price, Honor has decided against a QHD screen, instead opting for a Full HD display. It's long, with a 19.5:9 aspect ratio, and it’s also very light on bezels, with what Honor claims to be an almost 90% screen-to-bezel ratio.",
    "The resolution of 2230 x 1080 pixels is competitive. It means the phone has a resolution of 415 pixels-per-inch, bettering the significantly pricier iPhone XR’s 326ppi.",
    "It might lack the overall image quality you’d get with an OLED display on a Samsung or Apple handset, but given the price difference we can’t say we missed elements such as HDR.",
    "Off-angle and outdoor view-ability are better than we’d expect from a phone of this price too, and it’s easy to see the screen in all but the brightest conditions.",
    "The fact that the screen extends closer to the edges of the display is going to attract a few users, and to that end there’s no traditional notch at the top, just a small protrusion, also known as a water drop or teardrop notch, which houses the 24MP selfie camera.",
    "Another bonus is that within the settings are plenty of screen calibration tools. Eye Comfort mode, color calibration and more give you control over everything from the screen tone to its emission of blue light, which can interfere with sleep."
  ],
  "headers": {
    "4": "Price and release date",
    "7": "Key features",
    "12": "Design",
    "21": "Screen"
  },
  "links": {
    "Google suspended Huawei's future access to Android Play Store": "https://www.techradar.com/news/huawei-ban",
    "Nokia 7.1": "https://www.techradar.com/reviews/nokia-7-plus-review",
    "Motorola One": "https://www.techradar.com/reviews/motorola-one-review",
    "Honor 8X": "https://www.techradar.com/reviews/honor-8x",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "XS Max": "https://www.techradar.com/reviews/iphone-xs-max-review",
    "Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "Pixel 3 XL": "https://www.techradar.com/reviews/google-pixel-3-xl-review",
    "Galaxy S9": "https://www.techradar.com/reviews/samsung-galaxy-s9-review",
    "S9 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s9-plus-review",
    "OnePlus 6T": "https://www.techradar.com/reviews/oneplus-6t-review",
    "Samsung Galaxy A7": "https://www.techradar.com/reviews/samsung-galaxy-a7-2018",
    "Huawei P20 Pro": "https://www.techradar.com/reviews/huawei-p20-pro-review",
    "Mate 20": "https://www.techradar.com/reviews/huawei-mate-20",
    "iPhone XR’s": "https://www.techradar.com/reviews/iphone-xr-review"
  }
}