{
  "source": "https://www.techradar.com/reviews/dell-xps-15-2018",
  "title": "Dell XPS 15 (2018) review",
  "category": "computing",
  "updated": "2019-05-09T17:25:30Z",
  "author": "joe-osborne",
  "summary": "Big power, little change",
  "verdict": "The Dell XPS 15 has managed to oust much of its competition in terms of value, especially in 4K media work and in spite of yet another poor webcam position and lackluster audio, earning it TechRadar’s Great Value award.",
  "pros": [
    "Excellent performance",
    "Decent price",
    "Great port selection",
    "Fantastic display"
  ],
  "cons": [
    "Poor webcam placement",
    "Middling audio output"
  ],
  "article": [
    "‘Prosumer’ laptops are more popular than ever these days, and the Dell XPS 15 2018 is still at the top of the pile. This 15-inch Ultrabook has more horsepower than past XPS models, along with longer battery life.",
    "The Dell XPS 15 isn’t radically different than what came before, in fact it even keeps the awkward camera placement and mediocre speakers – aspects we really hope are addressed in the 2019 model. The Dell XPS 13 2019 actually fixes these problems, though, so we have our hopes up for the Dell XPS 15 2019. We already know the next XPS 15 is getting GTX 16 series graphics at the very least.",
    "The Dell XPS 15 is in a league of its own, especially if you’re a creative or professional on the market for a laptop that’ll dominate 4K mediawork on the go. This alone earns the Dell XPS 15 our ‘Great Value Award,’ along with a higher score. The Dell XPS 15, at the end of the day, is without a doubt, one of the best Ultrabooks you can buy today, even in the face of the weird camera.",
    "As configured to the right, you’ll pay a cool $2,099 (£1,869, AU$2,999) for the 2018 Dell XPS 15 with all of the power that a mainstream user needs. You can take the configuration even higher, with an Intel Core i9 processor, 32GB of memory and a 2TB SSD for a whopping $3,299 (£2,939, AU$4.499).",
    "The starting price for the Dell XPS 15 isn’t actually that steep, though – just $999 in the US at the time of this writing. For this price, you get an Intel Core i5 processor, 8GB of RAM and 1TB HDD behind a 1080p display. The initial price will go up a bit if you’re in the UK, but you’ll get a 256GB SSD and an Nvidia GeForce GTX 1050 for £1,319. And, in Australia, you get the same setup as the UK, but with a different graphics card for AU$1,899.",
    "This puts the Dell XPS 15 somewhere between the luxury of the MacBook Pro and the value that Windows 10 laptops are known for. It’s an affordable Ultrabook that has a fingerprint sensor in its power button for biometric login via Windows Hello.",
    "While the 15-inch MacBook Pro delivers a similar spec to what you see here, it does so at $2,399 (£2,349, AU$3,499) to start. This gets you the exact same processor, AMD Radeon Pro 555X graphics with 4GB of VRAM, 16GB of slower RAM and half the SSD storage space. This is all behind a display that, while a Retina panel, isn’t as sharp as the XPS 15 4K option. To match the Dell XPS 15 on all fronts, including storage, the MacBook Pro calls for $2,599 (£2,529, AU$3,819).",
    "Aiming at the same audience at the other devices, the Asus ZenBook Pro 15 does it for less, starting out at just $1,799 (£1,370, AU$2,500). This price will get you a 4K touch display on top of a secondary touchscreen in the touch pad, punctuated with 512GB of SSD storage and 16GB of RAM. Not to mention the same processor featured in the Dell XPS 15.",
    "Year over year, not much at all about the XPS 15 design identity has changed. The product still comes wrapped in an aluminum unibody shell with a carbon fiber keyboard deck, connected by a single, sturdy hinge.",
    "The design here stands alone, thanks to the ports allowed by the greater dimensions of the Dell XPS 15, while other laptops commit to that USB-C dongle life. The Dell XPS 15 features a full-size SD card slot, HDMI and USB 3.1, where the MacBook Pro only has four Thunderbolt 3 ports.",
    "The Dell XPS 15 doesn’t have a lot of room for a number pad on the keyboard, but neither do the XPS 15’s listed competitors. Plus, the keyboard is very punchy and well spaced – just like the Dell XPS 13. All we’re left asking for is a bit more travel.",
    "The touchpad is just good enough, though, with a matte glass tracking surface that produces a satisfying click when pressed. Using the Windows 10 UI with the XPS 15 is easy between the accurate touchpad and responsive touchscreen.",
    "And, what a touchscreen it is. Our review unit came in the optional 4K UHD (3,840 x 2,160) resolution, which makes colors and textures in films and photos simply pop. Of course, this also means that the XPS 15 is more than ready to power editing of 4K media content.",
    "The MacBook Pro and Asus ZenBook Pro can certainly power the same kind of work (and play) through an external 4K display, but the XPS 15 doesn’t need that – it can handle 4K work wherever and whenever. Better yet, the display meets 100% of the Adobe RGB color gamut.",
    "Unfortunately, the ‘chin-cam’ returns with the Dell XPS 15: the webcam is positioned beneath the screen to make way for its mega-thin left, right and top bezels. The resolution is june fine, but the placement is just no good, and could be a deal-breaker for some.",
    "Similarly, the speakers are in an odd spot considering the size of the XPS 15 – they’re on the base toward the lip, facing down. They’re also really small given the laptop’s size, though they’re loud enough. The Dell XPS 15’s audio capabilities lack depth compared to your TV or headphones, but it gets loud, at least.",
    "First reviewed April 2018"
  ],
  "headers": {
    "3": "Price and availability",
    "8": "Design",
    "12": "Display and audio"
  },
  "links": {
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Dell XPS 13 2019": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review",
    "Dell XPS 15 2019": "https://www.techradar.com/reviews/dell-xps-15-2019",
    "GTX 16 series": "https://www.techradar.com/news/heres-every-nvidia-geforce-gtx-1650-and-1660-ti-laptop-announced-so-far",
    "best Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro"
  }
}