{
  "source": "https://www.techradar.com/reviews/apple-arcade",
  "title": "Apple Arcade review",
  "category": "gaming",
  "updated": "2019-12-16T20:22:24Z",
  "author": "david-lumb",
  "summary": "The family-friendly casual gaming service keeps growing",
  "verdict": "Apple Arcade is a great little service trying to hit several niche keywords - family-friendly, offline, indie, casual, no-microtransaction - for a no-frills gaming experience on most of Apple's devices. But its lack of substantial and AAA titles, combined with an unclear growth strategy, make it tough to guess how it will fare in the future.",
  "pros": [
    "Large starting catalog",
    "No ads, no microtransactions",
    "It Just Works on most Apple devices"
  ],
  "cons": [
    "No AAA games",
    "Annoyingly minimal interface",
    "Uncertain catalog growth"
  ],
  "article": [
    "Now that every operating system has been updated, Apple Arcade is live on iPhones, iPads, Apple TVs and macOS. And after all that time...it’s still tough to gauge Apple’s biggest gaming venture in decades.",
    "As the service stands today, here’s the bottom line: if you don’t need AAA titles, Apple Arcade has a lot of surprises and genuinely pleasant games across plenty of genres. And in the months since it launched, the service has added 32 new games - a promising rate for a service that launched in September.",
    "While the service's interface groups games by category, you’ll need to do some legwork to find particular titles within the App Store tab Arcade is housed in, then manage each one among your regular apps. Requiring players to download games one-by-one (you can't stream them) will please some subscribers and annoy others.",
    "Still, Apple Arcade eases the overall gaming experience and removes the risk and regret of spending money on disappointing titles. For some players, it won’t be enough, and that’s okay - for families, fans without consistent internet connections for streaming, or folks looking for a lot of pick-up-and-play gaming, Apple Arcade can be the answer. And heck, with a free month trial, anyone can see if the service is for them.",
    "Apple Arcade’s pitch is simple: unlimited play and downloads from a large, curated list of apps for a nominal fee - $5 / £5 / AU$8 per month - which includes all game downloads and DLC. It’s a service that endeavors to be a no-sweat, no-stress experience that works on nearly every Apple device - and it’s family-friendly, too.",
    "For the most part, Apple Arcade fits that bill. The trouble is, when we hear “gaming service,” we think of those that offer much-hyped AAA titles and a back catalog of old games - which offer a clear valuation. If you were going to buy two brand-new $60 titles a year anyway, you might as well pay for an Xbox Games Pass or PlayStation Now at $10/month apiece and download a bunch of other top-tier games, old and new.",
    "Apple Arcade’s lineup is very different: it only has never-before-released games made, for the most part, by smaller and indie-scale developers. And due to Apple’s requirement that all games play on every device, the initial games look and handle a lot like mobile games (though some can get a little tighter control with the new-to-Apple-devices PS4 DualShock 4 and Xbox One controller support). With a handful of exceptions, the service consists of unhyped unknowns.",
    "From an aspirational perspective, this is exciting. Assuming Apple’s criteria of inclusion filters out everything but the best experiences, the service lets users discover games sight unseen in a way we haven’t been able to since the early days of the iPhone, before the App Store got dominated by poor-quality titles. You can fire up an Apple Arcade game and trust you’ll have a good time - from today’s lineup into the future (if the quality holds).",
    "Apple Arcade has officially launched in the US, UK and elsewhere - it should be live in 150 countries by now (Apple confirmed the service has launched globally). Every game works on all of its platforms: iPhone, iPad, Mac, and Apple TV.",
    "You’ll have to update to some of the most recent versions of each operating system to see the Apple Arcade tab in the App Store. Upgrade to iOS 13, iPadOS, and tvOS 13, and macOS Catalina to play on your respective platform.",
    "As a subscription service, it costs $4.99 / £4.99 / AU$7.99 / AED 19.99 per month - but everyone gets a free month trial to see if it’s right for you.",
    "Apple has also introduced an option to subscribe for a year in advance, which includes two months free (in the US, it costs $50 instead of $60).",
    "Apple Arcade’s lineup has a little bit of almost everything - which is to say, it’s not terribly deep in anything, at least not yet. As with any collection, there are unquestionable standouts and games you can probably pass on, but with nearly 100 games in its first three months, you're more likely to find something to dig into - you'll just have to spend time with each before you find them.",
    "Some of the best games in the catalog include long-awaited titles that had spent years in development before Apple picked them up for Arcade’s launch. Overland is one of these, a stylish and lean strategy game set in the post-apocalypse that studio Finji has been working on since 2013. It’s also one of the service’s less-exclusive games that’s also available on other platforms, but in this case, it’s a feather in Apple Arcade’s cap.",
    "(Apple Arcade’s exclusivity is a bit confusing: at the least, you won’t be able to get any of its games on other mobile services. At the most, you can only find select titles on Arcade. Most games lie somewhere in the middle. The service’s value lies in its amassed collection, not in the titles it’ll hold uniquely - especially when exclusivity deals expire.)",
    "Sayonara Wild Hearts is another eagerly-anticipated title that lives up to the hype - a rhythm-based game pacing race-and-chase action to the beat of background tracks. (Apple even named it its Apple Arcade Game of the Year.) It’s like a neon-drenched Temple Run with a variety of musical styles, and enjoyable to pick up for a song’s length. It’s not particularly deep - more of an experience than a game you’ll dump hours and hours into.",
    "Which is a good example of Apple Arcade’s overall appeal: for the most part, the games are stylized experiences suitable for temporary sessions and scratching different itches as you flit across the catalog. The service is appropriately named. It does feel like flitting through an arcade with unlimited plays after paying an entry fee.",
    "And just like an arcade, thanks to the relative unknowns stocking the catalog, you’ll probably stumble on some surprises: the small-town sim Outlanders, for instance, is a slow, calming experience building little settlements. Spek is a lovely conceptual puzzle. Tangle Tower is a promising detective story with delightful humor and voice acting. Where Cards Fall is a lovely synthesis of concept and theme. Bleak Sword is a spectacular stripped-down dark action-fantasy.",
    "Given its family-friendly requirements, the catalog didn't start with grim/gritty/gory titles (though there are a few, like Inmost) and it’s light on multiplayer games, with Ultimate Rivals: The Rink, LEGO Brawls and Pac-Man Party Royale encompassing most. When Apple Arcade was introduced at the company’s March 2019 streaming services event, large-scale online gaming a la Fortnite or PUBG seemed like an obvious genre that would need to be represented in the lineup, and we wondered how much Apple would try to compete. The answer: not much at all.",
    "Given the offline and single-player focus of the lineup, we’re not sure if it will ever be a prominent part of the Apple Arcade experience. Honestly, few of the games seem appropriate anyway - but huge-population multiplayer remains a prominent part of Apple Arcade’s competition. It would be surprising if the service remained offline forever.",
    "Apple Arcade isn’t without its blemishes - chief among them how the whole thing is organized.",
    "The service isn’t centralized in one place on each device - you’ll find it in a dedicated tab in the App Store. It’s laid out much like the rest of the app marketplace, with big splashed featurettes and categories below.",
    "Keeping the same interface, not housing the service in a discrete silo, and even having identical download screens to regular apps might make you forget you’re choosing among Apple Arcade’s stock.",
    "Once downloaded, the apps exist next to, well, all your other apps, indistinguishable from games you’ve paid for. Sure, you can manually rearrange them into app buckets, but it would be much easier to sort through them - and add a little prestige to games that made the cut - if there was a centralized app to access the catalog.",
    "It’s what Steam, GOG, and the Epic Games Store have done, and seems like a no-brainer to at least organize Apple Arcade in a similar way. Perhaps it will one day, and Apple will release it later - or maybe the company is too worried about introducing a second App Store interface.",
    "Also, devices - notably handhelds - get very hot to the touch when playing even short sessions of five to ten minutes. It can become very uncomfortable to hold iPhones when this happens, as the aluminum rim and the buttons get toasty. Cases are something of a must, if only to save your fingers if you plan on intensive gaming sessions.",
    "Some games aren’t terribly suited for a touch interface, either. Overland is much better served with mouse and keyboard, or simply more space on an iPad. That’s the nature of the smartphone gaming beast, and there are ways to accommodate less exacting control schemes - an undo option for accidental moves, say. A good tweak on mobile, for example, is Shinskei: Into The Depths, which slows down time when you’re aiming.",
    "More games are coming each month, Apple insists, but how many - and of what quality - we don’t know. The games we’ve played in the existing catalog, while universally stylish in their art, vary in appeal and depth. Some are clearly extensive labors of love, while others are pretty simple in concept and execution. It’s a grab bag of experiences.",
    "Which is all fine and good so long as there are enough games that substantially engage gamera to justify their continued subscription. Since we don’t know how many new titles are coming at what frequency (nor how long existing games will stay on the service), it’s hard to gauge whether Apple Arcade will please players after they’ve finished the initial (admittedly large) selection of titles.",
    "The hope is that Arcade games distinguish themselves, and the service as a whole, thanks to Apple assistance written into the platform. When developers sign their games up to be on Arcade, the company pledges an undefined level of financial support to give creators breathing room to make the games they want to make. Some developers told us this allowed them to add features and play area that would have been cut in the planning stages.",
    "Indeed, signing up for Arcade and its very obscured remuneration terms (we only know that game studios make money on Arcade titles similar to other apps on the App Store: commission based on sales - or in this case, some valuation on downloads and/or playtime) liberates developers from shoehorning monetization schemes into their games. Among today’s microtransaction-packed games, especially in mobile, Apple Arcade titles are already a relief.",
    "Those two combined have already led to a bit of expansive, “shaggier” - not lean - game design in Apple Arcade’s lineup. Sneaky Sasquatch has more sheer game area and activities at launch than it would otherwise (i.e. as a traditional up-front cost or free-to-play release), and includes small but rich flourishes like animating the titular cryptid to stare hungrily at food, even on wall posters - knowing they’re unreal, unable to look away.",
    "It’s tough to pinpoint exactly how each of the other games in the initial lineup benefited from the increased attention and care thanks to the financial assistance and professional expertise Apple provided. But ideally, this sort of nurturing will produce a higher class of game than iPhone, iPad, Mac and Apple TV owners are used to. Only time will tell if Apple’s biggest investment in gaming in decades will give consumers something truly unique - and impact the game industry along the way.",
    "Apple Arcade is suitable for everyone - as in, anyone will probably find a few games they like - but it’s ideal for select folks. The most obvious are those who already own a supported Apple device, which are often starved of compatible games - Macs especially. The others are families, given the intentional lack of mature/bloody/sexual content in titles, mobile gamers, and anyone who loves a good indie game. Arcade is chock full of ‘em.",
    "If you’re a AAA gamer and only a AAA gamer, Apple Arcade is probably not for you. That’s fine - just don’t come in expecting Apple to ramp up its catalog with higher-caliber franchises and titles. When we chatted with developers, they were adamant that optimizing their games for all FOUR platforms was the biggest hurdle - not, as we expected, designing for the lowest spec capabilities among them. In other words, it’s probably not worth the giant studios’ time to get their much-anticipated tentpole games on the service.",
    "PlayStation Now / Xbox Game Pass",
    "This comparison is inevitable, and also inaccurate, but let’s lay it out anyway. After a recent price drop for PlayStation Now, both it and Xbox Games Pass are around the same monthly price ($10 / £9 / AU$15). You can stream some games on PS Now or download from its 800-title catalog, while Xbox Games Pass is download-only for its 250-game lineup.",
    "Obviously, both require their respective consoles (with PC compatibility on select Xbox GP titles), so they’re not exactly good for mobile gaming. They do tend to add AAA and AA games at a regular clip at various intervals after release. And both are subscriptions on top of their consoles’ existing online services (PS Plus and Xbox Live).",
    "So you’ll have to pay more if you don’t have the console hardware or want to play online - and chances are you already have an Apple device that works with Apple Arcade (if you’re reading this review, anyway). Arcade is cheaper and aimed for more casual gaming. It really is apples and oranges.",
    "Google Play Pass",
    "This service conveniently surprise-launched just after Apple Arcade, and seems like an intentional competitor. Given Arcade doesn’t work with Android devices just yet (if ever), there’s an obvious market for Play Pass, and its introductory terms - a free 10-day trial, $2 per month for a full year, $5 per month after - are pretty generous.",
    "Unfortunately, it’s only out in the US right now. It also takes the more traditional approach of including mostly older, already-released games in its 350-title lineup. Two-thirds of that number are games, while the rest are apps, though it’s not clear how useful the latter are. This seems split mostly along operating system lines, but Play Pass lacks the new games-only criteria of Apple Arcade, so expect a less curated experience.",
    "Google Stadia / Microsoft xCloud",
    "In theory, Google Stadia and Microsoft xCloud are competitors to Apple Arcade insofar as they’re both technically playable on mobile, which is arguably Arcade’s main focus. But Google and Microsoft’s efforts are streaming-only, aimed at delivering top-tier AAA games, and are priced like other similar gaming services (Stadia is expected to cost $9.99 / £8.99 about AU$14).",
    "More to the point, neither Stadia nor xCloud have launched yet, making their competitive comparisons more theoretical than practical. We’ll certainly revisit this match-up when both have gone live."
  ],
  "headers": {
    "4": "What is Apple Arcade?",
    "8": "Apple Arcade price analysis and availability",
    "12": "Apple Arcade game catalog",
    "20": "Apple Arcade Store",
    "25": "Warning: Apple Arcade on iOS devices",
    "27": "Is Apple Arcade a good value?",
    "33": "Who it’s for",
    "34": "Who it’s not for",
    "35": "Comparisons"
  },
  "links": {
    "iOS 13": "https://www.techradar.com/news/ios-13-release-date-features-and-everything-you-need-to-know",
    "iPadOS": "https://www.techradar.com/news/ipados-release-date-and-news",
    "tvOS 13": "https://www.techradar.com/news/tvos-15",
    "macOS Catalina": "https://www.techradar.com/news/macos-catalina-is-here-everything-you-need-to-know-about-macos-1015",
    "introduced": "https://www.techradar.com/news/apple-arcade-subscription-price-now-includes-two-extra-months-for-free",
    "price drop": "https://www.techradar.com/news/playstation-now-slashes-subscription-price-to-take-on-xbox-games-pass",
    "PlayStation Now": "https://www.techradar.com/reviews/gaming/playstation-now-1213666/review",
    "surprise-launched": "https://www.techradar.com/news/google-play-pass-is-an-apple-arcade-competitor-for-dollar5-per-month",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Microsoft xCloud": "https://www.techradar.com/reviews/xbox-game-pass-ultimate"
  }
}