{
  "source": "https://www.techradar.com/reviews/acer-conceptd-9",
  "title": "Hands on: Acer ConceptD 9 review",
  "category": "computing",
  "updated": "2019-04-11T20:15:01Z",
  "author": "joe-osborne",
  "summary": "Acer’s gone and made a portable Surface Studio",
  "verdict": "The Acer ConceptD 9 is an impressive looking device that holds a lot of promise for a surprisingly large cross section of content creators and gamers, with the power to serve both needs rather effortlessly. We just need to see the inputs improve a little before mass production.",
  "pros": [
    "Excellent display",
    "Versatile device",
    "Good for gaming and work"
  ],
  "cons": [
    "Very pricey",
    "Poor keyboard and touchpad"
  ],
  "article": [
    "Acer has entered an entirely new product category in a huge way with the ConceptD 9. And, the company has brought its immense gaming chops along with it to create a device that’s potentially an everything laptop for content creators.",
    "With the ability to game about as well as it can render 4K creations with speed and ease, not to mention double as a portable digital drafting table, the ConceptD 9 could be a one-stop shop for a surprisingly large cross section of people.",
    "As with all of its announcements this year, Acer is being tight-lipped on specific configuration pricing for its ConceptD 9. However, we do know that the laptop will be available in North America in June starting at $4,999 (about £3,830, AU$7,045).",
    "What will be available is up to a 9th-gen Intel Core i9 processor and Nvidia GeForce RTX 2080 graphics, all cooled by Acer's 4th-Gen Aeroblade 3D fans to keep the system cool and noise below 40dB. The laptop will also sport up to 32GB of 2,666MHz DDR4 memory and as much as two 512GB NVMe SSDs in RAID 0 orientation.",
    "All of this is accessed through a 17.3-inch, 4K UHD touch display built on a hinge that allows it to flip, rotate and extend in a way similar to the Microsoft Surface Studio.",
    "The ConceptD 9 is very much like a portable Surface Studio, with a 360-degree “Ezel Aero” hinge located in the center point of the display held by a bracket on both sides. This allows the device to be used as both a straight creator’s laptop as well as a digital drafting table at various angles.",
    "Acer’s sharp display that doubles as a drafting table also sports Pantone validation for color, with 100% coverage of the Adobe RGB colorspace and a Delta E (a professional method of calculating color accuracy) of less than one. The screen, paired with a magnetically-attached Wacom EMR stylus, allows for 4,096 levels of pressure sensitivity as well – and it works with aplomb.",
    "Even with the size of the laptop, Acer had to make ample room for the graphics and processor hardware inside, forcing the touchpad to the right side of the keyboard. It’s not the most elegant of laptops in this way, but the main focus here is the display and its many functions for digital artists.",
    "This shows glaringly so in the keyboard and touchpad quality and design. We find the keyboard to incredibly soft in actuation force and a little too deep in travel, which we’re told should be fixed in time for units to hit shelves. Likewise, the touchpad is a little wonky, with goofy shaped click buttons and a small tracking space. The buttons may be fixed in time, but the tracking surface certainly won’t.",
    "Overall, the design is clever, but not the first we’ve seen of its kind, with HP having already produced a very similar product in the past. At least it allows for plenty of ports, which could eliminate the need for a docking solution: USB-C Thunderbolt 3, USB-C 3.1, two USB 3.1, USB 3.0, Ethernet, DisplayPort and HDMI.",
    "It’s tough to gauge the performance of a laptop from a few minutes with it, but the hardware on offer seems to promise a robust experience. Which, we should expect as much from a laptop costing five grand.",
    "With Nvidia RTX graphics inside, this laptop should be as suitable for getting a gaming session in as it is for rendering a 4K video. That will appeal to users that both like to game and need a device that’s more versatile than a gaming laptop.",
    "As for battery life, Acer hasn’t said anything on the matter. Given its size and the hardware inside, we wouldn’t expect much.",
    "The Acer ConceptD 9 is an impressive looking device that holds a lot of promise for a surprisingly large cross section of content creators and gamers. A digital drafting table that doubles as a rendering device as well as a gaming one, that you can take home no less, is a unique value proposition.",
    "However, we’re not sold on the keyboard in use as well as the touchpad implementation. Sure, people are bound to use connected accessories, but the included inputs should at least be viable in a pinch.",
    "At such a premium, we sure hope that these issues are ironed out as far as they can be before mass production begins. What lies beneath is a potentially game-changing device for content creators that want an everything device – including gaming."
  ],
  "headers": {
    "2": "Price and availability",
    "5": "Design",
    "10": "Performance",
    "13": "Early verdict"
  },
  "links": {
    "Microsoft Surface Studio": "https://www.techradar.com/reviews/surface-studio"
  }
}