{
  "source": "https://www.techradar.com/reviews/honor-20-review",
  "title": "Honor 20 review",
  "category": "phones",
  "updated": "2019-07-04T16:04:14Z",
  "author": "jon-mundy",
  "summary": "A true mid-range powerhouse",
  "verdict": "With exemplary performance, a vibrant display, a modern design and an accomplished camera, the Honor 20 comes up with the hardware goods, but there remain one or two questions over the Huawei-related software.",
  "pros": [
    "Speedy performance",
    "Decent camera results",
    "Great specs for the price"
  ],
  "cons": [
    "Magic UI is ugly",
    "Level of app bloat is ridiculous",
    "Huawei issues place future updates in doubt"
  ],
  "article": [
    "Update: after Google suspended Huawei's future access to Android Play Store and security updates, there are serious question marks over the future of Huawei and Honor phones.",
    "While Google, Huawei and Honor have promised to support phones currently on the market, it's not clear how long they'll receive Android updates or access to the Google Play Store, which would severely curtail their usefulness compared to the competition.",
    "The Honor 20 exemplifies the strange place this Huawei sub-brand finds itself in right now. It’s a desirable and capable almost-flagship phone available at an incredibly competitive price. But there’s a much-publicized political shadow hanging over it right now.",
    "We don’t know how the whole US vs Huawei thing is going to play out (at the time of writing, it’s looking positive for the Chinese manufacturer). But we do know that the Honor 20 will be a strong contender in the sub-£500/$600 smartphone category if and when things pan out.",
    "While the Honor 20 Lite before it offers a decidedly entry-level experience, the Honor 20 has a lot in common with the range-topping Honor 20 Pro. It has got seemingly the exact same display, the same chipset, and a very similar design.",
    "What’s more, while its camera isn’t quite as advanced or flexible as the Honor 20 Pro’s, it still takes great shots in ordinary conditions.",
    "The best thing about the Honor 20 is that you’re getting a functionally high-end device for half the price of a true flagship. It has been possible to grab the Honor 20 in the UK since June 21, 2019 at a price of just £400 (roughly $560, AU$810).",
    "That’s the same price as the Google Pixel 3a, which makes similar claims of offering flagship components for much less money. Unlike Google’s phone, the Honor 20 actually performs like a champ while offering a few concessions in the camera department.",
    "The price also pitches the Honor 20 against a range of higher-end phones that have been discounted in recent months, such as the Nokia 9 PureView and the Xiaomi Mi 9.",
    "Head over to the Honor website, and you’ll find that the brand considers the Honor 20’s quad camera system to be its headline feature.",
    "We can see why Honor would go with such an eye-catching lead. But the Honor 20’s true USP is far less sexy: a general high-end level of hardware competence at a knock-down price.",
    "It’s something that defines all of the cut-price Huawei sub-brand’s products, in fairness, and we doubt it will be making its way onto any product boxes. But that doesn’t make the Honor 20’s value proposition any less impressive.",
    "For not a huge amount of money, you’re getting the same basic level of performance as you’ll find in the Huawei P30 Pro. You’re also getting the same rich 6.26-inch display as the pricier Honor 20 Pro. And of course, you’re getting that flashy quad-lens camera system.",
    "However, one of our favorite features of the Honor 20 is something that would initially appear to be a quirky downgrade from its full-priced flagship rivals. Like the Honor 20 Pro, it has got a side-mounted fingerprint sensor embedded within its power key.",
    "While other phones like the Samsung Galaxy S10 and the Huawei P30 Pro are opting for technically impressive yet fundamentally compromised in-display fingerprint scanners, the Honor 20 goes for a lower tech alternative that works way more quickly and effectively.",
    "Unlocking your phone with a thumb or finger on the side of the phone feels surprisingly natural. In fact, it’s arguably even more natural than a rear or front-mounted solution, as it fits naturally into your grip.",
    "You can also access it while the phone is flat on its back, unlike a rear-mounted sensor, yet it doesn’t necessitate an oversized chin like a classic front-mounted sensor.",
    "We particularly appreciate how the power/authentication button has been fitted into a slight recess in the side, which helps you feel it out on the rare occasion when you don’t locate it instantly.",
    "It’s also great how the phone wakes and unlocks with a light touch rather than a full press. And the process really is extremely fast and reliable.",
    "The Honor 20 ticks most of the 2019 flagship design boxes, with a metal chassis constrained by glass to the rear and front.",
    "On the front you have a terribly modern edge-to-edge display with a punch-hole notch in the top left corner. The rear has that expensive-looking reflective finish that throws light off in beautiful bands of color, even with the black model we tested.",
    "This finish also makes the Honor 20 an absolute pig to photograph from the rear, though, without getting some crazy reflections. But you probably don’t care about that.",
    "What you might care about is the fact that fingerprints stand out a mile with this particular glassy finish, and that it also makes the phone a rather slippery customer. Don’t set it down on anything shy of a dead-flat and super grippy surface, or it will go skidding away with minimal provocation.",
    "The phone’s curved, matte metal sides help make it quite a pleasant handset to hold, even if those glass surfaces make things a little more precarious than we’d like. Thank goodness for that recessed power button/fingerprint scanner, which minimizes the need for shuffling the phone around in a single-handed grip.",
    "Just above that power button is a rather less remarkable volume rocker, which is slightly more awkward to access. But it’s not a major issue.",
    "There’s no 3.5mm headphone jack, unfortunately. It’s especially annoying that Honor hasn’t at least used this omission in the pursuit of an IP rating.",
    "We’re rather fond of the Honor 20’s front-filling display. It’s plenty large enough at 6.26-inches, and plenty sharp enough at 1080 x 2340.",
    "That’s not as pixel-packed as the QHD displays found in more expensive models, but there’s an argument to be made that such resolutions are overkill.",
    "The picture is pleasingly balanced to our eyes, with vibrant colors and crisp whites. It does seem to lose a fair amount of its pop outdoors, however, suggesting that it doesn’t perhaps get quite as bright as the very best panels in the business.",
    "It’s the same old unresolved story with that punch-hole element, though. That is, most video content (Netflix, Amazon Video) pretends it isn’t there and blocks it out, giving the phone a curious asymmetrical look. YouTube content can be zoomed in to fill the display, but you’ll generally lose some of the picture with that.",
    "Most up-to-date games fit the 19.5:9 aspect ratio rather better, stretching right out to the edges of the screen. The effect is suitably immersive."
  ],
  "headers": {
    "6": "Honor 20 release date and price",
    "9": "Key features",
    "19": "Design",
    "26": "Display"
  },
  "links": {
    "Google suspended Huawei's future access to Android Play Store": "https://www.techradar.com/news/huawei-ban",
    "Honor 20 Lite": "https://www.techradar.com/reviews/honor-20-lite-review",
    "Honor 20 Pro": "https://www.techradar.com/reviews/honor-20-pro",
    "Google Pixel 3a": "https://www.techradar.com/reviews/google-pixel-3a-review",
    "Nokia 9 PureView": "https://www.techradar.com/reviews/nokia-9-pureview",
    "Xiaomi Mi 9": "https://www.techradar.com/reviews/xiaomi-mi-9",
    "Huawei P30 Pro": "https://www.techradar.com/reviews/huawei-p30-pro",
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10"
  }
}