{
  "source": "https://www.techradar.com/reviews/honor-view-20-review",
  "title": "Honor View 20 review",
  "category": "phones",
  "updated": "2019-01-28T17:00:58Z",
  "author": "andrew-williams",
  "summary": "A great View",
  "verdict": "Advanced features, great battery life and a good price: the only real part to put you off the Honor View 20 is that ambitious shiny finish.",
  "pros": [
    "Great battery life",
    "Intriguing, smart camera",
    "Intelligent use of the punch hole display"
  ],
  "cons": [
    "No wide or zoomed rear lenses",
    "That finish is an audience-divider",
    "No official water resistance"
  ],
  "article": [
    "Update: After Google suspended Huawei's future access to Android Play Store and security updates, there are serious question marks over the future of Huawei and Honor phones.",
    "While Google and Huawei have promised to support phones currently on the market, it's not clear how long they'll receive Android updates or access to the Google Play Store, which would severely curtail their usefulness compared to the competition.",
    "The Honor View 20 is one of the first flagship phones of 2019 and it starts the year off with quite a show. A 48MP camera, 256GB of storage and a punch hole display mean this isn't the kind of phone we normally expect from Honor.",
    "Its phones are often cast as lower-cost alternatives to those of Huawei, which already tends to undercut Samsung and Apple. Sure, the Honor View 20 lacks some of the features of the Huawei Mate 20 Pro, but it looks, feels and behaves like a top-end mobile.",
    "If you can stomach its deliberately attention-grabbing finish, this is one of the most compelling phones of the moment. It's so good, in fact, that the Honor View 20 has earned a place in our best smartphone rundown - which is high praise indeed.",
    "The Honor View 20 first launched in China, where it's called the V20. It made its debut in the last few days of 2018.",
    "The rest of the world didn't have to wait too long for it to be reborn as the Honor View 20, though. The phone was announced on January 22 and by that time, it was already listed for sale on Amazon India.",
    "The Honor View 20's price is now confirmed in the UK to start at £499 (about $650, AU$900) for the 128GB storage and 6GB of RAM. The phone has also been launched in the UAE for AED 2,399 and comes with 256GB storage and 8GB of RAM. We don't currently know whether the phone will be launching in the US or Australia. If it does come to those two markets we don't yet know the price either.",
    "Typical of Honor, the price represents good value for money. Obvious alternatives include the OnePlus 6T and, if you don’t mind missing out on the cutting-edge punch hole design and camera hardware, the Xiaomi Mi 8.",
    "Honor and Huawei phones are particularly good at two things: being first to new tech and offering very good value compared to brands not based in China.",
    "You might consider the Honor View 20 alongside something like the OnePlus 6T. Both come from Chinese companies. Both get you more for your money than Samsung would offer.",
    "The Honor View 20 is more aggressive and unusual than a OnePlus phone, though. It has a light-reactive chevron finish we've not seen before. And in the UK and US it comes with 256GB of storage as standard. That would be a $150/£150 upgrade (from 64GB to 256GB) if you were buying an iPhone XS.",
    "This is also the first demo of tech we're likely to see over and over again in 2019, Sony's new 48MP sensors. These tell us a lot about how many phones will approach camera processing this year. And, oddly enough, it's very similar to what Nokia did back in 2012-2013 with the 808 PureView and Lumia 1020.",
    "In bright light, it uses all the pixels. In low light, pixels are merged for better low light performance.",
    "The Honor View 20 also lets us try out life with a punch hole screen. This is an alternative to a notch. Rather than dipping into the screen like a cupboard in a floor plan diagram, the camera sits behind a 4.5mm transparent circle in the display.",
    "Honor hasn't followed all current high-end trends, though. There's a rear finger scanner rather than an in-screen one, the View 20 also has a 3.5mm headphone jack and even an IR blaster on its top.",
    "This wouldn't be a true Honor phone without an odd part or two. It all adds up to a phone that, while more challenging than a OnePlus 6T, avoids the two most annoying parts of many top-end phones.",
    "It's not so expensive you get the sense you're being exploited, and you can use your favorite pair of wired headphones without an adapter.",
    "Every phone brand makes models with glass backs these days. Honor makes more than just about any other, from fairly affordable handsets right up to the priciest.",
    "Honor has a crack at a new style of finish with the Honor View 20. Light reactive layers that sit under the top glass layer are common, but this one has a chevron pattern that seems to point down to the charge socket on its bottom. It's alright, Honor, we know it's there.",
    "There's a gradient effect too, one a little like that of a sunburst guitar. Rather than changing from top to bottom, the edges of the Honor View 20 are dark blue. That blue lightens towards the center.",
    "The phone is also sold in red - that you can see in a few photos below - as well as black. We liked the blue and red versions of the phone best, but if you're after a more sedated look you may want to go for the black.",
    "The Honor View 20 is so bold and eye-catching, it may well be too much for some tastes. This is high fructose corn syrup confectionery. But it's not boring.",
    "A punch hole display also gives the View 20 among the highest screen-to-surface ratios around. It doesn't have the zero-border visual effect possible when a display curves across a phone's side, but the phone is fairly easy to handle considering it has a 6.4-inch screen.",
    "The View 20 is 75.4mm wide and 8.1mm thick, a similar stature to the OnePlus 6T. It's not a small phone, but which flagships are?",
    "Its hardware features push hard in some areas and stick to the familiar in others. For example, the View 20 has a rear fingerprint scanner pad on the back rather the newer in-screen style. It's fast and conveniently placed, but the in-screen style is more conspicuously advanced.",
    "There's a 3.5mm headphone jack too, on the top edge. Given Samsung will reportedly leave such a socket out of the Galaxy S10 family, the View 20 may be one of just a few high-end phones in 2019 with such a wired connection. We remain fans of the jack.",
    "Honor pushes hard to stand out in a couple of other areas too. The UK version of the View 20 has 256GB of storage. While no longer a true rarity, such high storage in a phone at this price is remarkable.",
    "The phone also has an IR blaster, which lets you treat the View 20 like a universal remote using the Smart Remote app. This hardware had a brief flutter of popularity among phone makers around 2013 but is now very rare. We think it's a neat addition, even if we only ever used such a feature after a frustrated half hour spent looking for the TV remote.",
    "The Honor View 20 has a 6.4-inch screen of 1080 x 2310 resolution. It's an LCD rather than an OLED and pixel density isn't even close to that of a Samsung Galaxy Note 9. But at this price, it doesn't really matter.",
    "Sharpness is excellent, and if you want ultra-vivid color typically associated with OLED, you can have it. Normal and vivid color profiles are on offer in Settings, and the latter has that distinctive candied look of a wide gamut display.",
    "Choose normal if you'd prefer a more natural look. It's a reminder the red in the Chrome logo shouldn’t actually look as bright as YouTube's. These nuances drop off when you crank up the saturation like a 6-year-old given command of the TV remote.",
    "Typical of an LCD, there's more brightness reduction at an angle than the OLED OnePlus 6T, and contrast isn't as good either. However, the View 20's screen is easily good enough considering the price. There's no obvious shortfall compared to any phone when used normally.",
    "Of course, it's the punch hole that draws most interest here. The Honor View 20 is the first phone we've reviewed with one. You will see an awful lot more of them in 2019.",
    "Honor seems to have nailed it on its first try. There's just a small 4.5mm circle removed from the screen to fit the single front camera. And, crucially, it sits just where it should.",
    "When you use the Honor View 20 on its side to play a game, there's a good chance this area would be obscured by your thumbs operating virtual controls anyway. As such, game developers do not tend to put anything too important here.",
    "Apps not optimized for this kind of full screen display will just block off the notch area anyway. And if you think the punch hole looks ridiculous, you can simply block it off just as you would a notch. This covers the area with a black bar, but the space is still used for notification icons.",
    "HDR is one feature that seems to have been ignored among all the fuss about the punch hole. We tried playing HDR videos on YouTube and, sure enough, the View 20 seems to support proper HDR10 video.",
    "It is not currently listed on Netflix’s page documenting phones it supports for HDR streaming. Only the Honor 10 is on there from the brand. However, with any luck it will get the nod in time."
  ],
  "headers": {
    "5": "Honor View 20 price and release date",
    "9": "Key features",
    "18": "Design",
    "29": "Screen"
  },
  "links": {
    "Google suspended Huawei's future access to Android Play Store": "https://www.techradar.com/news/huawei-ban",
    "Huawei Mate 20 Pro": "https://www.techradar.com/reviews/huawei-mate-20-pro-review",
    "best smartphone": "https://www.techradar.com/news/best-phone",
    "OnePlus 6T": "https://www.techradar.com/reviews/oneplus-6t-review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "808 PureView": "https://www.techradar.com/reviews/phones/mobile-phones/nokia-808-pureview-1090241/review",
    "Lumia 1020": "https://www.techradar.com/reviews/phones/mobile-phones/nokia-lumia-1020-1165253/review",
    "Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Samsung Galaxy Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "Honor 10": "https://www.techradar.com/reviews/honor-10-review"
  }
}