{
  "source": "https://www.techradar.com/reviews/freshservice",
  "title": "Freshservice review",
  "category": "computing",
  "updated": "2020-10-07T06:35:40.522Z",
  "author": "mark-pickavance",
  "summary": "Freshdesk with extra IT",
  "verdict": "Freshworks baked themselves an IT helpdesk by blending Freshdesk with an asset register and problem tracking system. It’s easy to use but doesn’t interface to third-party tools other than those made by the originating company.",
  "pros": [
    "Easy to use",
    "Fast to deploy"
  ],
  "cons": [
    "Charges for database records",
    "Poor reporting",
    "Lacks app integrations"
  ],
  "article": [
    "We’ve already reviewed Freshdesk by Freshworks, a web-based ticketing solution that has many satisfied customers.",
    "One complaint about Freshdesk was that it isn’t ITIL compliant, and therefore unsuitable for use in an IT support scenario.",
    "The reason it lacks this functionality has commercial logic. Freshworks has an alternative product with the asset registry and other ITIL (Information Technology Infrastructure Library) necessary features, called Freshservice.",
    "Is this product Freshdesk with a few extras at a higher price?",
    "Just like Freshdesk, Freshservice delivers a ticket-based solution where support requests that are then managed by agents.",
    "Where it differs is that Freshdesk includes social ticketing, skills-based ticket assignment and marketing integration, and these aren’t part of Freshservice.",
    "Tickets are generally generated by email, calls or form-based web solutions, and not on Twitter or Facebook.",
    "What they both share is basic reporting, team collaboration tools and a knowledge base, along with templated responses.",
    "But to these core features, Freshservice adds incident management handling, change, problem and& release management, asset management, software license management, and contract and project management.",
    "In short, it has all the critical parts needed to handle hardware and software deployments where users might have issues that they need to report and need full-service solutions.",
    "Traditionally these tools can be used as an internal requirement for a big company, or externally for a business supporting software contracts, but Freshservice is probably better suited to the internal support role.",
    "In this context, the agents might be IT staff rather than a helpdesk team, and this tool is designed for them to manage their support requests and track the speed of response to the demands made on the department.",
    "So what does it lack?",
    "The first feature we noticed that isn’t fully finished is the software register, which is currently in ‘Beta’.",
    "To collect the installation data requires a software agent to be downloaded and installed on each machine that you want to be included. The software is available for Windows PC, Apple Mac and Linux, but it doesn’t yet consider mobile devices in this scheme.",
    "The agent performs the job of collating all the software installed on each computer and storing it into the system database. But it lacks any means to verify if the licenses used are valid or not.",
    "One use of this tool is to confirm how many copies of Office 365 or whatever have been installed, but IT should already have this information by other means.",
    "It should point up if users are installing apps they shouldn’t, although this might throw up a good many false negatives, given how Microsoft tends to install things on to Windows 10 machines without asking the user or admins.",
    "What could be more useful is the hardware register, where it keeps a full specification and name of computers that are detected by another software utility. Network hardware is located using a ‘Probe’ tool that scans for devices like routers and printers.",
    "How well this might work in a properly secure network is debatable, because traffic management between sub-nets and other restrictions will probably interfere.",
    "A common complaint with previous versions of Freshservice is that the asset register wasn’t flexible, but those limitations have been addressed.",
    "The default fields can be tweaked as to what information they contain and made mandatory if required. But you can also add custom subsections, and create fields for that new device type or service. But you can’t add fields to the default set, oddly.",
    "There also isn’t any integration to external asset databases that the IT department might have used previously, forcing those that use this system to start from scratch.",
    "Another noticeable weakness is the reporting system. Freshservice has roughly 20 reports, but you can’t customise these in any significant way, sadly.",
    "But the biggest issue we see is that the concept of Freshservice assumes that no existing systems are in use. Because it has no means to connect to another asset register or problem tracker, should a business have a preferred one.",
    "It’s Freshservice, or a separate system, and that’s not a business-friendly option.",
    "Unsurprisingly, the interface for Freshservice looks practically identical to its sibling Freshdesk.",
    "It uses the popular dashboard model where you can manage tickets created at the point of interaction with the customer. Once created, the tickets are merged into the same system for tracking, escalation and referral, irrespective of their source.",
    "None of this diverges from the template created by Freshdesk, as managing IT support requests isn’t a radically different problem from any other helpdesk solution situation in regards to tickets and tracking to a resolution.",
    "The dashboard keeps agents and their superiors aware of how many outstanding tickets exist, and track the relevant metrics of support performance.",
    "And, as before, Freshworks has ‘gamification’, where scoreboards are maintained for a group of agents, and ‘badges’ are awarded for those performing best.",
    "How this might incentivise a workforce might depend on their age and other motivations, but it is available as an option for those that wish to implement it.",
    "Where the Freshworks tools excel is that they are easy to follow and understand, and Freshservice is, therefore, a good choice for those that need to deploy a system rapidly.",
    "Another major bonus of all Freshworks applications is that they’re designed to work in harmony with others from the same stable. Companies that use Freshteam or Freshsales can move seamlessly between them from within the Freshservice interface.",
    "The security options in Freshservice are the same as those in Freshdesk, unsurprisingly.",
    "By default, all web communications are made via SSL (Secure Sockets Layer), and you can implement SSO (Single Sign-On) for agents.",
    "There are switches that you can set to force greater password restrictions than the default, and you can make passwords expire, not be repeated and require mixed and special characters.",
    "We can’t mention passwords without a word of warning about password rule changes. This information that is on the change web page has huge implications;",
    "“Please note that once you enable password policy for your account (either default or advanced), you will not be able to disable it.”",
    "Therefore, don’t play with the password policy. Because it is a one-way door and once through it, you can’t go back.",
    "Two-factor authentications should be an option, at least for admins, but this isn’t currently a feature. Hopefully, Freshworks will address this soon.",
    "In short, security could be better and isn’t at a level that Enterprise customers would easily accept.",
    "If you want to try out Freshservice, there is a free 21-day long trial available to download.",
    "The licensing model is very similar to Freshdesk, in that there are paid tiers that offer different levels of functionality, that can be paid for monthly or on yearly contracts.",
    "The Freshservice tiers are Blossom, Garden, Estate and Forest, and they range from $19 per month per agent to $99 if billed yearly.",
    "Also, there is a charge for managed assets on the system, which goes from free for 100 assets, right up to $1,500 per month for unlimited assets. This cost isn’t a linear scale, so 1000 assets cost $130, and 5000 assets costs $650.",
    "Let’s be succinct. The customer is being charged here for records on a database that they created numbering at most in the thousands…incredibly.",
    "With the higher base price and extra gouge on assets, Freshservice is about 25% more expensive than Freshdesk.",
    "But you should be aware that you only get the critical asset register in the Garden tier and above, and software license management requires the Estate plan.",
    "All these factors combine to make Freshservice one of the more expensive options, although the cost of the software should be a component in any service contract that it is used to support.",
    "Looking at the features Freshservice adds, there is a noticeable lack of external integrations that Enterprise customers will notice are missing.",
    "They expect to pay more but do so expecting the investment to save them money by connecting their mission-critical tools, and this is exactly the area that Freshservice doesn’t address.",
    "That makes it more applicable to small and medium-sized businesses, although the pricing model might scare off the smaller companies.",
    "The biggest competitor in the IT helpdesk sector is HappyFox, and currently, that isn’t a comparison that Freshservice would win.",
    "Overall, while it does add some of the things needed to support and IT helpdesk, in many places, it doesn’t go far enough to be appropriate for larger companies or supporting external IT service contracts."
  ],
  "headers": {
    "4": "Features",
    "26": "Interface",
    "34": "Security",
    "42": "Plans and pricing",
    "50": "Final verdict"
  },
  "links": {
    "Freshdesk": "https://www.techradar.com/reviews/freshdesk-crm-review",
    "Freshservice": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5096675955712983000&xs=1&url=https%3A%2F%2Ffreshservice.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ffreshservice",
    "helpdesk": "https://www.techradar.com/best/best-helpdesk-software",
    "helpdesk solution": "https://www.techradar.com/best/best-helpdesk-software",
    "free 21-day long trial": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7989481611068423000&xs=1&url=https%3A%2F%2Ffreshservice.com%2Fsignup&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ffreshservice",
    "Freshservice tiers": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1156272381930850800&xs=1&url=https%3A%2F%2Ffreshservice.com%2Fpricing&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ffreshservice",
    "HappyFox": "https://www.techradar.com/reviews/happyfox-help-desk"
  }
}