{
  "source": "https://www.techradar.com/reviews/sentrypc",
  "title": "SentryPC review",
  "category": "computing",
  "updated": "2019-09-25T21:14:02Z",
  "author": "mark-pickavance",
  "summary": "Spyware for hire",
  "verdict": "If you only use the PCs, then SentryPC has an inexpensive surveillance tool that can track users and block personal activity. But don’t expect any advice on avoiding the legal and ethical pitfalls of spyware in your region, wherever you are in the world.",
  "pros": [
    "Stealthy",
    "Inexpensive"
  ],
  "cons": [
    "Only PC and Mac",
    "Zero legal or ethical guidance",
    "It’s Spyware"
  ],
  "article": [
    "Originally started in 2001 under the name of Access Control Software, the brand switched to SentryPC in 2005 and hasn’t looked back.",
    "The products include personal solutions for monitoring children, in the home and education. And, the business product we’ll be looking at today.",
    "SentryPC is designed for a wide range of uses, from blocking access to websites to enhancing productivity and conducting investigations.",
    "It’s competitively priced and includes stealth installations and a keylogger.",
    "Is this the surveillance tool for any job, or one that might end up getting IT staff into hot legal waters?",
    "What is important to understand about SentryPC is that the features that it has are dependent on the operating system that it is deployed.",
    "Currently, SentryPC can be installed on a Windows PC (XP, 2000, Vista, 7,8 or 10), or Apple Mac (Mac OS X 10.6+ and all macOS). It isn’t available for any mobile platforms and doesn’t support Chrome OS or Linux.",
    "We’d describe the PC release as the fully-featured version. Because it has several critical features that aren’t included in the Mac version at this time.",
    "On both platforms user activity is tracked, alerts generated for web and application activity, keys are logged, and when activity is detected a screenshot of the event is captured as proof.",
    "What the PC version has exclusively is chat conversation logging, clipboard logging, file changes, USB drive detection and print job logging.",
    "On Windows, the computer can also be remotely disabled, and a host of other features can be deactivated, such as file copying and even the desktop.",
    "The lack of all those features on the Mac makes it much less useful than the PC release.",
    "In addition to the activity that the agent code can detect and log on the computer, the system can be configured to filter and restrict access to apps and websites and filter specific words and phrases.",
    "All filters can be time-controlled, so those businesses that allow private use outside working hours can easily configure this.",
    "The feature set of SentryPC fits into a specific type of surveillance software offering, although it can be used either in an educational mode or in a stealthy one where those being tracked are not aware.",
    "Should the user cross on the red lines defined by the system, an alert can pop up on the screen explaining their error, or it can log that information for others to address.",
    "The problem with the stealth approach is that if the promised productivity improvements are reliant on the employees knowing that they are being monitored. And, you can configure this product not to do that, then you’re unlikely to see those benefits.",
    "Secretly capturing a private email or chats would undoubtedly fall foul of the rights for privacy in many countries, as the screenshots this system makes aren’t blurred.",
    "This omission could be a major problem from a legal standpoint, and we’d advise that you take advice from qualified lawyers before deploying any software like SentryPC into your business.",
    "The team that designed the user interface for SentryPC did an excellent job, as it looks and works very nicely indeed.",
    "What’s exceptionally pleasing is how many of the information panels are graphically based, rather than swamping the administrator in statistics. With graphs the eye is immediately drawn to abnormalities, and even when the data is presented as a list, colours are used to highlight critical info.",
    "After a relatively short time, most admins should be able to find all the features needed on the side menu and configure the capture of data effectively.",
    "The interface for SentryPC scores highly on our usability and approachability index.",
    "If the developers of SentryPC spent a long time on the interface, the same wasn’t true for the system security.",
    "The primary mechanism of protection is the login and password. A random password (10 characters with both lower, upper, digits, and special characters), is created at the time of purchase, and you are meant to change that password upon logging in to your account.",
    "Two-factor authentication isn’t an option or any other independent verification method.",
    "But, our biggest concern about SentryPC is that while it will generate infinite reports on the activities of those the system is tracking, it records almost nothing about those administering the system. Unless you also place the agent on the admin machine and include the admin as a user.",
    "The logging of what is viewed by the admins is an important feature in Teramind and ActivTrak, and necessary to achieve compliance with HIPAA standards.",
    "SentryPC has three plans designated as Basic, Business 50 and Business 100.",
    "Basic offers a single machine license for $59.95 per year, and you can add additional machines for only $19.95.",
    "For ten computers that’s an average of $25.95 per seat each year or $2.16 per month.",
    "The Business 50 and 100 offerings aren’t much different in respect of the features or service. On Basic and Business 50 the system will store 500 screenshots, and on Business 100 that is doubled to 1,000. Other than this aspect, the products are identical.",
    "These plans bundle 50 and 100 licenses into plans that cost $995 and $1,595 respectively.",
    "Those work out at an average of $19.90 and $15.95 per license per year, which is less than $2 for each month.",
    "You can pay to have additional storage space, but this appears to be an arbitrary control put in place merely to generate more revenue.",
    "For bigger companies Business 250, 500 and 1000 are also options, with an even lower cost per head per month.",
    "Even for low numbers this is affordable, and for wider deployment, it is very cheap.",
    "However, this solution has several major weaknesses, not least that many of the better features are exclusively on the PC and missing from the Mac version.",
    "But the other problem with have with SentryPC, is that zero guidance is given to customers about the legal and ethical issues surround the deployment of spyware.",
    "We asked SentryPC for comment on the lack of guidance to customers in regard to the legality and ethics of monitoring staff without their consent or knowledge, and it replied with the following;",
    "‘Every customer's situation is going to be different, with a number of factors involved, and we are in no position to offer guidance or advice in this area to them. I would recommend contacting your local authorities, compliance/legal team in your company, etc if you have questions or concerns.’",
    "The software Terms of Use at least mention that the software is distributed and licensed on the basis that it only goes on computers owned by the customer.",
    "We’d have liked to have seen some information in the FAQ about ethical use, but this isn’t available at this time.",
    "Overall, if you exclusively use the PC, then SentryPC might is a low-cost way to monitor user activity and control personal use of the systems in work hours.",
    "However, we’d be very cautious about using the keylogger and screen capture parts of this product or deploying it without informing staff and altering contracts to reflect these operational changes.",
    "And, we’d also recommend tracking the admin machine, so that the powers in this system aren’t used to stalk or harass staff without record.",
    "Considering how invasive this solution can be, we’d expect some push-back and impact on employee morale, should you use SentryPC in its fullest form."
  ],
  "headers": {
    "5": "Features",
    "19": "Interface",
    "23": "Security",
    "28": "Plans and pricing",
    "43": "Final verdict"
  },
  "links": {
    "SentryPC": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7600132412385203000&xs=1&url=https%3A%2F%2Fwww.sentrypc.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fsentrypc",
    "Teramind": "https://www.techradar.com/news/teramind-employee-monitoring-software",
    "ActivTrak": "https://www.techradar.com/news/activtrak-employee-monitoring-software",
    "three plans": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1288475270634594800&xs=1&url=https%3A%2F%2Fwww.sentrypc.com%2Fpurchase%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fsentrypc"
  }
}