{
  "source": "https://www.techradar.com/reviews/moto-g7-plus",
  "title": "Moto G7 Plus review",
  "category": "phones",
  "updated": "2019-12-04T10:43:19Z",
  "author": "john-mccann",
  "summary": "A top performer on a budget",
  "verdict": "The most powerful G series smartphone to date is packed with features and with a large screen, solid cameras and enough performance it's a great device for those unable to afford a fully fledged flagship.",
  "pros": [
    "Extremely fast charging",
    "Still has a headphone jack",
    "Good value for money"
  ],
  "cons": [
    "Battery drains with intensive use",
    "LCD screen not as colorful"
  ],
  "article": [
    "The Moto G7 Plus was the most premium offering in Motorola's affordable G7 quartet, offering up more power, better cameras and faster charging tech than its cheaper siblings. It's since been succeeded by the Moto G8 Plus, but it's still a decent device for people looking for a great cheap phone.",
    "The budget end of the mobile market continues to go from strength to strength, which means there’s some serious competition for the Moto G7 Plus and family - and that’s great for you, the consumer, as it means there’s a range of great low cost handsets available.",
    "The G7 Plus has a strong set of features, including a large 6.2-inch display, 4GB of RAM and dual rear facing cameras, but there are a couple of spots where it cuts corners to keep the cost down.",
    "That's no surprise, and in the past the G series has made cuts in the right areas, minimizing any negative user experience and delivering an excellent value device.",
    "The good news is, Motorola has successfully repeated the trick with the Moto G7 Plus.",
    "The Moto G7 Plus release date was March 1, 2019 in the UK, while the firm confirmed that it won't be launched in the US. It has found its way to India and has been available in Australia as well, along with a number of European and Latin American countries.",
    "In terms of the Moto G7 Plus price, it initially cost £269 / AU$499 for the SIM-free handset in the UK (from Carphone Warehouse and EE) and Australia – the same as the Moto G6 Plus when it launched.",
    "The newer Moto G8 Plus launched for £239 / AU$499, so actually cheaper than the G7 Plus, but the older device has subsequently seen price cuts and deals.",
    "If you didn't see the price tag before picking up the Moto G7 Plus, you'd be forgiven for assuming it costs almost double what Motorola is actually asking for the handset.",
    "Its front and rear are glass, sandwiching a metal frame which feels secure and relatively premium in the hand. Tap the rear glass and it does sound a little hollow – giving away its affordable credentials – but it's not something you'll be doing often.",
    "The power and volume keys are located on the right of the handset and fall nicely under your thumb or finger, with the power button offering a textured finished providing obvious tactile feedback on the key your finger is on.",
    "While the G7 Plus does have a large display, it's not overly cumbersome to handle. It measures 157 x 75.3 x 8.3mm, weighs 176g and sits well in the hand, but the glass finish means there's little grip on offer.",
    "However, Motorola includes a protective soft touch plastic case in the Moto G7 Plus box, which does provide grip and protection, and it’s nice to see a simple accessory like this bundled with the phone.",
    "There's good news for audiophiles, as the G7 Plus has a headphone jack on its base, along with a speaker and a centralized USB-C port.",
    "On the rear, just below the dual camera bump lies a fingerprint scanner inset within the Motorola logo, which is easy to find with your forefinger.",
    "Motorola says the body of the G7 Plus is \"water repellent\", but strictly not waterproof, so don't go submerging the handset in water. It should be fine in the rain though.",
    "Switching attention to the Moto G7 Plus display and you'll find a sizable 6.2-inch, Full HD (2270 x 1080) screen. There's minimal bezel at the top of the display, with the front-facing camera housed in a teardrop notch which cuts into the display.",
    "At the bottom of the screen there's a thicker bezel which houses the Motorola brand name, which is another signal that the Moto G7 Plus isn't quite as premium as some of its more expensive rivals that minimize the bezel to near-nonexistence.",
    "Still, the overall look is impressive, with text and images appearing crisp, bright and colorful."
  ],
  "headers": {
    "5": "Moto G7 Plus release date and price",
    "8": "Design and display"
  },
  "links": {
    "Moto G8 Plus": "https://www.techradar.com/reviews/moto-g8-plus-review",
    "cheap phone": "https://www.techradar.com/news/best-budget-smartphone",
    "Moto G6 Plus": "https://www.techradar.com/reviews/moto-g6-plus-review"
  }
}