{
  "source": "https://www.techradar.com/reviews/misfit-vapor-x",
  "title": "Misfit Vapor X review",
  "category": "wearables",
  "updated": "2019-10-10T18:05:24Z",
  "author": "andrew-williams",
  "summary": "Running out of steam",
  "verdict": "The Misfit Vapor X looks good and has a reasonable assortment of features, but hardware updates fail to give it any more than one day of battery life, and Wear OS does not have the charm to offset this.",
  "pros": [
    "Light and comfortable",
    "Has GPS, a heart rate sensor and NFC",
    "Appealing looks"
  ],
  "cons": [
    "HR tracking reliability is a little off",
    "Poor battery life",
    "Wear OS doesn’t feel hugely rapid"
  ],
  "article": [
    "Want to make a Wear OS watch with personality? It’s not easy. These days, most smartwatches have the stand-out appeal of bags of white flour.",
    "Misfit does not fall into the trap of trying too hard with its design. The Vapor X looks clean, clear and tasteful, unlike the fairly ugly TicWatch watches.",
    "It also has all the features you need, including GPS, Google Pay and a heart rate sensor. However, getting around a day of battery life under real world usage won't impress anyone, especially when there are longer-lasting alternatives like the Fitbit Versa, Samsung Galaxy Watch and Huawei Watch GT. So on balance, is the Misfit Vapor X a smartwatch you should be considering?",
    "The Misfit Vapor X was announced in August 2019. This series has been around since 2017, and this new model is a little more expensive than earlier versions.",
    "It costs $279 (around £225 / AU$410), which makes it roughly $80 more than the original Vapor and $30 more than the Misfit Vapor 2 from 2018.",
    "This price rise has just become more important too. You can buy an Apple Watch 3 for $199 /£199 / AU$319, and the Huawei Watch GT is cheaper too at $199 / £199 (around AU$365), though the latter can often be found for even less.",
    "So while the Vapor's pricing is fairly standard for a Wear OS watch, the array of alternatives based on other platforms is wide.",
    "The Misfit Vapor X also isn't widely available at the time of writing - it's out in the US, but UK and Australian availability haven't been confirmed.",
    "Many of the big names in wearables like Huawei and Samsung now use their own software. Wear OS watches are largely left to smaller brands like TicWatch, Fossil and Misfit. TicWatch has earned a lot of attention for its low prices, but a day with the Misfit Vapor X will make you consider spending a bit more.",
    "The Misfit Vapor X is a very pleasant wearable. It’s much thinner and lighter than the original Vapor and is far better-looking than any TicWatch smartwatch. Misfit hasn’t changed the look too much since the Vapor 2, but we don’t mind.",
    "Its case is aluminum, and elegant-looking stems attach the silicone strap. This is one of the smartest-looking Wear OS watches around, and it is very comfortable. It’s light at 43.2g and not bulky at just under 12mm thick.",
    "The silicone strap also has little lines cut into its back, which act as ventilation and make the strap more flexible. These indents will pick up salt deposits from your sweat after a while, particularly if you use the Misfit Vapor X to track exercise, but a quick rinse will get rid of them.",
    "You don’t need to remove the strap to do this either. The Misfit Vapor X is water-resistant to 5ATM, enough for not just showering but swimming too.",
    "Misfit has not really altered the standard Wear OS watch bezel design much, though. There’s a roughly 5mm gap between the end of the display and the edge of the watch, and the case diameter is the standard 42mm. The Misfit Vapor X doesn’t move smartwatch design forward in any way, but it is among the better-looking Wear OS models.",
    "The physical controls match the best too. Its crown cycles between the watch face and apps screen, but also acts as a rotary dial, letting you scroll through menus and your notifications without touching the screen.",
    "The two buttons, one to each side, open up Google Fit and Google Pay. They give you easy access to two of the more advanced uses for a smartwatch: paying for stuff and actively tracking exercise. These shortcuts can’t be customized.",
    "Misfit has not changed its screen tech either. The Misfit Vapor X has a 1.19-inch 390 x 390-pixel AMOLED screen, just like the 42mm version of the Vapor 2.",
    "Look closely and you’ll see a hint of PenTile fizz (caused by the panel’s pixel arrangement) but from a normal distance it is sharp. Colors are bold and the very high-contrast OLED lets the screen blacks blend into the surround, at least when viewing from the front.",
    "The Misfit Vapor X's screen is plenty bright enough, has an ambient light sensor to allow automatic brightness changes, and there’s a boost mode for very bright conditions. We found this very useful when using the watch to track outdoor runs during the tail end of the UK summer. Sometimes the sun shines in London."
  ],
  "headers": {
    "3": "Misfit Vapor X price and availability",
    "8": "Design",
    "16": "Display"
  },
  "links": {
    "Fitbit Versa": "https://www.techradar.com/reviews/fitbit-versa-review",
    "Samsung Galaxy Watch": "https://www.techradar.com/reviews/samsung-galaxy-watch-review",
    "Huawei Watch GT": "https://www.techradar.com/reviews/huawei-watch-gt-review",
    "Misfit Vapor 2": "https://www.techradar.com/reviews/misfit-vapor-2-review",
    "Apple Watch 3": "https://www.techradar.com/reviews/apple-watch-3-review"
  }
}