{
  "source": "https://www.techradar.com/reviews/lenovo-legion-c730-cube",
  "title": "Lenovo Legion C730 Cube review",
  "category": "computing",
  "updated": "2019-02-14T21:16:11Z",
  "author": "mark-knapp",
  "summary": "A gaming PC left wanting for graphical brawn",
  "verdict": "The Legion C730 packs some serious processing power into a highly portable design. However, Lenovo’s pairing of an overclockable CPU with a mid-range GPU makes for an unbalanced package.",
  "pros": [
    "Elegant design",
    "Compact and portable",
    "Powerful processor"
  ],
  "cons": [
    "Limited SSD storage",
    "FHD gaming for a QHD gaming price"
  ],
  "article": [
    "Lenovo Legion series of gaming desktops have grown up. The latest Legion C-series Cube desktops look classy enough to belong in your home entertainment setup while still being able to throw down at LAN parties.",
    "Although it fits into the small form-factor niche, the Lenovo Legion C730 Cube packs full desktop internals into a compact chassis with a volume of just 19 liters. Although it fits into the small form-factor niche, the Lenovo Legion C730 Cube packs full desktop internals into a compact chassis with a volume of just 19 liters. It’s definitely got a bit of a markup for the small build, but it’s not small enough to get a heartbreaking price hike.",
    "Instead, you’re looking at a beefy little build that’s ready to get up and go. But, because there are some questionable choices in the pairing of components, the C730 is a purchase that's hard to to justify.",
    "The Lenovo Legion C730 Cube we reviewed comes kitted with an unlocked Intel Core i7-8700K for overclocking paired with 16GB of 2,666MHz DDR4 RAM. On the gaming side of the spec, it has an Nvidia GeForce GTX 1060 6GB graphics card.",
    "That mix of a higher end, overclockable processor with a more middling GPU feels odd, though. Few competitors we’ve looked at make the same pairings.",
    "For storing your files, programs, and games, a 128GB PCIe NVMe SSD and 1TB hard drive are fitted. Altogether, this build comes to $1,519 (about £1,155, AU$2120), though we’ve seen Lenovo’s frequent online discounts bring it as low as $1,291 (about £980, AU$1,800).",
    "The base pricing for this build leaves it vulnerable to some competition, though not many builds match the Legion’s kit precisely.",
    "The MSI Trident 3 can cost just $1,284 (about £975, AU$1,790) and comes with a similar configuration, a much smaller build, and more solid-state storage. Looking for more power? The MSI Infinite X can come with more storage all around and a beefier GTX 1070 graphics card at $1,699 (about £1,290, AU$2,370).",
    "The $1,399 (about £1,090 AU$1,970) Dell XPS Tower Special Edition can offer more in almost all departments with the only major trade-offs being a larger chassis and a non-overclockable processor. And, there are enough custom builds available like this $1,399 (about £1,065, AU$1,950) iBuypower build with a Ryzen 7 2700X, 16GB of DDR4 RAM, a 1TB hard drive, a 240GB SSD, and the real kicker: an RTX 2070 8GB graphics card.",
    "The strength in Lenovo’s Legion C-series of gaming desktops comes from the design. At 19L in volume and under 20 pounds, the C730 is ready to fit into tight spaces. It fits nicely onto our shelf without the need to first remove our personal desktop.",
    "And, a large handle built right into the top of the case makes it’s incredibly portable. Moving the C730 around as we inspect it for this review is a breeze.",
    "Of course, with a desktop, customization and upgradability are on the table, and small form factors can call these facets into question.",
    "Getting into the C730 is easy after undoing two thumb screws and easily removing the two side panels. Once inside, though, we see a few easy upgrade paths, and a few not so easy ones.",
    "Though the labeled top view of the C730 almost makes it seem like there are simple, plug-and-play slots of new drives, the interior is a different story. The top shows slots for an SSD, two HDDs, and a PSU, but inside you find split compartments.",
    "One side houses the PSU and two 3.5-inch drive bays. The other houses the processor, graphics card, and all else (with the motherboard effectively dividing the two sides of the case.",
    "The cage for the 3.5-inch drives can tilt outwards for easy installation, and the power cable is all ready for that upgrade. However, a SATA cable may be tricky to wire between the two compartments.",
    "On the other side, things are a bit tight. There’s one empty DIMM slot ready for a quick RAM upgrade. But, with many wires all clumped together into one place, maneuvering may be difficult. The graphics card’s close fit to the frame may also make it difficult to pop out or slot in.",
    "And, since Lenovo has worked to separate cooling regions, switching up the graphics card (currently full-length, blower style) could negatively affect the thermal performance of the system. The cooling system may only feature two 80mm fans, but they do more work than you would expect – but more on that later.",
    "Those concerns aside, there are plenty of positives about the design.",
    "The IO is ample, with plenty on the rear, and two USB 3.1 ports on the front – though they’re a bit hidden at the very bottom of the chassis.",
    "The aesthetics are also striking. The case is made of metal with a dotted grille in front. On top, a clear acrylic panel shows through to the graphics card and features two-zone RGB lighting. The Legion C730 definitely scores points for those who put a value on appearance.",
    "With its specs, it should come as a surprise that the Lenovo Legion C730 performs impressively most of the time. The overclocked Core i7-8700K is brilliantly fast, and it shows when we open applications.",
    "Web browsing is responsive, and 16GB of fast memory gives us plenty of wiggle room to open tabs galore. Everything could have been that much faster, though, if the solid-state storage wasn’t so tight.",
    "With just a 128GB SSD, there’s little room for Windows itself, let alone a selection of apps. And, since this is a gaming computer, it’s disappointing to know that almost no games will be going onto solid-state storage without buying an additional drive. That said, the 1TB drive included spins at 7,200RPM, which helps with access times for games if you do end up storing them on the hard drive.",
    "While we game from the hard drive, we don’t feel like we’re waiting too long on loading screens.",
    "For such a tight build, and with only a small intake fan in front and a small exhaust fan in the back, thermals seem well managed. We didn’t notice any slowdowns. Running a 15-minute CPU stress test, there were no signs of thermal throttling.",
    "Performance hits its most noticeable sour patch when it comes to graphics, though. The unlocked Core i7-8700K and the GTX 1060 feel like a mismatch. Sure, both have been superseded by newer generations of hardware, but the two are still in different tiers.",
    "While the i7-8700K is a high-end processor that can take almost anything gaming can throw at it, the GTX 1060 is more of a mid-range champion, even if it is a 6GB model.",
    "Our benchmarking of Shadow of the Tomb Raider at 1080p showed the performance as largely GPU bound. And, while playing through a portion of the game, we could get playable frame rates between 40 and 60fps at 1440p, but only by dialing down settings.",
    "The issue is that the i7-8700K is all about dialing things up, and this unlocked model comes with a markup in price. For productivity, the powerful processor may make sense. But, for the level of gaming the C730 is meant for, it makes more sense to include something like the non-K i7-8700 to set the system at a lower price. For how much the C730 costs as reviewed, it would have made more sense to focus more of the budget on a beefier graphics card.",
    "The Lenovo Legion C730 is a little PC warrior. CPU-based performance is mighty, while GPU performance is going to be better suited to 1080p and eSports titles when high frame rates count. Unfortunately, the model we reviewed isn’t priced low enough to meet this reality.",
    "All told, the odd balance of hardware feels particular to this specific build. For a more reasonable mid-to-high-end build, we feel something like this custom build from iBuypower or the Dell XPS Tower Special Edition makes a lot more sense.",
    "Lenovo also offers a higher-spec $1879 (about £1,430, AU$2,620) C730 that makes a lot more sense. This model’s upgrades include a Core i7-9700K, 256GB SSD, and a more sensible RTX 2070 graphics card. If you can’t find the C730 configuration we’ve reviewed at its discounted rate, it makes more sense to pick up the upgraded model.",
    "The Legion Legion C730 compact size is its defining characteristic and there’s little competition to match it from the small build category, just be sure you’re buying the right configuration you need."
  ],
  "headers": {
    "3": "Pricing and availability",
    "9": "Design",
    "21": "Performance",
    "30": "Final verdict"
  },
  "links": {
    "MSI Trident 3": "https://www.techradar.com/reviews/msi-trident-3",
    "$1,284": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FMSI-TRIDENT38003US-Trident-8RC-003US-Enthusiast%2Fdp%2FB079NPGYK4%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7298459759388808000-20",
    "$1,699": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1315338108553642000&xs=1&url=http%3A%2F%2Fwww.tigerdirect.com%2Fapplications%2Fsearchtools%2Fitem-details.asp%3FEdpNo%3D6273510%26SRCCODE%3D3WCJ%26utm_source%3Dcj%26utm_content%3D6361382%26utm_term%3D12612265%26cjevent%3Df7d37d16233611e9822003fb0a240611&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Flenovo-legion-c730-cube",
    "Dell XPS Tower Special Edition": "https://www.techradar.com/reviews/dell-xps-tower-special-edition",
    "$1,399 (about £1,065, AU$1,950) iBuypower build": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-2758733641776326700&murl=https%3A%2F%2Fwww.newegg.com%2FProduct%2FProduct.aspx%3FItem%3DN82E16883227872",
    "custom build from iBuypower": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-7089791499309572000&murl=https%3A%2F%2Fwww.newegg.com%2FProduct%2FProduct.aspx%3FItem%3DN82E16883227872",
    "Core i7-9700K": "https://www.techradar.com/reviews/intel-core-i7-9700k",
    "RTX 2070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2070"
  }
}