{
  "source": "https://www.techradar.com/reviews/huawei-watch-gt-review",
  "title": "Huawei Watch GT review",
  "category": "wearables",
  "updated": "2019-11-20T11:29:18Z",
  "author": "james-peckham",
  "summary": "This smartwatch drops Wear OS for longer battery",
  "verdict": "Huawei has dropped the Wear OS software it normally runs on its smartwatches, instead switching to its own OS – and that’s mostly to the detriment of the Watch GT. That said, the battery life and price of the Watch GT will make it an appealing choice for some.",
  "pros": [
    "Incredible battery life",
    "Solid design",
    "Affordable price"
  ],
  "cons": [
    "No third-party app access",
    "Not built for contactless payments",
    "Limited phone app"
  ],
  "article": [
    "The first two Huawei Watch products were a big part of the initial success of the Android Wear operating system, so it came as a surprise when the company backed away from Google's wearable platform for the Huawei Watch GT.",
    "Instead the company decided to use its own software for its latest smartwatch, which seems to sit adjacent to the Wear OS-toting Huawei Watch 2 in a separate line of products, rather than being a ‘Huawei Watch 3’ of sorts.",
    "The Watch GT has pared back software to increase battery life, and the good news is that this has worked – although at the cost of compromises elsewhere.",
    "Since the Watch GT's introduction, the company has also unveiled the Huawei Watch GT 2 that comes with underwater heart rate tracking as well as music storage and a few design tweaks as well.",
    "Below you’ll find our full verdict on the original Watch GT from Huawei.",
    "There are two variants of the Huawei Watch GT that you need to know about, and Huawei calls them the Sport and the Classic.",
    "When it was first released, it was difficult to find the more expensive Classic version. It's now a lot easier to find, but in our experience we’ve often found retailers don’t specifically refer to them by their Sport and Classic names. The way to tell which version you're looking at is the black body edition is the Sport variant, while the silver body is the Classic.",
    "Originally released in the UK in November 2018, the watch has an RRP of £199 for the Sport variant but we've often seen the price as low as £140. The Classic is meant to cost around £220, but again we've seen it on sale for around £40 less at £180.",
    "In the US, the watch originally cost $199.99 for the Sport edition, but we've seen the prices drop to £160. The Classic version is on sale in the US for $229.99.",
    "After a bit of a wait, Huawei also introduced the watch in Australia where its RRP was set at AU$349 but we've seen the price drop down to AU$249 at certain sales periods.",
    "This is a thin and light smartwatch with a full-color display, and we found it comfortable to wear throughout our time using it; we also had compliments on how the watch looked on our wrist.",
    "The design is similar to that of the Huawei Watch 2, although it is slimmer. It's 10.6mm thick, and that helps it to sit on your wrist comfortably, without weighing it down like some smartwatches can.",
    "There's a 1.39-inch AMOLED display, which we found to be bright and clear. All of your stats appear clearly on the display, and it’s easy to interact with the touchscreen. That clarity is likely down to the resolution of 454 x 454 pixels, which is higher than we’ve seen on a lot of other smartwatches.",
    "This is one of the best screens we’ve seen on a smartwatch, which is why it’s a bit of a shame there’s no Wear OS software on the watch to provide apps other than Huawei's default selection. But let’s keeping focusing on the design of the watch for now…",
    "There are two buttons on the right-hand side of the watch that enable you to navigate around its interface when you’re not using the touchscreen itself.",
    "The top button works to wake the watch and then take you back to the main menu, while the lower one is designed for you to set up your own shortcuts. This enables you to easily boot up your favorite apps without having to head into the main menu, which is useful if you’re often running with the watch.",
    "If you own a Huawei Watch 2 you’ll recognize a lot of the design elements here. The GT is made of a combination of ceramic and metal that looks premium on the wrist. The bezel has numbers around is to make it look a touch closer to a traditional watch, and that ceramic gives it a classier feel than some other smartwatches.",
    "Everything else around the outside of the watch is metal, and we really like the look of the one we’ve been using for this review.",
    "You've got the choice of a silver watch body with a brown leather strap (which has silicone on the inside to make it comfortable while you're exercising), or a black body with a black silicone strap. We preferred the silver and brown option, but both look good on the wrist.",
    "Image Credit: TechRadar"
  ],
  "headers": {
    "5": "Huawei Watch GT release date and price",
    "10": "Design and display"
  },
  "links": {
    "Huawei Watch 2": "https://www.techradar.com/reviews/huawei-watch-2",
    "Huawei Watch GT 2": "https://www.techradar.com/reviews/huawei-watch-gt-2-review"
  }
}