{
  "source": "https://www.techradar.com/reviews/fujifilm-gfx-50r-review",
  "title": "Fujifilm GFX 50R review",
  "category": "cameras",
  "updated": "2019-02-18T17:55:43Z",
  "author": "matt-golowczynski",
  "summary": "Quality craftsmanship, superb results",
  "verdict": "The GFX 50R combines so much of what we love about Fujifilm's more established X-series with a sensor that's capable of superb image quality. It might not have the action photographer or videographer in mind, and it requires some serious outlay, but Fujifilm deserves praise for democratizing medium-format photography more so than any other manufacturer right now.",
  "pros": [
    "Superb detail and low image noise",
    "Responsive touchscreen",
    "Great build yet lightweight",
    "Relatively affordable for medium format"
  ],
  "cons": [
    "Underwhelming video specs",
    "Not the easiest body to handle",
    "OIS in only three current lenses",
    "Awkwardly placed USB port"
  ],
  "article": [
    "Fujifilm launched the GFX 50R as a smaller, lighter and considerably cheaper alternative to the company’s debut GFX model, the GFX 50S – just as full-frame cameras used to be confined to the professional market, but are now very much within the reach of enthusiast photographers, it appears medium format models are now getting the same treatment.",
    "While much of the insides are shared between the two cameras, the new arrival bears a rangefinder-style design that’s closer to Fujifilm’s X-Pro and X-E mirrorless cameras than to the more DSLR-esque GFX 50S. It’s also 145g lighter and 25mm thinner, and its current asking price is £1,000/$1,000 less than that of the older model.",
    "In short, it further shrinks the gap between high-end mirrorless/DSLR systems and medium format, and could well prove tempting for those who might have previously considered these kinds of cameras to be out of their reach.",
    "The GFX 50R has been built around the same 51.4MP (effective) medium-format sensor as the one inside the GFX 50S, which measures 43.8 x 32.9mm. This is designed with the conventional Bayer RGB filter array rather than the more complex X-Trans architecture used by many X-series models, but it mirrors that design in that there’s no anti-aliasing filter, which should help with detail retention.",
    "Fujifilm states that the sensor is capable of recording 14 stops of dynamic range, and it can output raw files or JPEGs, or even have images converted to 8-bit TIFF files in-camera. The company has also primed the sensor with an Ultrasonic Vibration system to help dislodge any particles of dust that might otherwise appear in images, which is probably just as well when you consider the size of the sensor and its relatively short 26.7mm proximity to the lens mount.",
    "The mount itself is Fujifim’s G mount, which accepts the company’s GF-branded lenses. Right now the range comprises six prime options and a single zoom, as well as a teleconverter and a couple of macro extension tubes, although three further lenses are set for release over the next couple of years. Only three current lenses are designed with their own image stabilization systems, which is important here as there's no equivalent sensor-based system inside the GFX 50R’s body, although two optics from the upcoming triplet are also set to have their own systems.",
    "The camera’s sensor is partnered with the X-Processor Pro engine that we’ve seen in the GFX 50R and, more prominently, in recent X-series models. This brings with it a range of familiar features such as Film Simulation modes and a handful of secondary pre-capture processing options, together with a useful post-capture raw-processing function.",
    "This engine also allows for a fairly basic (but understandable) burst shooting speed of 3fps, which promises to last for either 13 uncompressed or eight compressed raw frames. Switch to JPEGs on their own, however, and it should be able to soldier on until the memory card is full.",
    "Unlike on the GFX 50S, the tilting electronic viewfinder on which can be removed and replaced according to the user’s preference, the electronic viewfinder on the GFX 50R is integrated into its body. On the scales this makes the camera 145g lighter than the older model when it has its viewfinder in place, although the viewfinder itself follows much the same idea in terms of its specs, with 3.69 million dots spread across a 0.5-inch OLED panel, together with the same 100% coverage and 23mm eyepoint. The only point of difference is with magnification, which is slightly lower at 0.77x next to the GFX 50S’s 0.85x (in 35mm terms).",
    "Similarly, while the GFX 50R’s touch-sensitive rear display measures 3.2 inches in size and boasts 2.36 million dots, it only tilts up and down, rather than in the same three-axis manner as the older GFX 50S. Perhaps more crucially, there’s no top-plate LCD on the GFX 50R to show key exposure and shooting information, although this isn’t necessarily a feature we’d expect on this design of camera.",
    "Video recording is possible, although the specs are somewhat underwhelming. Resolution tops out at Full HD recording to a maximum 30p, while further discouragement comes courtesy of a single 2.5mm microphone port (which also doubles up as a remote port) rather than separate 3.5mm sockets for headphones and a microphone. The absence of the previously seen video-centric Eterna Film Simulation mode also underlines how little love Fujifilm expects this camera to get from videographers.",
    "While many of the GFX 50R’s cut-down features compared to the GFX 50S are consistent with its more agreeable price tag, the newer model does hold a few advantages other than its size and weight. Perhaps the most important is Bluetooth Low Energy, which allows the user to keep the camera connected to a smart device at all times for easy image transmission.",
    "The GFX 50R also maintains support for the NP-T125 Li-ion battery used by the GFX 50S, and arrives with the same battery life of around 400 shots per charge when the Auto Power Save feature is enabled, although there’s no option here to use a battery grip to extend this – a separate battery can of course be bought if required. Charging the camera through its USB port isn’t possible, although you can charge the battery in-camera through the mains socket next to it using an optional power adaptor."
  ],
  "headers": {
    "3": "Features"
  },
  "links": {
    "GFX 50S": "https://www.techradar.com/reviews/fujifilm-gfx-50s-review"
  }
}