{
  "source": "https://www.techradar.com/reviews/harman-kardon-citation-one",
  "title": "Harman Kardon Citation One review",
  "category": "audio-visual",
  "updated": "2019-04-08T22:05:30Z",
  "author": "lewis-leong",
  "summary": "A handsome smart speaker that dishes out the bass",
  "verdict": "The Harman Kardon Citation One is a solid Google Home speaker for the money. You get good sound with a lot of bass and Google Assistant’s powerful set of tools however, average voice recognition and overwhelming bass hold it back from being one of the best smart speakers around.",
  "pros": [
    "Handsome design",
    "Gets loud without distortion",
    "Sounds like a bigger speaker"
  ],
  "cons": [
    "Overwhelming bass at times",
    "Average voice detection",
    "No EQ available"
  ],
  "article": [
    "Between the Sony SRS-XB501G, JBL Link 300 and RIVA Concert, there’s no shortage of Google Assistant-powered speakers on the market today. So what can veteran audio maker Harman Kardon do that the others can't? While each of these speakers bring something new to the table, only the Harman Kardon Citation One really nails the balance between audio tuning and design.",
    "For $200 (£180, about AU$330), you get a solid Google Home speaker that looks handsome, plays loudly, and offers Google Assistant. Its bass can be overwhelming at times and suffers slightly from poor voice detection, but it’s still a solid option for the price and one of the better Google Assistant smart speakers on the market.",
    "The Harman Kardon Citation One looks handsome but not necessarily eye-catching. The exterior is a mix of Sonos One’s cylindrical shape and Google Home’s cloth housing, plus there’s a nice chamfered edge on the top to help the speaker look and feel more like a premium product.",
    "In terms of size, it’s a bit larger than the Sonos One and RIVA Concert.",
    "On top of the speaker you’ll find all the physical controls as well as two microphones. You can disable/enable the mic, change volume, control music playback, and pair with Bluetooth. Around back you’ll find a Wi-Fi status light which may seem like a peculiar place to put it, but it actually helps to give the speaker a subtle backlight at night, which may be intrusive if placed on the front of the speaker.",
    "In terms of inputs, you’re limited to Google Cast and Bluetooth 4.2 - and, unfortunately, there’s no 3.5mm aux jack to hook up legacy devices like you do on the Google Home Max. On the bottom of the speaker you’ll find a USB-C jack for servicing and a large reset button, which is appreciated.",
    "Bass is the first thing that immediately jumped out at us while testing the Harman Kardon Citation One, and its overwhelmingly the most prominent part of the speaker's audio profile. The speaker dishes out gobs of bass, which is overwhelming for our tastes on select tracks, but does make the speaker sound larger and helps fill the room with sound.",
    "Bass is so overwhelming, in fact, that even when listening to bass-light tracks like a violin concerto the bass notes rumble, which is something you don’t want for classical music. It was so intense at medium-high volume, that we were able to feel the bass vibrate through the console table and to the floor.",
    "The silver lining here is that while the speaker’s bass is its party trick, its highs still have a good amount of energy and brightness without sounding harsh. Mids for voices also have good presence but there are certain times when bass does begin creeping into the midrange presentation.",
    "In terms of sound stage, the Citation One is still a mono speaker but has the ability to project sound to make it sound like a bigger speaker than it is. While it doesn’t provide the same earth-shaking sound as the larger and much more expensive Google Home Max, we were impressed just how well the Citation One could mimic the sound of the larger speaker.",
    "When it comes to using Google Assistant, the Harman Kardon Citation One does exactly what you’d expect. However, we were disappointed by the average voice detection, especially when music was playing loudly - many of our attempts to summon the personal assistant were left unheard throughout testing and we had to shout at the speaker to be heard.",
    "The Harman Kardon Citation One is a solid Google Assistant speaker with a couple of quirks that hold it back from being our recommendation in the price range. Its average voice detection and overwhelming bass frustrated us but if you can overlook these issues, it’s a solid speaker. That said, we do wish Harman would release an app where you can adjust the EQ just to dial back the bass a bit.",
    "In terms of competitors, the RIVA Concert sounds more balanced but lacks the resolution of the Harman. There’s also the Sonos One, which supports Alexa now and will eventually support Google Assistant sometime in 2019. The One offers more balanced sound and about the same amount of resolution.",
    "That said, if you want a Google Assistant smart speaker that can get loud without distortion and dish out the bass, look no further."
  ],
  "headers": {
    "2": "Design",
    "6": "Performance",
    "11": "Verdict"
  },
  "links": {
    "Sony SRS-XB501G": "https://www.techradar.com/reviews/sony-srs-xb501g-portable-wireless-speaker",
    "JBL Link 300": "https://www.techradar.com/reviews/jbl-link-300-smart-speaker",
    "RIVA Concert": "https://www.techradar.com/reviews/riva-concert-review",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review",
    "Google Home Max": "https://www.techradar.com/reviews/google-home-max"
  }
}