{
  "source": "https://www.techradar.com/reviews/gigabyte-aero-15-2019",
  "title": "Gigabyte Aero 15 (2019) review",
  "category": "computing",
  "updated": "2019-02-27T23:02:05Z",
  "author": "joel-burgess",
  "summary": "Are gaming Ultrabooks ready for RTX graphics?",
  "verdict": "The Gigabyte Aero 15 is a solid gaming laptop that delivers an awesome RTX gaming experience for a reasonable premium when configured with an Intel Core i7 CPU.",
  "pros": [
    "Ray tracing ready",
    "Sleek, thin design",
    "Full-sized keyboard",
    "Edge-to-edge display"
  ],
  "cons": [
    "Core i9 performance throttled",
    "RTX GPUs are expensive",
    "Camera below screen",
    "Battery life poor (4K)"
  ],
  "article": [
    "Gigabyte's Aero 15 range has traditionally packed the best gaming components it could into an Ultrabook form factor, but it always left the absolute top-shelf parts to the company’s sister brand: Aorus.",
    "In 2019 however, the Aero 15 has broken this trend by adding an Intel Core i9/ Nvidia RTX 2080 configuration to the range and lumping on a hefty premium to the already pricey 2018 Aero 15.",
    "The Aero 15 has two main variations. The Aero 15-X9 features a Nvidia RTX 2070, 16GB of RAM and a 1TB PCIe SSD. While the Aero 15-Y9 gets a bigger RTX 2080, 32GB of RAM and a 2TB PCIe SSD.",
    "Both these units can be configured with either an Intel Core i7-8750H or a Core i9-8950HK CPU in most regions, but the X9 is only available with a Core i7 CPU in Australia. You can also choose between a 15.6-inch FHD 144Hz IPS display or a 15.6-inch UHD 60Hz IPS display, depending on whether you prefer resolution or responsiveness in your games.",
    "The cheapest of these configurations comes in at $2,399 (£2,399, AU$3,599) and you can fork out up to $3,999 (£4,499, AU$5,899) for the most expensive models.",
    "While it’s seriously upsized the internal components, the overall footprint of the 2019 Aero 15 isn’t too different from the previous models, maintaining both a 0.74-inch (2cm) thickness and weighing in at an easily carry-able 4.49-pound (2.13kg). This year’s Aero 15s only come in black coloring, which will be disappointing for anyone who appreciated the zesty orange and lime offerings from previous iterations.",
    "Gigabyte has always steered clear of making its gaming laptops classically loud by choosing to avoid things like speed stripes, multicolored vents and bright lighting strips. We’ve always appreciated this pared-back style, but because the 2019 Aero 15 only comes in black, it may be a little too conservative for those wanting a traditionally flashy looking gaming laptop.",
    "That said, this device packs an absurd amount of power into an exceptionally sleek form factor, so anyone who knows a thing or two about laptops will be sufficiently impressed by its profile alone. At 0.74 inches (1.89cm) thick, the Aero 15 is a fraction thicker than the 0.70-inch (1.78cm) Razer Blade 2019, but this difference is almost indistinguishable.",
    "To fit a number pad on a 15-inch laptop, the keyboard has to span from one edge to the other, and while this can look and feel a little awkward, it seems to work well on the Aero 15. The keys offer good resistance and reasonable travel distance for an ultrabook, making it a delight to type on.",
    "While the lack of available space means there’s no gap to distinguish the numpad, the trackpad is centered to the QWERTY keyboard and the backspace and return keys are large, so it’s not difficult for touch typists to feel immediately comfortable on this keyboard.",
    "If you do happen to find yourself mistyping, the RGB fusion area of the Gigabyte’s Control Center software will let you use the per-key RGB to highlight any key you want to find easily.",
    "Windows laptops of the past often struggled with the trackpad, but the Gigabyte Aero 15 has managed to buck this trend with a silky trackpad that makes the most of Windows’s native multi-finger gesture controls.",
    "You can get the 2019 Aero 15 with either a speedy, 144Hz Full-HD IPS panel from LG or an AUO 4K display at 60Hz for a serious bump in resolution. If you’re looking for something that’s going to offer outstanding performance in games, and you’re happy with a 1080p panel on a 15.6-inch display, then the ultra-fast refresh rate and 5ms response time of the LG panel is hard to pass up.",
    "Those looking for that extra bit of clarity and detail for work or play, on the other hand, will prefer the amazingly sharp resolution of the 3,840 x 2,160-pixel IPS display.",
    "There is enough power in this laptop to justify either, with many modern games getting well above 60 frames per second (fps) on ultra 1080p settings across both GPU configurations, and the RTX 2080 units managing playable 30 fps-and-over average frame rates with Ultra 4K settings. The main consideration with the 4K display is that it has a big impact on overall battery life.",
    "Both display types offer 100% of the Adobe RGB color spectrum and each unit has been individually color calibrated by X-Rite Pantone to ensure accuracy. While for many this just means a nicer screen, if you do have to color grade or design things the Aero 15 is more than capable of handling it.",
    "Of course if you do need a bigger display this device allows you to output using the latest HDMI, DisplayPort/USB-C or Thunderbolt 3 interfaces, so you’re not short of options.",
    "Images Credit: TechRadar"
  ],
  "headers": {
    "2": "Price and availability",
    "5": "Design",
    "12": "Display"
  },
  "links": {
    "Aorus": "https://www.techradar.com/reviews/aorus-x9",
    "2018 Aero 15": "https://www.techradar.com/reviews/gigabyte-aero-15-2018"
  }
}