{
  "source": "https://www.techradar.com/reviews/philips-brilliance-328p",
  "title": "Philips Brilliance 328P review",
  "category": "computing",
  "updated": "2019-03-06T13:42:32Z",
  "author": "mike-jennings",
  "summary": "Brilliance by name, brilliant by nature?",
  "verdict": "The Philips Brilliance 328P is an excellent screen, with stonking contrast, good color quality and loads of features alongside reasonable HDR. However, its HDR and colors could be a little better, and it’s occasionally awkward to use.",
  "pros": [
    "Huge contrast and brightness",
    "Decent colour accuracy levels",
    "Reasonable HDR impact",
    "Loads of versatility"
  ],
  "cons": [
    "Can’t quite meet its HDR protocol",
    "Colors could be a tad better",
    "Occasionally wobbly stand",
    "Awkward OSD"
  ],
  "article": [
    "The Philips Brilliance 328P is a little more expensive than many other 4K panels thanks to a price of $655 (about £499, AU$925) – but it does provide loads of features to try and justify that cost to a professional audience.",
    "It’s got its huge 4K resolution, of course, and it also serves up HDR, a 10-bit screen and lashings of versatility. Can we be convinced?",
    "This screen will set you back about $655 (about £499, AU$925).",
    "That price has come down by around $100 (about £100, AU$100) since the 328P made its debut, but it’s still around $100 (about £100, AU$100) more than you’ll pay for a more affordable 4K screen – although those panels probably won’t have 10-bit color or HDR.",
    "It’s also possible to save a little more cash if you opt for a 28in 4K screen, although moving to a smaller panel has its own pros and cons – namely a sharper image but a physically smaller panel.",
    "The Philips Brilliance 328P’s 10-bit screen is a solid start for work tasks where color accuracy is key – that attribute means that the Philips can display 1.07 billion shades of colour. Many other 4K panels use 8-bit screens that can only display 16.7 million colors.",
    "That’s vital for high-end design work – the extra colors mean better individual tones, more depth and subtler gradation between shades.",
    "The 3,840 x 2,160 resolution delivers a density level of 140ppi, which is great – text, images and applications will be pleasingly crisp. It also means you’ll have loads of real estate for multiple windows and applications.",
    "The Philips stacks up against the LG 27UD88, which costs $630 (about £600, AU$1,122). That panel has a 4K resolution too, but its 27in diagonal means a density level of 163ppi. Its images will be a little crisper, but you may prefer the physically larger size of the 32in Philips for work.",
    "The 328P has HDR, and the protocol used is called VESA DisplayHDR 600. As far as HDR standards go, it’s mid-range – VESA has weaker DisplayHDR 400 and 500 protocols, but a DisplayHDR 1000 specification that’s better.",
    "The DisplayHDR 600 standard demands a screen achieves a 600cd/m2 backlight level for short periods and a 350cd/m2 backlight for prolonged periods in order to give HDR content the requisite boost to color and contrast.",
    "DisplayHDR 600 also requires a 0.1cd/m2 black level, and 90% coverage of the DCI-P3 color gamut.",
    "The LG 27UD88 doesn’t have HDR, but it’s not unusual to find this technology creeping into 4K panels at this price. However, they often use the DisplayHDR 400 standard, which only requires a 320cd/m2 prolonged brightness level and a 400cd/m2 burst brightness – easier figures to achieve on cheaper screens, of course, but figures that make for a less impactful HDR experience.",
    "By way of contrast, the DisplayHDR 1000 standard specifies a 1,000cd/m2 burst measurement and a 600cd/m2 consistent backlight – so it will have more impact on HDR content than DisplayHDR 600.",
    "And then there’s the question of the content itself. There isn’t a vast amount of HDR content around – so you’ll only see the true benefit in the future.",
    "The 328P doesn’t have a clean bill of health when it comes to its headline feature, and in other areas its hardware continues to toe the line between impressive and ordinary.",
    "Take the VA screen. VA technology generally delivers great contrast that beats IPS panels, but VA usually falls behind when it comes to color accuracy.",
    "The 328P’s reliance on VA comes down to cost – as VA screens are cheaper than IPS equivalents. Screens with 32in, 4K IPS screens tend to cost a couple of hundred pounds or dollars more than the Philips.",
    "The 60Hz refresh rate is ordinary, and isn’t accompanied by any syncing technology. That’s fine for work, but it does mean that this screen won’t be noticeably fluid when compared to panels that do have syncing or higher refresh rates.",
    "The response time is middling, too, at 4ms – fine for work, but not good for fast-paced movement.",
    "The 328P’s base attaches to the stand with one screw, and four more secure the stand to the screen. The attachment at the rear can also be used with VESA 100 mounts.",
    "This screen means business when it comes to aesthetics. It’s got chunky bezel, dark plastic and metal, and a subtle stand. It’s not eye-catching, but it doesn’t need to be.",
    "It does weigh 20.3 pounds (9.23kg), though, and it has a maximum height and width of 25.8in (657mm) and 29.2in (742mm) – so it’s reasonably large and heavy.",
    "The 328P has huge versatility. There’s a lofty 7in (180mm) of height adjustment alongside swivelling, tilting and portrait mode operation. LG’s panel has all of this except swivelling.",
    "At the rear you get two HDMI 2.0 ports and a DisplayPort 1.4 connector. There are four USB 3.1 ports and a USB Type-C connector. The LG had plenty of ports, but it wasn’t quite as good here.",
    "The two 3W speakers produce adequate sound for casual music, and there’s a Gigabit Ethernet port at the back – a rare and welcome addition.",
    "It’s not all good news, though. The screen is little wobbly and the vertical movement is a little stiff. The ports face downwards and are installed at the back, which makes them awkward.",
    "The OSD offers inconsistent quality, too – the actual on-screen display is sensibly organised, but the four touch-sensitive buttons aren’t good.",
    "They’re very sensitive, there’s no haptic feedback, they have icons that are tricky to see and they’re next to the identical power button – so it’s too easy to press a button repeatedly or even turn the screen off by accident.",
    "So, to sum up, the Philips Brilliance 328P has impressive brightness, black point and contrast levels, and it delivers a reasonable boost to HDR content – but other HDR products will offer more dramatic improvements.",
    "Color accuracy and gamut coverage is good, but the most demanding designers and workers won’t be sated by this screen’s backlight inconsistency and lack of Adobe RGB adherence.",
    "The Philips Brilliance 328P delivers good image quality, but it rarely ascends beyond that level.",
    "Take its brightness measurement of 456cd/m2. It’s a fantastic figure for any normal screen, and it exceeds the 350cd/m2 figure required for consistent DisplayHDR 600 – but it’s short of that protocol’s burst brightness requirement.",
    "The black measurement of 0.14cd/m2 is great, too, but it’s not quite as low as the 0.1cd/m2 black point demanded by DisplayHDR 600.",
    "What does this mean in the real world? For starters, a contrast ratio of 3,257:1. In conventional terms, that’s brilliant.",
    "It means that you’ll get incredible quality when it comes to vibrancy, depth and variety at light and dark ends of the spectrum. That’s great for work, because it means more detail, more complex colours and better depth – and it’ll make movies and games look top-notch too.",
    "However, when it comes to HDR, it’s a bit of a mixed bag. HDR content does look pretty punchy on this screen when compared to normal content, and the 328P does offer a more dramatic improvement than screens that adhere to the weaker DisplayHDR 400 and 500 standards",
    "However, those brightness and black point figures could be better when it comes to HDR, so it also means that pricier HDR panels that meet the DisplayHDR 600 standard – or higher protocols still – will give better results. On the 328P you get an improvement from HDR, but not a transformation.",
    "Philips claims that the 328P has a sub-2 Delta E, but the monitor only hit this figure in its sRGB mode, where it delivered a great result of 1.25. At factory settings it could only manage a 2.52 Delta E. Neither results are bad, but we’d definitely use the sRGB mode at all times.",
    "The panel’s color temperature of 6,639K is better, but these figures do mean that colours aren’t quite as accurate as they could be.",
    "The 328P displayed 100% of the sRGB colour gamut, which is superb for most work. The screen also displayed 96.2% of the DCI-P3 gamut, which is used for HDR.",
    "However, this screen only handled 83.3% of the Adobe RGB gamut – which means that the panel does fall short when it comes to handling the extra colors required for high-end design work.",
    "Uniformity isn’t great, either. The 328P lost 22% and 17% of its backlight strength in its top-left and top-right corners. That’s not ruinous, but the 328P could be more consistent.",
    "The Philips Brilliance 328P has fantastic contrast, which means vibrancy and depth in normal situations as well as a reasonable HDR boost. Color quality is good, too.",
    "Its solid performance – alongside its 32in diagonal and 4K resolution – mean that it offers ample quality for most work tasks and for HDR content.",
    "The 328P offers loads of port and position versatility, too, and the price is decent considering the features on offer.",
    "However, while HDR content does look acceptable on this panel, it could be better – because the 328P doesn’t quite meet all the requirements of its mid-range HDR specification.",
    "The screen falls short of covering the Adobe RGB gamut, which will impact on some high-end work tasks, and Delta E only improved when we fiddled with the settings.",
    "Uniformity is also a little disappointing, movement can be awkward, and the ports aren’t too accessible.",
    "For the vast majority of people, the Philips 328P performs well – you’ll only need to look elsewhere if you’re particularly demanding. And, while its HDR could be better, it’s a reasonable offering considering the price. The 328P is an excellent screen, and you’ll only have to spend more if you’re one of the minority who needs something with even more quality and accuracy.",
    "Image credits: TechRadar"
  ],
  "headers": {
    "2": "Price and availability",
    "5": "Design and features",
    "29": "Performance",
    "43": "Verdict"
  },
  "links": {}
}