{
  "source": "https://www.techradar.com/reviews/amazon-kindle-oasis-2017-review",
  "title": "Amazon Kindle Oasis (2017) review",
  "category": "tablets",
  "updated": "2021-11-28T20:53:38Z",
  "author": "james-peckham",
  "summary": "The first all-metal and waterproof Amazon Kindle",
  "verdict": "The 2017 version of the Amazon Kindle Oasis remains expensive, but it still offers one of best ereader experiences money can buy with an easy-to-use system, beautiful design and phenomenal reading experience.",
  "pros": [
    "Great reading experience",
    "Audiobook functionality",
    "Waterproof and metal design is lovely"
  ],
  "cons": [
    "Expensive",
    "No headphone jack",
    "No speakers"
  ],
  "article": [
    "When Amazon launched the first Kindle it felt revolutionary, and helped to propel the nascent ereader to the widespread reading tool it is now.",
    "But nowadays, innovating in the ereader market is a difficult task, and something Amazon has struggled with in successive iterations of the Kindle line-up. That's all changed, however, with the Kindle Oasis.",
    "The launch of the Kindle Oasis (2017) marked 10 years since the release of the first ever Amazon ereader. Fittingly for a milestone product, the Oasis felt like a big step forward.",
    "It has since been replaced in Amazon's line-up with its most recent Kindle Oasis that was launched in 2019 that comes with a warm light for the very first time.",
    "That means the price of this existing Kindle Oasis has dropped down, but it still comes with a waterproof design, audiobook playback features and a notably larger screen than other Kindle models.",
    "This version of the Kindle Oasis was released back in 2017, and despite being replaced by a newer model it's still readily available from a variety of retailers. You'll find it refereed to on Amazon's site as the \"previous generation Kindle Oasis\".",
    "The 8GB version launched at £229.99/$249.99/AU$389 but the price is now slightly lower at £199.99 or $199.99. We can't find the Kindle Oasis (2017) on sale in Australia at the moment.",
    "There's also a 32GB version that launched at £259.99/$279.99 (with no Australian pricing available for this model). If you want the top of the range model, which comes with free cellular connectivity so you can download books anywhere, that originally set you back £319.99/$349.99/AU$529 but is now available for less.",
    "It’s not a cheap piece of kit considering you can pick up the cheapest version of the Kindle for only £59.99/$79.99 (about AU$105), but you get a lot more than with the most basic versions of the Kindle, and if you’re planning to read a lot, you may find it worth the extra money.",
    "Black Friday is sure to bring some further discounts to Amazon's Kindle range as well when it turns up toward the end of 2019.",
    "Unlike its predecessor, the Kindle Oasis (2017) doesn’t just do ebooks – it also works with Audible audiobook titles. If you use the audiobook service from Amazon you'll be able to listen to them on your Oasis with the use of Bluetooth headphones or a speaker.",
    "There's no 3.5mm headphone jack, which means you won't be able to listen to audiobooks over wired headphones, and that will be disappointing for some people. But it's likely been sacrificed to allow for the waterproof design, so swings and roundabouts.",
    "We'd have loved to have seen some speakers included within the Kindle Oasis itself, but if you have a pair of Bluetooth headphones you’ll be able to listen while on the move in peace.",
    "One nice touch is that if you own both the Audible and ebook version of a title, you can quickly switch between the two without losing your place.",
    "That means you'll be able to read physically on the screen, then switch over to the audiobook while you're on a walk and seamlessly switch back when you have a chance to read on the screen again.",
    "Owning both audiobook and ebook versions of a title may sound like an expensive endeavour, but if you already own the ebook Amazon will sell you the audio version starting at £2.99 (about $4, AU$5). It's going to cost extra money, but if you’re a serious reader who wants to make progress with a title anytime, anywhere with minimal interruptions you’re likely to welcome this feature.",
    "We found it worked well – you can just press on the Audiobook button at the bottom-right of the display to switch over to the audio edition; you may have to listen to a minute or so of audio you’ve already read within the ebook as it won’t know the exact moment you stopped, but it makes it easy to pick up where you left off.",
    "If you're also planning to use the Oasis for your audiobooks, it's likely you'll want the larger 32GB version to ensure you have enough room for all of your titles. The 8GB version will be enough for a ton of ebooks, but if you’re planning to add a few audio titles that’ll soon fill up.",
    "In perhaps the biggest departure in terms of design, the Kindle Oasis (2017) has an all-metal design, a first for the Kindle range. It's an aluminium material that doesn't feel slippery in the hand.",
    "It's heavier than the last-generation Kindle Oasis at 194g, but it's still a comfortable weight in the hand, and weighs less than the Kindle Paperwhite. During our time reading with the device we never found it would get too heavy, and that’s down to its unique design.",
    "The design on the rear is similar to the previous Kindle Oasis, with one side thicker than the other, with the thicker side designed to sit in your hand to offer a good grip.",
    "The primary reason for this thicker part is to house the battery, but this time there's no ugly case connector on the rear, and overall it looks superior to the original Oasis.",
    "Color choice wise you'll have graphite (the one pictured throughout this review) but there's also a champagne gold version of the 32GB model if you want something a little more extravagant.",
    "In fact, Amazon has taken the case mechanic of the original model away altogether. Instead you can buy covers to protect your Kindle, but there are no battery cases available for this model.",
    "For cases you have the choice of water-safe fabric covers for £39.99 (about $50, AU$70) or more premium-feel leather options, available in Midnight (black), Saddle Tan or Merlot (dark-red), for £54.99/AU$84.95 (about $70).",
    "We tried out the blue water-safe case during our full review and while it felt comfortable, we did find that it would get in the way a little while you were reading, and this may be an issue if you’re planning to always use it.",
    "The new Kindle Oasis is also waterproof, which is a first for the Kindle range. It can survive for up to an hour submerged up to two meters deep, which means it'll shrug off the odd dunk or splash, which is reassuring if you do a lot of reading in the bath, or by the pool on holiday.",
    "Arguably the only negative in terms of the design is that if your Oasis has been sitting around on a table or in a bag for a while the metal can feel uncomfortably cold to the touch when you pick it up.",
    "Apart from that though, this is the most comfortable experience we’ve had with an ereader, and that means it’s easier to keep reading for longer.",
    "Image Credit: TechRadar"
  ],
  "headers": {
    "5": "Amazon Kindle Oasis (2017) price and release date",
    "10": "Key features",
    "18": "Design"
  },
  "links": {
    "Kindle Oasis": "https://www.techradar.com/reviews/pc-mac/tablets/amazon-kindle-oasis-1318876/review",
    "Kindle": "https://www.techradar.com/reviews/pc-mac/tablets/e-readers/amazon-kindle-1328572/review",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Kindle Paperwhite": "https://www.techradar.com/reviews/pc-mac/tablets/e-readers/amazon-kindle-paperwhite-1297439/review"
  }
}