{
  "source": "https://www.techradar.com/reviews/moto-z3-5g",
  "title": "Moto Z3 5G review",
  "category": "phones",
  "updated": "2019-04-05T21:23:16Z",
  "author": "david-lumb",
  "summary": "The solid budget – and so far only – 5G option",
  "verdict": "The Moto Z3 won't turn heads with its simple design and lack of flagship features, but it's a surprisingly powerful phone at a bargain price. Which would be enough to recommend the phone – but it's also Verizon's secret weapon to get folks in the 5G door at a lower cost by buying the Z3 and a 5G Moto Mod. But how it will perform on the network has yet to be seen.",
  "pros": [
    "Significant price drop since launch",
    "Mods are intriguing if limited-utility",
    "Cheaper 5G option than flagships"
  ],
  "cons": [
    "Dated specs and design",
    "Cost of MotoMods adds up"
  ],
  "article": [
    "In the increasingly crowded midrange phone market, the Motorola Moto Z3 is under more pressure to stand out. And it does, thanks to its respectable (if slightly dated) specs and Motorola’s signature Mods add-ons – all for under $500.",
    "Admittedly, this review is late – the Moto Z3 officially launched in August 2018 – but the phone has a curious advantage that makes it relevant in 2019. The 5G Moto Mod, already on sale, will enable the phone to link up to 5G networks – including Verizon's, which is the only active one in the US thus far.",
    "This is the year 5G is supposed to arrive in force, promising much faster speeds and downloads. When 5G networks will actually get up and running isn’t clear, but there are already 5G phones coming this year by big companies, including the Samsung Galaxy S10 5G, LG V50 ThinQ, and the foldable Huawei Mate X.",
    "If the already-released Moto Z3 beats these others to the punch, that’s another feather in its cap. But some of those manufacturers, like Honor, will likely release a more affordable model that will compete with Motorola’s midrange phone – so the Moto Z3 may not end up being the most affordable 5G answer on the market for long.",
    "Otherwise, the phone incrementally improves on its predecessor, the Moto Z2 – but you’d do better to think of it as taking nearly all the best parts of the Moto Z2 Force and stuffing them into the Moto Z3 Play’s slightly larger frame.",
    "While the Moto Z3 is a worthwhile choice for the budget-conscious on its own, it’s also, currently, the only 5G phone in the US. Not alone, of course: you need the 5G Moto Mod, which clips on to the phone’s rear (securely, thanks to some strong magnets) and must remain in place to connect to Verizon’s just-launched 5G network.",
    "It’s not as simple as dropping into a Verizon store and walking out with the mod, as we found out. Among our first reactions, starting from the day the telecom switched on its 5G network, was surprise: Verizon requires you to show proof of ownership of a Moto Z3 when picking up a 5G Moto Mod, or to buy a phone on the spot. You’ll need to be subscribed to one of the telecom’s Unlimited plans, and then pay a $10 monthly fee above that. (You do get 3 months of free 5G data, though.)",
    "The 5G Moto Mod is pricey, retailing for $350, though Verizon is selling them in-store for $200 at the moment. Couple that with the $350 pricetag for the Moto Z3 and the whole setup is solidly in the midrange expense tier, though that’s far less expensive than the Galaxy S10 5G and LG V50 ThinQ 5G are expected to cost (at or above the $1,000 threshold that their non-5G versions have been priced at).",
    "As for the coverage, well...Verizon did activate its 5G network in early April a week earlier than expected, true. But it only went live in parts of two US cities. In Chicago, this included Magnificent Mile (specifically the Verizon store), Gold Coast, Old Town, River North, and portions of South Loop and West Loop. Minneapolis' 5G coverage areas are in Downtown West, Downtown East, Elliot Park, and the Mall of America's Verizon Store.",
    "Verizon is relying on millimeter wave technology that requires line-of-site with the 5G-broadcasting signal tower, which don’t cover nearly as large of area as those broadcasting 4G LTE. As such, we found it difficult to pick up 5G in the network’s first few days, and Verizon wasn’t providing coverage maps.",
    "Once you step outside the 5G coverage zones (or if your phone can’t connect), the 5G mod-packing phone should switch automatically to 4G, which we’ve found. When we have found 5G signal, we’ve seen speeds up to 448Mbps, which is about where Verizon placed its tamped-down expected rates before it improves its network. Compare that to the 45-60Mbps we saw on the 4G side of things.",
    "One last quick note: the 5G Moto Mod clips to the back of your Moto Z3 (and will be compatible with other Moto phones later on), but don’t worry about missing out on a battery pack: The 5G mod includes a 2,000mAh battery expansion, too. Worry instead at the beefy girth of the mod, which nearly doubles the thickness of the Moto Z3.",
    "The Moto Z3’s launched in August 2018 at a $480 (about £370, AU$650) baseline cost, though that’s dipped down to $349 on Motorola’s official store. That’s below the lower-specced Moto Z3 Play’s $399 price, though the latter is typically bundled with a 2,200mAh battery pack Moto Mod, which typically retail for $50.",
    "We’ll get into the Mods lineup later, but suffice to say they’re an important factor in the Moto Z3’s value – so if you’re just looking for a basic model with Mod accessibility, you might be satisfied with the Z3 Play.",
    "Unfortunately, the Moto Z3 is only carried by and available through Verizon. That’s certainly different from previous models like the Moto Z2 and Moto Z3 Play that you could buy unlocked or through different carriers, but you’ll have to go through Verizon if you want the Moto Z3.",
    "Picture the Moto Z3 Play. Got it? Great – that’s the design of the full-fledged Moto Z3. But that’s not necessarily a bad thing, as the phone is a sleek, thin smartphone with attractive glass front-and-rear that will easily fit in your pocket.",
    "Well, so long as the camera bump doesn’t get in the way: the signature photo-blister returns, and while it’s not cumbersome, it’s not small. But since it’s a key component to Moto’s Mod system (each add-on fits snugly around the bump), it’s a particular choice you’ll learn to live with if you opt for Motorola’s Z-line phones.",
    "The phone weighs 156g, which is on the lighter side compared to flagships like the iPhone XS (171 g) and Samsung Note 9 (201g). This is offset by the Mods, which can be hefty: the basic 2,200mAh power pack, by far the most useful Mod of the bunch, adds around 70 g. At 5mm thick, it covers the camera bump and then some, nearly doubling the thickness of the 6.8mm phone.",
    "Otherwise, the Moto Z3 looks textbook Motorola, with thin bezels on the sides, a chin thick enough to stick a company logo, and a thin top with no notch. From a distance, you’d be hard-pressed to tell this apart from some of the cheaper G-series phones. The big difference is the glass back (some G-phones have glass, but others have aluminum or plastic), the sizable camera bump, and the strip on the back filled with contact pins for the Mods to connect.",
    "Motorola retained the side-mounted fingerprint scanner. It’s conveniently placed right where your thumb rests, so we never had a problem logging in. In fact, it’s almost too convenient: when grabbing the phone, we accidentally pressed it and unlocked the phone when all we wanted was to check the lock screen notifications. It’s an odd annoyance, to be sure.",
    "The Z3 has a USB-C port at the bottom, but sadly, there’s no 3.5mm headphone jack. That’s something the newer and lower-market G7 phones have on their pricier cousin – let alone the Samsung S10 line, which still retain the port as a bragging point."
  ],
  "headers": {
    "5": "The Moto Z3 5G story...so far",
    "12": "Moto Z3 price and release date",
    "15": "Design"
  },
  "links": {
    "5G phones": "https://www.techradar.com/best/best-5g-phones",
    "Samsung Galaxy S10 5G": "https://www.techradar.com/reviews/samsung-galaxy-s10-5g-review",
    "LG V50 ThinQ": "https://www.techradar.com/reviews/lg-v50-thinq-5g",
    "Huawei Mate X": "https://www.techradar.com/reviews/huawei-mate-x",
    "our first reactions": "https://www.techradar.com/news/the-first-5g-phone-hands-on",
    "Moto Z3 Play": "https://www.techradar.com/reviews/moto-z3-play-review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "Samsung Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "Samsung S10": "https://www.techradar.com/tag/samsung-galaxy-s10"
  }
}