{
  "source": "https://www.techradar.com/reviews/gilisoft-video-editor-1030",
  "title": "Gilisoft Video Editor 10.3.0 review",
  "category": "computing",
  "updated": "2020-08-19T08:35:52Z",
  "author": "steve-paris",
  "summary": "An editing app with a completely different take on how to edit video",
  "verdict": "An original interface to help you make the most of a few simple clips you provide it, but it’s far from ideal should you wish to create more complex edits.",
  "pros": [
    "Original interface",
    "Multi-platform",
    "Simple to understand",
    "Stable"
  ],
  "cons": [
    "Convoluted way of working",
    "Limited tools",
    "Have to save files multiple times",
    "Not designed for long edits"
  ],
  "article": [
    "When you work in video editing, you see a lot of video editor apps that aim to do the job right, and after a while you start see similarities. Importing footage, previewing it, editing it, refine it and add special effects, it’s all pretty similar. So it was a pleasant surprise to come across Gilisoft’s Video Editor, because it turns the whole concept on its head, so much so in fact that a professional editor would look at it and wonder how to proceed.",
    "There’s no Preview Window, no Browser to look for clips and drag them to the Timeline to build your edit, no Timeline even. It could well be that my experience in this field is putting me at a disadvantage. Could I be so stuck in my ways that I cannot see a radical departure from the norm as anything but a mistake and an inconvenience? So in order to do this software justice, I will endeavour to look at it through the eyes of someone who has no prior knowledge or experience of editing. Can anyone make a movie with this software?",
    "At first glance, it’s hard to know where to proceed. The interface offers you eleven huge coloured buttons. Those colours don’t appear to organise the buttons in any particular group, and seem to have been chosen for aesthetic purposes. Based on their titles, you can Crop a file, add Effects, a Subtitle or a Watermark. The red Joiner button seems more promising as that appear to be where you build your edit. The three middle buttons offer you three different ways to cut footage: Easy Cutter, Batch Cutter and Advanced Cutter. The right most buttons let you Rotate your footage, Add/Remove Music, and Split a clip.",
    "Let’s start with Easy Cutter. This section allows you to load a single video file, select a specific section to turn that selection into a new separate file. You can select multiple sections of the same media it will save them all as different files, without altering their video format, so there would be no degradation in quality.",
    "Batch Cutter is a way to cut multiple different files in the same way (say, remove the first five seconds of each clip), Split Clip, lets you cut a clip into two, and Advanced Cutter allows you to cut sections of a clip, add effects to them, apply a watermark, include subtitles or add music, all in one go. Every time you perform an action, a new video file is saved bearing the new information.",
    "This has some advantages if your movie will essentially consist of a single clip. Using these cutting tools, you can trim the footage to focus solely on the interesting part, add a fun effect, maybe even a title, and that’s pretty much it.",
    "If you want to be a little more creative, that’s where the Joiner option comes in. You can load multiple clips into that section, either the raw footage you shot or any of the clips you created with the Cutter tools. They all appear in a list. You can reorder them with the Up and Down buttons. It’s also possible to further cut parts of those clips, should you wish to refine your edits.",
    "You’re able to add transitions in between your clips. This adds a merging effect between them. You can set the duration of this transition and have a choice of hundreds of them… except that the vast majority merely have a number for a description, forcing you to select it to find out what they do - hardly user friendly; how many will have the patience to check out all 248 of them?",
    "Within Joiner is an Output Settings menu, where you can change your video’s parameters. By default, they’re set to being the same as the clips you’re joining, but if the files are of different formats that section can be of benefit.",
    "Although you can preview each of the clips you’ve added to Joiner individually, you cannot preview the whole sequence you’re creating, nor the transitions you’ve selected; you must export the lot as a single file in order to do see what the end result looks like, which is far from convenient. This process is definitely not for the meticulous editor.",
    "Once done, you can re-import the completed file to one of the other menus to make further changes. Each of these options - Crop, Rotate, Effects, Subtitle, Watermark and Music - lead you to a different tab of the same window. This means that you can make all the changes you need related to those menus, without having to save the file and reopen it each time you alter the clip in a different way.",
    "Everything is pretty straightforward, but also very limited. You only have 14 effects to choose from for instance, in addition to the basics like Brightness, Contrast and Saturation, and those effects are generic, such as Mosaic, Haze, and Back and White. The chosen clip can also be slowed down to a 10th of its normal speed or sped up to 4 times.",
    "The Watermark section is interesting thanks of its ability to allow you to insert a video watermark to your clip. This could allow you to create a picture-in-picture effect if you so choose.",
    "Frustratingly, Subtitle requires you to load a text file - you can’t type directly into the app, although you can alter the font style and the text’s position on the screen.",
    "You can insert your favourite song via the Music section, and even choose where the music will start and end.",
    "I can see the appeal of such an app if your needs are very limited and you don’t want to bother with the headache that a more usual editing app can be. With Gilisoft you can simply load your clip, trim it, add an effect, save it and you’re done in minutes.",
    "However, if you have even slightly more complex needs, then this app becomes a burden. The constant loading and saving of files is quite cumbersome. The inability to preview the whole edit in the Joiner section seriously limits its usefulness, and would really restrict a budding editor to making a movie with only a handful of clips.",
    "Gilisoft is an editing application in the most basic definition of the term. It isn’t suitable for the creation of complex edits, but that isn’t to say that there is no market for this software: we all shoot quick one-take videos with our phones, and this app would actually be ideal for anyone wishing to play around a little with the resulting footage. In that respect, it definitely has its uses, but if you’re at all interested in moviemaking, you’ll outgrow it pretty fast."
  ],
  "headers": {
    "1": "Interface",
    "3": "Editing",
    "7": "Transitions",
    "11": "Effects",
    "15": "Final verdict"
  },
  "links": {
    "video editor apps": "https://www.techradar.com/best/free-video-editing-software",
    "Gilisoft’s Video Editor": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5900193326476634000&xs=1&url=http%3A%2F%2Fwww.gilisoft.com%2Fproduct-video-cutter-joiner.htm&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fgilisoft-video-editor-1030"
  }
}