{
  "source": "https://www.techradar.com/reviews/oki-c844dnw",
  "title": "Oki C844dnw review",
  "category": "computing",
  "updated": "2020-01-20T11:18:42Z",
  "author": "jim-hill",
  "summary": "World’s smallest A3 printer has huge potential",
  "verdict": "It might be small, but this versatile device prints perfectly and promptly on almost any media.",
  "pros": [
    "Fast print speed",
    "Many features",
    "Large format printing",
    "Vivid color prints"
  ],
  "cons": [
    "No touchscreen control",
    "Long-winded setup",
    "Expensive"
  ],
  "article": [
    "What looks, at first glance, like a heavy-duty A4 printer is actually the world’s smallest A3 color printer, and it achieves this feat without any awkwardly protruding paper trays. The innovative design can swallow 300 sheets of A3 paper in the main paper tray, but it can also print on A6 paper, making it one of the most flexible printers we’ve come across. It can even print on rolls of paper 1.3 meters long.",
    "At around £942 (about $1,175, AU$1,700) the Oki C844dnw is a premium model aimed at the small but busy office, or the retail space that needs to turn out high-quality prints of all kinds quickly and reliably.",
    "The print speed is rated at 36ppm for mono and color pages and Oki recommends a maximum monthly duty cycle of 75,000 pages. It may be small, but this is a serious machine with all the capabilities any business user could ask for including duplex printing, NFC connectivity and security features such as Private Print and an optional security card reader attachment.",
    "The C844dnw is not much wider than the average A4 printer, but it is longer with a depth of over 55cm, and it weighs a table-straining 40kg. The surprising weight says a lot about how much is crammed inside. The whole front section hinges open ingeniously to reveal the four large pre-installed toner cartridges. They are enough to print 2,500 pages, which is quite generous, but they can be replaced by cartridges offering a yield of up to 10,000 pages.",
    "The main paper tray is deep enough to hold 300 sheets of 80gsm paper, while the multi-purpose tray can take another 100 sheets. If that’s not enough, you can buy additional trays to carry a maximum of 2,540 sheets. The paper-out tray can hold 250 sheets.",
    "The long, low design provides a fairly flat path for your paper, which is how the Oki C844dnw is able to handle a very wide variety of media ranging from A6 up to A3 in size and up to 256gsm in weight. Like some other laser printers, the C844dnw uses LED guiding technology to reduce the number of moving parts and thereby increase life expectancy. Oki provides a three-year on-site warranty with this product.",
    "The glossy black control panel is located on the top of the printer and comprises of a numerical keypad and seven buttons. It’s a pity there’s no touchscreen, but the LCD display is at least backlit. Hidden away at the foot of the unit is a second power button for a full power down.",
    "At the rear are Ethernet, USB-A and USB-B ports. There’s no front USB port sadly, but this is compensated for with an NFC touch-point in the control panel. There’s also a lever built into the paper tray to indicate roughly how much paper is loaded in the main tray.",
    "As you might expect from a printer costing around a thousand dollars, the Oki C844dnw is fully featured and highly specified. It sits at the top of the new C800 series and it includes auto-duplex with Wi-Fi, Wi-Fi Direct and NFC connectivity built in. It can print on a particularly wide range of media from A6 to A3 paper, plus envelopes and card up to 256gsm in weight.",
    "The quoted print rate is very fast at 36ppm for mono or color A4 documents and the first page out time is given as six seconds, although this proved a little optimistic when we tested it. The capacity for paper is respectable at 300 sheets with another 100 in the multi-purpose tray. The toner capacity is also very high if you opt for the high-yield cartridges. A set of these will cost an eye-watering £1,108 (about $1,390, AU$1,990), but will print for 10,000 pages.",
    "The print resolution of 1200 x 1200 dpi is better than many laser printers. AirPrint and Google Cloud Print are catered for, of course, and the companion app called Oki Mobile Print makes it easy to print photos and files from your smartphone.",
    "Security features include Private Print, which allows you to insist on a code before prints can be collected, and there’s also the option of adding a security card reader.",
    "The setup procedure is rather long-winded, if only because we have become accustomed to printers at this price point offering a touchscreen interface. With only a numerical keypad and a mono LCD to work with, it’s a case of laboriously scrolling through the menu options and repeatedly keying in your Wi-Fi password until you manage it with no mistakes.",
    "The process is made more complicated by the fact that the printer cannot support infrastructure and AP mode at the same time, and toggling between the two takes a surprising amount of scrolling and typing. Once you are set up to your satisfaction, however, day to day operation of the C844dnw is very easy and actually quite fun thanks to its prompt and versatile printing abilities.",
    "The Oki C844dnw prints pages quickly and fairly quietly. We found that the first page out time was invariably longer than the quoted six seconds, but it was still relatively fast. Consecutive pages appear very quickly in duplex mode and they look pleasingly crisp and colorful.",
    "Text pages have the flawless uniformity we have come to expect of a premium laser printer. Switch to the toner-saving Draft Mode and the letters are given a light touch, but they’re still perfectly formed and legible even at the smallest point sizes.",
    "Color documents are even more impressive and they emerge at exactly the same rate of 36ppm. All three colors are bold and bright, while the black always appears satisfyingly dark and well shaded during greyscale tests. This vibrancy of colors, combined with the relatively high image resolution of 1200 x 1200 dpi, also means that photographs look quite lifelike. As with all laser printers, you can see the unwanted banding where light transitions to dark, but it’s handled very well here.",
    "The big advantage with the Oki C844dnw is that it can print on A3 paper with no more fuss than if it were A4. You can load A3 paper into the main paper tray, or the multi-purpose tray, and watch it shoot into the paper-out tray at high speed. We experienced no smudges, smears or paper jams throughout the duration of our testing.",
    "For a print-only device, this is an expensive unit, but it certainly justified its price during our review. The flat paper path and LED technology no doubt help the Oki C844dnw achieve its high print speed and flawless performance with every kind of paper stock you might want to throw at it.",
    "It’s a pity there’s no touchscreen interface or front USB port, and the companion app leaves room for improvement. But the C844dnw makes up for those minor shortcomings with auto-duplex and NFC connectivity, while the wide range of optional extras give it a degree of future-proofing many printers lack.",
    "All in all, this is a very well-designed and well-specified printer that would suite any office, big or small."
  ],
  "headers": {
    "3": "Design",
    "8": "Features and specifications",
    "12": "Setup and operation",
    "14": "Performance",
    "18": "Final verdict"
  },
  "links": {}
}