{
  "source": "https://www.techradar.com/reviews/creative-stage-air",
  "title": "Creative Stage Air review",
  "category": "audio-visual",
  "updated": "2019-02-01T22:49:46Z",
  "author": "ted-kritsonis",
  "summary": "Better audio from your PC or Mac when you're on a tight budget",
  "verdict": "The Creative Stage Air won’t wow anyone with its audio output but it is a decent step above tinny computer speakers.",
  "pros": [
    "Decent bass and mids",
    "Wired or wireless setup",
    "Lightweight and easy to use"
  ],
  "cons": [
    "Cables aren’t long enough",
    "Treble sounds flat",
    "No AAC or aptX support"
  ],
  "article": [
    "Even if you're buying a high-priced desktop, pack-in computer speakers are rarely good. Getting something better is easy enough, and when it’s as cheap as the Creative Stage Air, it may be worth giving it a shot.",
    "For $40 (£45, around AU$70) the Stage Air is less than a pair of headphones from most brands, and offers a serious update on the tinny-sounding computer speakers you're used to hearing. Sure, it's probably not the product that's going to replace the surround sound setup in your living room, but Creative is a company that excels at making products that punch above their weight.",
    "Should you toss out your old speakers for a Stage Air? Read on to find out.",
    "The Stage Air measures a modest 16 x 3 x 2.75 inches, good enough for just about any desktop all-in-one or monitor. It has a relatively low profile that makes it easy to slide underneath a monitor, but that also depends on which computer you’re using. For us, we nestled it under an older 2013 iMac most of the time and it fit perfectly.",
    "For both better and worse, it’s a pretty non-descript product. The piano black finish at the top gives it an air of elegance suggesting it’s not some run-of-the-mill $40 accessory. Take a closer look or put your hands on it, however, and the plastic body changes that perception a little bit.",
    "The metal grille in the front (with Creative logo) is flanked by two sides, one of which holds buttons for power, volume and Bluetooth. One microUSB port acts as the power source, with a USB-A port there acting as a separate playback input. Plug in a USB stick full of music and you can listen to those tracks directly. It actually starts playing automatically without any real way to control playback.",
    "In a bizarre move, Creative includes a really short Aux-In cable in the box. So short, in fact, that it only made it to the back of the iMac because the jacks on both were on the same side. If they weren’t, there’s no way we could've stretched the cable that far. Aux cables are pretty cheap - and you might even have a longer one laying around the house somewhere - but it's still a minor issue that's worth pointing out.",
    "The good news is that, if you can't run a wired connection, that's absolutely fine - the Stage Air supports Bluetooth, so going wireless is an option, either from a computer, mobile device, or both.",
    "The one caveat is that it’s Bluetooth 4.2 and only works with the SBC audio codec. That means you won’t get the best possible stream through AAC for macOS and iOS or aptX for Windows and Android.",
    "While you could always maintain a constant power source, the Stage Air has a battery that lasts up to six hours, according to Creative. Volume level is the biggest determining factor, and since you would likely go higher than average, expect something closer to four.",
    "Creative does outline a few different setup options that have more to do with what you’re actually connecting to. We found this best used in close quarters, like sitting in front of a computer or at a desk in a small room rather than using it to try and fill a living room full of sound.",
    "There are dual 5W drivers inside, so output isn’t especially loud, yet still ideal for close confines. Not surprisingly, the soundstage skews more toward the low end to let bass set the tone. We likened it to a slope that scaled up on the low end down toward the highs.",
    "Where bass was prominent and mids were complementary, the highs were flat. Treble is the weakest link in the audio spectrum here, and while it wasn’t so bad playing a game or listening to hip hop, it became much more obvious when listening to video or audio podcasts through the Stage Air.",
    "We weren’t expecting an unreal audio experience at this price point, so weren’t all that bothered by it. If anything, we thought it might be the low end that suffered more. Mind you, it can depend on the source and who’s talking or singing. Screechy voices will still feel loud, like Aerosmith’s Dream On or anything by AC/DC, whereas deeper voices, like Diana Krall or Eddie Vedder, sound subtler.",
    "Unlike some of Creative’s other products, there are no special audio modes to tinker with and boost fidelity. What you hear is what you get. This is why we see the Stage Air as being more for serviceable convenience than a compelling quality solution. If you play games or watch movies a lot on your computer, the shortcomings will be more apparent.",
    "Small kitchen TVs might also benefit from having something like this set up, just to boost their tinny speakers. The Stage Air’s footprint isn’t huge, and if you can lay it along a table along a wall, it should be fine.",
    "It’s easy to find faults with any $40 speaker, but we were never terribly disappointed by the Stage Air because we measured our expectations going in. There was simply no way we were getting $400 sound at a tenth of the price.",
    "Creative’s Stage speaker likely offers better sound, and comes with a subwoofer, for twice the cost of the Stage Air but we haven’t been able to test it, so can’t be sure of the performance improvements. For gamers, the Creative Sound BlasterX Katana may be more expensive at $220 (£219, AU$499), but it delivers far better performance and versatility. Plus, it can get really loud.",
    "But if you’re on a tighter budget and just want to escape from terrible computer speakers, the Stage Air will at least bump you up to the next level."
  ],
  "headers": {
    "3": "Design",
    "7": "Setup",
    "11": "Performance",
    "16": "Final verdict"
  },
  "links": {
    "Creative Sound BlasterX Katana": "https://www.techradar.com/reviews/pc-mac/peripherals/speakers-and-headphones/speakers/creative-soundblasterx-katana-1327913/review"
  }
}