{
  "source": "https://www.techradar.com/reviews/tribit-xsound-go",
  "title": "Tribit XSound Go review",
  "category": "audio-visual",
  "updated": "2019-02-13T23:00:48Z",
  "author": "lewis-leong",
  "summary": "This budget Bluetooth speaker has no right to sound this good",
  "verdict": "The Tribit XSound Go punches way above its class, offering big sound in a small package. The speaker gets loud, has a decent amount of bass, and lasts all day. For the money, the XSound Go is an incredible value for those on a budget.",
  "pros": [
    "Expansive sound",
    "Excellent battery life",
    "IPX7 water resistant"
  ],
  "cons": [
    "Sounds lean at max volume",
    "Mid-forward sound",
    "Charging takes a long time"
  ],
  "article": [
    "In the world of Bluetooth speakers, prices can range wildly from under $50 to well into the thousands. Costing just $33 (£28, about AU$47), the Tribit XSound Go falls in the former camp and although you’ve probably never heard of Tribit before, the company has been making waves, popping up in various Bluetooth speaker roundups.",
    "But why is a budget Bluetooth speaker getting so much attention?",
    "This is one of the best sounding Bluetooth speakers for under $50 you can buy right now. For the price, you’re getting expansive sound, excellent battery life, and a rugged IPX7 water resistant body. Plus, if you forget the speaker on the beach, you’re only out $33.",
    "After spending a week testing the Tribit XSound Go, we can say that the hype is merited. If you don’t want to spend too much on a Bluetooth speaker, the Tribit XSound Go should be at the top of your list. Here’s why.",
    "Admittedly, the design of the Tribit XSound Go isn’t anything to write home about: It’s a generic, pill-shaped speaker that would fit in at any electronics section at the grocery store but don’t let its humble design fool you.",
    "That said, it's definitely rugged, and could be thrown in a bag without worry.",
    "On the front of the speaker, you’ll find a grille with the Tribit logo hiding the drivers. The speaker’s controls are all located at the top with buttons for power, Bluetooth pairing, media playback controls, and volume controls. It’s all standard fare with the buttons being big and easy to use.",
    "Around the back is a silicone flap hiding the microUSB charging port and 3.5mm headphone jack. Bluetooth speakers are increasingly dropping support for analog inputs so it’s nice to see that the 3.5mm jack remains on the XSound Go. That said, while microUSB is fine, we would have liked to have seen a USB-C charging port as most modern phones and laptops use the connector.",
    "The speaker also comes with an attached lanyard which makes it easy to carry and can be strapped to a backpack.",
    "If you believe the old adage about getting what you pay for, you might not expect much from the Tribit XSound Go’s sound quality.",
    "Thankfully, that adage has never been less applicable: The speaker gets loud enough to fill up a medium-sized room, and at full volume, there’s only a little distortion on the highs.",
    "The overall tonal balance of the speaker is very mid-forward, so vocals have a nice emphasis and texture. Highs are extended, but lack the air of more powerful speakers. Bass is good for a speaker of this size but don’t expect it to shake your table. Deep, powerful bass can only be achieved with bigger speakers.",
    "Compared to the $50 (£46, about AU$63) Anker SoundCore 2, the Tribit XSound Go is our pick between the two for its better sound and less distortion at max volume. (The SoundCore 2 sounds a bit tinny and flat to our ears.)",
    "For that reason you’ll have to step up to the SoundCore Flare in Anker’s line of speakers to beat the Tribit’s sound. As a bonus, the Flare also gives you 360-degree sound which is largely preferable to a cone of sound.",
    "Battery life is rated at 24 hours of playtime at medium volume, and we got around 20 hours of observed play time, which is great for a speaker of this size. Charging the battery does take several hours so make sure to have the speaker charging overnight and not an hour or two before you need to take it on the go.",
    "The Tribit XSound Go shouldn’t sound this good for the price, but it does. The speaker impressed with balanced sound, is near distortion-free at high volumes, and lasts and incredible 20+ hours of playtime at medium volume. Plus, the speaker is IPX7 water and dust resistant so it’ll put up with a day at the beach or pool without a problem. While it’s design may be forgettable, you won’t care once you hear how good the XSound Go sounds.",
    "In terms of competition, you’ll have to spend a lot more for better sound quality. The UE Wonderboom is an excellent outdoor speaker, but will cost twice the money and doesn’t last as long as the Tribit. However, the UE Wonderboom does offer 360-degree sound and multi-speaker pairing if that matters to you. The JBL Flip 4 is also a good alternative if you want more bass emphasis and 360-degree sound but, if you're on a budget, you can't beat the XSound Go."
  ],
  "headers": {
    "4": "Design",
    "9": "Performance",
    "15": "Final verdict"
  },
  "links": {
    "Anker SoundCore 2": "https://www.techradar.com/reviews/anker-soundcore-2",
    "SoundCore Flare": "https://www.techradar.com/reviews/anker-soundcore-flare",
    "UE Wonderboom": "https://www.techradar.com/reviews/ue-wonderboom",
    "JBL Flip 4": "https://www.techradar.com/reviews/jbl-flip-4"
  }
}