{
  "source": "https://www.techradar.com/reviews/xiaomi-mi-mix-3-review",
  "title": "Xiaomi Mi Mix 3 review",
  "category": "phones",
  "updated": "2019-01-31T13:05:24Z",
  "author": "john-mccann",
  "summary": "A sliding party piece sets this affordable flagship apart",
  "verdict": "An accomplished flagship with plenty of power, solid battery life, and a party piece in the shape of its all-screen, sliding design that sets it apart from many of the smartphones on the market.",
  "pros": [
    "Great all-screen design",
    "Solid battery life"
  ],
  "cons": [
    "Heavy and bulky",
    "Slider is fun, but stiff",
    "Interface needs polish"
  ],
  "article": [
    "The Xiaomi Mi Mix 3 is a striking smartphone, with an all-screen display that shuns the notch and 'punch-hole' design culture currently sweeping the industry in favor of a cleaner, smarter look.",
    "Now, you might be wondering, if there’s an all-screen display, but no notch, and no punch-hole, where’s the selfie camera? The answer is that Xiaomi has dusted off a smartphone design trick from way back when, with the display sliding down to expose the Mi Mix 3’s front-facing snapper. It’s a trick Xiaomi has pulled off to good effect, and it means the Mi Mix 3 earns a prominent entry in the annals of the smartphone industry’s quest for a 100% screen-to-body ratio, with Xiaomi managing to fill 93.4% of the phone’s front-facing body with screen.",
    "Sliding display aside, the Mi Mix 3 boasts a host of high-end features, and with a price tag that sees it compete directly with ‘affordable flagships’ such as the OnePlus 6T and Honor View 20.",
    "The Xiaomi Mi Mix 3 is available in the UK, China and a host European and Asian countries, but the brand is yet to launch its smartphones in the US. Xiaomi only arrived in the UK at the end of 2018, so there’s hope it will bring its phones to the US soon.",
    "The firm’s phones are available in Australia and India, although the Mi Mix 3 is yet to reach either - but keep an eye out for it as it may be arriving soon.",
    "The Xiaomi Mi Mix 3 price is £499 (around £650, AU$900) in the UK, which as we’ve mentioned puts it up against the the OnePlus 6T and Honor View 20, while comfortably undercutting the established names.",
    "There is a Mi Mix 3 variant with 8GB of RAM and 256GB of storage, but we’ve been told that it won’t be coming to the UK.",
    "The big feature of the Xiaomi Mi Mix 3 is its sliding screen, which you have to tug with a little force to get the magnetic mechanism to move down and click into place.",
    "It is something of a party piece. We handed the Mi Mix 3 to many of our friends and family, and they were impressed with the all-screen display, but stumped when we challenged them to find the front-facing camera. When we slid the screen down to reveal it, everyone had the same reaction: “That’s cool.”",
    "It also makes a satisfying ‘clunk’ as you slide it up and down, which initially saw us playing with the slider subconsciously as we held the device, but we stopped doing so shortly into our review period – because the Mi Mix 3 isn’t actually that easy to slide.",
    "The screen is held in position by magnets to prevent accidental slides, but we found these to be a little too strong. Coupled with the slippery glass finish and a heavy body, it means you need to apply quite a lot of pressure to the screen in order to slide the Mi Mix 3 open.",
    "Compared to the BlackBerry Priv – one of the few sliding phones to launch in the past four years – the Xiaomi Mi Mix 3 just isn’t as smooth.",
    "Sure it’s cool, and the Mi Mix 3 can boast a form factor that helps it stand out from the crowd of slabs, and will potentially make it the envy of your friends, but day to day we found that we hardly used the slider.",
    "Unless we wanted to snap a gratuitous selfie, the screen remained unmoved. You can use the sliding action to answer calls, but it’s a bit of a gimmick and an on-screen swipe tends to be easier if you’re using the phone one-handed. It can be popped down to use the camera for face unlock, but considering the Mi Mix 3 has a rear fingerprint scanner which is easier and quicker to use, that function seems a little redundant.",
    "And the sliding design choice does come with a few drawbacks. The Mi Mix 3 is noticeably heavier than other phones, at 218g, and it’s slightly thicker (8.5mm) than most of its rivals, although it’s still slim enough to fit in your pocket.",
    "It's too early to tell if the sliding mechanism will wear out after prolonged use over the phone's lifespan, but we experienced no issues with the movement during our time with the handset.",
    "We did find that the section of phone which is uncovered when you slide down is a dust trap though, so a regular wipe is required to keep things looking fresh.",
    "Xiaomi has confirmed that the Mi Mix 3 does not have an IP rating for water or dust resistance, and the sliding mechanism puts its weather-proofing credentials even further in doubt.",
    "Another issue with the sliding design is protection. A slim case is provided in the box with the Mi Mix 3, but it doesn’t cover the base of the phone, and leaves the chin which slides out exposed if you were to drop the handset. You'll have to be extra careful if you do decide to pick it up.",
    "As is the trend with flagships these days, there’s no 3.5mm headphone jack on the Mi Mix 3, with just a USB-C port and speaker grilles on the base of the phone. On the right you'll find a power/lock key below a volume rocker, both of which are easy to hit.",
    "There is a third physical button though, located on the left of the handset just below the SIM card tray. This key launches Google's Assistant when pressed, giving you quick access to voice commands.",
    "The relatively large size of the phone means it's a little unwieldy when trying to type one-handed, with two hands often required if you're tapping out more than just a few words.",
    "Having a large, completely uninterrupted screen really feels like a luxury, though, and the 6.39-inch Full HD+ (2340 x 1080) AMOLED display on the Xiaomi Mi Mix 3 is all the better without any notches or punch-holes getting in the way.",
    "However, it doesn’t quite have the same punchy contrast of the AMOLED displays on Samsung and OnePlus handsets. It means colors appear a little more muted on the Mi Mix 3, which can make some images look a little more natural, but when it comes to watching video and playing games we’d have liked a little more pop.",
    "Xiaomi Mi Mix 3 hands on gallery"
  ],
  "headers": {
    "3": "Xiaomi Mi Mix 3 price and availability",
    "7": "Design and display"
  },
  "links": {
    "OnePlus 6T": "https://www.techradar.com/reviews/oneplus-6t-review",
    "Honor View 20": "https://www.techradar.com/reviews/honor-view-20-review",
    "BlackBerry Priv": "https://www.techradar.com/reviews/phones/mobile-phones/blackberry-priv-1308303/review"
  }
}