{
  "source": "https://www.techradar.com/reviews/moto-e6",
  "title": "Hands on: Moto E6 review",
  "category": "phones",
  "updated": "2019-07-31T07:22:23Z",
  "author": "matt-swider",
  "summary": "Duller than the Moto E5 in some ways",
  "verdict": "The Moto E6 is a budget phone full of compromises. It's Motorola's affordable Android 9 Pie smartphone with a 5.5-inch screen and a removable battery – a real rarity these days. But it lacks a fingerprint sensor, includes a microUSB port instead of USB-C, and keeps the resolution to just HD+ or 720p. Overall, the Moto G7 Play is a better deal right now.",
  "pros": [
    "Incredibly cheap",
    "Durable plastic back",
    "Removable battery"
  ],
  "cons": [
    "Moto G7 Play exists",
    "microUSB port",
    "No fingerprint sensor"
  ],
  "article": [
    "The new Moto E6 is the phone that Motorola wants you to see as the ideal cheap phone alternative if you think the budget-focused Moto G7 costs too much, and the specs show it's just that.",
    "It's a plastic Android Pie phone with solid construction and a 5.5-inch HD+ display on the outside, and the bare minimum in specs that a phone needs to survive these days on the inside. It's an upgrade over the 5.7-inch Moto E5 – at least in some ways.",
    "The Moto E6 has a Snapdragon 435 chipset to give it the smallest performance boost possible over the E5, and it's still limited to 16GB of internal storage and 2GB of RAM. The camera is the only thing that's seen a decent upgrade, but you shouldn't expect to take prize-winning photos with the E6.",
    "What's most confusing is that it lacks a fingerprint sensor, something found on the Moto E5, and that Motorola has stuck with a microUSB port in 2019.",
    "The E6 is at least consistent with its dated characteristics, offering a 3.5mm headphone jack and – shockingly – a removable battery, which some people will like. Really, though, the Moto G7 Play, at about the same price, remains the better buy.",
    "The Moto E6 retails for $149.99 (about £120, AU$210) unlocked from US retailers including Amazon, Best Buy, B&H Photo and Walmart.",
    "US carriers are supporting this phone, and that's started already with Verizon selling it on July 25. The intention was to sell it for $6.95 a month for a 24-month contract, but that's already been reduced to $0 a month. Other networks will include T-Mobile, Boost, US Cellular Consumer Cellular and Xfinity.",
    "Here's one thing the Moto E6 design has going for it: since it's made of plastic, you won't be able to shatter the back if you drop it like you would with a glass phone. It comes in two dark colors: Starry Black and Navy Blue.",
    "Everything about this phone's look and feel is a reminder that this is a very basic handset offered free on contract. It's rather small and unrefined, though you may like that it's compact enough to easily fit into one hand, and the cheap plastic is fairly grippable.",
    "The 5.5-inch screen is HD+, meaning it has a satisfactory resolution of 720p. All of this is okay for an ultra-affordable phone – but confusingly it backtracks in other areas: the lack of a fingerprint sensor (found in last year's model) means it relies on the less secure unlocking methods like Android Face Unlock.",
    "We also have a real problem with the microUSB port on the bottom of the device. USB-C has become the popular standard for Android phones, and the Moto E series has yet to catch onto that trend in 2019.",
    "The removable battery is going to be a highlight for some people, although power banks have become commonplace alternatives to carrying a second phone battery around with you.",
    "The Moto E6 specs start with the Snapdragon 435 chipset, which is an upgrade… but at the same time isn't – the E5 had a Snapdragon 425 chip, while the E6 Plus was at 435 already. Its 2GB of RAM and 16GB of internal storage (expandable by up to 256GB via a microSD card) are the same as in the last-generation phone.",
    "The main draw here is the camera upgrade, at least in theory. We need more time to actually test it outside, but we weren't impressed with the Moto E5 camera, so there's hope that the Moto E6 will improve things.",
    "The E6 has a 13MP rear camera that pulls in more light thanks to the sensor's larger 1.12μm pixels, with an f/2.0 aperture. It comes with fun-to-toy-around-with features, like Motorola's color-isolating black-and-white photo mode, Spot Color.",
    "The front-facing camera remains 5MP, with the same 1.12μm pixels and an f/2.0 aperture. You'll find a lot of the same software tricks on the front, with the addition of screen flash to light up your selfies.",
    "The Moto E6 promises all-day battery life, though its 3,000mAh battery is slimmed down over the E5's 4,000mAh battery – again, a weird omission. Stay tuned for a full review in the coming weeks as we test the performance, camera, and battery life.",
    "The Moto E6 is an ultra-cheap phone for a well-known brand name, but it's full of compromises that should mean most people will prefer to spend slightly more on the superior Moto G7 or Moto G7 Play.",
    "Yes, free-upfront phones are tempting, and so is the idea of a durable plastic handset with a removable battery. However, the specs here offer the bare minimum, and there's no USB-C port or fingerprint sensor. Even at this early stage of our testing, it's hard to recommend the Moto E6 when the older Moto E5 has some perks we liked more."
  ],
  "headers": {
    "5": "Moto E6 price and release date",
    "7": "Design and display",
    "12": "Specs, camera and missing features",
    "17": "Early verdict"
  },
  "links": {
    "cheap phone": "https://www.techradar.com/best/best-cheap-phones",
    "Moto G7": "https://www.techradar.com/reviews/moto-g7-review",
    "Android Pie": "https://www.techradar.com/news/android-pie-9-features-release-date-and-phones-list",
    "Moto E5": "https://www.techradar.com/reviews/moto-e5-review",
    "Moto G7 Play": "https://www.techradar.com/reviews/moto-g7-play-review",
    "power banks": "https://www.techradar.com/news/top-portable-chargers"
  }
}