{
  "source": "https://www.techradar.com/reviews/hp-envy-13t-2019",
  "title": "HP Envy 13t 2019 review",
  "category": "computing",
  "updated": "2019-08-30T17:45:56Z",
  "author": "mark-knapp",
  "summary": "An Ultrabook with few compromises",
  "verdict": "The HP Envy 13t is an elegant Ultrabook that offers a blend of premium design and strong performance at a fair price. It has surprisingly few faults for a second-tier laptop.",
  "pros": [
    "Excellent value",
    "Elegant design",
    "Strong Ultrabook performance",
    "Poppy, tactile keyboard",
    "Marathon battery"
  ],
  "cons": [
    "Inconsistent multi-core performance",
    "Hinge design poor for laps",
    "Display could be brighter"
  ],
  "article": [
    "HP’s Envy line of laptops is effectively the more affordable alternative to its premium Spectre line of Ultrabooks.",
    "But, over the years, more and more of the premium features have trickled down into Envy laptops, and the latest Envy 13t keeps that up with plenty to offer at a more affordable price.",
    "The new HP Envy 13t starts at $999 (£849, AU$1,799) but has been frequently on sale in the US for $250 off all models (note: the US base configuration has a non-touch display, while UK and Australia have touchscreens). The unit we’re reviewing starts at $1,189 as configured before any discounts, and includes an 8th-Generation, Intel Core i7 quad-core CPU, 16GB of RAM and Nvidia GeForce MX250 graphics.",
    "That puts it well below the $1,499 Spectre 13 with a slower Intel Core i7 and half the memory. Meanwhile, the $978 Dell XPS 13 may fit into the same price ballpark, but the base configuration starts with an Intel Core i3 processor paired with just 4GB of RAM and 128GB of storage.",
    "The $999 (about £785, AU$1,403) Huawei MateBook 13 comes in with close parity between price and specs, while MSI’s newly announced Modern 14 offers 10th-Gen Intel Comet Lake processors, a thin-and-light design and a $749 (about £620, AU$1,110) starting price point.",
    "The HP Envy 13t readily fits into the thin-and-light category at just 2.59 pounds and 14.5mm thick. We’ve been tossing the Envy into a backpack that weighs more than it, and it feels light enough on our back that we have to double check it’s even in the backpack before heading out for the day.",
    "The chassis is made from anodized aluminum that is soft to the touch. On the base of the laptop, it’s sturdy with minimal flex, but the screen portion of the laptop is more susceptible to bending and twisting (though less than we experienced with the Acer Swift 5).",
    "One downside to the aluminum is its softness. We managed to get a small ding on the front edge of the laptop which we consistently feel with our thumb when using the clickable trackpad.",
    "Speaking of the trackpad, it’s incredibly wide, offering plenty of space (and Precision drivers to boot) for use. However, it’s vertical dimension feels short when compared to how wide it is. A little way to the side of the trackpad there’s also a small, square fingerprint scanner that we find rarely works on the first try.",
    "The Envy 13t keyboard is standard for its size, and thankfully doesn’t do anything weird to fit certain keys. There are no shrunken Shift keys or oddly placed arrow keys. It even makes the most of its space to add Home, Pg Up, Pg Dn, and End keys at the far right side.",
    "The keys themselves are a delight to use. They’re all wonderfully poppy with minimal wobble and even travel. Pressing on the very edge of a key works as effectively as pressing on the center, making for a highly accurate typing experience that took almost no time to adjust to coming from another laptop. They are also fully backlit, though the white backlight on silver keys can actually make it harder to see the characters in certain situations.",
    "Each side of the laptop includes a USB Type-A port with an unusual mechanism that partly closes the port when not in use — it’s an interesting solution for making the laptop so thin while still including full-size USB ports, though it can be tricky to plug into. There’s also a 3.5mm headphone jack and USB-C port on the left side.",
    "The power port for the lightweight, 65W power adapter is on the right side. There's also a microSD card slot and a little switch that physically disables the webcam, which sits above the display. The webcam itself is a simple 720p number that can get the job done, but has hazy details even in excellent lighting conditions.",
    "There are four speakers, with two down-firing speakers at the front sides of the laptop and more housed in a long, stylish speaker grille above the keyboard. The speakers are impressively loud and clear. We watched a couple episodes of The Boys out on a balcony with minor street traffic on the road below, and could still hear well enough.",
    "The display uses a special hinge that raises the laptop up on an angle, allowing for better airflow through the bottom vents. HP has cleverly added two small, rubber strips on the back edge of the display so that the aluminum doesn’t get scraped if it’s resting on a metal table.",
    "The downside of this hinge design is that the laptop is uncomfortable to actually use on a lap. We either have to sit it far forward on our knees, or have the back edge focus all the pressure along one line on our legs. It may not be a big issue for people who mostly use their laptop on desks and tables, but it could quickly become a dealbreaker for lap users.",
    "The back of the display also has a discreet but somewhat unsightly strip of plastic near the bottom of it that runs almost the whole length. But, this hopefully improves the performance of the machine, as it’s a pass-through for radio signals like Bluetooth and Wi-Fi. What’s strange is that we don’t see this in more designs (it is on the HP Spectre 13, though).",
    "The 13.3-inch display itself is a contender, but shows where the Envy’s affordability results in shortcomings. It has thin bezels on the sides with a slightly thicker bezel up top and a much thicker one at the bottom. It’s not winning any awards for these bezels, especially with the likes of Asus’s ZenBook line.",
    "The HP Envy 13t can come with an Ultra HD display, and we have the Full HD model. It’s plenty sharp for everything we need on a display this size, and doesn’t come with the big hit to battery life that 4K displays are known for.",
    "The screen can get fairly bright, but it’s somewhat hampered by being glossy. Even though it can get bright enough to use outdoors, the glare (and finger oils — it’s a touchscreen after all) can still make it slightly strenuous. And, HP doesn’t provide an anti-glare display option."
  ],
  "headers": {
    "2": "Price and availability",
    "5": "Design and display"
  },
  "links": {
    "Spectre 13": "https://www.techradar.com/reviews/hp-spectre-13",
    "Dell XPS 13": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review",
    "Huawei MateBook 13": "https://www.techradar.com/reviews/huawei-matebook-13",
    "MSI’s newly announced Modern 14": "https://www.techradar.com/news/msi-updates-lineup-of-creator-laptops-with-10th-gen-intel-core-processors",
    "Acer Swift 5": "https://www.techradar.com/reviews/acer-swift-5",
    "HP Spectre 13": "https://www.techradar.com/reviews/hp-spectre-13"
  }
}