{
  "source": "https://www.techradar.com/reviews/asus-zenbook-s13",
  "title": "Hands on: Asus ZenBook S13 review",
  "category": "computing",
  "updated": "2019-01-08T16:15:44Z",
  "author": "kevin-lee",
  "summary": "The fairest Ultrabook of them all",
  "verdict": "With a bezel-less screen unlike anything you’ve seen and packing more hardware than most other Ultrabooks, the Asus ZenBook S13 is a unique machine worthy of your attention",
  "pros": [
    "Almost completely bezel-less",
    "Discrete graphics and a massive battery"
  ],
  "cons": [
    "No Thunderbolt 3"
  ],
  "article": [
    "Webcams (or front-facing cameras) are basically the only thing holding us back from having all bezel-less devices. Phones introduces notches and now the Asus ZenBook S13 UX392 has introduced the webcam tab (our branding, not Asus’).",
    "Rather than digging into the 13.9-inch screen, the ZenBook S13 has achieved a nearly bezel-less display by extending part of its frame to accommodate the webcam. Aside from that nearly all screen face, the ZenBook S13 is an astonishingly thin laptop that still rocks full-on Intel Core I-series processors and even discrete graphics.",
    "The Asus ZenBook S13 UX392 is set to release in the coming months, but pricing has not been disclosed yet. Not exactly the concrete facts we were hoping from Asus, but we can set some expectations for pricing by looking at what’s already in the market.",
    "This laptop’s greatest competitors will be the Razer Blade Stealth, as it’s an ultra-thin laptop rocking discrete graphics for $1,599 (£1,499, AU$2,779). The newly announced Huawei MateBook 13 also a strong competitor that asks for a humble $1,299 (about £1,025, AU$1,830). Asus will have to price its laptop competitively to keep up with this scene.",
    "The ZenBook S Asus debuted at Computex 2018 already featured some impressively thin screen bezels with a 85% screen-to-body ratio, but the new S13 takes things even farther to a 97% screen-to-body ratio. The borders on this unit’s display aren’t just thinner, the screen as a whole has also been enlarged from a pedestrian 13.3-inches to 13.9-inches, putting it on par with larger screen Ultrabooks like the Lenovo Yoga C930 and Huawei Matebook X Pro.",
    "That 13.9-inch display is only Full HD (1,920 x 1,080) and non-touch, which is a little bit of a letdown, but the display still looks gorgeous with plenty of sharpness and lush colors.",
    "Now going back to that webcam tab, at first we weren’t crazy about it but it makes opening the laptop incredibly easy. And yes, we can confirm the ZenBook S13 is one of those laptops you can open with a single finger without the whole thing lifting off the desk.",
    "Speaking of lifting, Asus’ ErgoLift hinge returns to slightly raise the rear of the laptop up and pitch the keyboard at a slight angle when you open up this laptop. Whereas ErgoLift hinge raised up the original ZenBook S by almost a full inch, the extra height you’ll seen on an open ZenBook S13 is much less dramatic and measures somewhere closer to half an inch, if not less.",
    "Overall, the ZenBook S13 features a ton of new flair from the radial pattern of its ring spun screen lid to the diagonally brushed aluminum finish on the keyboard deck. There’s even a large diamond-cut line just above the function keys to give this laptop and extra bit of style while cementing its luxurious identity.",
    "This laptop is also incredibly small and thin with dimensions measuring at just 12.4 x 5.08 x 0.77 inches (31.6 x 12.9 x 1.95cm) and weighs in at 1.1kg. Despite its thinness, the Asus’ latest Ultrabook still features one full-sized USB 3.1 Gen 2 Type-A alongside two USB 3.1 Gen 2 Type-C ports – unfortunately not Thunderbolt 3 – micro SD card slot and a headphone jack.",
    "For how small and thin the ZenBook S13, Asus is packing it with a ton of hardware. Firstly, users will have a choice between the two Intel Whisky Lake processors with the Core i7-8565U and Core i5-8265U. Then there’s the optional Nvidia GeForce MX150 discrete graphics further bolstered by up to 16GB of DDR3 2,133MHz memory and up to a terabyte of PCIe NVMe SSD storage.",
    "Asus even managed to cram in a 50Whr battery that it claims is capable of providing up to 15 hours of use – a battery life rating we fully intend on verifying in our full review.",
    "The ZenBook S13 packs a ton of power on paper and we felt it during our short hands on time with the unit. The laptop felt incredibly snappy with some light web browsing and other tasks. We’ll have to see if the optional discrete graphics can really pull its weight with headier tasks like Photoshop and more in our full review.",
    "Asus has really spared no expense to make its most powerful and beautiful Ultrabook yet – and that’s exactly why we’re a little scared to ask how much it will cost. That said, it’s hard not admire the entire design of this laptop or how much hardware Asus managed to pack into its tiny frame. You basically can’t ask for a better looking or well-equipped, ultra-thin laptop than this and we like it a lot already."
  ],
  "headers": {
    "2": "Price and availability",
    "4": "Design",
    "10": "Performance",
    "13": "Early verdict"
  },
  "links": {
    "Razer Blade Stealth": "https://www.techradar.com/reviews/razer-blade-stealth-13",
    "Huawei MateBook 13": "https://www.techradar.com/news/huaweis-matebook-13-looks-to-one-up-apples-macbook-air-in-every-way?fbclid=IwAR0dPaMm8CGF0jqWCuiHXrWNPzKWvKa_I29XjNiSdD95wh_htt1Lg4KVoNc",
    "ZenBook S": "https://www.techradar.com/reviews/asus-zenbook-s",
    "Computex 2018": "https://www.techradar.com/news/computex-2018",
    "Lenovo Yoga C930": "https://www.techradar.com/reviews/lenovo-yoga-c930",
    "Huawei Matebook X Pro": "https://www.techradar.com/reviews/huawei-matebook-x-pro",
    "spared no expense": "https://www.youtube.com/watch?v=DqM0yZK__gI&t=12s"
  }
}