{
  "source": "https://www.techradar.com/reviews/hp-elitebook-x360-1040-g5-2-in-1-convertible-business-laptop",
  "title": "HP EliteBook x360 1040 G5 2-in-1 convertible business laptop review",
  "category": "computing",
  "updated": "2019-04-12T18:00:55Z",
  "author": "desire-athow",
  "summary": "One of the best business laptops on the market just got better",
  "verdict": "The EliteBook x360 1040 G5 is the apex predator of the business laptop world, a magnificent beast with a big punch, but also a bigger price tag (compared to its rivals). There’s a lot to like about it but the competition is ferocious out there, both in terms of features and sales pitches. Shop wisely.",
  "pros": [
    "Nifty design and stylus",
    "Great performance",
    "Blisteringly fast SSD",
    "Plenty of ports"
  ],
  "cons": [
    "Battery life disappointing",
    "Expensive",
    "Uneven anti-glare display",
    "Loud under load"
  ],
  "article": [
    "This is the first time that HP has introduced a truly top-of-the-range convertible business laptop in a 14-inch form factor. The x360 1040 G5 still carries the DNA of the EliteBook brand but has evolved into something that is decidedly different from the rest of the business laptops at the very high-end of the market.",
    "The HP EliteBook x360 1040 G5 is only available in one color – namely silver, which is what you naturally get from an aluminum chassis. That’s in stark contrast to the likes of Dell or Lenovo that tend to adopt more conservative anthracite colors. One might argue that HP merely rebadged the now-retired Spectre Pro x360 brand as it seeks to create a more coherent business range.",
    "This is a unibody design with the sort of refinements you’d expect when you shop in this price range (the review configuration is priced around $3,600, albeit heavily discounted right now – more on that later).",
    "You get a gorgeous satin finish, crisp well-defined lines, with the right balance of curves and delicately machined beveled edges. And the designers at HP have even managed to shrink this 14-inch powerhouse to the size of an average 13.3-inch laptop, down to 321 x 215 x 16.9mm – roughly the size of a third of an A4 paper ream, with a starting weight of 1.35kg.",
    "Despite this, the HP EliteBook x360 1040 G5 manages to squeeze in an impressive number of ports. There are two Thunderbolt 3 connectors, a full-size HDMI port, a 3.5mm audio connector and two USB 3.1 Gen 1 Type-A ports. There’s also a power button (on the left) and a volume rocker (on the right) but no card reader.",
    "The screen itself has a thick bezel along the top to accommodate the Full HD webcam and infrared camera for Windows Hello login, as well as a multi-array microphone (note that the webcam doesn’t come with a lens cover). There’s also a thick bezel at the bottom to take care of the connectors and components for the display.",
    "Underneath the laptop are two rubber strips that support it on a flat surface, with vents and holes to help with cooling the components inside. There are also two downward-firing speakers that complement another pair located on either side of the keyboard; all four are powered by Bang & Olufsen.",
    "EliteBook’s pedigree might not be as rich as the ThinkPad or the Latitude, but the design language in the x360 says otherwise. Certain design choices might be contested but there’s very little – if anything – that HP got truly wrong.",
    "The review sample provided came with the (former) top-of-the-range mobile processor available from Intel. The i7-8650U – launched in Q3 2017 – has been replaced by the 8565U which was released one year later. Curiously, the latter is not vPro compatible (which explains why it is not in the EliteBook and its rivals), has a slightly lower base frequency, but a much higher turbo clock speed.",
    "So you have a quad-core, 8th-generation CPU with a 15W TDP, manufactured using a 14nm process and paired with an integrated UHD Graphics 920 video subsystem.",
    "The HP EliteBook x360 1040 G5 supports up to 32GB DDR4-2666 memory in dual-channel configuration for improved performance. However, these are soldered which means that you can neither change nor add modules once you purchase the laptop. This is perhaps one of the biggest compromises one needs to make when going for thin-and-light laptops.",
    "You can configure the notebook to take an SSD up to 2TB in size. The spec sheet mentions self-encrypted drives as an option – great for enterprises – and Optane.",
    "The display on the EliteBook x360 1040 G5 is one of its strongest selling points, as it integrates HP’s Sure View privacy screen which can be enabled simply by pressing the F2 button. This makes it very difficult for other people around you to see what’s on your screen, but it reduces the brightness significantly as well.",
    "The 14-inch IPS Full HD display is covered by a layer of Corning Gorilla Glass 5 and has a matte finish, which isn’t a surprise given that you don’t want fingerprint smudges over your screen as a result of it being a touch display.",
    "Other titbits worth noting: HP provides a 65W USB Type-C monoblock power adapter with a changeable plug – there’s a 58WHr 4-cell non-removable battery inside, one of the biggest we’ve seen on an Ultrabook. Also, the HDMI port is v1.4 rather than v2.0, and there is no dock (hole/slot) for the Wacom active stylus pen – it does attach to the side magnetically, although that’s a compromise in our view.",
    "This laptop does come with NFC by default, and optional LTE connectivity, but no Bluetooth 5.0. There is a fingerprint sensor plus a TPM 2.0 embedded security chip.",
    "Speaking of security, the laptop is MIL-STD 810G certified and its backlit keyboard is spill-proof. This military certification means that the laptop has been through a number of resistance tests.",
    "One thing that you can expect from a business laptop is a hefty amount of security (in this case, HP’s Sure Start Gen4, SureRun, SureClick) and management software (JumpStart) bundled, some of which might be viewed as bloatware, when in fact all this provides a fundamental layer of applications that separates the established players from the rest of the market.",
    "Fortunately, there were only two HP applications loading at startup. One of them, Phonewise, allows you to send and receive texts as well as making and receiving calls directly from your PC. Pretty useful one might think, but unfortunately, HP has already confirmed it has ended support for this app, and that it may not be compatible with future Windows versions.",
    "The matte display – rated at 700 nits brightness – ensures that you can work in very brightly lit environments without too much glare. It is bound to divide opinions, though, as some of our peers described it as best-in-class, while others found it hazy.",
    "We side with the latter opinion – the chemical etching process does work wonders, but we couldn’t help but notice that the periphery of the area where our eyes were focusing tended to be fuzzier, grainier and dimmer than expected. You can always swap the panel for a glossy version, or indeed a 4K screen, although it doesn’t come with the Sure View option.",
    "Writing on the display – which is about the size of an A4 sheet of paper – was a thoroughly enjoyable experience, with the matte surface providing the right level of friction and granularity. The stylus supports 4,096 levels of pressure which means that it can faithfully mimic the physical interaction between pen and paper. The accompanying app offers some useful customization options, too.",
    "Typing on the keyboard – which HP renamed as the Premium Collaboration Keyboard – was close to perfection. The slightly bigger chassis means that the keys are reasonably spaced – there are dedicated page up/down keys as well as dedicated Skype/telephony and calendar keys. We liked the fact that the Shift keys are extra-long, and that, in general, the keys had excellent feedback, no perceptible wobble and a generous amount of travel.",
    "The third input peripheral – the touchpad – is made of glass and supports gestures by default. It’s neither too big nor too small, being just the right size at 110 x 64mm. Furthermore, the touchpad is as good (and smooth) as it gets despite not having dedicated physical buttons.",
    "The 15W Intel CPU is cooled by an active fan which gets loud under load – as loud as 62dB during our benchmarks, according to our portable sound meter located next to the air grill.",
    "Speaking of the tests, the laptop delivered some spectacular numbers despite sporting a power-constrained CPU (remember, its power envelope is only 15W). Doubtless it was helped by the increased number of cores (compared to the previous generation), dual-channel memory configuration (which provided more memory bandwidth) and a best-of-breed solid-state drive (courtesy of Samsung).",
    "The HP EliteBook x360 1040 G5 lasted a few minutes short of seven hours (6:53 to be precise) in our YouTube video test, playing a 10-hour count-up video on maximum brightness with maximum performance settings, disabling any power saving features and letting the laptop run until it switches off. You can try the test for yourself here. That’s less than the HP EliteBook x360 1030 G2 from 2017, and a far cry from the 17 hours of battery life that HP claims.",
    "As for the speakers on the laptop, they are very, very good; far better than we’d expect from a business laptop. The audio quality is full of body, punchy, and has plenty of character, regardless of whether you’re playing jazz music or action movies.",
    "At the time of writing, there’s an HP Days Sale running with the price of the cheapest model of this notebook (3SH44AV with an Intel i8250U) selling for only $1,766.05, a saving of $950.95 (or 35%). You could save another $150.80 by opting for FreeDOS 2.0 as the operating system (rather than Windows 10 Pro 64-bit), handy if you have an existing license or want to try Linux/Ubuntu.",
    "Other ways of reducing the price of the 1040 G5 include removing anti-glare and HP Sure View privacy, and a smaller 128GB SSD which brings the price down to just over $1,500. Our review configuration (3SH50AV) came in at $2,349.75, down from $3,615.",
    "Across the whole industry, only a handful of players can deliver the level of integration and aftersales support that professionals targeted by the EliteBook brand demand. Globally, only Lenovo, HP, Dell, Acer, Fujitsu and Dynabook (née Toshiba) can fulfill those demands.",
    "The Lenovo ThinkPad X1 Yoga (3rd Generation) is a formidable rival to the EliteBook x360 1040 G5. Both are convertibles but the Lenovo model has a few things in its favor, being more affordable, for starters – selling for just over $1,250 – with a bundled ThinkPad Pen Pro stylus. That’s around a third cheaper with a similar configuration, the sort of saving that could sway both a CIO and a CFO. Oh and it also has a privacy flap for the webcam.",
    "The 13.3-inch screen of the Dell Latitude 7390 is smaller than its rivals, and it has a price tag – after discounts – that pits it squarely against the Lenovo. The stylus is optional in this configuration and there’s only a 128GB non-OPAL SSD, too, but it has the biggest battery of the three (whether that translates into a longer battery life remains to be seen). Fun fact: Dell is currently offering a “buy one laptop, get a discounted Chromebook” deal with up to 40% discounts.",
    "Note that HP has a smaller version of the 1040 G5, aptly named the EliteBook x360 1030 G3, but it happens to be far more expensive than the 1040 while weighing about 100g less. It does include an active stylus, though.",
    "So what audience does the HP EliteBook x360 1040 G5 target? Professionals who want a business laptop with secure features and the ability to be used as a tablet, albeit a heavy one.",
    "Let’s look at the pros first. This is a good-looking laptop with bags of personality, plus the stylus works wonders, it’s impressive on the audio front, and the x360 is fast. There are also plenty of ports, and all this adds up to make for an excellent overall laptop.",
    "That said, there are some not-so-insignificant weaknesses. The battery life was lower than we’d expect, the laptop is noisy under load, and the display will divide opinions. Perhaps more importantly, it is far more expensive than comparable models from Dell and Lenovo, which will likely be a decisive factor for many businesses looking to swap an expensive laptop with plenty of character for one that makes the finance department happy."
  ],
  "headers": {
    "1": "Design",
    "8": "Specifications",
    "17": "Usage",
    "24": "Performance",
    "28": "The competition",
    "34": "The business take"
  },
  "links": {
    "You can try the test for yourself here": "https://www.youtube.com/watch?v=RgOy0qn2M0Y",
    "HP EliteBook x360 1030 G2": "https://www.techradar.com/reviews/hp-elitebook-x360-1030-g2",
    "3SH44AV with an Intel i8250U": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-7115975768956489000&p=https%3A%2F%2Fstore.hp.com%2Fus%2Fen%2FConfigureView%3FcatalogId%3D10051%26langId%3D-1%26storeId%3D10151%26urlLangId%3D%26catEntryId%3D3074457345619037818%26quantity%3D1",
    "Lenovo ThinkPad X1 Yoga": "https://www.techradar.com/reviews/lenovo-thinkpad-x1-yoga-3rd-gen",
    "Lenovo model": "https://lenovo.7eer.net/c/221109/218864/3808?subId1=trd-us-1235073972600690000&sharedId=trd-us&u=https%3A%2F%2Fwww.lenovo.com%2Fus%2Fen%2Flaptops%2Fthinkpad%2Fthinkpad-yoga%2FThinkPad-X1-Yoga-3rd-Gen%2Fp%2F22TP2TXX13Y",
    "Dell Latitude 7390": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1207865973436065300/https://www.dell.com/en-us/work/shop/dell-laptops-and-notebooks/latitude-7390-2-in-1/spd/latitude-13-7390-2-in-1-laptop/CTO27390132N1US?ref=p13n_system_cat_mv&c=us&cs=04&l=en&s=bsd",
    "EliteBook x360 1030 G3": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-5967897880048148000&p=https%3A%2F%2Fstore.hp.com%2Fus%2Fen%2FConfigureView%3FcatalogId%3D10051%26langId%3D-1%26storeId%3D10151%26urlLangId%3D%26catEntryId%3D3074457345618897819%26quantity%3D1"
  }
}