{
  "source": "https://www.techradar.com/reviews/honor-20-pro",
  "title": "Honor 20 Pro review",
  "category": "phones",
  "updated": "2019-07-30T11:28:10Z",
  "author": "tom-bedford",
  "summary": "Honor’s going all-in on the smartphone camera game",
  "verdict": "The Honor 20 Pro looks, feels and runs like a premium smartphone, but without the polish or the hype - and, most importantly, without the price tag. It's a slick and powerful mid-range smartphone that will give its competitors a run for their money.",
  "pros": [
    "Fantastic four-camera array",
    "Easy-to-use fingerprint sensor",
    "Large, vibrant display"
  ],
  "cons": [
    "No headphone jack",
    "Magic UI looks rather childish",
    "Punch-hole camera steals screen real estate"
  ],
  "article": [
    "Update: after Google suspended Huawei's future access to Android Play Store and security updates, there are serious question marks over the future of Huawei and Honor phones.",
    "While Google, Huawei and Honor have promised to support phones currently on the market, it's not clear how long they'll receive Android updates or access to the Google Play Store, which would severely curtail their usefulness compared to the competition.",
    "Honor phones typically take tech from Huawei’s latest handsets, water down the specs in a few non-critical areas, and sell for a lower price tag – but the Honor 20 Pro throws this precedent out the window with specs that appear to make it an even more appealing prospect than the high-end Huawei P30 Pro.",
    "Like the P30 Pro the Honor 20 Pro has no less than four rear cameras, as well as the latest Kirin 980 chipset – but it’s also shaking things up with new features like a ‘punch-hole’ front-facing camera rather than a notch, and side-mounted fingerprint sensor built into the power button.",
    "Update: Honor has finally announced the launch date and price of the Honor 20 Pro in the UK, so if you've read this review and are impressed by the handset's relatively low price and great performance (and also are based in the UK), you can finally pick up the handset.",
    "The price in particular is something to bear in mind, as it's a lot lower than that of the Huawei P30 Pro, yet isn't completely dissimilar in terms of specs – in short, if the P30 Pro is too expensive but you need that camera power, this is the device for you.",
    "In many ways, then, the Honor 20 Pro doesn’t feel like an affordable cousin to the Huawei P30 range, but rather a powerful and impressively specced smartphone beast in its own right – and with a price tag that sits below what you’d expect.",
    "But Honor must have cut some corners to put out a phone with such cutting-edge features at a low price; the question is, which corners – and will you notice?",
    "In the UK, the Honor 20 Pro costs £549.99 (around $670, AU$970) for 8GB RAM and 256GB storage. For a smartphone with as impressive specs and camera capabilities as these, that's a rather low price, and we were expecting it to cost a little more.",
    "In part, we've given the phone such a high score because it's providing many features of high-end phones, like a powerful chipset or four-camera rear array, at a price that makes it accessible to the everyday buyer.",
    "Huawei smartphones (including Honor, a subsidiary of Huawei) are currently not available through US carriers or major retailers, though it's still possible to buy them. This usually means a higher cost or relying on an unverified online retailers, and software may not be optimized for US networks.",
    "Huawei's other products, including laptops and tablets, are readily available in the US, and the firm is working to obtain clearance to market its phones, so we could see this handset officially launch in America in the future.",
    "That price tag is comfortably below the Huawei P30’s £699 / AU$1,099 (roughly $910) launch price, but a reasonable amount above the Honor 20 which costs £400 (roughly $490, AU$700).",
    "You can pick up the smartphone from August 1 in the UK, which was quite a while after Honor launched it, and even a few months after the Honor 20 released in May.",
    "On the surface, the Honor 20 Pro doesn’t look particularly different from any standard Android phone – but looks can be deceiving, and there are some quirks to the Honor 20 Pro’s design.",
    "The handset isn’t quite plus-sized, but it’s still large – with a body of roughly 154mm x 74mm x 9mm, some users may have trouble reaching the top of the screen, but it’s not exactly a burden to carry about.",
    "The Honor 20 Pro display is something we’ll get into later, but while the phone has an impressive 91.6% screen-to-body ratio, there’s still just enough bezel to house a speaker and notification light right at the top.",
    "On the right side of the handset you’ll find one of the Honor 20 Pro’s most useful features: the power button and fingerprint sensor are one and the same, so by the time you’ve picked up your phone and pressed the power button you’re in.",
    "An indent makes this button easy to find without looking, and it’s a snappy system, so we found ourselves unlocking and able to use the phone much more quickly with this side-mounted sensor than with the now-common in-screen scanner. The button’s also at the perfect height to make it natural to use for most hands.",
    "The volume rocker sits above the power button, and there’s a USB-C port on the bottom of the phone – sadly there’s no headphone jack, which was something the Honor View 20 did have, and it seems like a curious omission given that this is an affordable phone aimed at a younger audience.",
    "On the back of the handset is its quad-camera setup – this makes for quite a prominent bulge, and the phone won’t sit flat on a surface because of it, but that’s arguably a small a price to pay for all the tech within.",
    "The Honor 20 Pro is available in two colors – a purple shade and a green, both of which use, in the words of Honor, ‘Triple 3D Mesh’ and curved glass to create a bright, reflective pattern on the back. It’s certainly a more refined design than the Honor View 20, which was a little on the garish side, but the Honor 20 Pro is perhaps a little less eye-catching as a result.",
    "Still, it’s a good-looking phone, with a nice balance between functionality and slick design.",
    "One compromise you’re going to have to accept with this handset is the display, because the Honor 20 Pro screen is perhaps a little bit of a downgrade compared with competing devices.",
    "The 6.26-inch screen uses LCD Full HD+ tech, which isn’t quite as good as the OLED of the Huawei P30 phones, so perhaps won’t display colors quite as well, although it has a great brightness range, and holds up well when viewed in direct sunlight.",
    "Honor 20 Pro competitors like the Google Pixel 3a or OnePlus 6 do have better screens, with OLED and AMOLED displays respectively, so you’re not getting top-end specs here, and the screen quality is one of the main trade-offs for the low price.",
    "There’s no notch intruding on the Honor 20 Pro’s screen; instead Honor has decided to go for a ‘punch-hole’ camera which means the lens is cut out of the display – the Honor View 20 and Samsung Galaxy S10 have similar arrangements.",
    "Honor claims this is the smallest punch-hole camera on the market, at only 4.5mm, but between the hole in the screen and the edge of the display is a fair amount of real estate that isn’t used, so in effect the screen space lost is around the same amount as would be lost to a notch.",
    "This isn’t a huge issue, and having the ‘lost’ space in the corner of the display keeps it out of sight, out of mind. In general the screen is fine for everyday use, and you’ll only notice the lesser display when you directly compare it to a high-end phone.",
    "Image credits: TechRadar"
  ],
  "headers": {
    "8": "Honor 20 Pro price and release date",
    "14": "Design",
    "23": "Display"
  },
  "links": {
    "Google suspended Huawei's future access to Android Play Store": "https://www.techradar.com/news/huawei-ban",
    "Huawei P30 Pro": "https://www.techradar.com/reviews/huawei-p30-pro",
    "Huawei P30": "https://www.techradar.com/reviews/huawei-p30-review",
    "Honor 20": "https://www.techradar.com/reviews/honor-20-review",
    "Honor View 20": "https://www.techradar.com/reviews/honor-view-20-review",
    "Google Pixel 3a": "https://www.techradar.com/reviews/google-pixel-3a-review",
    "OnePlus 6": "https://www.techradar.com/reviews/oneplus-6",
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10"
  }
}