{
  "source": "https://www.techradar.com/reviews/bitdefender-box-2",
  "title": "Bitdefender Box 2 review",
  "category": "computing",
  "updated": "2021-11-19T02:57:57.995Z",
  "author": "mike-williams",
  "summary": "A smart firewall for the connected home",
  "verdict": "Setup can be complex, but once it's running this little box will keep you safe at home, and Bitdefender's quality software protects you everywhere else.",
  "pros": [
    "Lots of features",
    "All managed from one app",
    "Built-in parental controls",
    "Bundled Bitdefender software"
  ],
  "cons": [
    "Setup can be tricky",
    "Can only be managed by a mobile app",
    "Connectivity limited to 1x LAN, 1x WAN port"
  ],
  "article": [
    "Update: Bitdefender Box 2 is now available to buy in the UK for £179 – a price that includes Bitdefender Total Security. There's an annual subscription fee of £89 after the first year.",
    "Bitdefender Box 2 is a smart home security appliance which shields desktop PCs, laptops, mobiles, tablets and all your connected devices from hackers, malware and more.",
    "The Box is essentially a supercharged router which can replace or run alongside your existing networking kit. Connect your devices to the Boc and it acts as a firewall, watching inbound connections to keep hackers at bay. Your network is constantly monitored for unknown devices or suspect behavior, and Box also blocks outgoing requests to known malicious websites.",
    "Box is powered by a capable dual-core 1.2GHz version of ARM's popular Cortex A9 CPU, with 1GB DDR3 RAM and 4GB of internal storage.",
    "Wi-Fi duties are handled by an 802.11a/b/g/n/ac AC1900 setup. You get just two ports – one LAN, one WAN – both supporting Gigabit Ethernet. F-Secure's SENSE router goes further with three LAN ports and even Bluetooth support, but there's enough power here for most users, especially if you'll just be plugging Box into an existing ISP router.",
    "Extras? There's a 1m Ethernet cable bundled with the BOX, but that's about it.",
    "The Box was first released more than a year ago in a US-only form, but now it's also available in more internationally-friendly forms. Our review unit comes with a three-pin plug ready for use in the UK, and even if that doesn't help you directly, support for 100-240V input means you can use it almost anywhere via a travel adapter.",
    "Bitdefender Box costs £179 ($199) for year one, which gets you the router and a subscription to Bitdefender Total Security, or the equivalent for your device (Bitdefender Antivirus for Mac, Bitdefender Mobile Security for iOS or Bitdefender Mobile Security for Android).",
    "After the first year, an annual £89 ($99) gets you all the core Box features, but still includes Bitdefender Total Security for an unlimited number of devices, worth at least £79.99 ($104) all on its own.",
    "This is a reasonable price, and broadly comparable with the main competition. For example, F-Secure SENSE charges less for the hardware at £85 ($111), but protecting ten devices costs a chunky £140 ($182) a year, giving you a similar £225 ($294) for year one and a more expensive £140 ($182) per year afterwards.",
    "Bitdefender Box arrives in a well-designed and very protective, umm, box. Lift the cardboard sleeve, open a surprisingly solid lid, and everything is neatly tucked away inside. It's the kind of premium packaging you'd expect for a luxury designer product rather than a piece of network kit.",
    "The router inside is a very simple design, a minimalist cream and black triangular block with a power connection and a couple of Ethernet ports. It looks good, and should blend nicely into the background in most homes.",
    "Networking newbies will probably be intimidated by the lengthy instructions on the setup card, and it can take some thought to work your way through the process.",
    "The process starts by downloading Bitdefender Central's app for iOS or Android (for some reason, there's still no desktop-based alternative). This is normally used to manage any existing Bitdefender installations you might have, but the app also provides a Box activation wizard.",
    "Setup starts by asking you to log in to the Box network on your phone, then connect your device to the internet, typically by plugging it into your standard router with the cable provided.",
    "The app offers a choice of networking modes. Box can effectively replace an ISP router, work with an existing personal router by enabling bridge/AP mode, or be used as a standalone router.",
    "We chose the ISP Router option. The app asked for our ISP router's login credentials so that it could clone our default settings.",
    "The last step requires disabling your original wireless network to ensure any devices reconnect to the Box. The app includes instructions to work with several common router types, our UK IS's model wasn't on the list.",
    "This won't be a major issue for experienced users, as they should be able to turn wifi off from their router settings page. If that doesn't work, or you're unsure how to do it, Bitdefender offers free installation assistance via telephone and email.",
    "We've always found Bitdefender support to be speedy and helpful, but if even this fails, you could just set up Bitdefender Box as a new wireless network with its own name. You'll then have to update all your devices to connect to the Box network, but once that's sorted, you'll be ready to go.",
    "With setup complete, you can use the Box in its basic form without doing anything else at all. Restart each of your devices, and they should connect to the Box and the internet exactly as they did with the old router.",
    "Even at this level, there's plenty happening in the background. Box is monitoring outgoing connections, blocking attempts by your devices to access phishing and other malicious sites, and also preventing the sending of sensitive information like credit card details over an unencrypted connection.",
    "Box also watches for dubious incoming connections, and prevents any brute-force attempts to log in to your devices.",
    "More general network monitoring layers detect and alert you to network vulnerabilities, as well as picking up unusual behavior which might indicate a hacked device.",
    "Evaluating these features in-depth is difficult. What signs might a smart TV display to indicate that it's been hacked, for instance, and which of those would you expect Bitdefender Box to detect? We really don't know.",
    "Testing the core technologies is more straightforward, though, and here Bitdefender Box performed well.",
    "The system correctly prevented our test MacBook from accessing multiple dangerous websites, for instance. The warning message explained that it was coming from BOX, and that we could add the URL to a whitelist if it was flagged in error (Bitdefender's URL filtering is better than most, so this shouldn't happen often).",
    "We also found that Box was an effective firewall for our network, preventing simple incoming attacks, and its data protection feature didn't allow us to submit passwords over an insecure (HTTP) connection. A standard router does much the same, and your browser will probably warn you about insecure websites, anyway, but it was good to see that Box was working as advertised.",
    "Your Box is managed from the Bitdefender Central app. This opens with a view of your network status, usually captioned with a reassuring 'Your home is safe' message, and details of devices currently connected to your network.",
    "A Notifications panel provides useful information on recent events, including new device connections, blocked attempts to access malicious URLs, and any incoming network attacks that Box has deflected.",
    "An Install Protection button prompts you for the email address of the device owner, and sends them a message with a link to download and install local Bitdefender software (Windows, Mac, iOS and Android devices are covered). Your subscription covers as many devices as you need.",
    "Box comes with simple parental controls which can block websites by content or restrict internet access by time of day. The ability to block a specific device's internet access on demand could also be handy for those ad hoc ‘stop what you're doing and come here right now’ situations. There's nothing surprising or revolutionary here, but the features are still a worthwhile addition to the package.",
    "A Settings panel includes some small but welcome extras. You're able to create a secure and isolated network for guest devices, for instance, so visitors can use this to connect to the internet, without having access to your main network. And amongst the low-level network settings (set your network name, password, custom LAN address), you're able to add your preferred DNS servers to be used for all connected devices.",
    "We completed our checks by running simple performance tests, including streaming HD video content from three devices simultaneously. As we'd expect from the level of hardware used by Bitdefender Box, there were no issues and our systems worked much as they did with the original ISP router.",
    "Bitdefender Box can take some time, thought and experience to set up properly. But there's a free installation service to help point you in the right direction, and once you're up and running the Box does an excellent job of protecting you from a host of security threats."
  ],
  "headers": {
    "10": "Setup",
    "20": "Features",
    "34": "Final verdict"
  },
  "links": {
    "Bitdefender Box 2": "https://bitdefender.evyy.net/c/221109/278689/4466?subId1=trd-us-1214189243579305700&sharedId=trd-us&u=https%3A%2F%2Fwww.bitdefender.com%2Fbox%2F",
    "Bitdefender Total Security": "https://www.techradar.com/reviews/bitdefender-antivirus",
    "F-Secure SENSE": "https://www.techradar.com/reviews/f-secure-sense-router"
  }
}