{
  "source": "https://www.techradar.com/reviews/wd-upthere",
  "title": "WD Upthere cloud storage review",
  "category": "computing",
  "updated": "2020-08-28T15:09:25Z",
  "author": "mark-pickavance",
  "summary": "The minimalist approach to cloud storage",
  "verdict": "Since Western Digital acquired Upthere in 2017, it has made changes, but failed to improve the dire user experience. The web app is the only access point on a computer, and it sports an oddly idiosyncratic interface and limited feature set.",
  "pros": [
    "20GB for free",
    "Security is decent"
  ],
  "cons": [
    "No desktop apps",
    "No virtual drive connections",
    "No sync tools"
  ],
  "article": [
    "Note: As September 2019, Western Digital has closed down its Upthere cloud storage solution and SanDisk Cloud Services.",
    "of Western Digital bought Upthere in August of 2017 for an undisclosed sum, after having sunk $77m into the business alongside KPCB.",
    "They said at the time, \"Upthere is delivering on its mission to transform the personal storage market and we share their focus on providing consumers more rich and meaningful experiences with their data,\"",
    "Based on this review, you might wonder how those words have been translated into actions in the current version of WD Upthere.",
    "It’s difficult to know where to start with Upthere, mostly because it’s a product that looks to be under siege from the owners, like an unloved toy in the hands of an especially aggressive two-year-old.",
    "We’ll talk about that scenario later, in the meanwhile what does Upthere do, and is it any good?",
    "The approach of Upthere is an interesting one that primarily organised around the concept of sharing over any other imperative.",
    "It does this through ‘Loops’ that can either be personal or for wider consumption. Let’s imagine you go on a holiday with a group of friends and you want all the images and videos to be accessible to all. A Loop is everyone can sync their phone captures to that space, allowing everyone to see everything, and also edit anything.",
    "You can achieve much the same thing from a computer through the Upthere web interface. It allows you to upload contents and then associate it with a Loop, although its much harder work than the mobile apps, and has a very peculiar interface that doesn’t allow the selection of multiple files.",
    "The gallery organisation of content also suggests that this product was never meant to manage very large numbers of files or loops, should you end up with thousands of images or music tracks on it.",
    "If you’re wondering about desktop apps that might bind the storage to a drive letter or sync important folders to the cloud, then you are out of luck with Upthere.",
    "Only Android and iOS mobile devices have access apps, where you can interact directly with the cloud storage, and there is no third-party support for other apps to do this or an API available to build your own.",
    "Oddly, at one point this product had apps on both the Apple Mac and Windows PC, both called ‘Upthere Home’. From what we understand these provided much the same functionality as the web interface and not the typical desktop apps that other cloud services provide.",
    "As limited as they were Western Digital didn’t just stop developing these tools. Six months after the takeover they disabled them accessing the system forever more!",
    "The words ‘commercial suicide’ seems to best sum up this course of action. Why any company would spend millions of dollars to buy a company, and then set about undermining it in this fashion is beyond our comprehension.",
    "Surely, they needed to expand this functionality with a desktop virtual drive and sync tool?",
    "What’s exceptionally poor is that for Windows 10 users the Upthere Home app is still available on the Microsoft Store, where you can download and install it. Those that do that will then be told to upgrade to latest version, not that there will ever be another one.",
    "That nobody at this company could spend the five minutes to remove it is indicative of where Upthere is currently. A place that isn’t anywhere a cloud storage solution would choose to be.",
    "Currently, the only tool they have for Windows and macOS is one called the Upthere Parachute, designed to pull everything off the system and bring it back to a computer.",
    "The continued maintenance of that tool strongly hints that sometime soon Western Digital aims to pull the life-support from Upthere, and those using it will need the only useful app it has to extract all their data to a safe place.",
    "Given all the numerous other failings of Upthere we were pleasantly surprised that the security side of this product is well-considered.",
    "When you sign up, you can use Google or Facebook to get onboard, tying the account to the security of those products. Once an account has been created, you can add, and you are advised to, activate two-factor authentication, using either an SMS message or authentication app.",
    "Upthere thoughtfully provides a single backup code that you can copy away, should you misplace the device that you use the service with.",
    "The Upthere datacentre is located on US territory, and reputedly has 24/7 physical security along with substantial redundancy systems for power outages and network provider issues.",
    "There are no options like allowing users to control their own encryption keys, but based on what they are offering, we’d of been shocked if they had included options like that.",
    "The pricing plan is remarkably simple and starts with them giving you 20GB absolutely for free.",
    "If by some quirk of fate you find that you’ve used up that amount you can have extra 100GB chunks of capacity for $1.99 per month, and you can add as many of those as you like.",
    "That would make 1TB of space $19.90, which isn’t the cheapest way to get that capacity, although you can increment it as your needs grow and you can cancel at any time.",
    "Irrespective of how cheap this service is, relatively, the lack of basic functionality is a real issue.",
    "Without desktop access and sync, there isn’t any use for this outside being an esoteric mobile platform that’s competing with Google and Apple and their operating system-centric services.",
    "We suspect that most users will take the free 20GB and use it for some minor project and leave all their critical files on a service that syncs to their computer.",
    "At this time this isn’t a serious business offering, and we’d be surprised if it ever transforms into one under the current strategic direction.",
    "It’s fine to share a few images with friends on a break, but the same niche is well covered by the likes of Google, Microsoft and Dropbox, but with much greater flexibility about how you interact with the storage on other platforms."
  ],
  "headers": {
    "4": "Features",
    "20": "Security",
    "25": "Pricing",
    "29": "Final verdict"
  },
  "links": {
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Upthere": "https://upthere.com/",
    "pricing plan": "https://upthere.com/pricing",
    "$1.99 per month": "https://upthere.com/pricing"
  }
}