{
  "source": "https://www.techradar.com/reviews/toshiba-canvio-4tb-external-hard-disk-drive-2019-edition",
  "title": "Toshiba Canvio 4TB external hard disk drive (2019 edition) review",
  "category": "computing",
  "updated": "2019-01-15T19:00:40Z",
  "author": "desire-athow",
  "summary": "Is there any innovation left in the external hard drive market? Probably not…",
  "verdict": "Toshiba’s Canvio 4TB external hard drive isn’t an intrinsically bad product, but the competition is so much better in this price range that it’s difficult to recommend this drive.",
  "pros": [
    "Minimalist design",
    "Slightly better than average performance"
  ],
  "cons": [
    "On the expensive side",
    "No bundled software",
    "No USB Type-C connector"
  ],
  "article": [
    "Much of this review might invoke some sense of déjà vu, because the external hard disk drive we’re reviewing today looks very similar to the Canvio hard drives that we’ve reviewed over the past few years (the 2015 Canvio, the 2014 one, the 2013 edition and the 2018 model).",
    "The DTB440 (otherwise known as the Canvio Basics 4TB or the HDTB440XK3CA) is part of the 2019 range launched by Toshiba. It is a traditional 2.5-inch external hard disk drive that comes with a USB 3.0 connector and a matte plastic enclosure. This is a no-frills model with a one-year warranty, no software and no password protection.",
    "Other members of the Canvio family include the Canvio Ready, the Canvio Premium (with an aluminum chassis, three-year warranty and a Type-C connector), the Canvio Advance (with a two-year warranty) and the Canvio for desktop that uses a 3.5-inch hard drive.",
    "Not much has changed over the years: the design of Toshiba’s Canvio Basics range remains relatively minimalist. It still uses a flat USB Micro-B connector, an anthracite finish, and a blue status light tucked away in a corner.",
    "There are no rubber feet here to prevent it from slipping, and other than a removable sticker on its belly, this is a pretty standard external hard disk drive. You get a short 50cm USB cable plus a quick start guide, and at 109 x 78 x 19.5mm with a weight of 218g, this drive is small enough to be slipped in a rucksack for the likes of business trips.",
    "The drive is available in 1TB, 2TB and 4TB models from Toshiba (one of the three remaining hard disk drive vendors worldwide). The 4TB model we reviewed is built around an unknown 2.5-inch HDD model that uses four 1TB platters and is likely to be a yet-to-be-announced 15mm drive, the MQ04UBB400, which explains the slight increase in thickness compared to its predecessors.",
    "There are no surprises in that this is a SATA 3 drive with a 5400RPM spinning speed and possibly as little as 16MB cache (based on the existing specialty storage products sold by Toshiba).",
    "The market hasn’t evolved significantly over the past four years, since the first 2.5-inch 4TB hard drive was launched. In other words, the current crop of 4TB hard drives are no different from the ones that came out in 2015. They might be a bit faster and consume a bit less power, but all in all, users won’t notice that much of a difference.",
    "Even so, the performance of the drive was quite decent for a spinning hard disk. It scored between 145 and 158MBps on CrystalDiskMark 6.0 and Atto (read and write speeds) with slightly lower numbers recorded on AS SSD. A 10GB file took a whole 80 seconds to be transferred, which is better than we’d expect.",
    "The Canvio Basics 4TB sells for $110 (around £85) at Amazon, only $5 less than the Canvio Advance. On the other hand, both are significantly more expensive than the Seagate Expansion 4TB model – at $90 (around £70) – or the WD My Passport which costs $95 (around £74). The latter comes with built-in 256-bit AES hardware encryption plus WD Security software and WD Backup software for free.",
    "To make matters even worse, you can get a 5TB external hard disk drive (the Seagate Backup Plus) for a few cents cheaper at $109.91 (around £85), with a choice of four colors, Seagate’s backup software, and a two-month free subscription to Adobe Creative Cloud.",
    "The Canvio Basics lacks the Toshiba Storage Security and Toshiba Storage Backup software, but you can get either for free elsewhere (visit our best free antivirus software and best free backup software roundups to find out more).",
    "We’d love to have seen Toshiba use a USB Type-C connector here, but every cent counts at the lower-end of the market, plus the newer interface acts as a selling point to entice users to the firm’s premium products.",
    "The bottom line, though, is that the Canvio Basics is far more expensive than the existing competition, and suffers from a common bugbear with newly launched products – they often carry much higher prices. It is not a fundamentally flawed product but it is priced far too high to make an impact on the market.",
    "There is not much life beyond 4TB with only one vendor (Seagate) exhibiting any sort of interest in bigger capacities. So it seems that it’s only a matter of time before solid-state drives, which have already reached the 1TB for $100 barrier, catch up with 2.5-inch external hard disk drives, making them obsolete in the medium-term."
  ],
  "headers": {
    "3": "Design",
    "5": "Hardware",
    "7": "Performance",
    "9": "Competition",
    "11": "Final verdict"
  },
  "links": {
    "the 2015 Canvio": "https://www.techradar.com/reviews/pc-mac/pc-components/storage/disk-drives-hdd-ssd/toshiba-3tb-canvio-external-hard-drive-1296244/review",
    "the 2014 one": "https://www.techradar.com/reviews/pc-mac/pc-components/storage/toshiba-2tb-canvio-usb-3-0-external-hard-drive-1261238/review",
    "the 2013 edition": "https://www.techradar.com/reviews/pc-mac/pc-components/storage/disk-drives-hdd-ssd/toshiba-stor-e-canvio-1-5tb-1174962/review",
    "the 2018 model": "https://www.techradar.com/reviews/toshiba-canvio-advance-2tb",
    "$110": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FToshiba-Canvio-Portable-External-HDTB440XK3CA%2Fdp%2FB07KQPKJXH%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1039751862719250800-20",
    "Canvio Advance": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07KQXRJPF%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8751152180636959000-20",
    "Seagate Expansion 4TB": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSeagate-Expansion-Portable-External-STEA4000400%2Fdp%2FB017KE8OG0%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1032548794753913000-20",
    "WD My Passport": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FBlack-Passport-Portable-External-Drive%2Fdp%2FB01LQQH86A%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1253930205727309800-20",
    "Adobe Creative Cloud": "https://www.techradar.com/reviews/adobe-creative-cloud",
    "best free antivirus software": "https://www.techradar.com/best/best-antivirus#best-free-antivirus-downloads",
    "best free backup software": "https://www.techradar.com/best/best-free-backup-software"
  }
}