{
  "source": "https://www.techradar.com/reviews/sony-srs-xb501g-portable-wireless-speaker",
  "title": "Sony SRS-XB501G Portable Wireless Speaker review",
  "category": "audio-visual",
  "updated": "2019-03-28T22:46:04Z",
  "author": "lewis-leong",
  "summary": "The ultimate party speaker with Google Assistant built right in",
  "verdict": "The Sony SRS-XB501G is a party speaker that you can use both inside the house and pool-side. The speaker gets loud, sounds spacious, and lasts all day, which makes it great for using on the go. Once at home, you can plug it in, use it as a networked speaker and control it via Google Assistant. It does the former better than the latter, but overall it's a fine companion in either situation.",
  "pros": [
    "Powerful, spacious sound",
    "Good battery life",
    "Physical buttons for controls"
  ],
  "cons": [
    "Subpar app experience",
    "Average voice detection"
  ],
  "article": [
    "There are ton of great Bluetooth speakers on the market today and as a result, companies are increasingly finding niche parts of the market to fill.",
    "One of those niche markets is the party speaker and it’s users are looking for a speaker that can play loudly without distortion, last all day, and stand up to dust and water. This is exactly the niche that Sony’s SRS-XB501G fills but with one more trick up its sleeve in the form of Google Assistant.",
    "To that end, the SRS-XB501G is a big speaker that offers a light show, tripod mount, big sound, and Google Assistant. This is a speaker that you can truly use on the go and in the home after a day of partying. On the go, the speaker is brilliant, playing loudly and for up to 16 hours. But at home, it’s dated design and average voice detection are compromises compared to dedicated home speakers.",
    "At 6 lbs (2.72kg), there’s no getting around the fact that the Sony SRS-XB501G is a big, heavy speaker. You'll feel it the moment you take it out of the box. But thankfully Sony saw the issue ahead of time and added a handy carrying handle to make lugging it around a bit easier.",
    "The frame looks like a large rounded rock and you can see the two tweeters and one woofer through the grille. We think its exterior poses a striking similarity to a speaker from a boombox and is a stark difference from the trend of cloth and wood covered speakers that are en vogue today.",
    "It’s nice to see that all major features can be controlled via the physical buttons without the need for a finicky app... however, the speaker does require you to download two apps if you want to use its smart functionality: both the Google Home app to set up the voice assistant in addition to Sony’s Music Center app.",
    "Google Home is self-explanatory but Sony's Music Center app allows you to tweak the light show and access to sound tweaks like Extra Bass, though unfortunately, the app is very bare-bones and difficult to navigate.",
    "Round the back is a waterproof flap that hides the speaker’s USB-C port and barrel plug for charging. The speaker change charge via either the USB-C port or with the included barrel plug. If you don’t have a Power Delivery USB-C, you’ll want to stick with the included charger. Unfortunately, there’s no 3.5mm aux jack to use with your legacy devices.",
    "If you're planning on using this wirelessly, the Sony SRS-XB501G supports Bluetooth 4.2 and Google Cast.",
    "We’ve tested other speakers in Sony's Extra Bass lineup like the Sony SRS-XB40 in the past and weren’t impressed by their bloated bass response. Thankfully, the SRS-XB501G offers nice balance and can play loudly without distortion.",
    "While we preferred the speaker in the “Live” mode, which helps with making music sound much wider, there’s an included Extra Bass option in the app which does exactly as it describes, but we found the tonal balance too warm and the bass too loose. There’s also the option to create your own custom EQ, however we recommend you leave it in Live mode and call it a day.",
    "One quirk about the SRS-XB501G is the fact that its lightshow doesn’t react to the music. Instead, you have the option to choose different “moods” like “Chill,” “Hot,” or “Rave,” which simply change the color and cadence of pulsing.",
    "This is a big disappointment because the light show is vastly less interesting to watch without reacting to the music. Adding to that, the lights also simply fill the perimeter and highlight the woofer rather than encompass the entire speaker. Other party speakers do a much better job of integrating with the music and showing off the design.",
    "As a Google Assistant speaker, the XB501G is simply average. With music play loudly, you’ll have to shout at the speaker for it to hear you. If you're looking for a point of comparison, we put the voice detection on par with the JBL Link 300. Average voice detection aside, the speaker works just like every other Google Home speaker.",
    "On the go, battery life is rated at 16-hours (12-hours with Extra Bass and lighting enabled) and we had no problem hitting that number playing at medium volume. That said, if you plan on using this outside at your next soiree, expect to cut a few hours off the play-time if you like playing your music loudly. Charging takes several hours so make sure to charge the night before taking the speaker on the go.",
    "The Sony SRS-XB501G is an interesting product - and one that bridges the gap between a party and home speaker. On the go, it’s a good speaker that offers spacious, balanced sound, good battery life, and IP65 water resistance. However, its average voice detection and dated styling make it seem out of place inside the home.",
    "Competitors like the LG PK7 sounds slightly better and has a light show that actually reacts to your music, however it doesn’t have the Google Assistant built in. If you’re looking for an actual portable speaker that you can fit in a bag that also supports Google Assistant, the JBL Link 20 is a good choice. Just don’t expect it to pump out as much bass or offer as wide of a soundstage.",
    "To that end, the XB501G is a good all-around compromise that fills multiple purposes. It's not the best wireless speaker, nor the best smart speaker, but it's a solid entry in both categories and one of a select few to exist in both camps."
  ],
  "headers": {
    "3": "Design",
    "9": "Performance",
    "15": "Verdict"
  },
  "links": {
    "Sony SRS-XB40": "https://www.techradar.com/reviews/sony-srs-xb40-bluetooth-speaker",
    "JBL Link 300": "https://www.techradar.com/reviews/jbl-link-300-smart-speaker",
    "LG PK7": "https://www.techradar.com/reviews/lg-pk7-portable-bluetooth-speaker",
    "JBL Link 20": "https://www.techradar.com/reviews/jbl-link-20-google-assistant-smart-speaker",
    "best wireless speaker": "https://www.techradar.com/news/best-speaker",
    "best smart speaker": "https://www.techradar.com/news/best-smart-speakers"
  }
}