{
  "source": "https://www.techradar.com/reviews/arlo-pro-3",
  "title": "Arlo Pro 3 review",
  "category": "appliances",
  "updated": "2019-11-05T14:35:52Z",
  "author": "christian-de-looper",
  "summary": "The Arlo Pro 3 is almost the best security camera on the market, with one major flaw",
  "verdict": "The Arlo Pro 3 doesn't offer a 4K resolution - but you will get plenty of other great features that make this security camera a super solid choice for those who don’t need the best of the best.",
  "pros": [
    "Good image quality...",
    "Stylish design",
    "Easy to use and setup",
    "Lots of features"
  ],
  "cons": [
    "...but not the highest resolution",
    "Limited security without subscription"
  ],
  "article": [
    "With a classy weatherproof design, a host of awesome smart home features, the Arlo Pro 2 quickly rose as one of the best security cameras out there.",
    "Now, however, there’s a new boss in town in the 2K, HDR-compatible Arlo Pro 3, a successor to the Arlo Pro 2 with a number of refinements and improvements.",
    "The Arlo Pro 3 is aimed at improving on the Arlo Pro 2, but not stepping on the toes of the 4K-capable Arlo Ultra. As such, you won’t get a 4K resolution here - but you will get plenty of other great features that make this camera a super solid choice for those who don’t need the best of the best.",
    "The Arlo Pro 3 is available to buy for $199.99 / £279.99 (around AU$295) for just one single camera or $499.99 / £549.99 (around AU$740) for two cameras and the requisite Arlo Hub.",
    "If you’ve ever seen other Arlo security cameras before (or really any smart camera in general), you’ll immediately recognize the Arlo Pro 3: it's almost identical to the Arlo Ultra in design, with a black face and a white exterior apart from that face.",
    "On the front of the cameras, you’ll get the lens itself, along with the “spotlight” above it. On the bottom, there are charging pins and a button to open the device up - which is how you’ll remove and insert the battery. On the back, there’s a screw mount.",
    "The base station, called the SmartHub, is pretty much identically-designed too. It’s almost all white, and has an ethernet port, USB port for local storage, and power input, and should look right at home next to your router. Of course, having an extra hub is a bit of a pain, especially if you’re like me and have to deal with a number of hubs for different smart home systems, like Philips Hue and Samsung SmartThings.",
    "That said, it’s to be expected at this point, and the advantages of having a hub instead of having the cameras connect directly to Wi-Fi make it worth the frustration.",
    "One thing to note is the fact that you cannot buy a starter kit with the SmartHub and one camera. That means that you’re going to have to shell out for a pack with two cameras, which can get a little pricey.",
    "Setting up the Arlo Pro 3 is very easy... when it works. (It didn’t work the first time for us.) The Arlo app will walk you through the process, which includes connecting your router to the base station and then connecting your cameras. The instructions are very simple, though the base station failed to connect for us, and we had to power it down and try again. The second time, however, it worked like a charm.",
    "Once you set up the cameras, you’ll be able to tweak some settings within the app. For example, you may want to set the SmartHub mode to “geofencing” if you’re using the cameras indoors, as that ensures they’ll turn off automatically when you’re at home. You may also want to set up motion zones, which ensures the cameras track motion inside those zones and ignore it in other zones.",
    "If you have the camera set up outside, you may want it to track motion in front of your door, but ignore the public path that goes by your house, for example, which will prevent you getting dozens of notifications every day.",
    "Installing the actual camera is easy too. In the box, there are two cameras for the basic starter kit, and one type of each base -- including one magnetic base and one screw-mountable base. If you want to use both cameras with the same kind of base, you’ll have to buy them separately.",
    "Once everything is set up, the cameras work great - and they look pretty good too. If you set everything up properly, you won’t have to pay much attention to the cameras unless something actually happens and you need to review the footage.",
    "As mentioned, the Arlo Pro 3 does not have a 4K resolution like the more expensive Arlo Ultra - but the quality is still a pretty impressive 2K. You’ll get a 160-degree field-of-view, and as expected in 2019, the cameras have night vision and two-way audio. There are other smart features too, like automatic zooming and motion tracking, which should help ensure the camera picks things up when it needs to. The camera can zoom up to 12x, and offers HDR support as well.",
    "The end result is pretty much what you would expect: The Arlo Pro 3 looks better than the 1,080p Arlo Pro 2, but not quite as good as the 4K Arlo Ultra. No surprises there.",
    "The field-of-view is good, though not as high as the Arlo Ultra - and we never felt like we were missing a lot with the slightly narrower field-of-view. Colors looked pretty good during the day, and thanks to the HDR support, the camera avoids over-exposure. The color night vision is pretty good too, and certainly better than non-color offerings by competitors. Don’t expect the same quality of footage as during the day, but do expect a step up in night footage over your previous security camera.",
    "There are a few features that have bled over from the Ultra: For example, the Pro 3 has the same noise-canceling two-way audio, which makes it easier to hear what’s going on. There’s also a built-in siren.",
    "The Arlo Pro 3 integrates with the rest of your smart home too. It supports Google Assistant and Amazon Alexa, plus you can use it with HomeKit. Unfortunately, Arlo has announced that it doesn’t plan to support Apple’s HomeKit Secure Video, so don’t expect that kind of deep HomeKit integration - but at least you can still open up the Home app and see a feed of the footage from your camera.",
    "We only tested the Arlo Pro 3 for a few weeks before writing the review, so we were unable to truly test battery life. That said, Arlo claims between three to six months, which isn’t bad.",
    "The new-and-improved Arlo app looks good and works pretty great too. Sometimes it can be a little tricky to find the settings you need, but once you get used to the app and how it works, you shouldn’t have too many issues.",
    "In general, the app is split up into a few different sections. The “Devices” section gives you a quick view of your cameras and your SmartHub, while the “Library” lets you see a list of events. The “Mode” tab shows the different ways to arm your cameras, and the “Settings” tab, as you would expect, lets you browse the different features and tweak those settings. Simple.",
    "There are a number of ways to arm your cameras, which is a handy touch. You can set the cameras to be simply armed or disarmed, or you can set them to automatically arm based on a schedule, or, as mentioned, using your location. You can even create a new mode, which allows the cameras to automatically arm when they detect motion or hear a sound.",
    "Unfortunately, as you would expect these days, some features are trapped behind a paywall. You do get a three-month trial, and the subscription is only $3 per camera per month, for the basic Arlo Smart subscription, but if you don’t pay it you’ll lose access to things like object detection, cloud recording, and more. Arlo used to offer a seven-day free event-based cloud storage option, but unfortunately that option isn’t available for the Arlo Pro 3.",
    "The Arlo Pro 3 is a worthy successor to the Arlo Pro 2 - and a great option for those who want an outdoor security system that offers good, reliable image quality without overpaying for the Arlo Ultra.",
    "That said, the starter kit, with two cameras, is currently $500 - which is still relatively expensive. Considering the fact that the two-camera Arlo Ultra kit is available from Amazon for $518.64 at the time of this writing, it’s really not that much extra to upgrade to the best - and it’s something we recommend.",
    "Still, the Pro 3 is likely to get discounted eventually too, and the Ultra may go back up to full price. If you find that the difference in price is too much, you’re still getting an excellent camera with a ton of awesome features -- so rest assured that you’re covered with the Arlo Pro 3. And, considering the fact that your subscription will cost extra if you want to store 4K video, the Arlo Pro 3 might be the way to go regardless of start-up costs. It’s certainly a better camera than the vast majority of other options out there, most of which still cap out at 1080p."
  ],
  "headers": {
    "3": "Price and release date",
    "4": "Design",
    "9": "Setup",
    "13": "Day-to-day use",
    "20": "Arlo app",
    "24": "Final verdict"
  },
  "links": {
    "Arlo Pro 2": "https://www.techradar.com/reviews/netgear-arlo-pro-2",
    "best security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Arlo Ultra": "https://www.techradar.com/reviews/arlo-ultra"
  }
}