{
  "source": "https://www.techradar.com/reviews/gigabyte-aorus-k9-optical",
  "title": "Gigabyte AORUS K9 Optical review",
  "category": "computing",
  "updated": "2019-03-27T13:40:29Z",
  "author": "michelle-rae-uy",
  "summary": "Lacking in frills, but with speed, accuracy and durability in spades",
  "verdict": "The Gigabyte Aorus K9 Optical keyboard may look and feel like a traditional mechanical keyboard, but it has more aces up its sleeves. It’s faster, more responsive and definitely more durable, giving you unparalleled gaming advantage.",
  "pros": [
    "Super responsive optical Flaretech switch",
    "Shorter debounce time",
    "Splash and chatter proof"
  ],
  "cons": [
    "Limited RGB lighting customization",
    "Heavy",
    "Not as feature-rich as others"
  ],
  "article": [
    "At first blush, the Gigabyte Aorus K9 Optical keyboard may not be quite as impressive as other gaming keyboards on the planet. Looks-wise, it’s really more like the Plain Jane of the family. It doesn’t have all the fancy and attractive skin-deep trimmings. It’s heavier than others. And, you can’t even fully customize the RGB lighting for a more immersive gaming experience done your way.",
    "But, history has proven that looks can be deceiving and can only get you so far. While the Aorus K9 Optical may not have all the bells and whistles you could ever want, it does prove to be quite a strong contender when it comes to gaming performance.",
    "The secret is, of course, in the sauce … or rather the optical Flaretech switch it touts, giving it boosted speed and responsiveness as well as that extra heft all keyboards need to survive the rigorous demands of gaming. All for only $139 (£109, AU$206) a pop.",
    "If you’re browsing for gaming keyboards at a store, the Gigabyte Aorus K9 Optical probably won’t catch your attention. Made of an all-black, matte-feel exterior whose fanciest trimmings are the RGB-lit Aorus eagle icon above the number pad and the also RGB-lit Aorus logo at its bottom end, it doesn’t necessarily scream, “Look at me. I’m cool.”",
    "And, if you’re going to really nitpick, the keys are ever so slightly stiffer and smaller than most, and the whole thing is heavier than many of the gaming keyboards that have made it to our desk.",
    "Make no mistake, however: the Aorus K9 might not be the prettiest, but it’s probably one of the sturdiest keyboards you’ll ever have in your life, and not just because it’s made of top-quality steel springs. Thanks to its optical Flaretech switch that doesn’t have to deal with metal parts that will degrade due to oxidation and corrosion, the Aorus K9 apparently has a much longer lifespan than traditional mechanical keyboards at 100 million keystrokes (mechanical keyboards average at 50 million).",
    "Not only that, but because of how these optical switches are designed internally, this keyboard is also splash-proof as well as chatter-proof since dust and dirt have much lower chances of getting in to interrupt the connection inside that might affect your gaming experience.",
    "In the spirit of durability, Gigabyte also made sure to give this keyboard a strong, braided cable, which may not be as flexible as we had hoped, but will certainly last a good while. Gigabyte paired it with this simple yet effective three-slot cable management system so that you can run the cable left, middle or right, depending on your desk setup or what’s most comfortable for you.",
    "And speaking of comfort, this gaming keyboard’s keys have a slightly exaggerated concavity to avoid slippage and keep your fingers in place as well as rubberized feet to keep the keyboard itself in place, especially when you’re button-mashing. To give it a bit more oomph, the Arrow, Escape and WASD keys are swappable to orange ones included in the box.",
    "The switches are swappable as well. The Aorus K9 is available in two optical switch types: the blue, which we tested, and the red. While the blue type has a very discernible tactile bump and click at 1.8mm, the more linear red is missing this. With this keyboard’s switches being swappable, this just means you can swap out your switches according to your tactile feedback preference (or when needed).",
    "If you love personalizing your RGB lighting, the Gigabyte Aorus K9’s RGB customizations might be a bit of a let down. While some gaming keyboards offer full RGB customizations from color and brightness to movement, this keyboard relies heavily on motion presets, which only let you set certain things like one color for all the keys, brightness, speed of movement and the direction of motion. There are only four motion presets to begin with. To change the RGB lighting color for each key, you’d have to select the Static preset.",
    "Of course, that’s hardly a deal-breaker if you’re looking for a quality keyboard. Bearing in mind that the Aorus K9 boasts a few other features that are more directly related to your gaming performance, the limitations of its RGB customizations is hardly a factor anyway.",
    "This gaming keyboard is all-key programmable, meaning you can reassign any key to do a plethora of things. Using the Aorus Engine software, you can assign a key to perform a multi-key action (up to three keys), a mouse action (left, right, middle buttons), a specific task (i.e. starting your email, playing music, opening the calculator), a media player function (stop, play, rewind, forward, volume up and down), a hot key function or a macro for gaming edge.",
    "Additionally, it boasts full N-key rollover so that every single press is registered no matter how many keys your pressing at the same time, again to give you that gaming edge.",
    "Where the Gigabyte Aorus K9 Optical truly hits the mark is in its top-notch performance. Thanks to its optical Flaretech switches, it has a shorter debounce time than many of the best mechanical keyboards on the market, which in real-life situations makes it faster and more responsive.",
    "While traditional switches have 20ms debounce time, this keyboard has a near-zero time at 0.03ms. That might not matter as much for casual gamers, but it definitely gives the more serious ones a competitive edge even with its standard travel distance of 4mm and activation distance of 2mm.",
    "Testing this keyboard with AAA games like Far Cry 5, Assassin’s Creed Odyssey, and Call of Duty: Infinite Warfare, not only is it responsive and accurate, but it also does not produce any discernible latency or missed keystrokes.",
    "Playing Far Cry 5 in which you’ll often find yourself in battle with several enemies at once, the Aorus K9 allows for fast responses and rapid actions. Same is the case with Assassin’s Creed Odyssey, during which we can use macros for special powers, like shooting a volley of arrows to hit several enemies at once.",
    "The Gigabyte Aorus K9 Optical keyboard is not fully loaded with frills and fun features. The RGB lighting isn’t fully customizable, for example, and it has a minimalist, all-black design.",
    "But, when it comes to performance and build quality, not to mention comfort and important features that offer a gaming advantage, this keyboard is certainly dressed to impress. Again, it all boils down to the switches, which are optical Flaretech.",
    "These switches are not just twice as durable as a traditional mechanical keyboard as well as splash- and- chatter-proof, but they’re also over 600 times faster, thanks to its 0.03 ms debounce time and super responsive activation. With an affordable price tag of $139 (£109. AU$206), you’re getting a lot of bounce for your ounce with this gaming keyboard."
  ],
  "headers": {
    "3": "Design",
    "10": "Features",
    "14": "Performance",
    "18": "Final verdict"
  },
  "links": {
    "gaming keyboards": "https://www.techradar.com/news/gaming/10-best-gaming-keyboards-1295703",
    "keyboards": "https://www.techradar.com/news/computing-components/peripherals/what-keyboard-10-best-keyboards-compared-1028011",
    "£109": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FGigabyte-Aorus-Optical-Mechanical-Keyboard%2Fdp%2FB07J56K4G2%2Fref%3Dsr_1_fkmrnull_2%3Fkeywords%3Daorus%2Bk9%26qid%3D1553453371%26s%3Dgateway%26sr%3D8-2-fkmrnull%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-8213660392271028000-21",
    "AAA games": "https://www.techradar.com/news/best-pc-games",
    "Far Cry 5": "https://www.techradar.com/news/far-cry-5-review",
    "Assassin’s Creed Odyssey": "https://www.techradar.com/news/assassins-creed-odyssey-review"
  }
}