{
  "source": "https://www.techradar.com/reviews/magicsee-n5-nova-thin-client-android-pc",
  "title": "Magicsee N5 Nova thin client Android PC review",
  "category": "computing",
  "updated": "2019-10-08T20:40:01Z",
  "author": "desire-athow",
  "summary": "An absolute bargain if you’re looking for a decent thin client",
  "verdict": "The Magicsee N5 Nova is the cheapest Android device with 4GB of RAM and 64GB onboard storage so definitely one to consider if you want to experience Android on a big screen; as a thin client, things get a bit more complicated.",
  "pros": [
    "Very cheap",
    "Good performance",
    "Ample storage and system memory",
    "Recovery button"
  ],
  "cons": [
    "Annoying blue LED",
    "100MBps Ethernet only",
    "No 802.11ac",
    "Only two USB ports"
  ],
  "article": [
    "When a market has reached maturation, often, the only way to innovate is to offer the cheapest possible; that’s exactly the path that Magicsee, a newcomer to the Chinese market of Android TV boxes and thin clients, has chosen to take.",
    "Its N5 Nova doesn’t have any major selling point, like the X96H and its HDMI in. Instead where it trumps others is in its pricing. At $39.99, it is the cheapest Android device in the world to have 4GB of RAM and 64GB of onboard storage. A comparable Window 10 device with similar system memory and storage is likely to cost about three times that price.",
    "That should, in theory, future proof it, should the N5 Nova update the firmware to Android 10. Nothing about that is sure though.",
    "There’s nothing ambitious about the Magicsee N5 Nova from a design perspective. It is small (13.40 x 13.40 x 2.50 cm), light (170g) and likely to be tucked away behind a monitor or television. Note that - like most Android boxes - it doesn’t have a VESA mount as they usually require line of sight for their remote controls.",
    "As expected, it is entirely made of plastic with rubber feet with two USB ports (one being USB 2.0), two audio connectors, a 100MBps Ethernet port, a HDMI one, a proprietary power port (powered by a 12V2A power supply), a card reader and a LED clock at the front. Underneath is a recovery pinhole tucked away, just in case you hit a major issue.",
    "At the heart of the Magicsee N5 Nova is the Rockchip RK3318, a four-core ARM-based processor that uses the Cortex-A53 with a Mali-450 GPU. That is paired with 4GB of DDR3 RAM and 64GB onboard storage. Other features include 802.11n, Bluetooth 4.0 and a remote control.",
    "The N5 lagged the X96H significantly in most benchmarks compared to the X96H, that’s likely to be down to better optimisation from AllWinner, as well as a lower clock speed (1.5GHz vs 1.3GHz) and a weaker GPU (T720 vs Mali-450). That was particularly acute on PC Mark 2.0 and benchmarks that rely heavily on the graphics subsystem.",
    "The user interface is far more slicker than your average set top box with cleaner icons. It runs on Android 9.0 with a customised UI, as is the norm across that market. One thing worth mentioning is the annoying blue LED light that comes on when the device is powered on. You can put a piece of tape to hide it but it sort of defeats the purpose; note also that there’s no power button.",
    "At $49.99, the X96H is slightly more expensive than the Magicsee N5 but the extra $10 is well worth it. It has an extra USB port, a faster CPU with a more powerful GPU, a power button and a HDMI-in which is pretty much unique in the world of Android devices.",
    "Like the X96H, the MX10 Pro ($42.99), the X10 Plus ($46.99) and the H10 ($47.35) sport the Allwinner H603 CPU and claims that they can drive 6K displays (which don’t current exist on the market). These all sport the same features (system memory, storage capacity, expansion capabilities) leaving us to believe that they are manufactured by the same OEM.",
    "That means that they have the same issues; 10/100MBps Ethernet, an absence of 802.11ac and the use of USB 2.0 ports. Niggles, rather than deal breakers.",
    "This is essentially a phone without a battery, 4G connectivity, a display, a speaker and a microphone. The Magicsee N5 Nova is a great piece of technology given its price but we’d rather spend $10 less to get the X96H which is a better product altogether. Some may point out that it is a 25% premium but in the grander scheme of things, it is not a big amount.",
    "That’s not to say that the N5 Nova is worthy of your interest. It is extremely compact, can even be powered by a USB port from another device (like a laptop) and can be considered to be almost disposable as a computer. No need to send it back if it breaks down, just recycle it."
  ],
  "headers": {
    "3": "Design",
    "5": "Hardware",
    "6": "Performance and in use",
    "8": "The competition",
    "11": "Final verdict"
  },
  "links": {
    "thin clients": "https://www.techradar.com/best/best-thin-client",
    "X96H": "https://www.techradar.com/reviews/x96h-thin-client-android-pc",
    "Magicsee N5": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-8190012657992061000&p=https%3A%2F%2Fwww.gearbest.com%2Ftv-box%2Fpp_009308993364.html%3Fwid%3D1349303",
    "MX10 Pro": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-3273246513659395000&p=https%3A%2F%2Fwww.gearbest.com%2Ftv-box%2Fpp_009746261113.html%3Fwid%3D1433363#goodsDetail",
    "X10 Plus": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-6678093471788235000&p=https%3A%2F%2Fwww.gearbest.com%2Ftv-box%2Fpp_009934919507.html%3Fwid%3D1433363#goodsDetail",
    "H10": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-6485251368587884000&p=https%3A%2F%2Fwww.gearbest.com%2Ftv-box%2Fpp_009427869796.html%3Fwid%3D1433363"
  }
}