{
  "source": "https://www.techradar.com/reviews/amazfit-bip",
  "title": "Amazfit Bip review",
  "category": "wearables",
  "updated": "2019-12-23T15:54:30Z",
  "author": "cameron-faulkner",
  "summary": "The Bip is all about battery and value",
  "verdict": "The Bip is the layman’s Apple Watch. At just $99 / £70 (around AU$99) the Bip offers plenty of reason to invest, but none greater than its excellent battery life.",
  "pros": [
    "Amazing value",
    "Stylish design",
    "Excellent companion app"
  ],
  "cons": [
    "Auto-pause feature doesn’t work",
    "Finicky UI",
    "Light on supported workouts"
  ],
  "article": [
    "A good fitness tracker doesn’t need to look like the Apple Watch 5 in order to succeed, but it sure helps. The Amazfit Bip is a head-turning wearable that, even once you learn that it isn’t an Apple Watch, is still worth your attention.",
    "For $79 or £62, the Amazfit Bip is a competent fitness tracker that is said to last longer than 30 days on a single charge. If you’re after a simple wearable that can push notifications from your smartphone, wake you up with a dedicated alarm, and track your workouts with built-in GPS, and more, the Bip makes a strong case for itself.",
    "It’s not the most robust offering, and while it certainly can’t compete with the rich, interactive experience provided by watchOS 6 or Wear OS (or even Samsung's Tizen OS), you’ll likely be impressed with just how much $79 / £62 can get you.",
    "The Amazfit Bip is out now in the US and UK for $99 or £69.99 (around AU$99) and is readily available on the company’s website, as well as well-traveled web destinations like Amazon.",
    "As Amazfit is a brand within Huami, which supplies wearables under the Xiaomi umbrella, distribution across the globe is a bit murky at the moment. It launched in the US in early 2018 and then came to the UK a couple of months later, while we hope to hear about it arriving in Australia in the future.",
    "We’ve already touched on the highlights of the Bip’s design. It looks like an Apple Watch. But upon closer inspection, a closer parallel might be something more like the Pebble Time.",
    "Built with a matte-textured plastic chassis, the Bip transitions nicely into a slightly curved slate of Corning Gorilla Glass on top of its colored, pixelated display.",
    "Moving around the tracker’s interface is done on the touchscreen, but waking it with the side button is mandatory. This design choice might seem like an annoyance, though it’s defensible when you realize how easy it can be to accidentally swipe the screen when you’re working out.",
    "Speaking more on the glossy button on its side, clicking it triggers an animation to wipe across the screen, indicating that you’ve woken it. The built-in settings allow you to designate a task that launches when you press and hold the button. Things like outdoor running, cycling, treadmill, or walking are the only options available now, but the list could grow in the future.",
    "Once the Bip is unlocked, you have free access to slide your finger around, each direction venturing into different features. Sliding down reveals your connection status, battery level, and lets you toggle a “do not disturb” mode that disables notifications of any kind. Swiping up shows you various notifications that have come through your phone, like text messages or alerts for Twitter.",
    "Nothing happens when you slide from the right side, but moving left reveals one of seven tiles, which can be rearranged in the Mi Fit companion app. Here, you’ll find the Status section, giving you a deep dive on steps taken, heart rate, distance traveled, etc. Some of the built-in watch faces (like the one prominently pictured in this review) reveal this info without any interaction whatsoever, so your use may vary for this view.",
    "Following Status, there are pages dedicated to Activity, Weather, Alarm, Timer, Compass and Settings. We’ll drill into the Activity section later on, but each of the others are pretty predictable, though accessible, in their execution."
  ],
  "headers": {
    "3": "Amazfit Bip price and release date",
    "5": "Design"
  },
  "links": {
    "Apple Watch 5": "https://www.techradar.com/reviews/apple-watch-5-review",
    "watchOS 6": "https://www.techradar.com/news/watchos-6-release-date",
    "Wear OS": "https://www.techradar.com/news/best-wear-os-watch"
  }
}