{
  "source": "https://www.techradar.com/reviews/hp-omen-27-gaming-monitor",
  "title": "HP Omen 27 Gaming Monitor review",
  "category": "computing",
  "updated": "2019-01-29T17:33:18Z",
  "author": "michelle-rae-uy",
  "summary": "Fast gaming monitor with an understated look",
  "verdict": "As far as gaming monitors go, the HP Omen 27” performs incredibly well with a gorgeous display that’s crisp and fluid, and it has a few nifty features as well. However, it’s also a bit expensive for what it is.",
  "pros": [
    "Vibrant 1440 display",
    "Impressive response time, overclocking to 165Hz",
    "G-Sync enabled"
  ],
  "cons": [
    "Difficult to navigate menus",
    "Color banding in shadows",
    "Weird placement of buttons and ports"
  ],
  "article": [
    "HP’s 27-inch Omen gaming monitor boasts a crisp and fluid display that’s clearly designed (and is especially great) for gaming. It delivers an impressive 1-millisecond response time and a 144Hz refresh rate that can be overclocked to 165Hz. Even if there’s a ton of action, you won’t miss a thing with this display and there aren’t any discernible issues.",
    "It’s also G-Sync enabled, which works with any computer equipped with an Nvidia graphics card with G-Sync capabilities to maintain a consistent refresh rate and prevent screen tearing. Plus, it has a number of available options for different settings like color, brightness, contrast, and response time, making it fairly customizable.",
    "All that, coupled with its sturdy design and subtle gaming look, might make it a good choice for your gaming display needs. But at a little less than $500 bucks, it’s definitely not an impulse buy. Let’s dig in deeper to see if it’s worth the price.",
    "Though not burn-a-hole-in-your-pocket expensive, the HP Omen 27-inch gaming monitor is still pricey for what it is and what it offers. There are other gaming monitors in the market with similar or better specs that are a tad or even much cheaper.",
    "To name a few, the $479 (£599, AU$999) 32-inch Samsung CHG70 QLED with its 144Hz refresh rate, 1ms response time and curved design. There’s also the 25-inch BenQ Zowie XL2540 – priced at $449 (£429, AU$749) that boasts a blazing fast refresh rate of 240Hz, but only features a standard 1080p resolution.",
    "Prices range for the HP Omen 27, from $429 on Adorama to $$474 on Amazon in the US. It’s also available in the UK for £699 and in Australia for AU$1,399. A 25-inch model is also a cheaper option at $279 (£269, AU$599), but this version only has a 1080p display.",
    "Those who are not big fans of that aggressive gaming look that many peripherals (and computers) sport these days might appreciate HP Omen’s understated gaming look. We do.",
    "It has a few touches of gamer aesthetic, specifically the logo stamped on its diamond-shaped base with a red, metallic version of the same logo on the back – where you’ll also find a built-in headphone stand. In addition, it also has customizable RGB lighting pointing down at its base, which you can use as a task light or simply as mood lighting to add to your immersive gaming experience.",
    "The rest of it, however, just looks like a regular monitor, with a textured finish, very thin bezels for better use of real estate and a firm stand with adjustable height. It feels sturdy and made of quality material, which is to be expected considering its price tag. It has several inputs and output port options: HDMI and DisplayPort for input, a CPU-powered USB Hub built-in to connect your peripherals and for charging devices, and a headphone jack.",
    "The design isn’t perfect though. There are a few things we don’t like about it, the first of which is its five buttons in the back to access the menu and settings. The menu itself isn’t as user-friendly as we would have liked it to be, but having flush buttons that are placed in the back makes the task of personalizing your display settings an even more frustrating task. If the buttons were set on the side, things would have been a tad easier.",
    "There’s also the fact that its ports are downward-facing, making it not only harder to see which port is which especially when you have the monitor set up against the wall and you’re coming at it from the front, but also trickier to attach any cable. We get it’s built that way for a cleaner look, but is it worth it when it takes you longer to connect and set things up?",
    "Finally, there’s the fact that the base is doesn’t swivel. Not that it’s that important of a feature when gaming, but it would alleviate our issues with inserting cables and it’s nice to have for things like reading documents.",
    "Performance contains the HP Omen’s strongest features, with its lightning-fast response time and refresh rate, its beautiful color reproduction, and its tack-sharp 1440p display. These qualities are fully realized when connected to a source through the DisplayPort, which allows refresh rate overclocking at 165Hz.",
    "Admittedly, we did encounter the same issue many monitors that use DisplayPorts have – that is, we couldn’t get it to work at all at first – but all it took was a simple fix. We just turned everything off and unplugged everything, then turned the computer on, plugged in the Display cable, and turned the monitor on (in that exact order).",
    "Once we got the display working through the DisplayPort, we just needed a bit of calibration to get that look we want (the menu offers several modes that boast different looks, hues, white balance, and level of contrast) and everything was in great form.",
    "It’s very responsive, and the games are crisp and fluid, giving you a highly immersive gaming experience. If gaming is what you’re really after with a monitor, this is definitely an excellent option.",
    "As we mentioned earlier, it is also a G-Sync enabled monitor. That means that you can sync it with any computer with an NVIDIA graphics card with G-Sync capabilities, which basically forces the monitor and the GPU to have the same refresh rate to avoid screen tearing issues.",
    "On the downside, the HP Omen does have some very noticeable grain and color banding issues that are especially obvious when you’re watching movies. It doesn’t affect its overall performance, but frankly, it’s unattractive and distracting.",
    "Additionally, the HDMI connection only offers a refresh rate of 60Hz, which means that while it still looks good, it’s not as crisp or fluid and you’re likely to start noticing frame drops and screen tearing. It’s best to stick to using a Display cable and connecting through the DisplayPort if you want the best visuals.",
    "Another glaring flaw is its viewing angle. While you’ll have a pretty good viewing angle from left to right with the HP Omen, its color banding gets even worse when viewing from above or below.",
    "It’s simple design and subtle gaming look, great display and performance features (including a 165Hz refresh rate when overclocked) that matches well with gaming, and G-Sync features, the HP Omen 27-inch is an overall great gaming monitor.",
    "However, considering its recurring color banding issue, hard to access buttons and ports, and underwhelming refresh rate when using HDMI, not to mention the DisplayPort issue we encountered at setup, we don’t think it’s worth its price tag.",
    "If we’re being honest, we’d probably check out a few other options first before committing to the HP Omen 27. Don’t get us wrong; it’s great and your games will look beautiful and immersive in it, and movies will look great as well, if not as good. It’s got crisp and fluid visuals, nice color reproduction, and super smooth gameplay when using the DisplayPort.",
    "But it also has a few flaws that are too obvious to ignore, considering you’re paying shy of $500 for it and considering that there are cheaper options out there that offer about the same level of performance. Maybe if it was a lot cheaper, we might be convinced to overlook these flaws. But at that price tag, we’d shop around first."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "12": "Performance",
    "20": "Final Verdict"
  },
  "links": {}
}