{
  "source": "https://www.techradar.com/reviews/lookout-security-and-antivirus",
  "title": "Lookout Security and Antivirus review",
  "category": "computing",
  "updated": "2019-05-01T07:14:08Z",
  "author": "mike-williams",
  "summary": "Using free Android antivirus apps doesn't have to compromise your security",
  "verdict": "Short on features but long on malware-hunting power, Lookout is more accurate and effective than many commercial antivirus apps. Worth a try.",
  "pros": [
    "Good antivirus performance for a free app",
    "Effective web protection",
    "Easy to use",
    "14-day trial of the Premium version"
  ],
  "cons": [
    "Possible conflict with VPN apps",
    "No cleanup or performance-boosting extras"
  ],
  "article": [
    "Lookout Security and Antivirus is a hugely popular antivirus and security app with more than 100 million downloads recorded on Google Play, and a 4.4 rating. (We're looking at the Android app in this review, but there's a capable iOS version available, too.)",
    "Lookout Security and Antivirus' free version includes the antivirus, a System Advisor to report on OS issues, and basic anti-theft functions including location and Scream (an alarm you can trigger remotely).",
    "Lookout hasn't tried to pad out the feature list with the usual security, cleanup or speedup extras (app locking, a call blocker, junk file finder-- you've seen them all before.) That may be an issue for some, but we're happy to see a developer focus on the most important functions.",
    "A $2.99-a-month Premium plan ($2.50 if you pay for a year up-front, $29.99 total) gets you a host of extra features. Safe Wifi alerts you when you access potentially dangerous networks; a Privacy Advisor highlights which of your apps can access sensitive information (location, contacts, identity, more); a Safe Browsing web filter prevents you accessing known dangerous sites; a Breach report warns you when one of your accounts might have been compromised; a Signal Flare feature emails you with your device location when the battery is running low, so you can find it even if it dies; and even if you can't get your device back, remote locking and wiping ensures the thief won't have access to your data.",
    "This looks relatively expensive to us - Bitdefender Total Security will cover up to 5 devices, desktop or mobile, for just $44.99 in year one, $89.99 on renewal - but a free 14-day trial of Lookout Premium allows you to compare its abilities with other security apps before you part with any cash.",
    "Lookout Security and Antivirus installed in just a few seconds, with no hassles of any kind. Handing over our email address got as a free account, the app ran a basic scan on our device, and began monitoring for danger.",
    "The app opened with a very simple interface, little more than a simple status message ('No threats found', in our case), the time of the last scan, and a large and reassuring green tick to reinforce the point that everything was fine.",
    "There is a little more detail, if you go looking for it. Choosing Security from the menu, for instance, displays an Apps screen with a list of recent actions, and a Scan Now button to run on-demand checks. But that's not really necessary, as Lookout Security and Antivirus will scan and warn you of risky apps and downloads as they're accessed, so for the most part you can leave it to get on with protecting your device.",
    "A compact Settings box gives you some control over this, by allowing you to disable the analysis of apps or downloads. That could be useful if, say, you find Lookout Security and Antivirus falsely flags one of your apps, or maybe you're happy to have your apps scanned, but want to leave download checking to something else.",
    "If this all seems a little basic, tapping a Try Premium option on the menu allows you to start and set up a free 14-day trial (this doesn't start a Google Play subscription, so you won't be billed if you forget to cancel.) This only takes a few seconds, but gives you access to Premium's various extra features.",
    "Lookout Security and Antivirus checks apps as they're installed to look out for malware, adware, riskware and anything else it considers dubious. We tried installing F-Secure's AV Test (a harmless EICAR-based app which allows you to see if your anti-malware system is doing its job), and sure enough, we were alerted to a possible threat. (Although Lookout prompts us to uninstall the app immediately, we could choose to ignore the alarm for now, handy if you're sure it's a false alarm.)",
    "AV-Comparatives 2019 Android Antivirus report assessed the performance of 250 Android security apps. Lookout Security and Antivirus was included on the list, and managed to block a decent 99.6% of test threats while not raising any false alarms.",
    "Lookout was outperformed by a lot of apps (23 blocked 100% of threats), but its equal 30th position was excellent for a free product, and it also beat some big commercial names: Malwarebytes, CheckPoint, Qihoo, Webroot, Panda, Dr. Web, IObit, Comodo, and more. Lookout Security and Antivirus may not be the best, but it's good, and it can play a big part in keeping you safe online.",
    "Lookout's Safe Browsing feature aims to prevent you accessing malicious downloads, phishing sites and more. We tested the app with a couple of sample sites, and in both cases it popped up an alert, while also giving us the chance to continue if we were sure this was a false alarm.",
    "While this was looking good, there's a problem you might easily miss. Safe Browsing works by redirecting your web traffic through a VPN connection (not one you can use yourself; it only connects to Lookout's servers.) You can only have one VPN connection active at a time, though, and we found that if we connected via a real VPN, Safe Browsing stopped working. There were no interface alerts - they still told us Safe Browsing was active - but we could freely access sample malicious sites without Lookout noticing.",
    "Lookout's anti-theft features start with the ability to track the current location of all your protected devices from its web console. We only tried this once, but it worked perfectly, giving our position to within 200 feet.",
    "The Signal Flare feature also delivered for us, sending an email with an embedded map showing our device's location, just before its battery ran out.",
    "A Scream feature sends a request to your device to play a loud noise, maybe useful if it's lost.",
    "The app has remote wiping and locking, too, but these aren't enabled by default: you must enable a particular Lookout setting and agree to the relevant Device Administrator permissions. This isn't difficult - go to Locate My Device > Lock and Wipe and tap Enable Lock And Wipe - but if you don't notice that option, you may not realize the remote features aren't enabled until it's too late.",
    "There are a handful of other features, all with some value, though nothing you haven't seen before. The Privacy Advisor highlights apps which have permissions to access various sensitive areas of your device, for instance, including the camera, microphone, your storage, location and more. It's useful, but we've seen better, and we wouldn't miss it if it wasn't there. Lookout's standout feature for us is its antivirus, that's the component that really matters: everything else you could more-or-less get elsewhere.",
    "Lookout Security and Antivirus has relatively few features, but that's only because it focuses on what really matters, and it's worked-- this is one of the most effective and accurate free antivirus apps around."
  ],
  "headers": {
    "5": "Setup",
    "10": "Protection",
    "13": "Features",
    "20": "Final Verdict"
  },
  "links": {
    "Lookout Security and Antivirus": "https://play.google.com/store/apps/details?id=com.lookout",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "iOS version": "https://itunes.apple.com/us/app/lookout-security-backup-missing/id434893913?mt=8&at=1001lnRX&ct=trd-us-5968410545985937000",
    "Premium": "https://play.google.com/store/apps/details?id=com.lookout&hl=en",
    "Bitdefender Total Security": "https://www.techradar.com/reviews/bitdefender-antivirus",
    "F-Secure's AV Test": "https://play.google.com/store/apps/details?id=com.fsecure.eicar.antivirus.test&hl=en_US",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}