{
  "source": "https://www.techradar.com/reviews/beats-solo-3-wireless",
  "title": "Beats Solo 3 Wireless review",
  "category": "audio-visual",
  "updated": "2020-01-07T16:56:27Z",
  "author": "xandrew-wiliams",
  "summary": "Fashion-focused cans get smart",
  "verdict": "Smart wireless headphones that make some real techy improvements, but the sound unfortunately lags behind.",
  "pros": [
    "Excellent wireless stability",
    "Good Bluetooth-phone interaction",
    "Energetic, punchy sound"
  ],
  "cons": [
    "Firm headband pressure",
    "Lack of fidelity for the price"
  ],
  "article": [
    "These Beats headphones were the first fruits of Apple's deal to buy the Beats brand – in terms of actual products at least – and the review below represents our initial thoughts when the headphones first appeared in 2016.",
    "When Apple bought the Beats brand, it was only a matter of time before that Cupertino mobile know-how would be baked into Dr Dre's personal audio line. The Solo 3 wireless are the first obvious fruits of that partnership in terms of products, taking an existing Beat Audio line and giving them a sprinkle of Apple's magic dust.",
    "The Beats Solo 3 Wireless were the first fruits of Apple's deal to buy the Beats brand – in terms of actual products at least – and the review below represents our initial thoughts when the headphones first appeared in 2016.",
    "At first glance, the Solo 3 Wireless don't look all that different to their predecessors the Solo 2, Apple takeover or not. It's only under further inspection to the internal specs that the improvements become more obvious – Apple's expertise in mobile engineering sees connectivity stabilized and battery life improve.",
    "However, the traditional issues with audio quality are back with the Beats Solo 3 Wireless. If you're not a total Beats brand loyalist, you'll likely find that for a few more notes the Bose QuietComfort 35, with their noise cancelling smarts, added comfort and superior sound performance, could be a better fit for your needs.",
    "The Beats Solo 3 Wireless don't usher in a dramatic design refresh from the outside, which to be fair is a sensible move on Apple's part.",
    "Beats headphones remain among the most recognizable in the world, and these days it's the Beats Solo we see out and about the most. In 2014 Beats smoothed-out the lines of the set with the Solo 2 for a less aggressive appearance, and while the glossy finish of our pair has a loud and adolescent edge to it, reports you need to be under 25 to pull these off are exaggerated.",
    "You just have to make sure you buy the right color. Apple sent us the glossy black version, but there are also matte black, glossy white, silver, gold, rose gold, violet and red to choose from... so quite the color palette.",
    "All Beats headphones used to feature brash bright red “B” logos on them, but they now come color-matched to whatever shade you pick. The Sennheiser Momentum On-ear and Bose pairs look more grown-up, but the last couple of generations have tried to make the Beats Solo style more palatable for a wider audience.",
    "The Beats Solo 3 Wireless build is much the same as ever, though, and it may make some of you look at the price a little suspiciously. Most of the frame is plastic, with only the fold-up hinge and the skeleton of the headband made of metal for, extra strength.",
    "The pads are synthetic leather-topped foam, and the fake leather really isn't all that convincing either. Synthetic stuff can look almost indistinguishable from the real thing these days, but this is very clearly plastic-based.",
    "Beats headband padding on the Beats Solo 3 Wireless doesn’t seem luxurious either, but this time it has a definite purpose.",
    "The Beats Solo 3 Wireless use squidgy rubber for the part that sits on your head, spreading the pressure well and creating a much higher-friction hold than conventional headband padding. The idea is you'll be able to wear these headphones while out jogging without them gradually working their way off your head.",
    "It’s not just the headband that makes this possible, though. The Beats Solo 3 Wireless also have a fairly firm grip on your cranium, which initially doesn’t feel that comfortable compared to a set of over-ear headphones.",
    "If you wear glasses with chunky stems, you’ll likely find that after a few hours you start to feel a bit of gnawing discomfort in your ear cartilage. However, this is a problem of runner-ready on-ear headphones in general, rather than specific to the Beats Solo 3 Wireless. In this specific class, the headphones are actually fairly comfy too, thanks to ear cups that shift to fit your head’s contours in order to spread out the pressure as evenly as possible.",
    "Wear chunky glasses and want a wireless pair you can wear for six hours at a time without any discomfort? Check out the Bose QuietComfort 35 before buying these is our recommendation.",
    "Other external bits of the Beats Solo 3 Wireless worth checking out include the 3.5mm input on the left cup, for use when the battery is dead, and the fold-up design. You get a carry pouch in the box, and it's a good idea to use it if you pick a glossy version – that finish will show off scratches like they're newly-caught Pokémon.",
    "There are also some hidden controls on the right ear cup: the Beats logo acts as a play/pause button and the ring above/below alters volume. A mic hidden in the ear cup lets you take calls too, but the Beats Solo 3 Wireless don't have active noise cancellation, a feature now fairly common in higher-end wireless headphones.",
    "Whereas active noise cancelation monitors ambient noise and adds inverse frequencies of that noise to the drivers' output to cancel it out, the Solo 3 Wireless instead use pure passive isolation, where the pads simply block out sound. While not as effective at cutting out the low-end hum of a city, it works well enough here for use on noisy public transport.",
    "The external hardware of these headphones is pretty solid, but there are two sides to the meaty insides of the Beats Solo 3 Wireless. One is excellent, the other just passable.",
    "The Beats Solo 3's strong point is the tech that goes into its wireless capabilities. Apple credits its W1 wireless chip for the headphones' excellent up-to 40 hours battery, but the exact specs are – as usual for Apple – rather opaque.",
    "We're very happy for wireless sets like this to last around 20 hours, and the former Beats Solo 2 last 12 hours between charges, so this is a huge improvement. It means most people should be able to get two weeks' use before charging rather than just one. Wireless charging is super-quick too: Apple claims you get 3 hours of playback from a 5 minute charge.",
    "You can check the charge level using the 5-pip LED indicator on the right cup.",
    "They use a micro USB cable, although there's no way to directly connect this to, and charge the headphones from, an iPhone Lightning port. Apple wants to sell us the Solo 3 Wireless as a Bluetooth headphone revelation, but when used wired they actually feel more at home with an Android phone.",
    "What's actually even more useful than ultra-long battery life is the reliability of the wireless signal. We didn't hear a single burble, blip or cut-out once during testing, and we've mostly been using Android phones rather than the iPhones that are \"officially supported\" by this pair.",
    "The slightly cheaper, larger Sony MDR-100ABN also have excellent wireless stability though, so Apple doesn’t exactly have a trademark on these wireless chops.",
    "Their interaction with iOS devices is – for now – unique. Where the Beats Solo 2 Wireless are really just like any other pair of Bluetooth headphones, the Solo 3 Wireless pop-ups in iOS more like a Wi-Fi speaker. It appears as specific source, so doesn't have to be treated like just another wireless accessory.",
    "There's clearly something clever going on in the Apple W1 chip. And if you use an Android, you can use the Solo Wireless 3 like any Bluetooth pair, although as there's no NFC or aptX, they make quite a basic setup.",
    "The sound of the Beats Solo 3 Wireless is less impressive than the tech, and roundly similar to that of the Beats Solo 2. Before we get into any criticism, it's worth noting that these last two generations of Beats Solo headphones are still far better than those of the early years of Beats.",
    "An approach of just making the bass sound big and fat, which tends to cloud the sound, has been altered. Now the aim seems to be to make the Beats Solo 3 Wireless sound like a hi-fi system with a subwoofer attached.",
    "There's bonus bass here, but for the most part it's centered around fairly low frequencies. This results in aggressive and punchy-sounding kick drum beats without the resonant boom that so often turns big bass into bad bass.",
    "The Beats Solo 3 Wireless sound is lively and energetic, fitting the Beats brand image well. The pounding bass beat of Simian Mobile Disco's Sleep Deprivation sounds suitably juggernaut-like through this pair, with much less unwanted boom than the earliest Solo headphones.",
    "However, for a pair this pricey, the mid-range sound quite flat, lacking dynamics. A slight lack of finesse in the sort of frequencies where mids and treble meet can also cause some hard edges to certain vocals, depending on the singer's register (for example, Randy's Newman’s gravelly croon can sound a bit hard). It's not enough to make you wince, or to tire out your ears in an hour, but at this price we have a right to be picky.",
    "Listening to the Solo 3 Wireless next to the Audio Technica ATH-MSR7 and Sennheiser Momentum 2.0, the Beats pair lacks a certain sort of detail that separates decent headphones from great ones. It's not classic audio bore treble detail that's missing, but spatial detail.",
    "Where the ATH-MSR7 can deliver a very 3D-like take on fairly complicated arrangements, the Solo 3 Wireless approach is much more crude and rudimentary, almost pudding-like. In Kate Bush's Running Up That Hill, say, the rolling bass tom bed becomes a muddling influence that makes the track sound messy.",
    "If you're not listening closely, the powerful bass is enough to divert your attention from these sorts of effects, but it also actually compounds the problem, upsetting arrangements and at times even making lead vocals sound almost like incidental parts of a mix when left to compete with a strong bass line.",
    "It's a classic example of a headphone you might hear described as \"good for dance music\", but all that really means is that it's one of the few genres that tends not to expose the pair's significant audio flaws.",
    "The Beats Solo 3 Wireless ace their wireless tech, with very solid Bluetooth, good range and class-leading battery life – there's a huge difference here compared with often-flaky cheap Bluetooth sets. The new way they interact with iPhones should also make Google think about how Android talks to Bluetooth accessories in the future.",
    "Their bass response is sure to be a crowd-pleaser too. It's not meant to be neutral or accurate, but by providing meaty thuds without major boominess, the Solo 3 Wireless do what a Beats headphone should.",
    "The range of colors available also good, going from bolder shades that skew younger to plain matte finishes that won't look out of place on anyone's head.",
    "We hear no major sound quality improvements over the Beats Solo 2. Limited dynamics and a lack of spatial detail may leave you unimpressed if you're not blown away by the stomach-punching low-end.",
    "There's also a strange dichotomy going on here. The Solo 3 Wireless are meant to be next-gen wireless headphones for iPhones, but their wired connection won’t plug in directly to an iPhone without using the 3.5mm adapter, and they charge using microUSB rather than Lightning. This is good for Android owners, but not so good for those who have gone all-in with Apple.",
    "Not everyone will get on with the Beats Solo 3 Wireless fit either. While they are comfortable for a pair of fairly firm on-ear headphones, glasses-wearers in particular should know what they're in for: potential discomfort after a while.",
    "The Beats Solo 3 Wireless make huge improvements in some areas, and change little in others. Top on its list of achievements are class-leading battery life and wireless stability on-par with the very best, regardless of whether you use an Android or an iPhone.",
    "They also interact a little differently with iOS devices than older Bluetooth headphones, which is a neat change, particularly when iPhones don’t allow pairing using NFC.",
    "Other elements are less impressive, though. Some issues are very minor, like the use of unconvincing leatherette in a headphone set this pricey.",
    "It's the sound that matters most though, and it's not at the level of the best at the price. While the bass is punchy and the Solo 3 Wireless have plenty of energy, the flat mid-range leaves them less sophisticated and involving than some cheaper sets, particularly if you actually listen to music rather than treating it as an incidental soundtrack to your life."
  ],
  "headers": {
    "5": "Beats Solo 3 Wireless: design",
    "19": "Beats Solo 3 Wireless review: performance",
    "37": "We liked",
    "40": "We disliked",
    "43": "Verdict"
  },
  "links": {
    "Beats headphones": "https://www.techradar.com/news/audio/portable-audio/cheap-beats-by-dre-deals-1302753",
    "Bose QuietComfort 35": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/bose-quietcomfort-35-1322715/review",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "Beats Solo 2": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/beats-by-dre-solo-2-wireless-1284158/review",
    "Sony MDR-100ABN": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/sony-h-ear-on-mdr-100abn-1321289/review",
    "Audio Technica ATH-MSR7": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/audio-technica-ath-msr7-1299110/review"
  }
}