{
  "source": "https://www.techradar.com/reviews/draft-datacolor-spyderx-capture-pro",
  "title": "Datacolor SpyderX Capture Pro review",
  "category": "cameras",
  "updated": "2019-08-21T15:22:34Z",
  "author": "matt-golowczynski",
  "summary": "A helping hand from capture to finish",
  "verdict": "With four popular products rounded up in this bundle, this is a sound option for anyone needing to give their shooting and editing a quick check-up. But unless you need the latest SpyderX Elite calibrator, you can save a fair chunk of cash by opting for the older and very similar Spyder5 Capture Pro bundle.",
  "pros": [
    "Super-fast calibration speeds",
    "Integrated reference guide contains stacks of info",
    "SpyderX sensor protected when not in use"
  ],
  "cons": [
    "USB-A connection not ideal for newer laptops",
    "Counterweight/cover could be heavier",
    "A fair bit pricier than Spyder5 Capture Pro"
  ],
  "article": [
    "The Datacolor SpyderX Capture Pro bundle consolidates four popular Datacolor products and delivers them in a smart carry case, providing photographers with everything they need to ensure accuracy across exposure, color and cameras/lens performance.",
    "This package contains the Spyder LensCal, Spyder Cube, Spyder Checkr and SpyderX Elite, all of which have been available for some time, with the exception of the latter, which was announced earlier this year. Because the inclusion of SpyderX Elite is the only thing that's changed form the previous Spyder5 Capture Pro bundle, much of what follows will focus on the performance of that component.",
    "Spyder LensCal allows you to check whether your lenses are focusing at the correct point, so that you can make minor adjustments to compensate for any bias. This is particularly important for photographers who frequently use wide-aperture lenses, as these can sometime miss the mark – and with these lenses capturing such a shallow depth of field this can cause subjects to be rendered slightly out of focus.",
    "That said, with more photographers using mirrorless cameras, this is arguably less of a problem than it used to be, given the fact that lenses on such bodies focus using the main image sensor rather than a separate phase-detect module, which makes for far better accuracy.",
    "Spyder Cube, meanwhile, is placed in a scene at the start of a shoot to provide you with a reference point for raw adjustments. Its different faces give you targets for black, white and 18% neutral grey, which can be used to determine correct contrast, white balance and exposure. There's also a black 'trap' within the black side for absolute black, and a chrome ball at its top to provide a reference for specular highlights.",
    "The third element is Spyder Checkr, a collection of colored and neutral targets, which can also be used to correct white balance, but also to provide additional reference points for known colors. Again, the idea is that you place it in the scene at the start of a shoot, and use the captured reference image to make adjustments for subsequent shots taken in the same conditions.",
    "Finally, we come to the SpyderX Elite, the centerpiece of the package, and the company’s latest color calibration tool. From the outside, this looks to be a redesigned version of previous Spyder models that have become established as popular color management solutions, but Datacolor has fitted it with a fresh lens-based color engine that allows for calibration in less than two minutes, further claiming that it’s more accurate than before and even easier to use.",
    "Specifically, the model is said to have higher light sensitivity and more advanced sensors than the previous Spyder5 Elite unit, and like that model is able to monitor ambient light so that it can take your environment into account.",
    "Incidentally, this is the more senior of two Spyder models, the other being the SpyderX Pro. So what are the differences? The Elite boasts more advanced display mapping and analysis tools, together with unlimited calibration settings choices and the option to calibrate projectors, with side-by-side display tuning and a handful of other perks on top of all that.",
    "The combined cost of these components brought individually is around £100 / $100 / AU$240 more than the price of the SpyderX Capture Pro bundle, so it’s quite a saving – and you get the case on top of that. If you’re on a budget, however, you can still get the previous Datacolor Spyder5 Capture Pro package for around £100 / AU$210 less (it's only around $30 less in the US), which contains the same Spyder LensCal, Spyder Cube and Spyder Checkr, together with the older Spyder5 Elite.",
    "The SpyderX Elite has a glossy white casing and a smart design that sees it clip into a protective cover when not in use. This shields the lens from dirt and damage, and also functions as a counterweight during calibration.",
    "It’s swung over the top of the display to keep the calibrator flat against the screen and in place – at least that's the idea; it’s very light, so you may find yourself angling your display to make sure the unit actually stays right up against it.",
    "The USB-A connection on the SypderX Elite means it’s not immediately compatible with newer laptops fitted with Type-C ports; it would have been welcome to find a small adapter thrown into the box, as these aren't expensive on their own.",
    "If you’re new to calibration you can opt for the step-by-step wizard, while color management wizards can opt for the full-fat process to give them more immediate control over certain settings. You can still access these more advanced settings when using the step-by-step wizard if you want to, but it helpfully clears them out of the way for the benefit of those who don't.",
    "The Interactive Help guide explains what’s going on, and the built-in manual is an excellent reference for anything that may need to be cleared up, with heaps of information; however, it would be good for this to be incorporated either into the main display at the side of the screen, or even better, next to the features that you may be querying in a ‘What’s This?’ manner as you go through the process, rather than having to open it all in a separate window.",
    "Used with a 2016 13-inch Macbook Pro, the calibration process was impressively brief, with it taking around 74 seconds on average for the calibrator to measure the targets being displayed by the software – it does make you wonder why this couldn’t have always been the case before.",
    "You then have the option to check before and after views of the sample images (or your own) so that you can appreciate the degree of change (if any). With auto brightness settings disabled, we did notice very small shifts in brightness between repeated calibrations, although color output stayed consistent.",
    "The Spyder Cube has a handy tripod mount at its base and a small loop on its top, enabling it to be hung if needed, and it comes with its own little pouch to keep its sides clean. In terms of its performance there's not much to speak of; it's a simple tool and it does what you'd expect it to. It's clearly more hardy than a white balance card and will no doubt last longer, so all you really need to do is make sure to keep it in its pouch when not in use. You also need to be careful not to capture images with too much noise, as this will affect your results when using the white balance pipette or similar later on.",
    "Similarly, the SpyderCheckr does what's expected of it, and it's a useful way to check and balance color between two different cameras you may be using. The casing protects the panels from premature fading, and a fade checker built into the case also gives you an idea of when the targets may no longer be showing what they should be.",
    "Like the other products, Spyder LensCal can be mounted on a stand when needed, with a bubble level giving you a good idea of accurate positioning. By focusing on the black and white target and examining subsequent images, you have a clear idea as to whether focus needs to be fine- tuned through the camera body. Again, it's a simple tool, and does what it does well. It also folds down flat for easy storage if you don't want to keep it in the case.",
    "There’s no issue with the Spyder Cube and Spyder Checkr, which both do what they ought to do well, although they're probably best suited to users capturing in very controlled environments (particularly in tricky mixed lighting), rather than the average photographer who may be faced with constantly changing conditions outdoors. Spyder LensCal is also useful, particularly if you use a DSLR with a fast glass; it’s a simple device, but then it doesn’t really need to be any more complicated.",
    "Viewed in isolation, the SpyderX Elite is certainly a very good and speedy calibrator that makes the process as pain-free as possible. Color management isn’t exactly the sexiest subject, nor the easiest to grapple with if you’re new to it, so it’s great that the software makes the process a doddle – and that it's so fast.",
    "So what don’t we like? The USB-A port might mean you need an adapter, and we reckon the software’s interface could do with an overhaul to make better use of space.",
    "If you regularly calibrate your display and like the idea of being able to do the whole thing in under 90 seconds, and if you feel that the other three components would serve your shooting well, then the SpyderX Capture Pro makes a lot of sense, as it saves you a fair chunk of cash on buying everything separately. Otherwise, we reckon the older Spyder5 Capture Pro package would make more sense, as we found the Spyder5 Elite calibrator to be a sound performer, and the remainder of the package is identical."
  ],
  "headers": {
    "1": "Features",
    "10": "Design and performance",
    "20": "Verdict"
  },
  "links": {
    "Spyder5 Elite": "https://www.techradar.com/reviews/pc-mac/monitors-and-projectors/datacolor-spyder5-elite-1294965/review"
  }
}