{
  "source": "https://www.techradar.com/reviews/samsung-55-inch-8k-qled",
  "title": "Hands on: Samsung 55-inch 8K QLED review",
  "category": "audio-visual",
  "updated": "2020-02-26T12:08:19Z",
  "author": "olivia-tambini",
  "summary": "8K for the average home",
  "verdict": "At a first glance, it looks like Samsung could have the answer to bringing 8K TV to the masses – now we just need content creators like Netflix, Amazon Prime, and YouTube to catch up.",
  "pros": [
    "Smaller size suitable for more homes",
    "Stunning 8K images",
    "Impressive brightness and color"
  ],
  "cons": [
    "Still very expensive",
    "No Dolby Vision support"
  ],
  "article": [
    "When Samsung debuted its first 8K QLED TV – the Q900R – it was mightily impressive, and mightily inaccessible. And while Samsung says QLED TV sales have increased by \"200% year-on-year\", owning an 8K TV is a pipe-dream for many.",
    "Coming in 65, 75, 82, and 98-inch variants (and costing upwards of $5,000), these audiovisual behemoths are hardly suitable for the average home, and with precious little native 8K content available out there, why would you spend so much money on those extra pixels?",
    "Well, now Samsung could have the answer, with the launch of a 55-inch variant of its impressive Q900R TV.",
    "It will be available in \"over 30 countries\" from September, but Samsung hasn't revealed any firm release dates.",
    "The 55-inch Q900 QLED 8K will cost you $2,499 / £2,999 (around AU$3,700) judging from Samsung's own website – although that's apparently a saving of $1000 off the $3,499 retail price.",
    "There's not a huge difference between the new 55-inch model and the flagship 85Q900R model – it's just smaller.",
    "That's not insignificant though; by releasing a smaller, more affordable version of the Q900R, Samsung has found a way to make 8K televisions more accessible. Having an enormous 98-inch screen that costs $69,999 clearly won't appeal, or be feasible for everyone.",
    "For those that aren't familiar with Samsung's 8K QLED, a thin, dark frame wraps around the screen, with a pair of king-sized feet tucked under each bottom corner – and thanks to this new, smaller model, you shouldn't have too much trouble finding a suitable TV stand to place it on.",
    "Like its larger siblings, all connections are put through an external 'One Connect' box, that jacks into the TV via one cable; it carries four HDMI 2.0 ports, three USBs, Bluetooth, and support for wired and wireless networking. This is a really nice touch that prevents a mess of cables hanging down from your flashy 8K display (which we think would somewhat ruin the effect).",
    "Otherwise, there's not much else to say about the design of the 55-inch Q900R – it looks sleek and functional, but it's not as innovative as The Wall, for example.",
    "Like other mid-high end Samsung TVs, this 55-inch model uses the ‘Eden 2.0’ smart TV system .",
    "With its straightforward Smart TV interface, you'll having no problem navigating apps like Amazon Prime Video, Netflix, and YouTube, all of which support 4K HDR playback.",
    "What they don't support, is 8K (yet, anyway). However, Samsung is keen to point out that more and more 8K content is on the way, with the Rugby World Cup being broadcast in 8K from September 20, as well as the 2020 Olympics.",
    "Samsung's Quantum AI Processor means that the 55-inch Q900R should be just as fast as its larger siblings.",
    "Although we only spent a short time with the new 55-inch model, we felt it looked just as good as its larger siblings - although the pure spectacle of 8K content is diminished somewhat by its smaller size.",
    "Like the other models in the range, it boasts incredible brightness and color; as we watched Samsung's 8K promo video, we were treated to the vivd reds of a parrot nestled in a treetop, vast, breathtaking landscapes, and vibrant firework displays.",
    "While we can't speak to the effectiveness of Samsung's 8K AI upscaler in this particular model, we'd be surprised if it wasn't as effective as that included in the other models.",
    "So far, we're impressed with Samsung's 55-inch 8K QLED – and while the specs and features are pretty much identical to the other variants in the range, the new, smaller size is a game changer.",
    "It means that 8K televisions can finally find a place in the average home, where space is at a premium and spending upwards of $5000 on a flashy display is simply oiut of the question.",
    "It's not cheap by any means, and while 8K content is on the rise, it's by no means commonplace – if you do most of your watching via Netflix, you may as well wait until the streaming platform starts offering 8K content.",
    "When it does, this TV could be a fantastic investment."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "10": "Smart TV (Eden 2.0)",
    "14": "8K performance",
    "17": "Early verdict"
  },
  "links": {
    "Q900R": "https://www.techradar.com/reviews/hands-on-samsung-q900r-8k-qled-tv",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "8K": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "Q900R TV": "https://www.techradar.com/reviews/hands-on-samsung-q900r-8k-qled-tv",
    "The Wall": "https://www.techradar.com/news/samsung-the-wall-microled-tv",
    "smart TV system": "https://www.techradar.com/news/best-tv",
    "Amazon Prime Video": "https://www.techradar.com/news/heres-whats-coming-to-amazon-prime-soon",
    "Netflix": "https://www.techradar.com/best/best-netflix-shows"
  }
}