{
  "source": "https://www.techradar.com/reviews/canon-pixma-g6050",
  "title": "Canon Pixma G6050 review",
  "category": "computing",
  "updated": "2021-03-03T17:33:09Z",
  "author": "jim-hill",
  "summary": "Refillable tanks give this inkjet an advantage in the office",
  "verdict": "It’s not as fast as a laser, but thanks to the generous amount of ink in the box, this rock steady inkjet can churn out equally crisp text documents at a more economical rate and make a decent fist of photos.",
  "pros": [
    "Bold pigment black text",
    "Strong companion app",
    "Lots of ink in the box",
    "Neat ink tank design"
  ],
  "cons": [
    "Slow to print",
    "Small display",
    "Unintuitive interface",
    "No front USB port"
  ],
  "article": [
    "It’s hardly surprising that the trend for refillable ink tanks is growing when you consider the savings that can be made over a cartridge-based system.",
    "The Canon Pixma G6050 integrates four ink reservoirs in a surprisingly compact three-in-one device and comes with a generous six bottles of ink in the box. That’s enough to print 18,000 black and white pages and 7,700 in colour. It has enough room to load up 350 sheets of paper and can be easily accessed via a USB cable or Wi-Fi with an intuitive smartphone app for cloud printing and scanning. In short, it it well specified for use in a small office that needs to turn out lots of documents and photos.",
    "At around £300 (about US$380, AU$550) the Canon Pixma G6050 looks expensive alongside other office inkjets with more features, until you consider the six bottles of ink (three black and three colour) that come in the box. Take that into consideration and the Canon Pixma G6050 looks like a bargain.",
    "The Canon Pixma G6050 integrates its four large ink tanks into a surprisingly compact design. There’s clearly a design advantage in doing away with bulky plastic ink cartridges because there’s room inside for a fairly deep 250-sheet main paper tray. You can load another 100 sheets in the rear tray and this is where photo paper and envelopes should go.",
    "It’s reassuring to see the actual ink levels yourself rather than waiting for the printer to tell you that one of your cartridges is empty. The tanks are quite large, so you won’t be refilling very often. The main paper drawer also has a clear plastic window allowing you to see at a glance how much paper is in there.",
    "Unlike Canon’s other Pixma printers, which are dominated by a large colour touchscreen, the new G series has only a two-line mono LCD in its tilting control panel. It’s a disappointing step backwards, but a necessary sacrifice in order to gain the ink tanks while keeping the cost down. There’s no SD Card slot or front USB port for the same reason. The A4 sized scanner bed is on top and if you don’t really need the scanner, then the more affordable Pixma G5050 is essentially the same machine without the scanner.",
    "Being a three-in-one device means you can print, scan and copy. There’s no fax facility, but there are plenty of other key features. It can automatically print both sides of the page for instance, and it can handle all sizes of paper up to A4. That includes glossy photo paper, envelopes and parcel labels, which can all be loaded into the rear tray.",
    "There are USB and Ethernet ports at the rear, and with Wi-Fi built in, you can also connect wirelessly via your network or using Wi-Fi Direct. AirPrint, Google Cloud Print, PictBridge and Canon’s own Pixma Cloud Link are all available for easy cloud printing.",
    "The print resolution is 4800x1200 dpi, while scanning is at 1200 x 2400 which are both reasonably high resolutions and promises strong copying functionality. The quoted print speed is rather slow at 13 ipm in mono and only 6 ipm in colour.",
    "So what features are missing? Well, there’s no ADF (automatic document feeder) or fax and no NFC connectivity or flash memory card slot for photographers. Sadly, there’s not even a front USB port for printing directly from a thumb drive either. It’s a pity there are only four inks available too, as other Canon printers often use five or even six colours to compose a photo. In this case, the black ink is a pigment (rather than a dye), which is great for text documents, but there’s no additional black dye which is better for printing photographs.",
    "Setting up the Canon Pixma G6050 involves first fitting two fine inkjet cartridges, which seems surprising for a supposedly cartridge-less system. However, these two small carts do not have to be replaced.",
    "When in place, you can then pour in the ink from the the bottles provided. The nozzles are shaped so that you can fill each tank to the top without spilling a drop. However, it would be possible to pour the wrong colour into the wrong tank, so do be careful. The tanks are stoppered with a rubber seal, although we wouldn’t advise storing this thing on its side if you have to put it back ins box with ink in the tanks.",
    "Unlike similar Canon printers, the Pixma TS8050 for instance, there’s no setup wizard to help you connect to your wireless network or print out test pages in order to check print head alignment. Canon’s companion app will get you connected to Wi-Fi, so you can use your smartphone to type in the Wi-Fi password, but it won’t give you access to the printer’s settings.",
    "Unfortunately, the interface is rather unintuitive compared to most modern printers and the two-line display is limiting. It’s a case of squinting at the small display and cycling through lots of option using the two cursor buttons to find and change each setting.",
    "When you load paper in the tray, or slip a new sheet into the rear tray, the display will ask you to choose the paper type which is somewhat tedious using the two cursor buttons and on a couple of occasions we had to turn the machine off and on again to force it to recognize the paper that was correctly loaded.",
    "The Canon Pixma G6050 prints slowly, but steadily, turning out mono pages at around 13 pages per minute. It prints quite quietly and text documents look particularly crisp and bold. The black pigment ink used stands out well, giving individual characters a crisp clarity right down to very small point sizes. Pages of text emerge with the consistency and quality you might expect from a laser printer, albeit at a much slower rate. And in terms of cost per page, it actually works out cheaper.",
    "Colour documents also show good consistency and detail. They emerge at the even slower rate of around six pages per minute and the colours look a little muted compared to other inkjets, but they are perfectly acceptable. Photographs, however, do look a little too subdued in terms of colour. Blues and reds could be said to be more natural in appearance than many overly vibrant inkjet printers. However, greens look a little washed out and blacks appear rather grey. The level of detail is high and in other respects, photo prints look fine on photo paper, they just lack the colour fidelity achieved by Canon’s five and six-colour systems.",
    "We experienced only one paper jam during the test and successfully printed onto envelopes and stickers without a problem. Duplex printing is slow, but successful and it’s not only limited to A4 paper. It can also duplex print A5 and B5 pages.",
    "Scanning documents to a PC is very straight forward and the 1200 x 2400 resolution ensures it is good and sharp. Photocopied documents also look very faithful in terms of detail, however, there is a slight softening of the colours in the copied document.",
    "Aside from luxuries like NFC connectivity and front ports for flash memory, the Canon Pixma G6050 is well featured with a good scanner and auto duplexing. The teeny display is a little frustrating if you have become used to a touchscreen interface and this printer is by no means fast, but it prints accurately and reliably and text documents look great. Photo prints a fine too, just not as vivid as some inkjets can manage. The main advantage here then is the refillable ink tank system which makes inkjet printing far more economical than it ever was with cartridges."
  ],
  "headers": {
    "3": "Design and build",
    "6": "Features and specifications",
    "10": "Setup and operation",
    "15": "Performance",
    "19": "Final verdict"
  },
  "links": {
    "Canon Pixma G6050": "https://www.canon-europe.com/printers/pixma-g6050/",
    "Pixma TS8050": "https://www.techradar.com/reviews/canon-pixma-ts8050"
  }
}