{
  "source": "https://www.techradar.com/reviews/tp-link-kasa-filament-smart-bulb-kl50-review",
  "title": "TP-Link Kasa Filament Smart Bulb (KL50) review",
  "category": "appliances",
  "updated": "2019-10-29T13:06:51Z",
  "author": "gerald-lynch",
  "summary": "Trendy filament stylings with a smart twist",
  "verdict": "Easy to set up and ready to be voice controlled in minutes, the TP-Link KL50 filament smart bulb is great value.",
  "pros": [
    "Stylish vintage looks",
    "Easy to set up",
    "Inexpensive"
  ],
  "cons": [
    "Some app hiccups"
  ],
  "article": [
    "Smart home gear, from connected light bulbs to smart locks, are well regarded for their convenience and energy saving credentials – but they don’t always win over those picky about their interior design. Connected gadgetry often leans more towards “tech” than it does towards “design”, leaving some home decorators in the cold.",
    "The TP-Link Kasa Filament Smart Bulb (aka model number KL50), is a welcome addition to a style-conscious smart home then, offering an inexpensive way to add vintage-looking filament bulbs to a modern connected home ecosystem.",
    "The KL50 smart bulb from TP-Link’s Kasa range can be picked up now for an RRP of £14.99 (around $20 / AU$28). That puts it among the more affordable smart filament bulbs we’ve seen, half the price of similar-styled Philips Hue bulbs.",
    "Coming in either E27 screw-in or B22 bayonet lock-in bulb types, the KL50 smart bulb can be bought in fitting configurations that should fit most standard fixtures or lamps. Beneath the glass of its standard-sized bulb is where it gets a bit snazzy though, with a warm crossed-filament element that has a vintage feel, despite the bulb’s smart credentials.",
    "The KL50 is Dimmable and has a “soft white” temperature of 2700K. Though it’s not a color-changing bulb, the light it gives off is welcoming, with a relaxing glow when not blasting out at its surprisingly-bright 100% brightness intensity setting. Though it’s a 7W energy-saving bulb, its actual brightness output feels closer to an old-school style 60W bulb – more than enough to comfortably read by.",
    "Setting up the TP-Link Kasa Filament Smart Bulb was a piece of cake. It was simply a matter of screwing it into a lamp, turning on the power, downloading the accompanying Kasa iOS or Android app and letting it locate the bulb.",
    "The app did much of the work, intelligently pairing the bulb with a Wi-Fi network, and prompting any firmware update that needed to be carried out. Note that there’s no need for an additional smart hub here either – your Wi-Fi router is all that’s needed to make the bulb speak to your Kasa app.",
    "Where it did struggle a bit was with Alexa integration. Though the bulb supports both Google Assistant and the Amazon Alexa voice helpers, the TP-Link app didn’t seem to enjoy pairing with Amazon’s service. Instead, we had to open up the Amazon Alexa app itself in order to pair the KL50 with our wider smart home system, despite the TP-Link instructions prompting us to do it within the Kasa app itself.",
    "Once the Alexa hiccup was smoothed over, everything worked fantastically. We were able to add the KL50 to groups, make it part of routines with other devices, and control its brightness with voice commands using an Amazon Echo speaker. It responded quickly to all over-the-air commands, and remained stable even when part of a complex set of instructions.",
    "The Kasa app has a few nice features not always present in other smart bulb applications, too. As well as your usual brightness and power controls (and the ability to set preset values for precise brightness tweaks), there’s also a scheduling option which powers the bulb on based on your preferred times of day, and an energy saving monitor. It’s comparing energy savings against regular 60W bulb (though you’ll have to figure out what the kW differences mean in actual cash yourself.)",
    "A simple-to-use and attractively glowing smart bulb, the KL50 TP-Link Kasa Filament connected light bulb is an affordable way to add some vintage flair to your growing smart home."
  ],
  "headers": {
    "2": "Price and availability",
    "3": "Design",
    "5": "Set-up and installation",
    "8": "Features and performance",
    "10": "Verdict"
  },
  "links": {
    "Philips Hue bulbs": "https://www.techradar.com/reviews/gadgets/appliances/philips-hue-1124842/review",
    "Amazon Echo": "https://www.techradar.com/reviews/amazon-echo-2020"
  }
}