{
  "source": "https://www.techradar.com/reviews/g-technology-g-drive-mobile-ssd-500gb",
  "title": "G-Technology G-Drive mobile SSD 500GB review",
  "category": "computing",
  "updated": "2019-03-28T19:00:06Z",
  "author": "desire-athow",
  "summary": "Solid, rugged, fast, and justifiably expensive",
  "verdict": "The G-Drive mobile SSD is the only rugged drive in this price range with a five-year warranty (most others offer three-years). You will be paying a premium for it, though – as much as 40% on the 1TB model. This drive is speedy and rugged but there are equally capable drives available for less.",
  "pros": [
    "Interesting design",
    "An industry-leading five-year warranty"
  ],
  "cons": [
    "Expensive",
    "Need to format first when using Windows",
    "No support for encryption"
  ],
  "article": [
    "You won’t buy the G-Technology G-Drive mobile SSD for its speedy performance – get its bigger brother, the mobile Pro instead – or for its looks – in that case, the LaCie Mobile SSD might be a better bet. Instead, this external SSD from a Western Digital Corporation brand focuses on the creative audience who want a solid storage device that can survive bumps and drops, and still deliver.",
    "The G-Drive is available in three capacities: $129.99 for the 500GB version, $209.99 for the 1TB model, and $389 for the 2TB drive, prices which are way higher than the competition.",
    "The G-Drive mobile SSD sports a big G logo on the front and a rugged look. It is protected by an aluminum core, and clad in rubber except for the top cap where the USB Type-C connector is located. Slits in the rubber enclosure allow the SSD to cool.",
    "You should be able to open up the drive and replace the storage component inside – assuming you can get the tool to undo the two screws keeping the whole thing in place.",
    "The drive, which comes with a rather startling five-year warranty, features an IP67 water and dust resistance rating, a 3-meter drop protection (with tests carried out on a carpeted concrete floor), and a 1000lb crushproof rating. It is also bundled with a USB 3.0/2.0 cable adapter for backwards compatibility.",
    "With dimensions of 94 x 50 x 14.5mm and weighing under 100g, it is small, but not as portable as some of its rivals – more on that later.",
    "The G-Drive mobile SSD has a USB 3.1 Gen 2 port which in theory can transfer data at up to 10Gbps, twice what traditional USB 3.0 can achieve. However, we paired it with one of the latter and couldn’t achieve the maximum rated transfer speeds of up to 560MBps.",
    "Our tests, carried out with CrystalDiskMark, Atto and AS SSD, yielded similar results with read and write speeds between 430MBps and 441MBps, roughly what you’d expect from a USB 3.0 port. A 10GB file was transferred in 73.8 seconds, which translates into a real-life transfer speed of 136MBps.",
    "The drive uses 3D NAND which delivers lower power consumption and cheaper prices. It was detected as a SanDisk X600, an M.2 SATA model that features WD’s 64-layer 3D NAND flash.",
    "Note that you will need to reformat the drive first in order to use/mount it with Windows, a process that takes a few minutes. The drive was not warm during our tests, and there’s no bundled software as is often the case with competitors. As for the bundled cables, we just wish they were a bit longer than 12cm.",
    "It is not difficult to understand why Samsung’s T5 portable SSD is the current bestselling external SSD at Amazon. It is tiny, well-built, speedy, and benefits from the expertise of the world’s largest NAND flash producer. Granted, it doesn’t have a long warranty (but is covered for three-years), nor does it come with an IP rating (i.e. it isn’t waterproof). However, the Samsung drive is shockproof, with hardware encryption for added protection, and at $178 for the 1TB model and $98 for the 500GB effort, it’s significantly cheaper than the G-Drive mobile SSD.",
    "SanDisk, a brand that sits alongside G-Drive in the Western Digital Corporation portfolio, sells the Extreme portable external SSD. It is fully rugged and retails for less than the G-Drive. While it has a shorter warranty, similar to the T5, it’s slightly smaller than the G-Drive mobile SSD.",
    "Even cheaper is the Adata SE730H external SSD which sells for $170 and $95 for the 1TB and 512GB models respectively. The Adata is waterproof and shockproof, tiny, and has a three-year warranty. Like the G-Drive mobile SSD, it has a USB 3.1 Gen 2 Type-C connector which allows it to surpass 500MBps with compatible host machines.",
    "It might be a little-known brand, but the APrime iNeo uses a WD Blue SSD (likely to be similar to what’s inside the G-Drive) in a MIL-STD-810G rugged case. Like all the other alternatives listed here, it comes with a three-year warranty and a Type-C (USB 3.1 Gen 2) connector. Best of all, it is $60 cheaper than the G-Drive at $149.99. On the flipside, though, this product is far bulkier as it uses a standard 2.5-inch drive.",
    "Is $35 too much to pay for an extra two years’ worth of warranty? Some might argue that this will be worth it, for peace of mind, while others will doubtless believe that the 35% premium the G-Drive mobile SSD charges over a roughly similar Adata SE730H is unpalatable.",
    "We recommend going for a 1TB model compared to the smaller capacity – five years is a lifetime in the world of flash memory, and while it is commendable that G-Drive offers such a long warranty, before that period is up, it is likely that professionals – whom the G-Drive mobile SSD targets – will have moved on to faster, more reliable and/or cheaper storage devices.",
    "You will need a compatible connector in order to make the most of its transfer capabilities. Older systems will see little benefit, if any. For more cautious types, we recommend using a cloud storage provider to back up your files. WD has its own called Upthere and we are surprised that this is not included as standard here."
  ],
  "headers": {
    "2": "Design",
    "6": "Performance and usage",
    "10": "Competition",
    "14": "Final verdict"
  },
  "links": {
    "LaCie Mobile SSD": "https://www.techradar.com/reviews/lacie-mobile-ssd-2tb",
    "$129.99 for the 500GB version": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB0765PBZNL%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7928316726192960000-20",
    "$209.99 for the 1TB model": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB0765QBGZZ%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1130156509566243800-20",
    "$389 for the 2TB": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB0765LJWFZ%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1302180350315935500-20",
    "Samsung’s T5": "https://www.techradar.com/reviews/samsung-portable-ssd-t5",
    "Extreme portable external SSD": "https://www.techradar.com/reviews/sandisk-extreme-portable-ssd-1tb",
    "Adata SE730H": "https://www.techradar.com/reviews/adata-se730h-external-ssd",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Upthere": "https://www.techradar.com/reviews/wd-upthere"
  }
}