{
  "source": "https://www.techradar.com/reviews/asus-designo-curve-mx38vc",
  "title": "Asus Designo Curve MX38VC review",
  "category": "computing",
  "updated": "2019-03-19T16:27:59Z",
  "author": "jeremy-laird",
  "summary": "Asus’s 38-inch mega monitor is a sight to behold",
  "verdict": "Asus’s new 38-inch mega monitor is a superwide sight to behold and includes wireless device charging, but lacks HDR visuals.",
  "pros": [
    "Huge desktop real estate",
    "Good quality IPS panel",
    "Excellent connectivity"
  ],
  "cons": [
    "No HDR or high refresh",
    "Very expensive"
  ],
  "article": [
    "Super-wide PC monitors with 21:9 aspect ratios are nothing new. Ditto super-wide screens with curved panels. But while we’ve seen scores of such monitors measuring 29 inches, 34 inches and 35 inches across, Asus is going for the more novel 38-inch niche with its latest high-end monitor, the Designo Curve MX38VC.",
    "This isn’t actually the first time a 38-inch 21:9 monitor with a 3,840 by 1,600 pixel native resolution has hit the market. LG has that honor with the 38UC99 which debuted in 2016 but didn’t become widely available until 2017. But 38-inch 21:9 monitors like this remain both unusual and relatively exotic.",
    "Indeed, a little like the LG competition, the Asus Designo Curve MX38VC has taken a while to hit the market. Asus first showed the MX38VC off in summer 2017. Perhaps because of that delay, the MX38VC lacks some features that have since become more common at the high end, including high refresh rates and HDR support.",
    "Whatever, the MX38VC has been a long time coming. Time to find out if the wait was worth it.",
    "This class of PC monitor is never going to be cheap. At $1,099 (about £1,000, AU$1,500) Asus has priced the Designo Curve MX38VC pretty much in parallel with its main competition, the LG 38UC99.",
    "In fact, it’s very likely the two use the same LG-manufactured LCD panel. But one thing is for sure, with 38 inches of quality IPS technology this is a premium LCD panel.",
    "The headline grabbing feature here is inevitably that 38-inch LCD panel. Strictly speaking, it’s a 37.5-inch item with a native resolution of 3,840 by 1,600 pixels and a 2300R curvature.",
    "That pixel count means you’re getting the equivalent of a 4K monitor across the horizontal, but fewer vertical pixels. The resolution and panel size combo also make for 109 pixels per inch, which isn’t particularly stellar from a pixel density perspective. A high DPI display this is not.",
    "The panel itself is capable of 8-bits per channel of color, with FRC dithering bumping that up to 10-bit and thus the claimed 1.07 billion colours. The panel type is IPS, which bodes well in terms of viewing angles and colours. However, this isn’t a cutting edge display with a huge colour gamut, local dimming or HDR support. It’s a pretty conventional LCD monitor with a single LED backlight, maximum brightness of 300cd/m2 and contrast rated at 1,000:1.",
    "However, that isn’t to say it doesn’t have a few extra tricks you may not see elsewhere. Probably the standout feature is the Qi wireless charging dock built into the base. It’s configurable in the OSD menu to function even when the display is in sleep mode.",
    "There’s also a USB Type-C port with support for up to 60W of power delivery, so you can charge your laptop at the same time as driving the display. And all with one cable.",
    "Another unusual feature is the Harmon Kardon sound system complete with support for Bluetooth audio streaming. Asus is taking integrated audio seriously much more seriously with this screen. The speakers in most monitors are very much an afterthought.",
    "In this age of ultra-punchy HDR visuals, the core image quality of the Asus Designo Curve MX38VC is a little underwhelming. There simply isn’t the contrast, the saturation, the plain old brightness of the latest HDR monitors with powerful backlighting and local dimming.",
    "The sheer size of the display also means you don’t get the crispness and sharpness that many 4K-class screens offer. Spread over 38 inches, those 3,840 pixels are each much larger than those of, say, a 27-inch 4K monitor or a 32-inch model.",
    "However, the MX38VC still offers a lot of pixels in outright terms and with them a huge amount of usable desktop space. Most super-wide screens feel constricted by limited vertical resolution. But with 1,600 pixels, the MX38VC offers a decent view of the vertical aspect of documents and webpages, while enabling the viewing of multiple windows, documents and web browsers side-by-side.",
    "The 2300R curvature is certainly helpful in that regard, ensuring the far edges of the screen aren’t viewed at an excessively oblique angle. In terms of absolute image quality, the IPS panel ensures good performance.",
    "The viewing angles are excellent, while black and white scale test images show plenty of detail at default settings. As a productivity machine, the MX38VC has a lot going for it.",
    "It’s not half bad as a gaming panel, too. OK, you don’t have high refresh on offer. But there is FreeSync support up to 75Hz. And there’s no question games look stellar stretched across the 38-inch 21:9 panel. It’s truly a sight to behold and definitely more immersive than a smaller, more conventionally proportioned PC monitor.",
    "But what of that Harmon Kardon sound system? It’s far, far better than the speakers fitted to most monitors. There’s reasonable dynamic range and definition on offer, even if the outright bass levels are limited.",
    "Admittedly, you could exceed the sound quality with a fairly cheap 2.1 speaker system. But there’s appeal in the simplicity of keeping it all integrated into the the display. Certainly, these speakers are more than just backup items to be suffered in the short term when a proper speaker solution isn’t available. They’re much better than that.",
    "As for the Qi charging dock, it works pretty much as advertised. When you combine the Qi charging with the decent quality sound system and USB-C connectivity, the result is a monitor that promises a particularly clean installation with a very low cable count.",
    "A single cable would allow you to drive the display for both video and audio, power a laptop, all the while you can wireless charge your smartphone. If you have a strong aversion to cable clutter, the MX38VC should definitely be on your shopping list, that’s for sure.",
    "With HDR technology entering the mainstream, a $1,000/£1,000 display that only offers SDR visuals isn’t an easy sell. However, the Asus Designo Curve MX38VC is still a compelling PC monitor.",
    "Partly that’s thanks to the sheer scale of the 38-inch IPS panel. It may not be high DPI, but it does deliver loads of usable desktop real estate. It also makes for a very immersive gaming experience, even without 100Hz+ refresh capability.",
    "What’s more, the combination of USB-C connectivity, remarkably good integrated audio and a Qi charging dock adds significant additional appeal, especially for anybody who seeks minimal cable clutter.",
    "Overall, this is a very expensive display that conspicuously lacks some high end features, most notably HDR certification. But if you can afford it and are willing to overlook the limitations, it’s still a pretty wonderful LCD panel."
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Design and features",
    "12": "Performance",
    "22": "Verdict"
  },
  "links": {
    "38UC99": "https://www.techradar.com/news/computing-components/lg-offering-up-huge-21-9-curve-gaming-monitor-1327357"
  }
}