{
  "source": "https://www.techradar.com/reviews/garmin-forerunner-235",
  "title": "Garmin Forerunner 235 review",
  "category": "wearables",
  "updated": "2019-12-04T10:46:07Z",
  "author": "kieran-alger",
  "summary": "Age is just a number",
  "verdict": "The Garmin Forerunner 235 still manages to stand out, despite its age. A lower price helps, but the depth and breadth of its tracking skills and training insights ensure it can still compete with newer running watches.",
  "pros": [
    "Resting heart rate insights",
    "Sharp looks, lightweight design",
    "Good value"
  ],
  "cons": [
    "Intermittent syncing issues",
    "A bit plastic",
    "Sleep tracking needs work"
  ],
  "article": [
    "These days we expect running watches to be more than distance and pace trackers. Increasingly, we want them to coach us too, with insights on how to improve form and train smarter.",
    "It’s why the latest devices offer ever-more-detailed running dynamics, heart rate analysis and training feedback. It’s also why you’d think that a watch launched more than two years ago might struggle to keep up.",
    "However, thanks to some future-proof tech at launch and subsequent updates the Garmin Forerunner 235 does just that. Despite its age it’s still a viable choice for runners with a keen eye for performance and a bargain.",
    "Let’s be straight, there are more feature-rich watches out there, the Garmin Forerunner 645 for a start, which means the 235 isn’t even the best Garmin watch money can buy, but before you click away in a fit of early adopter haste, it’s worth giving the Forerunner 235 careful consideration, because this is a powerful lower-end watch with a lot going for it, not least its price.",
    "Because of the Forerunner 235’s age you can pick it up much cheaper than its original £299.99 / $329.99 / AU$469 RRP. It came out around the world toward the end of 2015, so it's several years old now.",
    "We’ve seen it drop a full hundred pounds below its original price in the UK, and if you shop around you'll likely find similar discounts in other countries, so if you’re looking for lots of run-tracking capability but on a budget, that should make it a very attractive option.",
    "If you see it for under £160 in the UK, snap it up right away, because that's a really great deal for something that's still not been really replaced by Garmin and does a good job.",
    "Sport watches are rarely stylish and though the Forerunner 235 is still unmistakably a Garmin, it’s among the better-looking run trackers you can buy. It comes in three color combinations: black and frost blue, black and red and black and grey, and there’s some smart subtlety to the latter two.",
    "There’s a classic round-faced, 1.23-inch diameter color screen that’s crisp and easy to read in most light, with enough real estate to display up to four stats on two customizable screens.",
    "If you’re a fan of touchscreens then the lack of one here might disappoint, instead you get five side buttons to navigate your way through Garmin’s relatively simple menus.",
    "The perforated soft silicone strap makes for a more comfortable, less sweaty run, particularly useful over longer distances and considering you’ll need to wear this a little tighter on the wrist to get the best accuracy from the built-in optical heart rate sensor.",
    "That said, comfort is compromised somewhere thanks to the fact the Forerunner 235’s sensor protrudes more than you’ll find on the likes of the Polar M430 and it can dig in a little on longer runs.",
    "The buttons are responsive and easy enough to use on the move though and the whole thing weighs in at just 42g, which makes it one of the lighter watches you can strap on, though some people might not like the overall plastic feel that’s clearly helped shave off some grams."
  ],
  "headers": {
    "4": "Garmin Forerunner 235 price and availability",
    "7": "Design, comfort and usability"
  },
  "links": {
    "Garmin Forerunner 645": "https://www.techradar.com/reviews/garmin-forerunner-645-music-review",
    "best Garmin watch": "https://www.techradar.com/best/garmin-watch",
    "Polar M430": "https://www.techradar.com/reviews/polar-m430"
  }
}