{
  "source": "https://www.techradar.com/reviews/audeze-mobius",
  "title": "Audeze Mobius review",
  "category": "gaming",
  "updated": "2019-05-16T22:10:22Z",
  "author": "bill-thomas",
  "summary": "A new plane of gaming audio",
  "verdict": "The Audeze Mobius may be prohibitively expensive for many gamers, but that doesn’t mean it’s not absolutely worth the price of entry. The excellent sound quality and comfort easily make this one of the best gaming headsets we’ve ever used.",
  "pros": [
    "Fantastic sound quality",
    "3D audio is neat",
    "Comfortable"
  ],
  "cons": [
    "Expensive",
    "Bog-standard mic"
  ],
  "article": [
    "When you’re looking for one of the best PC gaming headsets, you’ll typically have to sacrifice aesthetics, sound quality or comfort. So, when we get our hands on something like the Audeze Mobius we pay attention – this is a planar magnetic headset, which automatically elevates the sound quality above what many competing gaming headsets can offer.",
    "But, that said, this headset is more than its high-end drivers. The Audeze Mobius features a unique 3D surround system, powered by Waves Nx, that tracks the movement of your head to deliver an immersive audio experience that enhances every game you play.",
    "If that all sounds awesome, it is, but this audio experience comes with a premium: The Audeze Mobius will set you back $349 (£349, AU$599) – making it’s truly in a league of its own. The closest competitor in terms of price would be something like the $299 (£299, AU$489) Astro A50 or the SteelSeries Arctis Pro wireless at $329 (£299, AU$449).",
    "And, while the Audeze Mobius doesn’t have the ‘gamer’ design or any bright LEDs, this headset blows away the competition where it really matters: sound quality. This is a gaming headset that you can comfortably use for games, movies and even music – as long as you have the cash.",
    "Forgoing any RGB-lit logos or even bright colors, the Audeze Mobius looks more like a traditional pair of headphones than a gaming headset. The model we got in for review is black, with gray metal bands that punctuate in a black textured plastic band along the top. Both this top band and the ear pads are padded with memory foam. This all combines to make for an extremely comfortable headset.",
    "Due to its premium materials, the Audeze Mobius is hefty, but not to the point where it feels exhausting to wear, and it’s just tight enough to feel snug. Finally, we’re getting the kind of PC gaming headset that you can wear through an hours-long gaming session without getting a headache.",
    "The side of each ear has a nice, patterned design, and the left earcup has all the buttons and ports. On the side of the ear cup itself, you’ll find the power button, which you can push twice to pair to the Bluetooth device of your choice, and above that is the microphone mute switch.",
    "On the side of that same ear cup, you’ll find volume and mic dials, USB-C, aux in, mic out and the 3D audio button. You can hold the button down to switch between 3D audio on, auto and manual, or just tap it while facing forward to center the audio.",
    "The ability to switch this feature off with a button press means that listening to music is much more enjoyable, and we wish the Razer Nari Ultimate had something similar for its haptic feedback.",
    "One of the best features here is the inclusion of USB-C for both charging and actually connecting it to your PC. That means we can use our laptop charger to juice up this headset in a pinch.",
    "As for the mic, it’s removable, but like most other headsets with a removable mic, it’s pretty much the weakest link. You can bend it to position it where you like, but it just doesn’t feel as rigid and well constructed as the rest of the headset. Either way, we’d rather have the removable mic here, than one that retracts into the headset for aesthetic reasons. As it stands now, the Mobius is something you could feasibly wear outside your house if you're so inclined.",
    "The Audeze Mobius sounds amazing, there’s no way around it. Typically when we review a gaming headset we go in accepting that our music won’t sound particularly great. That’s simply not true here.",
    "Whether we’re chilling out to Amy Winehouse, blasting Lil Wayne loud enough to doom ourselves to hearing aids before 40, or playing some Mozart, this headset sounds amazing. What’s particularly surprising is how neutral the sound stage is. There are a lot of gaming headsets that have really deep bass to the detriment of everything else. The Audeze Mobius have a neutral sound signature, so everything is extremely clear.",
    "But, what about all those explosions in games? Well, while it doesn’t rattle our ears like the Razer Nari Ultimate does, games (and films) sound cinematic, and we found ourselves hiding in a corner during an airstrike in Battlefield V.",
    "In fact, because of the open and neutral soundstage, certain types of games, namely RPGs, sound way better. These games don’t rely on bass for all the effects, so the Audeze tend to be much more immersive, and that’s before we even take the 3D surround sound into consideration.",
    "This isn’t the first time we’ve seen 3D audio in a gaming headset, but it is the best implementation of it by far – easily exceeding the Acer Predator Galea 500. The way this works is that the audio will shift whenever you turn your head, providing a different kind of surround sound than the 7.1 virtual sound we’re accustomed to in gaming headsets.",
    "And, because we’re using the Audeze Mobius with an Ultrawide gaming monitor, that effect was nothing short of incredible. Even running to try and kill Havel at level 1 in Dark Souls for the 50th time sounds fresh and immersive. The crickets and waterfalls in Darkroot Basin providing all the atmosphere you could want.",
    "This is one of those features that we’ve always wanted to see executed well, and we’re happy to report that the Audeze Mobius finally does it. In fact, audio performance is so good that it more than makes up for the less-than-stellar microphone. This is a headset that’s aimed at single-player experiences, and the Audeze Mobius truly excels there.",
    "It’s easy to just say that the Audeze Mobius is one of the best gaming headsets on the market and call it a day. However, the high price tag means that any recommendation has to come with a caveat: sure, it sounds great, but there are so many great gaming headsets that cost half as much.",
    "That being said, you will be hard pressed to find a gaming headset with better overall audio quality than the Audeze Mobius. It’s not the bassiest, nor does it have the best microphone, but this headset takes in-game audio to another level."
  ],
  "headers": {
    "4": "Design",
    "11": "Performance",
    "18": "Verdict"
  },
  "links": {
    "best PC gaming headsets": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675",
    "Astro A50": "https://www.techradar.com/reviews/gaming/gaming-accessories/astro-a50-gaming-headset-review-1083794/review",
    "SteelSeries Arctis Pro": "https://www.techradar.com/reviews/steelseries-arctis-pro-headset",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Razer Nari Ultimate": "https://www.techradar.com/reviews/razer-nari-ultimate"
  }
}