{
  "source": "https://www.techradar.com/reviews/macbook-pro-15-inch-mid-2018",
  "title": "MacBook Pro (15-inch, mid-2018) review",
  "category": "computing",
  "updated": "2020-11-19T16:00:56Z",
  "author": "matt-hanson",
  "summary": "Same body, big leap in power",
  "verdict": "The MacBook Pro 2018 15-inch is a powerful pro notebook with a fantastic design. However, in its bid to appeal to the mass market, it might turn off some professionals.",
  "pros": [
    "Fantastic design",
    "True Tone works well when you want it",
    "Touch Bar is improving",
    "Very good performance"
  ],
  "cons": [
    "Expensive",
    "Lack of ports",
    "Keyboard still feels a little flat"
  ],
  "article": [
    "Apple has a knack for launching new versions of its devices with a lot of fanfare, but when it released the Macbook Pro 2018, it did it so under the radar. In fact, the 2018 MacBook Pro experienced such a low-key launch, despite having much more powerful hardware and an improved keyboard. And, just like the previous generation, the 15-inch MacBook Pro arrives alongside its 13-inch counterpart.",
    "Despite its quiet release, we know that Apple still loves the MacBook Pro. And that quiet release might just be due to that fact that while the iPhone XS and iPad, along with the 12-inch MacBook, are aimed at mass consumers, the MacBook Pro has always been aimed at the creative and professional audience.",
    "This new MacBook Pro brings a level of performance (and price) that’s significantly higher than its more consumer-oriented devices, so that it meets the growing demands of its target users.",
    "However, that also doesn’t mean that Apple does want mainstream users to buy into the MacBook Pro. If you want the most powerful MacBook to date, the new MacBook Pro might be for you as well. Just keep in mind that, while the keyboard has been updated, there are still reliability issues. Although that’s hardly a deal-breaker to diehard Mac fans.",
    "Between the two sizes, there’s enough of a difference in performance to warrant two separate reviews. In this one, we’re looking at how the flagship 15-inch MacBook Pro performs in 2019, even on the heels of the release of the 15-inch MacBook Pro 2019.",
    "If you already have the device and are having issues with it, check out our guide on how to reset a MacBook Pro. Bear in mind also that both models have been recently refreshed. The 13-inch entry level model received an improved display and keyboard, not to mention a cheaper price, in July 2019. On the other hand, 15-inch model got the 8-core Intel Core i9 chips back in May 2019.",
    "As with past MacBook Pro models, the new 15-inch comes in several configurations. The base model comes with a 2.6GHz 6-core 9th-generation Intel Core i7 processor, Radeon Pro 555X GPU, 16GB of DDR4 memory and a 256GB SSD for $2,399 (£2,349, AU$3,499).",
    "Again, there’s more than just the base model – you can configure it different components to tailor to your needs (and budget), at least to an extent. If you’re doing a lot of video editing, for instance, you can upgrade the processor to a 9th‑generation Intel Core i9, while saving cash by sticking to a smaller SSD and utilizing an external hard drive, preferably with a Thunderbolt port, instead.",
    "The MacBook Pro 2018, which again has been refreshed mid-2019, can be configured to a 2.4GHz 8‑core 9th‑generation Intel Core i9 processor for $300 (£310, AU$440) more, 32GB of RAM for $400 (£360, AU$640) more and an upgrade to the AMD Radeon Pro 560X for an additional $100 (£90, AU$160).",
    "Apple also has the Radeon Pro Vega graphics on offer. This will set you back $250 (£225, AU$400) for the Radeon Pro Vega 16, and $350 (£315, AU$560) for the Radeon Pro Vega 20. However, you’ll have to opt for at least a 512GB SSD if you want this graphics option.",
    "As far as storage, you can upgrade to a 512GB SSD for $200 (£180, AU$320), 1TB SSD for $600 (£540, AU$960), 2TB SSD for $1,400 (£1,260, AU$2,240) and a 4TB SSD for $3,400 (£3,060, AU$5,440). Though again, it’s worth noting that you’re better off with an external SSD drive, as you’ll find many with more storage capacity at more than half the price.",
    "The MacBook Pro 15-inch is certainly expensive, but the price of entry is worth it to many potential users. Plus, it’s great that the MacBook Pro doesn’t raise the base price over the 2017 model. You can get a notable upgrade in specs, without spending significantly more.",
    "If you’re looking for a MacBook Pro alternative running on Windows 10, the new Dell XPS 15 2018 offers comparable spec options – with up to an Intel Core i9-8950HK, Nvidia GeForce GTX 1050Ti graphics, 32GB of RAM and a 2TB PCIe NVMe SSD for $3,199 (about £2,520, AU$4,616).",
    "While this is a high asking price, it’s still cheaper than a similarly specced Macbook Pro with Radeon Pro VEGA 20 graphics, which will set you back $4,549 (£4,274, AU$6,899). That’s enough price difference to seriously consider the Dell laptop. Unless, of course, you’re wedded to macOS or want to utilize the new features that comes with macOS Catalina, which is rolling out in Fall 2019.",
    "The MacBook Pro has made a name for itself for having a beautiful, thin and light chassis that fits powerful components. And, Apple has taken an ‘if it’s not broke, don’t fix it’ approach with the 2018 model.",
    "In other words, the new MacBook Pro has an almost the same chassis design as last year, right down to its dimensions and weight. It weighs just 1.83kg (4.02 pounds), and when closed, it’s only 1.55cm (0.61 inches) thick.",
    "Anyone who loves the design of older MacBook Pro laptops will appreciate this, especially because the weight and those dimensions are incredible for a 15-inch laptop this powerful. It’s even slightly thinner than the Dell XPS 15, and a bit lighter than Microsoft’s Surface Book 2. These are arguably the MacBook Pro’s biggest Windows-based competitors, and the fact that the MacBook Pro 2018 easily beats them on power, while being thinner and lighter, is a huge win for Apple.",
    "All 15-inch models of the MacBook Pro 2018 feature the Touch Bar, a thin glass touchscreen that runs along the top of the keyboard, displaying context-sensitive buttons on its 2,170 x 60 resolution screen. These buttons change depending on the application or task that you’re performing, and are designed to give you quick shortcuts for a more seamless workflow.",
    "When the Touch Bar first made an appearance on the MacBook Pro 2016, not everyone was sold on the idea, though we ourselves were quite enamored with it. The good news is that over the years, Touch Bar compatibility has grown, encompassing every Apple app, as well as many popular third party apps like Adobe Photoshop and Google Chrome. This feature more useful than ever before, and once you get used to the new Touch Bar buttons, they really can help speed up your workflow, making it more seamless.",
    "Not that there aren’t any drawbacks. These buttons are context-sensitive and change depending on what app you’re using. This basically means you’ll never really be able to use them without checking where they are – unlike physical buttons whose locations you can quickly memorize. It’s a small criticism, but one that might make sticking to keyboard shortcuts for your most-used tasks a better option.",
    "Next to the Touch Bar is a fingerprint scanner for quickly and securely logging unto the computer as well as authorizing payments. It's fast and easy to set up, and accurately reads your fingerprint and logs you in without fuss - something that many fingerprint readers on laptops fail to do.",
    "Not everything is exactly the same, however. The keyboard just got an update, for example, which might be great news for many people, but not be good enough for others. The keyboards of previous MacBook Pros with the ‘butterfly’ switch have been criticized for having higher than usual failure rates, and suffering from issues such as ‘sticky keys.’ So much so that Apple was even forced to admit that some of its keyboards break too easily.",
    "While Apple has bragged that the MacBook Pro 2018 comes with an improved keyboard, it didn’t exactly specify that the revisions were aimed at fixing these issues. Instead, it focused on the fact that it is quieter to type on. If you’re a fast typer who likes to hammer keys while working, this improvement will at least be welcome (to you and your co-workers).",
    "While we do find the new MacBook Pro keyboard to be less noisy in practice, the shallow key travel remains, which means that the keys don’t feel quite as tactile or responsive while typing. Users who like shallower keyboards may actually prefer this design, however.",
    "A new silicone membrane not only helps keep the noise of the keyboard under control, but also stops dust from getting in and messing up the switch – a complaint many people have had with previous MacBook Pro models.",
    "Lastly, the screen also gets a number of improvements. While it still keeps its 2,880 x 1,800 resolution and 220 ppi of pixel density, it now also boasts Apple’s True Tone display tech, which debuted on the iPad Pro and is featured in the new iPhone XS, XS Max and XR. This technology senses ambient lighting in the environment you’re working in and adjusts the display so that you get a bright and vibrant image, no matter where you are.",
    "You can toggle this mode on and off in the Display section of System Preferences in macOS, and the difference is quite striking, giving the screen a warmer feel. This is a nice feature to have when you mainly work with word processing, spreadsheets or coding applications.",
    "While it’s a welcome extra however, it’s one that is aimed more at consumers rather than creative professionals. If your job involves work where color accuracy is essential, such as photo and video editing, then you might want to turn this feature off.",
    "Undoubtedly, the MacBook Pro 2018 15-inch’s thin and light form factor makes for a very stunning design. However, we also have to remember that Apple is marketing the MacBook Pro 2018 for creatives and professionals first and foremost. It’s here that we have to wonder if this thinness may be a hindrance.",
    "After all, professional devices need to put workflow above all else – that includes aesthetics. Because of its thin design, the MacBook Pro 2018 comes with just four USB-C ports, and one headphone jack port.",
    "To be fair, these are all Thunderbolt 3, which means data transfer is extremely fast as long as you have compatible devices, including that external SSD you’re currently saving money on. But, if you’re going to use legacy hardware with the MacBook Pro – like anything that requires a standard USB-A port – you’ll need to use an adapter, which you’ll have to buy separately, adding to your cost.",
    "If you want to connect to an Ethernet cable, you’ll also need an adapter. If you’re a photographer who needs to transfer photos from a memory card, you’ll need a memory card reader as well. That is, if you don't already have one.",
    "Some people will say that the lack of ports is a small price to pay for the thin and light design. That is, unless you’re a creative who requires a device with everything you need on offer and very minimal fuss. If so, you’ll soon get frustrated with the MacBook Pro’s ports limitation. That’s not exactly good news, considering that the laptop is designed for users just like you.",
    "If you look at other laptops designed for professionals, like Lenovo’s ThinkPad, they put usability above svelte design. They have a workman-like appearance, sure, and can be big, bulky and inconvenient to carry around. But, you’ll also be able to plug your hardware in quickly and easily. If compatibility and ease of use is your top priority, you may want to choose legacy hardware support over svelte design, which means the MacBook Pro might not be your most ideal option.",
    "To be fair, the stunningly-thin design of the MacBook Pro means it’s a creative’s notebook that also appeals to consumers. If you’re invested in the Apple ecosystem and want the most powerful MacBook ever made, then the MacBook Pro 2018 15-inch is going to be incredibly tempting.",
    "Just bear in mind that this unending pursuit of thinness by Apple also has other implications for the MacBook Pro. There’s some very powerful hardware crammed into the MacBook Pro’s tiny body, and the more powerful the hardware, the hotter it runs. Due to its thin and light chassis, there needs to be a very good cooling solution to keep it from overheating.",
    "And, while the MacBook Pro 2018’s cooling system does work – there’s not much annoying fan noise whirring up when performing intensive tasks like some other laptops – we’ve also seen some worrying reports that the MacBook Pro 2018 throttles the processor when it gets hot, limiting the performance of the processor to keep it from overheating.",
    "While this does happen with other laptops, the worrying thing here is how quickly the MacBook Pro 2018 seems to throttle the processor. It means that a cheaper MacBook Pro, with a core i7 processor, rather than a core i9 chip, can potentially perform better when handling processor-intensive tasks. On the upside, Apple has rolled out a macOS update to address this, which we will discuss later in this review.",
    "If you’re considering the MacBook Pro 2018 as your next laptop investment, you may want to think carefully about whether having a thin and light laptop is more important to you, or if having a more seamless workflow in your professional work is still top priority.",
    "Images Credit: TechRadar",
    "Check out our laptop buying guide video below."
  ],
  "headers": {
    "6": "Price and availability",
    "14": "Design",
    "28": "How thin is too thin?"
  },
  "links": {
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "12-inch MacBook": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/macbook-1287806/review",
    "reliability issues": "https://www.techradar.com/news/new-macbook-air-2018-keyboard-flaw-uncovered-by-youtuber",
    "15-inch MacBook Pro 2019": "https://www.techradar.com/reviews/macbook-pro",
    "how to reset a MacBook Pro": "https://www.techradar.com/how-to/how-to-reset-a-macbook-air",
    "13-inch entry level model received an improved display and keyboard": "https://www.techradar.com/news/apple-kills-the-12-inch-macbook-and-upgrades-the-macbook-pro-and-macbook-air",
    "15-inch model got the 8-core Intel Core i9": "https://www.techradar.com/news/apple-lets-loose-first-ever-macbook-pro-with-an-8-core-processor",
    "external hard drive": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "external SSD drive": "https://www.techradar.com/news/best-portable-ssd",
    "Dell XPS 15 2018": "https://www.techradar.com/reviews/dell-xps-15-2018",
    "macOS Catalina": "https://www.techradar.com/news/macos-catalina-is-here-everything-you-need-to-know-about-macos-1015",
    "Surface Book 2": "https://www.techradar.com/reviews/microsoft-surface-book-2",
    "having higher than usual failure rates": "https://www.techradar.com/news/macbook-pro-keyboards-with-butterfly-switch-appear-to-fail-more-than-older-models",
    "admit that some of its keyboards break too easily": "https://www.techradar.com/news/apple-admits-some-of-its-macbook-keyboards-break-too-easily",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-2-129",
    "XS Max": "https://www.techradar.com/reviews/iphone-xs-max-review/2",
    "XR": "https://www.techradar.com/reviews/iphone-xr-review",
    "worrying reports": "https://www.techradar.com/news/is-the-macbook-pro-2018-subject-to-excessive-thermal-throttling",
    "macOS update to address this": "https://www.techradar.com/news/apple-solves-macbook-pro-2018-throttling-issue-with-software-patch"
  }
}