{
  "source": "https://www.techradar.com/reviews/kate-spade-scallop-2",
  "title": "Hands on: Kate Spade Scallop 2 review",
  "category": "wearables",
  "updated": "2019-01-08T16:00:02Z",
  "author": "james-peckham",
  "summary": "A follow up to a solid women's smartwatch",
  "verdict": "The design of the Kate Spade Scallop 2 is similar to the last generation, but there's lots of interesting tech packed in here, making it a fully-fledged smartwatch worthy of your attention.",
  "pros": [
    "Premium design",
    "Google Pay included"
  ],
  "cons": [
    "Limited design choices",
    "May be too large for some"
  ],
  "article": [
    "Fossil has spent the last year or so upgrading the watches it makes for licensed brands with new technology, and now it's the turn of the Kate Spade Scallop.",
    "The new Kate Spade Scallop 2 – announced at CES 2019 – is a top-end smartwatch that's designed for women, but would be suitable for anyone with smaller wrists.",
    "We've taken a quick look at the latest smartwatch in the Kate Spade range, and you can see our first impressions below.",
    "At the time of writing there's no official date set for the launch of the Scallop 2, but you'll be able to buy it in the US at some point in January 2019. We don't currently know when or whether it'll be coming to the UK or Australia.",
    "Price wise, you'll be spending either $295 (about £230, AU$410) on the leather strap version of the watch, or $335 (about £260, AU$470) for the variant with a metal chain link strap.",
    "The design of the Kate Spade Scallop 2 is unique, but it's very similar to the original watch. It has a 42mm stainless steel case (which may still be quite large for wearers with smaller wrists) and the bezel around the screen has a petal effect that's raised up to give it such a unique look. The watch body itself comes in either silver with a gold flower effect, or rose gold with the flower in the same color.",
    "It's likely you'll either love or hate the design, but you have to applaud the brand for doing something so different to any other smartwatch you can buy right now.",
    "We found it to be a heavy device, and our wrists were a touch too big for the straps, but they seemed like they would be comfortable in day-to-day wear. You can swap out the leather or metal strap you buy with the watch for any third-party 16mm strap too.",
    "We don't know much about the display on the Kate Spade Scallop 2, but in our testing it was large enough to navigate around the Wear OS software running on the watch.",
    "We don't know what's powering the Kate Spade Scallop 2 either, but it seemed to work well under our finger in our limited time testing it.",
    "The latest version of Wear OS was present too, which is a welcome addition to the watch as it's now a lot easier to find your way around the software.",
    "It's capable of contactless payments as there's NFC on the watch, which means it's compatible with Google Pay.",
    "For fitness, there's full GPS, a swim-proof design (that's 3ATM water resistance) and a heart rate tracker. All of that is here for you to use, but we'd question whether this is a comfortable device to wear when working out.",
    "That's something we'll explore in our full review later along the line.",
    "There's also an app that's exclusive to Kate Spade watches called Choose My Look. This asks for the color of items in your outfit, which it uses to create what might be a suitable watch face for your look.",
    "You can judge for yourself below whether you think it did well in our test...",
    "In terms of battery, Fossil claim this watch will last for between a day and two from a single charge so you'll have to keep an eye on the battery or charge it up each night to ensure it lasts.",
    "We can't give a full verdict on the Kate Spade Scallop 2 yet, but it's a smartwatch we are looking forward to testing further.",
    "There's no other brand out there making smartwatches like this, and it may be this is a big seller for that exact reason as it's so unique and now sports lots more top-end tech."
  ],
  "headers": {
    "3": "Kate Spade Scallop 2 release date and price",
    "5": "Design and display",
    "9": "Specs and features",
    "17": "Early verdict"
  },
  "links": {
    "Kate Spade Scallop": "https://www.techradar.com/reviews/kate-spade-scallop-review",
    "CES 2019": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets"
  }
}