{
  "source": "https://www.techradar.com/reviews/ashampoo-photo-optimizer-2019",
  "title": "Ashampoo Photo Optimizer 2019 review",
  "category": "computing",
  "updated": "2019-06-10T11:49:48Z",
  "author": "cat-ellis",
  "summary": "Better-looking photos with a click (or two)",
  "verdict": "Ashampoo Photo Optimizer 2019's one-click photo editing works well for landscapes, and its slider-based system for manual adjustments is thoughfully designed. The automatic results won't suit all subjects, but as a free tool for making quick adjustments to a batch of pictures, this does the job admirably.",
  "pros": [
    "Free to use",
    "Clean interface",
    "Automatic and manual controls"
  ],
  "cons": [
    "Auto optimization is hit-and-miss"
  ],
  "article": [
    "Ashampoo Photo Optimizer 2019 is a quick and convenient way to improve the look of your pictures – individually or in batches. Although Windows’ built-in Photos app includes many of the same features (including cropping, rotating and color correction), it only allows you to edit one photo at a time, which can eat up a lot of time when you have more than a handful to process.",
    "Ashampoo Photo Optimizer 2019 also has a host of other handy functions that you won’t find in most free photo editors, and although full instructions are provided, its streamlined interface is self-explanatory.",
    "Unusually for free-to-use software, it’s also devoid of distracting ads, leaving you free to focus on the important task of optimizing your pictures.",
    "Ashampoo Photo Optimizer 2019 is free to use, but to get started you’ll first need to request a license key by submitting an email address. Ashampoo won’t share it with any third parties, though you will receive updates on the company’s own products (which you can unsubscribe from if you’re not interested).",
    "The software comes with a set of images for you to experiment with, but if you prefer, you can remove these and start working with your own pictures immediately.",
    "Click ‘File’, then select either ‘Add folder’ or ‘Add file’ to select the photos you want to optimize. Once that’s done and they’ve appeared in the pool, select one or more by checking their boxes and you’re ready to get to work. To remove a photo from the pool, hover over it and click the cross icon that appears. Don’t worry – this won’t delete the picture from your PC.",
    "One of the main attractions of Ashampoo Photo Optimizer 2019 is the ‘Auto Optimize’ button, which analyzes a single picture (unlike some of the software’s other tools, it can’t be used for batch editing) and applies one or more changes to improve its sharpness, color and brightness. It’s an interesting idea and works particularly well for landscapes, but we found that it sometimes raised the brightness a little too far for other subjects, resulting in images looking washed out.",
    "If that happens, you can make adjustments manually instead by selecting ‘Color correction’ from the right-hand menu. Again, you can only use this tool to make changes to one picture at a time. This is accomplished via a series of sliders, enabling you to fine-tine brightness, contrast, lightness, saturation, hue and gamma. The sliders are quite sensitive, but you can also adjust the number to the right of each slider for very fine adjustments (a welcome touch rarely seen in photo optimization software.",
    "You can also crop or resize individual photos, or rotate or mirror several at once by checking multiple images in the pool, then clicking the appropriate button.",
    "We’d like to be able to apply the same set of color adjustments to multiple images at once, which would be a real timesaver for pictures taken in the same lighting conditions, but Ashampoo Photo Optimizer 2019 is still an excellent tool for any amateur photographer, and it’s impossible to argue with the price."
  ],
  "headers": {
    "3": "User experience",
    "9": "Conclusion",
    "10": "The competition"
  },
  "links": {
    "Ashampoo Photo Optimizer 2019": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9146665552998218000/https://www.ashampoo.com/en/usd/pin/1557/multimedia-software/Ashampoo-Photo-Optimizer-2019",
    "free photo editors": "https://www.techradar.com/best/free-photo-editor"
  }
}