{
  "source": "https://www.techradar.com/reviews/sirin-labs-finney",
  "title": "Hands on: Sirin Labs Finney review",
  "category": "phones",
  "updated": "2019-01-16T11:47:28Z",
  "author": "simon-chandler",
  "summary": "The world's first commercially available 'blockchain phone'",
  "verdict": "The Sirin Labs Finney doesn't really have anything to distinguish it other than the added cryptocurrency wallet, so unless this is a must have feature there are better smartphones to be had.",
  "pros": [
    "Easy-to-use crypto wallet"
  ],
  "cons": [
    "Limited crypto support",
    "Bulky design"
  ],
  "article": [
    "Sirin Labs is no stranger to niche smartphones, having previously launched Solarin – the 'world's most secure' phone – in 2016. The Swiss/Israeli manufacturer is back, this time with a device that aims to entice the mainstream customer in a way that its £10,000 predecessor failed to do.",
    "This device is the Finney, which has the distinction of being the world's first commercially available 'blockchain phone.'",
    "It was technically beaten to market by the HTC Exodus 1, however this device is still in \"early access\" and can't be purchased with physical money, only Bitcoin or Ethereum cryptocurrency - which means it's not commercially available.",
    "What this means – for anyone who isn't a Bitcoin geek – is that in addition to being a normal, current-generation smartphone, it also comes equipped with its own cryptocurrency wallet, which sits atop the main device as a standalone and secure unit.",
    "But even with this well-implemented addition, will the Finney offer enough to attract the average punter, and bring cryptocurrency out of the digital underground?",
    "Unlike the £10,000 Solarin, FINNEY is (comparatively) more affordable. It officially retails at $899 (£799), making it cheaper than the iPhone XS and Samsung Galaxy Note 9.",
    "It was released on November 28, which is when it could be pre-ordered on (and now purchased from) Sirin Labs' website.",
    "However, with the opening of Sirin Labs’ own UK store in Mayfair, London it can now be bought in person, with the company adding that the device will soon be available via Amazon Launchpad.",
    "For the uninitiated, most cryptocurrency owners keep their Bitcoins in a software-based wallet, which essentially stores the passwords they need to spend their coins. However, given that software-based wallets are constantly connected to the internet, they aren't always safe from hackers.",
    "This is where Finney comes in. Its wallet is hardware-based and physically separate from the smartphone itself, which it communicates with only when the user wishes to send or receive cryptocurrency.",
    "This might seem intimidatingly hi-tech at first glance, but we found it surprisingly easy in practice to set up Finney's wallet and use it to transfer Bitcoin.",
    "We simply tapped the touchscreen to open the transfer app, opened the hardware wallet by sliding it upwards from the top-rear of the phone, and then used the wallet's very own mini-touchscreen to choose how much we wanted to transfer.",
    "It's as easy as that, although at the moment Bitcoin and Ethereum are the only cryptocurrencies you can use with Finney's wallet (in addition to Sirin Labs' own Sirin Labs Token).",
    "That said, Sirin Labs informed us that it will be adding compatibility with Litecoin and Dash in the next month, with other popular cryptocurrencies set to follow.",
    "Compared to other current-gen smartphones (with their rounded edges and all-touchscreen displays), the Sirin Lab Finney is unusually angular and squarish.",
    "For some, this will make it a less sleek and attractive device than its rivals, although admirers could argue that its distinctive angles might serve to distinguish it from an increasingly saturated crowd.",
    "As for its display, the smartphone has a 6-inch touchscreen with an 18:9 aspect ratio, and even though it has top-and-bottom bezels it also has a notch at the top of the screen.",
    "The screen has a 1080 x 2160 resolution, which makes its less sharpe than the iPhone XS or Galaxy S9, although it is able to handle HD images well enough.",
    "Video can be viewed on the Finney in either a vertical or horizontal orientation, and the angular shaping and flat sides of the smartphone mean it's easy enough to handle.",
    "However, it's a little on the large side, so operating the back button at the bottom-left of the touchscreen (the only way of backtracking through webpages) is usually a two-handed affair.",
    "The Finney comes with a USB-C port on its base (and cable in the box) for charging, which can also be used with a supplied dongle to connect earphones as there's no dedicated headphone jack.",
    "If you open up the nano-SIM port, you will also find a slot for a microSD card, allowing you to build on the 128GB of internal storage.",
    "The Sirin Labs Finney arguably doesn't look as sexy as certain other smartphones, but its specs are solid.",
    "It comes with 6GB of RAM, a Qualcomm Snapdragon 845 chipset and 128GB of storage.",
    "The presence of the Snapdragon 845 and 6GB of RAM enables the Finney to process games comfortably and support the custom Sirin OS interface, which is built on Android 8.1 Oreo and modified to include greater security features (such as Sirin Labs’ own Cyber Security Center app).",
    "The Finney cameras are capable of holding their own, with the rear snapper boasting a 12MP lens and the selfie cam featuring an 8MP lens.",
    "Photos we took during our brief time with the handset were vividly colored and sharply detailed, although the camera app doesn't come with as many editing options as you find on the latest iPhones or Google Pixel 3.",
    "Lastly, while we haven't had the time to completely put the Finney's 3,280mAh battery through its paces, Sirin Labs tells us that it lasts as much 20 hours if used normally.",
    "And with its USB C-charging cable we found that it can recharge quickly, with a 100% recharge taking a little over two hours.",
    "The Sirin Labs Finney is an interesting smartphone, and arguably one that could set a trend for future devices to follow.",
    "While it has a decent camera and a powerful CPU able to handle most tasks, it doesn't really have anything to distinguish it other than the added cryptocurrency wallet, and at the moment Bitcoin still hasn't cracked the mainstream, despite being ten years old.",
    "And while the combination of a powerful Android smartphone and a cryptocurrency wallet may be attractive to crypto aficionados in the market for both, the current limited compatibility of the wallet may be a partial turnoff for now.",
    "Still, the convenience of having a secure hardware wallet attached directly to your smartphone may be too great for some die-hard crypto enthusiasts to resist."
  ],
  "headers": {
    "5": "Sirin Lab Finney price and availability",
    "8": "The Blockchain Phone",
    "14": "Design and display",
    "22": "Performance, interface and camera",
    "29": "Early verdict"
  },
  "links": {
    "Solarin": "https://www.techradar.com/news/phone-and-communications/mobile-phones/we-challenged-samsung-and-blackberry-over-their-android-security-claims-1326825",
    "HTC Exodus 1": "https://www.techradar.com/news/htc-exodus",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "Samsung Galaxy Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "opening": "https://www.techradar.com/news/worlds-first-blockchain-smartphone-store-opens-in-london",
    "Galaxy S9": "https://www.techradar.com/reviews/samsung-galaxy-s9-review",
    "Google Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review"
  }
}