{
  "source": "https://www.techradar.com/reviews/asus-zenbook-14",
  "title": "Hands on: Asus ZenBook 14 review",
  "category": "computing",
  "updated": "2019-01-09T23:52:44Z",
  "author": "joe-osborne",
  "summary": "The best of ZenBook S and Pro in one laptop",
  "verdict": "The Asus ZenBook 14 takes the coolest features from the ZenBook S and ZenBook Pro that had debuted last year and crams them into a clever, little 14-inch laptop that straddles the line between both. For that, this is a kitchen sink of sorts that can appeal to several kinds of users.",
  "pros": [
    "ErgoLift hinge delights",
    "Clever numeric key pad within touchpad",
    "Attractive design",
    "Excellent starting price"
  ],
  "cons": [
    "Fingerprint reader in touchpad"
  ],
  "article": [
    "Asus is officially spreading its new ErgoLift design into its wider ZenBook portfolio, and it starts with the Asus ZenBook 14. Debuted at CES 2019, the laptop incorporates elements from the ‘S’ and ‘Pro’ lines of Asus laptops to impressive effect.",
    "It’s a gorgeous laptop altogether, but one that’s also capable and versatile without having to resort to a 2-in-1 aesthetic that can be polarizing among users.",
    "The ZenBook 14 also comes in aggressively priced, so there’s very little working against it heading into 2019. Chances are high that this ZenBook becomes a standard-setting laptop for the year.",
    "Asus is calling for $749 (about £590, AU$1,050) to start for the ZenBook 14 in the US when it launches sometime this quarter. That price includes an 8th-generation, dual-core Intel Core i3 U-series processor, 4GB of 2,133MHz DDR3 memory and a 256GB PCIe SSD. This all comes through a 14-inch LED Full HD (1,920 x 1,080) display.",
    "There are several upgrade options, though Asus hasn’t yet provided those configuration details. So, here’s what the highest-end model will look like: a quad-core Intel Core i7 U-series processor, Nvidia MX150 graphics, 16GB of 2,133MHz DDR3 memory and 1TB of PCIe storage. At this tier, the screen simply gains an anti-glare feature. Of course, it’s unknown how much this model will cost.",
    "All told, it appears that Asus will aggressively price the ZenBook 14 throughout, if the $749 starting price is anything to go by.",
    "Essentially, the new Asus ZenBook 14 adapts the style of the 12-inch ZenBook S that debuted last year, blows it up to 14 inches, coats the metal chassis in a new “Utopia Blue” color and throws in more diamond cut edges than you’d know what to do with. With that, the laptop takes on the raised, ErgoLift hinge design for the elevated typing angle and just about every other design feature of the ZenBook S.",
    "Yes, that includes the fingerprint reader embedded into the touchpad, which we’ve never been a fan of. However, Asus did take advantage of the additional horizontal space to make room top-firing stereo speakers that should considerably improve audio quality.",
    "Asus hasn’t been specific about the height and weight of the device, simply stating that it comes in under 1.45kg, or 3.2 pounds. That’s mighty light for a 14-inch laptop – only this is technically a 13-inch laptop.",
    "Asus’s miniscule 6.5mm screen bezels have allowed for a 14-inch display on the diagonal within a frame that’s just 13 inches on the horizontal.",
    "And, while we don’t know exactly how thin the laptop is, we know it’s just enough to fit one USB-C 3.1 Gen2 port, one USB-C 3.1 Gen1 port, a USB 2.0 port, HDMI-out, an SD card reader and a 3.5mm headphone jack.",
    "Moving onto the keyboard, we find it to be rather tactile and therefore easy to use for newcomers and veterans alike. As for the touchpad, while it feels like any other glass-coated tracking device, it also can double as a digital numeric key pad. This function can be accessed with the tap of the fingerprint reader button, and is mighty convenient for number crunchers who don’t want to lug around a 15-or- 17-inch laptop.",
    "The display on this laptop isn’t going to blow you away with a sharp resolution or snappy touch controls, rather it’s a screen that nails the basics. We find the Full HD resolution to be plenty, and the colors appear rich on the panel through a strong backlight.",
    "Of course, it’s tough to say how well this laptop would perform with such brief time testing it, but the parts on hand can give us a solid idea of what to expect. The ZenBook 14 uses full-power Intel Core U-series processors, and therefore is fan-cooled.",
    "This should put the ZenBook 14 on par with competing flagships, like the Dell XPS 13, and put it ahead of the latest MacBook Air in terms of pure output. The optional Nvidia MX150 graphics inside should see it keep up with competitors such as the Huawei MateBook 13.",
    "Asus is promising up to 10.8 hours of battery life from the laptop, which could easily be achievable between the standard display and power-sipping 8th-generation Intel processor. We’ll see for ourselves in a full review, but that would make the ZenBook 14 mighty competitive.",
    "The Asus ZenBook 14 takes the best of the ZenBook S and ZenBook Pro that had debuted last year and crams it into a clever little 14-inch laptop that straddles the line between both. For that, this is a kitchen sink of sorts that can appeal to several audiences.",
    "While we’re not thrilled by a fingerprint reader embedded into the touchpad, we do appreciate its added numeric key pad function. Beyond that, there’s not much else working against this laptop, if anything.",
    "The ZenBook 14 is one of those hybrid professional and general use laptops that we’ve found to be a sort of mini trend in the computing world. We’ll be the judge of whether it can please both of those crowds in a full review.",
    "Check out all of TechRadar's CES 2019 coverage. We're live in Las Vegas to bring you all the breaking tech news and launches, plus hands-on reviews of everything from 8K TVs and foldable displays to new phones, laptops and smart home gadgets."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design and display",
    "13": "Performance",
    "16": "Early verdict"
  },
  "links": {
    "CES 2019": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "Asus laptops": "https://www.techradar.com/news/best-asus-laptops",
    "Dell XPS 13": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review",
    "MacBook Air": "https://www.techradar.com/reviews/macbook-air-review",
    "Huawei MateBook 13": "https://www.techradar.com/reviews/huawei-matebook-13",
    "TechRadar's CES 2019 coverage": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets"
  }
}