{
  "source": "https://www.techradar.com/reviews/polar-vantage-v-review",
  "title": "Polar Vantage V review",
  "category": "fitness",
  "updated": "2021-03-17T16:47:17Z",
  "author": "kieran-alger",
  "summary": "The Polar Vantage V is almost like having a coach on your wrist",
  "verdict": "The Polar Vantage V is lighter, better looking and more fully featured than any Polar multi-sport watch we’ve seen before. It doesn’t come cheap and there are some bugs that need to be ironed out, but if you’re serious about competing in your sport at any level, this watch deserves to be on your shortlist.",
  "pros": [
    "Lightweight and stylish",
    "Tracks running power from the wrist",
    "Extensive training and recovery insights"
  ],
  "cons": [
    "No music",
    "Uncomfortable strap",
    "GPS pacing can be jumpy"
  ],
  "article": [
    "We’ve been waiting for a successor to the Polar V800 multi-sport watch for a while and it arrived in 2018 in the form of the Polar Vantage V, a new multi-talented device targeted at anyone who cares about performance, from the elites down to the weekend warriors.",
    "In addition to a snazzy new design, the headline features of this running watch include improved optical heart rate tracking that Polar claims is its most accurate yet, and running power tracking from the wrist. The Vantage V is the first watch in the world to offer this – though there are apps like Power2Run for the Apple Watch 4 that do the job too.",
    "The Vantage V also sports a broad range of extensive training load and recovery monitoring features tailored to the individual athlete, and a battery life that extends to a whopping 40 hours of continuous workout tracking.",
    "From serious sports tracking right through daily activity and sleep, there’s a great deal packed in here and a lot to excite athletes of all levels.",
    "So is this the best running watch you can buy right now? We put it to the test to find out.",
    "When it comes to price, the Polar Vantage V sits at the higher end of the spectrum. The watch-only package is priced at £439 / $499 / AU$699.90, or you can buy it with a H10 chest strap – which you’ll need to unlock all of the recovery features – for £479 / $549 / AU$799.90.",
    "Given that recovery smarts constitute one of the major feature sets, to get the full benefit of this device you’re really looking at the higher price. For comparison a Garmin Forerunner 935 costs £439.99 / $499.99 / AU$699.",
    "The first thing you notice when you pick up the new Polar Vantage V is how much subtler and more sophisticated the design is compared to its blockier, rectangular-faced predecessor the V800. We’d go as far as to say this is Polar’s best looking watch ever and one of the most attractive running watches you can buy right now.",
    "What you’ve got here is a watch that you can wear all day without screaming to the world \"I’m an Ironman competitor.\" Much of this is down to the fact the Polar Vantage V has a more traditional round watch face that’s complemented by a sleek stainless steel bezel and frame that surrounds a touchscreen color display.",
    "The display isn’t as sharp as you’ll find on something like the Apple Watch 4 and we found it to be a little dark and hard to read. The backlight fires up when you turn your wrist but not to full brightness. More often than not we ended up hitting the full display light to make the information more legible.",
    "Unfortunately, there’s no way to customize the screen or light settings, for example to have the backlight always on during night runs or heavy sunlight, or to extend the time the light is on when you hit the button.",
    "There are five subtle, textured stainless steel side buttons that provide a second way to navigate the watch in addition to the tap and swipe touchscreen.",
    "The buttons were particularly useful on the move, and because the touchscreen controls are largely restricted to scrolling through and reviewing information, we found we used the buttons more than the screen even when we weren’t running.",
    "There are some user interface oddities. You can use the touchscreen to scroll sideways through the Vantage’s main screens for at a glance stats on Activity, Training Load, Heart Rate and Training History, but it then feels a bit weird to switch to the up and down buttons to achieve the same action.",
    "When we tapped to go deeper into the stats for each, we found the touchscreen to be a little laggy. Also, once you’re at a deeper level – say jumping from your current heart rate into the Max and Average BPM for the day – you can’t use the touchscreen to go back. You have to jump to the back buttons, again all a bit odd.",
    "At 66g it’s 13g lighter than the V800 and also a fair bit lighter than something like the Garmin Fenix 5 Plus, which comes in 86g. When it comes to all-day wear and even sleep tracking overnight this is a huge improvement.",
    "Out of the box the Vantage V is designed to fit medium and large wrists with 22 well-spaced notches that should accommodate most wrists. However, those with small wrists have been penalized somewhat as they’ll have to purchase a small size wrist band separately.",
    "On comfort, we found it was necessary to tighten the watch before exercise to ensure a good fit for heart rate accuracy, but when we forgot to loosen it afterwards, the strap pinched.",
    "Despite its soft silicone, worn like this for long periods we got some quite nasty skin irritation. In fact, overall we found the strap to be a bit of a bugbear. It was hard to find the right tightness to avoid it feeling loose or pressing uncomfortably into the skin.",
    "The watch itself is 46mm wide and 13mm thick, the latter due to quite a pronounced optical heart rate bump that we’re told is necessary for the best skin contact and delivering the most accurate optical heart rate readings.",
    "On the back you’ll also notice there are 9 optical LEDs in two colors (4 red and 5 green) as well as four bio-impedance sensors that detect when there’s good skin contact for taking the heart rate readings.",
    "These four electrodes are also used to charge the watch in conjunction with a round USB cradle dock that locks the watch in place better than some past Polar charging solutions.",
    "As you’d expect from a multi-sport watch, the Vantage V is waterproof and during our tests it happily withstood rain, showers and sessions in the pool without any trouble.",
    "The Polar Vantage V comes in three familiar Polar colors: black, white and orange."
  ],
  "headers": {
    "5": "Polar Vantage V price and availability",
    "7": "Design, display and interface"
  },
  "links": {
    "Polar V800": "https://www.techradar.com/reviews/wearables/polar-v800-review-1302688/review",
    "running watch": "https://www.techradar.com/best/running-watches",
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review",
    "Garmin Forerunner 935": "https://www.techradar.com/reviews/garmin-forerunner-935-review",
    "Garmin Fenix 5 Plus": "https://www.techradar.com/reviews/garmin-fenix-5-plus-review"
  }
}