{
  "source": "https://www.techradar.com/reviews/kidlogger",
  "title": "KidLogger review",
  "category": "computing",
  "updated": "2020-02-14T12:23:06Z",
  "author": "sofia-wycislik-wilson",
  "summary": "A simple way to record your children's computing activity for your peace of mind",
  "verdict": "The lack of control options is a little disappointing, but if you're just looking to keep an eye on what your children are up to, this is a powerful way to do just that.",
  "pros": [
    "Available for Windows, macOS, Linux, Android, iOS and BlackBerry",
    "Effective monitoring",
    "Can monitor multiple devices"
  ],
  "cons": [
    "Monitoring only; no control or blocking options",
    "Free option is a little limited",
    "Subscription model can get expensive"
  ],
  "article": [
    "Anyone with children has a tricky line to tread; computers and the internet are wonderful tools, but they can also be a cause for concern. The idea behind KidLogger is that it acts as an extra pair of eyes for you, constantly watching over your child's shoulder so you know what they’re getting up to.",
    "Of course, everyone – including children – uses multiple devices to get their technology fix, and this is something the software takes into account. You can monitor up to five devices without have to part with a penny.",
    "The basic version of KidLogger is not only free, but also open source. This is great news because it means the code can be checked and analysed by anyone – after all, the last thing you want from any sort of monitoring tools is for it to be secretly doing something sinister in the background.",
    "If you're hoping to stop your children from visiting certain websites or launching particular programs, there's bad news; as its name suggests, this parental control software is merely about monitoring. It will log every keystroke your child types, log every program that is launched, take screenshots at login and even record audio if you're willing to take out a subscription. The hope is that when told that this monitoring is taking place, children will keep their own activities in check.",
    "There are two premium KidLogger subscriptions. Standard costs $9 (about £6, AU$11) for three months, $17 (about £12, AU$21) for six months, or US$29 (about £21, AU$37) for a year.",
    "Professional is US$29 (about £21, AU$37) for three months, US$49 (about £35, AU$62) for six months, or US$89 (about £63, AU$112) for a year.",
    "The differences between the three versions are quite complex, but you can use the developer's comparison matrix to make your choice.",
    "Setting up KidLogger is very simple, but the interface leaves a little to be desired. You use simple check boxes to indicate what you'd like to monitor – keystrokes, clipboard contents, USB usage, Skype chat logs, browsing history and even recording audio. It's also possible to take screenshots at pre-defined intervals, or when keywords are detected on screen.",
    "Any logs that are recorded can be viewed online from any device, so you monitor activity from afar at any time.",
    "However. while Kidlogger is certainly useful, it isn't parental control software in the sense that most people would understand, which is something of a disappointment."
  ],
  "headers": {
    "7": "User experience",
    "10": "You might also like"
  },
  "links": {
    "KidLogger": "http://kidlogger.net/",
    "parental control software": "https://www.techradar.com/best/parental-control",
    "comparison matrix": "http://kidlogger.net/comparison-matrix.html"
  }
}