{
  "source": "https://www.techradar.com/reviews/anker-nebula-capsule-ii-mini-projector",
  "title": "Anker Nebula Capsule II mini projector review",
  "category": "audio-visual",
  "updated": "2019-07-11T16:59:55Z",
  "author": "gerald-lynch",
  "summary": "A cinema the size of a coke can",
  "verdict": "The Anker Capsule II makes projecting your favorite movies easy, thanks to improved brightness, a slick Android TV and Google Assistant voice interface and its remarkably-small form factor.",
  "pros": [
    "Great design",
    "Android TV built-in",
    "Full-size HDMI port"
  ],
  "cons": [
    "Expensive",
    "Could be brighter",
    "Netflix must be sideloaded"
  ],
  "article": [
    "If you’re after a portable projector, Anker has been the brand to beat for the last couple of years. Its Nebula range of Mars and Capsule projectors has gone from strength to strength, thanks to their compact designs and support for Android apps.",
    "While it might not replace home cinema projectors anytime soon, the ultra-portable Anker Nebula Capsule II might well be the best portable projector the company has ever built, beaming an image as large as 100-inches onto your wall, all powered by Google’s Android TV platform.",
    "It makes some concessions in terms of brightness, resolution and battery life, but if portability is your primary concern, it’s hard to recommend anything other than the Anker Nebula Capsule II.",
    "The Anker Nebula Capsule II projector is available now, priced at $579.99 (about £465 / AU$830).",
    "That’s not exactly cheap, but isn’t far off what you’d pay for similar, inferior rivals, making the Anker Nebula Capsule definitely one to keep an eye on if you’re hunting down a portable projector. For context, the larger and older Nebula Mars II price hovers around the £469.99 ($499.99 in the States) mark. It has better battery life and speakers, but lacks the convenience of true Android TV support.",
    "You’ll be hard-pressed to find a more compact portable projector with features this good as the Anker Nebula Capsule II. Weighing less than a kilo at 680g, it’s not much bigger than a can of coke, and has everything it needs to get movies and video beamed onto your wall, built in.",
    "Measuring 3.15 x 3.15 x 5.9 inches, it’s all black with wraparound speaker grilles, except for a handful of buttons and a small red Anker logo on the front. Its projection lens sits recessed in a small circular porthole around the front.",
    "It’s incredibly portable then, and a built-in battery makes it even more so. Charging over a USB-C port on the lower rear, you’ll get three hours of video playback (or 30 hours if you use it merely as a speaker) from a 2.5 hour charge. In practice, we found that closer to two or 2.5 hours of video playback. That’s considerably less than the original Capsule’s four hours, but make sense given that the brightness rating here is 200 ANSI lumens compared to the original’s 100. That makes its projection far more watchable in the daytime, but means you’ll have to keep a charger handy for extended viewing sessions.",
    "In terms of ports, alongside that USB-C power input you’ll also find a full-sized USB port, an audio-out 3.5mm port for hooking up beefier speakers than the 8W one built in, and a regular full-sized USB port. That USB and HDMI combo is particularly useful, letting you both power and plug in a dongle like an Amazon Fire TV Stick when on the go. Power and Bluetooth activating buttons are on halfway up the rear of the projector, while there's also the option to screw in a tripod on the bottom of the projector.",
    "You’ve two in-the-box options for controlling the projector. First is its built in controls, which are capacitive and sit on the top, comprising directional buttons, a central selection button and volume up and down controls. The choice to go capacitive here is appreciated, meaning a light tap can select the option you’re after, making you less likely to unintentionally shift the projected image by moving the Capsule II.",
    "There’s also a handy remote in the box that mimics these controls, as well as adding an input switcher (from Android TV to HDMI), an Android TV home button, a back button and a Google Assistant button. This activates a mic in the remote control, and lets you talk to the projector to select onscreen elements (among other Google Assistant features). It works very well, and will be familiar to anyone with an Android phone or access to another Android TV or Google Home smart device. Wi-Fi is built into the Capsule II, and it also supports Google Chromecast features thanks to the inclusion of Android TV.",
    "Finally, that lens features 1-second autofocus. Move the Capsule II by accident, and it should automatically adjust itself to reset the image clarity. If for whatever reason it doesn’t trigger, holding down the remote’s input selector should trigger the autofocus manually.",
    "Anker’s projectors have previously used a forked version of Android, letting the company load apps like Netflix and Amazon Prime Video onto its devices, but hamstringing them slightly with a clunky homemade interface. That’s not the case with the Capsule II.",
    "Instead, Anker has loaded its little projector with a fully-featured build of the Android TV 9.0 operating system. This gives it access to over 3,600 apps directly, without the need for an external playback device.",
    "Navigating Android TV here works a treat, especially with the included remote control. The interface shows apps as a series of tiles to be scrolled through, which each app row throwing up recommended viewing content based on what you’ve watched previously. It moves smoothly, and the ability to jump straight into YouTube programming or buy a Google Play Movies title is incredibly handy.",
    "Where the Anker Nebula Capsule II’s Amlogic S905X processor struggles however is with gaming. There are plenty of Android TV games available, but anything more advanced than a 2D arcade classic and the Capsule II starts to feel the strain. Those into retro gaming and emulation will enjoy being able to have an all-in-one projection gaming system to throw into a rucksack however.",
    "What could prove difficult for less adept users though is getting Netflix onboard. Anker hasn’t been able to get the device certified by the streaming company, meaning it’s not readily downloadable on the Nebula Capsule II. You can sideload a version of the streaming service onto the device using that aforementioned USB port, but expect to jump through more hoops than you’d like for what is one of the most popular streaming platforms on the planet.",
    "Providing you’re not expecting to get a cinema-bothering level of performance from that little lens, the Anker Nebula Capsule II is a great little device. It still struggles in broad daylight (as did its predecessor), but one the light fades, it’s a very watchable image projected, especially given the relative size of the device.",
    "There are limitations here, of course – though the device can playback from a 4K source, it’ll only output in 720p, and while it’s built-in speaker is clear and surprisingly loud, it won’t have the immersive power that a sound bar will deliver.",
    "But that all kind of misses the point – here’s the complete viewing experience, from projected screen to speaker output to Wi-Fi powered movie delivery, in a single device half the size of a Pringles can.",
    "It’s ease of use and set up compared to a regular projector makes it so much more attractive to use as a result. Where larger projectors may be a pain to install, this one is a charged battery pack and a walk to the viewing location of your choosing away. Want to watch Jurassic Park in the garden? You’re good to go. Fancy playing the SNES Classic Mini in a tent? It’ll even power the little console, too.",
    "Suddenly, the world is your cinema.",
    "A 100-inch screen projected out of a device that’s shaped like a beer can? It’s hard not to fall in love. Though in an ideal world battery life, projected brightness and resolution would be stronger, they’re minor quibbles against what’s achieved here. For a truly portable, and effortlessly useable portable projector, it’s hard to recommend anything other than the Anker Nebula Capsule II."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "12": "Android TV",
    "17": "Performance",
    "22": "Verdict"
  },
  "links": {
    "Nebula Mars II": "https://www.techradar.com/reviews/anker-nebula-mars-ii-portable-projector",
    "Google Assistant features": "https://www.techradar.com/news/9-things-google-assistant-can-do-that-you-may-not-know-about",
    "SNES Classic Mini": "https://www.techradar.com/reviews/snes-classic-mini"
  }
}