{
  "source": "https://www.techradar.com/reviews/libreoffice",
  "title": "LibreOffice review",
  "category": "computing",
  "updated": "2019-10-28T14:03:26Z",
  "author": "cat-ellis",
  "summary": "Never pay for office software again",
  "verdict": "This open source office software suite is truly exceptional, and new features are added all the time. It's amazingly flexible too, and totally free – even for commercial use.",
  "pros": [
    "Full suite of office software",
    "Compatible with all Microsoft Office file formats",
    "No advertising or features hidden behind paywalls"
  ],
  "cons": [
    "Extra templates have to be downloaded and installed manually"
  ],
  "article": [
    "Everyone needs a suite of office software for everyday tasks. Microsoft Office is perhaps the best-known option, but there are also lots of free alternatives that replicate almost all the features of Word, Excel, PowerPoint and company. LibreOffice is one such package, and it's earned a reputation as one of the best free office suites around.",
    "LibreOffice is an offshoot of the OpenOffice project, and is developed by huge team of enthusiastic coders who deliver regular updates and new features to ensure it keeps pace with premium office software.",
    "LibreOffice contains six component programs that provide everything you need from an office suite:",
    "You can save and open many different formats, including Microsoft file types (including DOC, DOCX, PPT, PPTX, and many more), which is ideal if you're collaborating with users of Microsoft Office, or if you've previously used Microsoft's suite but have decided to try LibreOffice.",
    "LibreOffice offers a choice of interface styles: a traditional system of icons and toolbars, and an optional NotebookBar (similar to the ribbon used in Microsoft Office since 2007). Both have their advantages; the NotebookBar will make switching from Microsoft Office more natural, while the old-school layout means everything is visible at a glance, and you can navigate easily using a keyboard rather than a mouse if you prefer.",
    "Beyond that, there's little difference between Microsoft's productivity toolkit and LibreOffice. The open source suite lacks Office's built-in cloud storage option, but that's easily remedied by installing the Dropbox desktop software, which gives you instant access to your account as though it was a folder on your PC.",
    "LibreOffice's selection of templates might seem a little limited compared to Microsoft's, but this is easily remedied by the huge collection of downloadable options available in the project's online repository. There are also plugins to add features like advanced grammar tools, extra language packs, improved accessibility options (such as export for braille embossers), and plugins for other programs like mind-mapping tool Freemind.",
    "LibreOffice is truly remarkable. Give it a try and you might never pay for office software again."
  ],
  "headers": {
    "4": "User experience",
    "8": "You might also like"
  },
  "links": {
    "LibreOffice": "https://www.libreoffice.org/",
    "installing the Dropbox desktop software": "https://www.dropbox.com/",
    "the project's online repository": "https://extensions.libreoffice.org/",
    "Freemind": "https://www.techradar.com/reviews/freemind-mind-mapping-software"
  }
}