{
  "source": "https://www.techradar.com/reviews/magic-leap-one",
  "title": "Hands on: Magic Leap One review",
  "category": "wearables",
  "updated": "2019-01-14T12:21:10Z",
  "author": "henry-st-leger",
  "summary": "A leap into the future?",
  "verdict": "If enough developers get on board, this could be a compelling headset. But we're still awaiting just how much software support the strong hardware will receive.",
  "pros": [],
  "cons": [],
  "article": [
    "Behold the Magic Leap One. After years of secretive development, and a huge amount of hype about its stylish design and holographic imaging, Magic Leap’s premium augmented reality headset is now on the market.",
    "Well, in North America at least. The rollout is starting slow – it’s only available in a handful of American cities from the Magic Leap website initially – though the headset is sure to come to Europe and other regions in the near future.",
    "For now though, very few people have had the chance to try out the Magic Leap One headset, and we’re here to give you our first impressions of using the $2,295 (about £1,700, AU$3,000) contraption, which allows you to see AR images overlaid on the world around you, as opposed to the closed-off virtual worlds of VR.",
    "Our demo was limited to few levels of Angry Birds: First Person Slingshot, an AR experience from Resolution Games that’s available for free on Magic Leap World, Magic Leap’s own store for games and other AR content. Based on the globally popular Angry Birds mobile game, the AR game sees you using a slingshot in three-dimensional space – so what was it like?",
    "It’s safe to say that Magic Leap hasn’t skimped on the headset’s appearance. AR headsets haven’t always had the best reputation for stylish design – see, for example, the infamously awkward-looking Google Glass. But unapologetically creating a ‘premium’ product has allowed Magic Leap to put some serious thought into the design, and create something that’s spectacular to look at.",
    "The Magic Leap One’s shape sits somewhere between smart glasses and virtual reality visor. It’s not bulky, but the thick band around your head stops it from looking like a pair of upcycled spectacles. While you can’t realistically fit in your own glasses underneath, you can source prescription lenses that clip magnetically onto the inside of the visor.",
    "The headset clasps along the sides and back of your head, without any straps over the top. You may think this would exert a lot of pressure on the temples, but even when clasped tight the Magic Leap One remains comfortable – at least, for our 20-minute play session – and Magic Leap seems to have thought through its weight distribution in a smart manner.",
    "The Magic Leap One comes in two sizes, with each unit having an adjustable band at the back for fitting to your head’s exact size. The rims around the lenses will block off the corners of your vision somewhat, but the lenses still offer a fairly broad field of view.",
    "The controller is much more in line with existing AR / VR headsets on the market. It’s shaped somewhat like an oversized thumb. You clasp it in one hand, using a touch-sensitive trackpad to move through menus, while the motion controls allow you to wave a cursor, slingshot, weapon, or otherwise around in front of you. There are also two buttons on the underside for various uses (in our demo, for ‘firing’ the slingshot), and we’re told that Magic Leap is aiming to patch in support for a second controller for games with more complex inputs.",
    "You’re technically untethered, not having to rely on an external PC or computer, though you will need to clip a small disc-shaped device to a pocket or waistband to power the simulations, which connects via a cable to the main headset (it hangs outside your pocket so as not to overheat).",
    "Despite it being a highly-advanced, next-generation augmented reality headset, the Magic Leap One feels pretty natural to use.",
    "Rather than hemming you in behind a visor, the AR glasses generate ‘digital light’ at different depths to give the appearance of lifelike objects in your field of vision - all while letting you stay aware of the space around you.",
    "Rovio’s Creative Director for Extended Reality, Sami Ronkainen, commented how “in VR systems, you always have displays right in front of your eyes. But with these light displays, you can focus on different distances, which reduces strain on your eyes, and is more like looking at objects in the real world.”",
    "Being able to view AR images in the real world around you means you don’t have the same sense of immersion – and isolation – that you experience when entering an entire other world in VR. You’re in the same room, with the same furniture; there’s just some other stuff there too. In a world increasingly dominated by technology, a headset that doesn’t entirely shut you off from the outside world seems like a pretty attractive way forward – it’s just a shame about the astronomical price tag.",
    "We found the Angry Birds game as joyful as any mobile entry, with plenty of added three-dimensional novelty. Built in the Unity game engine, the game’s cartoonish art style and humor come across well in 3D, while the glee of seeing crates collapse and green pigs roll across a real-life table can’t be underestimated.",
    "We’re very used to, and bored of, VR games that keep you on the spot while the world arranges itself around you. Playing an AR game that lets you roam around the room, looking for the best angle from which to take down a pile of rickety platforms, feels hugely refreshing.",
    "There is a slight sense of disconnect that comes with playing such a rudimentary mobile game on a headset costing over $2,000. As a proof of concept for Magic Leap’s AR technology, though, it’s hard to criticize the experience – and you’ll still get 28 levels and at least 10 hours of playtime in the free title.",
    "What makes the Magic Leap One so engaging is its awareness of the space that you’re in. It doesn’t just project images into the air, but rather fits them into a physical space. Angry Birds: First Person Slingshot fits itself perfectly to the surface of a living room table. Green pigs roll off onto the floor, or fly out the window. Virtual structures collapse in 360-degree space, just like real ones would.",
    "We’d expect to see future iterations of the Magic Leap One improving the user interface further, with additional scope for controllers, a less restrictive vision, and the computing power to create AR experiences on an ever grander scale. But already the sleek design and natural user experience offer a solid basis for developers to start creating interesting and innovative uses for the AR headset.",
    "For now, and given its price, the Magic Leap One could hardly be described as a compelling purchase. But if enough developers get on board, and the technology becomes cheap enough to get into more consumers’ hands – and in countries other than the US – it may yet prove worthwhile."
  ],
  "headers": {
    "4": "Design",
    "10": "Performance",
    "17": "Early verdict"
  },
  "links": {
    "augmented reality": "https://www.techradar.com/how-to/what-is-augmented-reality",
    "Magic Leap website": "https://www.magicleap.com/",
    "Magic Leap One": "https://www.techradar.com/news/magic-leap-one",
    "Angry Birds: First Person Slingshot": "https://www.techradar.com/news/magic-leaps-first-big-game-is-surprisingly-angry-birds",
    "VR headsets": "https://www.techradar.com/news/the-best-vr-headset"
  }
}