{
  "source": "https://www.techradar.com/reviews/lg-ultrafine-24md4kl-b",
  "title": "LG UltraFine 24MD4KL-B review",
  "category": "components",
  "updated": "2019-07-29T19:10:09Z",
  "author": "jackie-thomas",
  "summary": "More than fine",
  "verdict": "The LG UltraFine 24MD4KL is a great monitor for fledgling photo and video editors. Its high resolution and color accuracy make it a perfect fit for anyone getting creative work done. However, the high price point and thick bezels make it hard to recommend for most everyday users.",
  "pros": [
    "Incredible color accuracy",
    "Bright and vivid",
    "USB-C and Thunderbolt 3 compatibility"
  ],
  "cons": [
    "Expensive",
    "Thick bezels"
  ],
  "article": [
    "There are so many monitors out there these days that are packed with huge screens, impossibly thin bezels and HDR, that when a display rolls around that just offers a great resolution and impeccable image quality, it's kind of a breath of fresh air. And, that's basically the LG UltraFine 24MD4KL-B in a nutshell.",
    "This USB-C monitor is practically designed for Macs and Ultrabooks, with its buttonless design and relatively lightweight build. With a single Thunderbolt 3 cable, you'll be able to charge your laptop, while having an amazing display – and a surprisingly long Thunderbolt 3 cable is included right out of the box.",
    "However, it's an expensive monitor, especially considering the display size and the thick bezels. The fantastic image quality goes a long way to making up for it, but it is still hard to recommend to everyday users.",
    "If you're interested in picking up the LG UltraFine 24MD4KL, you can do so now, though you're pretty much limited to the Apple Store in the US, where you can scoop it up for $699. However, if you're in the UK or Australia, you'll have to wait a bit, as we couldn't find it anywhere in either of those territories.",
    "This is certainly expensive for a 4K monitor, as you can pick up comparable looking panels from LG itself for the same amount of money with a bigger screen and thinner bezels. For instance, the LG 27UD88-W has a the same resolution, similar image quality and a larger screen for $649 – and you can even find it for much less at the time of this writing.",
    "The main difference between these two monitors is going to be the color support. The LG 27UD88-W is limited to 99% of the sRGB spectrum, while the LG UltraFine 24MD4KL has full DCI-P3 color gamut. This display, then, is meant entirely for photographers and video editors who absolutely need the most color accurate display out there. Everyone else is probably better off looking elsewhere and saving a few bucks.",
    "When you pull the LG Ultrafine 24MD4KL out of its packaging one of the first things that will jump out at you, especially if you've been surrounded with recent laptops and smartphones like we have, is that the bezels are thicc. The bezels are around 13.9mm on the sides and 15.5mm on the top and bottom – that's massive by today's standards.",
    "However, while the bezels aren't low profile, pretty much everything else is. At its deepest point, the LG UltraFine 24MD4KL is just 1.9 inches thick, and the stand is black and blends into the background. It helps that the only ports on offer here are USB-C around the back: two Thunderbolt 3 and three standard USB-C that serve as a pass through.",
    "And, about the stand, it's flat at the bottom, so you could hide it pretty effectively. It will also allow you to raise and lower the monitor, as well as tilt vertically. However, you can't tilt the display horizontally or rotate it. For a display that's so clearly designed to cater to professionals needs, it's a shame that it doesn't let you fully control the orientation of the display.",
    "Don't bother looking for buttons on this monitor, though – they're not there. This monitor will turn off or on, depending on whether or not it detects a signal. This is a cool idea, in theory, but it does make us wonder why the bezels are so thick when there are no buttons. This also means that if you want to change the display settings, you're at the mercy of software, rather than being able to manually fiddle with the picture. For most people this probably won't even matter, but power users might get annoyed.",
    "It's hard to come down on whether or not we're fans of the design of the LG UltraFine 24MD4KL or not. On one hand, the simple button-less design is a godsend for ease of use, and we really do appreciate a more spartan approach to hardware design. However, the thick bezels and the fact we can't rotate the display without moving the entire stand is kind of a pain.",
    "This monitor has fantastic picture quality, and it's not even close to being a matter of debate. This 24-inch, 3,840 x 2,160 display is so pixel dense – offering 183 pixels per inch (ppi), opposed to the 163 ppi offered by 27-inch monitors with the same resolution. That's a 10% boost to pixel density and is definitely enough to notice if you're a creative looking at high resolution images all day.",
    "This screen also shoots out 500 nits of brightness, and when combined with the full P3 wide color gamut, what you get is an incredibly bright and colorful display. Whatever you're looking at, whether it's just the macOS High Sierra standard background, or watching Altered Carbon on Netflix, everything is absolutely gorgeous.",
    "Just keep in mind that with its 60Hz response time, high price and lack of HDMI or DisplayPort, this is very much not a gaming monitor. You probably can play some games on it, provided you have a gaming laptop with Thunderbolt 3, but you'll get a better experience for less cash elsewhere. It doesn't help that you have to jump through quite a few hoops to get this monitor to work with Windows, especially if you're using a gaming PC.",
    "Not that gaming even matters here. We keep finding ourselves staring at this display, forgetting video games ever even existed anyways.",
    "While watching Altered Carbon on this screen, we just can't look away, even with the sound off. Photoshop is also an incredible experience on this monitor, the high resolution and accurate color making it very easy to make any necessary changes – though we must admit our typical Photoshop workload is pretty light.",
    "When all is said and done, the LG UltraFine 24MD4KL is a beautiful 4K display. It has that full P3 color gamut, and is bright enough to make you never want to look away from your screen again.",
    "However, with the thick bezels and high price, it's hard to recommend to most everyday users. If you're just looking for a nice display to hook your Mac into, you can do better elsewhere. And, Windows 10 users will have a much better display experience elsewhere, too.",
    "If you're a photographer or a video editor looking for an affordable pro-level display, and you're ok with the smaller screen size and thicker bezels, you could find a lot to love here."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "11": "Performance",
    "16": "Final verdict"
  },
  "links": {
    "monitors": "https://www.techradar.com/news/computing-components/peripherals/best-monitor-9-reviewed-and-rated-1058662",
    "USB-C monitor": "https://www.techradar.com/deals/best-usb-c-monitors",
    "Macs": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "4K monitor": "https://www.techradar.com/news/best-4k-monitors",
    "LG 27UD88-W": "https://www.techradar.com/reviews/lg-27ud88-w",
    "gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review"
  }
}