{
  "source": "https://www.techradar.com/reviews/sonos-ikea-symfonisk-bookshelf-speaker",
  "title": "Sonos IKEA Symfonisk bookshelf speaker review",
  "category": "audio-visual",
  "updated": "2019-09-13T09:36:30Z",
  "author": "andrew-murphy",
  "summary": "IKEA has helped to design the cheapest speaker in the Sonos ecosystem",
  "verdict": "The Symfonisk neatly sidesteps outright gimmickry with a surprisingly competent speaker.",
  "pros": [
    "Full-bodied, focused presentation",
    "Fully integrated into Sonos ecosystem",
    "Literally a bookshelf"
  ],
  "cons": [
    "Lacks some subtlety",
    "Not the best Sonos audio"
  ],
  "article": [
    "There were two quite clearly defined camps when Sonos and IKEA revealed their plans to collaborate on a range of home furnishings / wireless speakers, all under the moniker Symfonisk.",
    "To some it made a lot of sense: two companies who are literally household names – one a market leader in multi-room audio, the other a global behemoth of home interiors – sharing smarts to cater for a common audience. The fact that these would be the cheapest available Sonos components was only a boon.",
    "To others, the idea of singing bookshelves or lamps was little more than a gimmick.",
    "In truth, the Symfonisk bookshelf speaker treads the line between both camps, holding its balance while delivering a surprisingly accomplished performance worthy of both family names.",
    "If you're more partial to lamps, you can check out our Symfonisk lamp speaker review – otherwise, read on for our take on the Symfonisk bookshelf speaker.",
    "[Update: Sonos IKEA speakers are about to get easier to control with a new puck-shaped remote that you can mount on your wall. The IKEA product page for the button only appears to be live in France, but it does reveal that it will cost €14.99. That works out at around $16 / £13 / AU$24 based on current conversion rates.]",
    "The Symfonisk bookshelf speaker is the cheaper of the pair, at $99 / £99 / AU$149 RRP, available exclusively through IKEA. If you're after something that also functions as a table lamp, the Symfonisk lamp speaker costs slightly more at $179 / £150 / AU$269.",
    "You’ll spot IKEA’s influence here, not only in this Symfonisk speaker’s dual purpose as a wall-mounted bookshelf – it’ll hold up to 3kg of books, ornaments or whatever else you decide for it to hold – but in its clean, unassuming aesthetic.",
    "Wall mounting could be hugely useful, regardless of whether you decide to put anything on it, especially if you plan to use a pair as rear audio channels for your TV. It’s worth keeping in mind that the Symfonisk bookshelf can be placed horizontally or vertically on any solid support. Essentially, it can be used just as any other wireless multi-room speaker.",
    "The Symfonisk bookshelf speaker will barely dominate a room if you leave it out in the open, especially if you opt for the black (rather than white) finish, its brick-like form makes it easy to tuck away virtually out of sight.",
    "You’ll have little need to tamper with the Symfonisk once you’ve set it up, either: the only connections are the power lead and wired ethernet port. The latter we’d always recommend using; although the speaker will connect to your home network via its onboard Wi-Fi, an ethernet cable will provide the strongest, most stable internet connection.",
    "The Symfonisk’s fabric-covered fascia is relatively bare as well, save for manual play/pause and volume controls. However, given Sonos’s control app – truly a market leader when it comes to multi-room software – it’s unlikely you’ll leave many fingerprints on those.",
    "The Symfonisk isn’t just an IKEA-made speaker, though – it’s also a solid entry into the respected Sonos range. It was always more or less certain the Symfonisk bookshelf would share the same basic functions as the company’s other speakers – ditching Bluetooth in favour of a home internet connection, via Apple AirPlay 2 or Spotify Connect – but its embedding goes deeper than that.",
    "It’ll link to any other Sonos component you have on your network, while you can pair two of the same Symfonisk speakers to play in stereo. Perhaps more impressive, though, is that you can link to one of Sonos’s existing home cinema components – namely the Sonos Beam, Playbar or Playbase, or the Sonos Amp – to use the speakers as rear channels in a 5.0 or 5.1 surround sound package.",
    "You needn’t worry about forward planning either, as the Symfonisks will be afforded all the same updates as any other Sonos speaker – other than those pertaining to voice control, which is probably the only glaring omission.",
    "It’ll only take a few moments to connect to your speaker through the Sonos app, where you’ll find various means of optimizing the Symfonisk for its finest possible sonic performance. One such is TruePlay, which uses the microphone in your smartphone or tablet to scan the shape of the room you're in – and whether any hard surfaces will be affecting the acoustics – and amend the EQ settings accordingly.",
    "The app also features a simple two-band EQ, to fine-tune bass and treble response. It isn’t often we would stray far from the default settings, but the versatility of this Symfonisk’s placement means you may want to play around depending on whether you’ve mounted it on a wall or placed it elsewhere.",
    "For reference, we tested the speaker mainly seated on a thick wooden table, and took out a little bass while leaving Sonos’s Loudness feature on – the latter affording a little extra punch and vibrancy to the sound.",
    "For those sceptical of how good a bookshelf can sound, the audio performance is better than you might expect. From the off, the Symfonisk is bold, focused and full-bodied, and certainly not shy about throwing music into the room.",
    "There is a little rolling off of treble frequencies – as often you might expect from a wireless speaker around this price – but overall there’s a good tonal balance and smooth output. We recommend quieting the bass in the EQ settings, though: it will open the soundstage a bit wider and prevent speakers and instruments from sounding like they’re crammed into an overly tight space.",
    "In a nutshell, the Symfonisk bookshelf speaker is rather a blunt instrument, but one that can be highly effective if wielded in the right manner. Rhythmically, instruments seem fairly well organized, but it is far from the expert timing of the Sonos One – which was previously the entry-level option for the company’s multi-room speakers.",
    "If that sounds altogether negative, it shouldn’t. Those licking their lips at the prospect of nabbing a Sonos One-style performance at half the price will be disappointed, but there are still many of the hallmarks that make Sonos speakers so great.",
    "The Symfonisk bookshelf speaker delivers a forward, full-bodied presentation that does often demand a keen ear – not to mention its feature set belying a truly tempting price tag. Though it doesn’t set any new standards, it’ll make a fine addition to many multi-room set-ups, while being a great starting point for many others too."
  ],
  "headers": {
    "6": "Price and availability",
    "7": "Design",
    "12": "Features",
    "15": "Performance",
    "21": "Verdict"
  },
  "links": {
    "plans to collaborate": "https://www.techradar.com/news/sonos-and-ikea-collaborated-to-make-a-speaker-lamp-and-bookshelf-speaker",
    "Symfonisk lamp speaker review": "https://www.techradar.com/reviews/sonos-ikea-symfonisk-lamp-speaker",
    "Sonos IKEA speakers are about to get easier to control": "https://www.techradar.com/news/sonos-ikea-speakers-are-about-to-get-easier-to-control",
    "IKEA product page": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5250219668639460000&xs=1&url=https%3A%2F%2Fwww.ikea.com%2Ffr%2Ffr%2Fp%2Fsymfonisk-telecommande-volume-noir-40433780%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fsonos-ikea-symfonisk-bookshelf-speaker",
    "IKEA": "https://www.techradar.com/techradar/articles/www.ikea.com",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Sonos Beam": "https://www.techradar.com/reviews/sonos-beam-review",
    "Playbar": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/sonos-playbar-1130807/review",
    "Playbase": "https://www.techradar.com/reviews/sonos-playbase",
    "Sonos Amp": "https://www.techradar.com/reviews/sonos-amp",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review"
  }
}