{
  "source": "https://www.techradar.com/reviews/apowersoft-free-online-screen-recorder",
  "title": "Apowersoft Free Online Screen Recorder review",
  "category": "computing",
  "updated": "2020-08-19T06:43:51Z",
  "author": "cat-ellis",
  "summary": "Record, annotate, edit, export",
  "verdict": "A feature-packed screen recorder with no time limits or unsightly watermarks, made all the more exceptional by the fact that it runs in your web browser.",
  "pros": [
    "No time limits",
    "No watermarks",
    "Highly customizable"
  ],
  "cons": [
    "Requires a browser plugin"
  ],
  "article": [
    "Apowersoft produces two screen recorders. The first, which we're reviewing here, is a web-based tool that runs in your browser, while the other (accessed on the same site by clicking 'Download desktop version') is a premium application that's only available as a limited free trial unless you buy a subscription.",
    "Apowersoft Free Online Screen Recorder is completely free to use, with no time limitations, paywalls or watermarks. However, although it runs in your web browser, you'll still need to download and install a small launcher application before you can use it. Click 'Start recording' and follow the instructions (it works for both Windows and macOS).",
    "You'll be presented with a recording toolbar, and the centre of your screen will be selected by default. Use the drop-down menu to choose the part of your screen to be recorded (the full screen, a custom area, or a space the same dimensions as a mobile device).",
    "The cog-shaped Settings button offers an impressive array of options. You can customize keyboard shortcuts, the output directory for your videos, cursor highlighting, frame rates and much more. Few desktop screen recorders offer so many customization options, let alone web-based tools.",
    "When you're ready to record, just click the red button and wait for the countdown. You can choose to capture footage from your screen or a webcam, with audio from your soundcard, a microphone, both or neither.",
    "Apowersoft Free Online Screen Recorder is impressive. Once you've installed the launcher it's very easy to use – if you're happy with the default settings, you can start recording with a single click.",
    "You can annotate the screen while you're recording – ideal for software tutorials and walkthroughs – and the finished file can be uploaded to Vimeo, YouTube, Dropbox or Google Drive. You can also save it to your PC or Mac as a video or GIF file, or launch Apowersoft's video editing application to edit it.",
    "It's not suitable for recording games, but for any other tasks, Apowersoft Free Online Screen Recorder is brilliant."
  ],
  "headers": {
    "5": "User experience",
    "8": "You might also like"
  },
  "links": {
    "screen recorders": "https://www.techradar.com/news/the-best-free-screen-recorder",
    "Apowersoft Free Online Screen Recorder": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3500217052241752000&xs=1&url=https%3A%2F%2Fwww.apowersoft.com%2Ffree-online-screen-recorder&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fapowersoft-free-online-screen-recorder"
  }
}