{
  "source": "https://www.techradar.com/reviews/durabook-s14i-rugged-laptop",
  "title": "Durabook S14I rugged laptop review",
  "category": "computing",
  "updated": "2019-07-28T15:50:36Z",
  "author": "desire-athow",
  "summary": "Billed as the world’s toughest semi-rugged computer",
  "verdict": "The Durabook S14I is a good semi-rugged laptop at a nice price but let down by a disappointing performance - both performance wise and on battery life - especially given the quality of the components used.",
  "pros": [
    "The most affordable semi-rugged out there",
    "Very solidly built",
    "Excellent expansion capabilities"
  ],
  "cons": [
    "Very poor storage performance",
    "Shockingly battery life",
    "Coil Whine/Static",
    "Touchpad performance is abysmal",
    "Rating"
  ],
  "article": [
    "Durabook has carved a small but lucrative niche in the world of ruggedised laptops. Twinhead International Corporation, its parent company, has been manufacturing laptops since the early 1990s, and introduced the concept of semi-rugged laptops in 2002. The latest iteration of that long line of devices is the Durabook S14I which retails for €2,478.00 (about £2,221, $2,780); the basic SKU starts from £1269/€1434.",
    "This is not your average business laptop. It is an out-and-about, burly, heavy and not-so-insignificant notebook, like the ones you would probably see in action movies being used to knock out foes and enemies. The Durabook S14I model sent to us weighs a hefty 2.92Kg which far more than the 2.3Kg quoted in the marketing literature. Extra accessories are to be blamed for the weight gain; more on that later.",
    "With a footprint of 35cm x 29cm and a thickness exceeding more than 4cm, it is far more voluminous than thin-and-light laptops with similar configuration. It is also far more expandable and, of interest to us, in another league when it comes to durability and ruggedness.",
    "Durabook used a Magnesium alloy chassis with plenty of plastic to absorb shocks, bumps and scratches. At its thickest, for example, the screen’s bezel reaches 40mm. So much protection means that it easily adheres to IP53 and MIL-STD-810G certifications. No, it won’t survive being submerged in salt water but almost everything else should be fine, including a 4ft drop.",
    "The screen is recessed by about 5mm, an order of magnitude more compared to normal laptops. A privacy flap hides the webcam and the base itself is a good 25mm thick, making it a challenge for whoever wants to try touch typing for a prolonged period.",
    "The front of the device contains a handle as well as indicator lights for power, two batteries, wireless connectivity and network. On the right is a removable caddy that houses the system drive, a headphone socket, an SD card reader and a Wi-Fi switch. The last flap houses three full size USB ports, one of which is a USB 2.0.",
    "The back hosts, behind two separate flaps, one HDMI connector, a USB 2.0 port, VGA, DB15/Serial and LAN connector. The left hand side houses two swappable bays; ours had a DVD writer and a battery but you can swap the former for another bigger battery and the latter for a smart card reader.",
    "Note that all flaps are tightly fitted and you will need to use your fingernails to open them. If yours is too long, there’s a real risk of breaking them.",
    "Flipping the laptop over reveals POGO connectors as well as air vents to cool the laptop’s components as well as three release latches. Three screws hold a flap together; removing allows easy swapping of the main hardware parts. The AC adapter provided is a brick model rated at 65W.",
    "Three CPU options are available: two Core i5 CPU (8250U and 8350U) and a Core i7 (8650U). The S14I has two memory slots and ours came with both filled with 8GB memory modules.",
    "Interestingly, there’s a MXM socket that can accommodate an optional Nvidia GeForce GTX 1050 GPU.",
    "The wireless connectivity is handled by an Intel 9560 chipset and there’s a 49.84WHr battery which is one of the biggest we’ve seen on a ruggedised device.",
    "We were puzzled by the performance of the Durabook S14I given that our device was using an Intel Core i7-8550U, arguably, one of the fastest CPUs Intel currently has in its mobile arsenal. Truth be said, it was obliterated by the Intel Core i5-8565U found in the LifeBook U939X in all our tests.",
    "If that wasn’t bad enough, its storage performance was horrible with read/write speeds of about 30MBps, slower than a hard disk drive and a fraction of what we’d expect from a Micron SSD. A fault in the connector of the removable dock might explain the very poor numbers but that casts a rather worrying shadow on the quality of control.",
    "As for the battery life, it is bad as well. The Durabook S14i is the least efficient laptop we’ve ever tested, running down its big 50Whr battery in 155 minutes. Only the Eurocom Tornado F7, a mobile workstation that belongs to another category altogether, did worse.",
    "The keyboard is what you’d expect from a ruggedised laptop; utilitarian, almost scrabble-like keys with a harder-than-average return (great when you’re wearing gloves), generous key spacing and travel. Not too noisy and a good layout with programmable keys and a fingerprint reader located on the side, on the right edge.",
    "The touchpad on the other side is another disappointing experience. This particular model doesn’t have any gaps between the palm rest and the active surface. What that means is that there’s no downward physical movement when you press on it. In addition, the material chosen for its surface is granular rather than smooth, making it uncomfortable. It does have two physical mouse buttons though.",
    "Any positives? The Durabook S14I runs on Windows 10 Pro and comes with no bloatware, which is a breeze of fresh air compared to other business laptops. The 14-inch full HD display is also a highlight; perfectly usable in broad daylight, with decent viewing angles, a good contrast and responsive to touch.",
    "The Getac K120 is a potent rival although it is more of a convertible rather than a fully-blown laptop. It transforms into a tablet once you pull it out of its docking station. At $4,648 back in May 2019 for a model with all the trimmings, it is a bit more expensive than the S41I but then again remember that this is a detachable slate.",
    "Dell’s Latitude 7424 Rugged is another formidable candidate with plenty of hardware options; you can add a discrete GPU, up to 32GB RAM and a DisplayPort connector and even a PCMCIA card reader (remember those?). A model with 8GB of RAM and 256GB retails for around $3,600 at the time of writing with the code, SAVE35.",
    "The Panasonic Toughbook 54 Performance semi-rugged laptop is also a capable competitor to the Durabook S41I. The latter however has a much better processor (the Toughbook offers 7th generation Kaby Lake parts only) while the Panasonic model boasts a discrete graphics card by default, Panasonic’s pedigree and a competitive price.",
    "The Durabook S14I is far more expensive than most laptops out there (with the notable exception of Apple’s MacBook Pro series) and yet it is cheaper than the competition making it a bit of a bargain if a business is looking to buy a truckload semi-rugged devices with the blessing of the CFO.",
    "It enjoys the qualities and compromises that come with the ownership of a ruggedised device but where it let us down significantly was in its overall performance. What made it worse was that it was unexpected given the quality of the components used. It may well be - and we hope that it is - a one-off.",
    "Do we recommend it? Reluctantly yes given how cheaper it is compared to the competition and because performance apart, it is actually a nice product to use."
  ],
  "headers": {
    "1": "Design",
    "9": "Hardware",
    "12": "In use and performance",
    "18": "Competition",
    "21": "Verdict"
  },
  "links": {
    "Durabook S14I": "https://www.groupmobile.com/hardware.html?___store=default&manufacturer=55",
    "Getac K120": "https://www.techradar.com/reviews/getac-k120-ruggedized-laptop",
    "Latitude 7424 Rugged": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1342511918650133800/https://www.dell.com/en-us/work/shop/cty/pdp/spd/latitude-14-7424-laptop/xctol742414us",
    "Panasonic Toughbook 54": "https://na.panasonic.com/us/support/product-configurator#/customize-model?searchType=base&baseModel=663&variant=Performance"
  }
}