{
  "source": "https://www.techradar.com/reviews/msi-gs75-stealth",
  "title": "Hands on: MSI GS75 Stealth review",
  "category": "computing",
  "updated": "2019-01-07T21:58:11Z",
  "author": "joe-osborne",
  "summary": "Thin, light and all screen",
  "verdict": "The MSI GS75 Stealth takes the best of the GS65 Stealth and blows it all up to 17.3 inches, while implementing Nvidia’s latest graphics. Color us impressed and ready for a full review.",
  "pros": [
    "New RTX graphics",
    "Excellent design",
    "Plenty of ports"
  ],
  "cons": [
    "No keyboard macro keys",
    "A little hefty"
  ],
  "article": [
    "MSI took the opportunity at CES 2019 to unveil a major addition to its thin-and-light flagship gaming laptop line: the 17.3-inch MSI GS75 Stealth. The company’s first 17-inch thin-and-light laptop for gaming comes with all the trimmings you’d expect.",
    "That includes a completely anodized aluminum frame containing one of the latest Intel Core i7 processors and up to Nvidia GeForce RTX 2080 Max-Q graphics driving a 17.3-inch, Full HD display with a 144Hz refresh rate and thin bezels all around.",
    "This all comes in a package that’s just 0.75 inches (19.05mm) thick. So, will you want to pick this thin-and-light beast when it launches this year? Early signs say it definitely deserves your attention.",
    "Unfortunately, MSI has yet to disclose the price, release date and global availability for the GS75 Stealth, simply promising that it will be the first to market with a 17-inch thin-and-light gaming laptop with RTX 2080 graphics inside.",
    "MSI isn’t even releasing the full specification details, but expect up to Intel Core i9 H-series processors and the gamut of Nvidia RTX graphics cards, with a full-fat RTX 2060 and the 2070 and 2080 options in the Max-Q design.",
    "These parts will be back by an unspecified amount of DDR4 memory and either NVMe M.2 or straight M.2, with room for up to three SSDs inside. These can be accessed and upgraded through MSI’s easy-access panel.",
    "It may sound reductive, but it’s true that the MSI GS75 Stealth looks and feels a lot like a simply larger MSI GS65, and that’s no bad thing. The all-black aluminum frame adorned with brass accents all over returns, but this time the dual hinges are fully brass-colored and that much more attractive.",
    "While still too wide to fit into most backpacks, the GS75 Stealth at just 0.75 inches thin should make transport a lot easier. The laptop is a bit heftier than we would like to carry around in our bag, at 6.06 pounds (2.75kg) but this is a better trade-off than it’s ever been.",
    "MSI has also brought its long-standing partnership with SteelSeries to this laptop, with a keyboard provided by the company featuring per-key RGB backlighting. The lighting reacts to in-game events, and the keys are plenty punchy and offer satisfying travel.",
    "As for the 144Hz, 1080p display, we’ve seen it first hand and it truly pops. We noticed little to no screen tearing as a demonstrator played Assassin’s Creed Odyssey on the laptop. It’s not going to wow you with its sharpness, but the point is speed.",
    "While we can’t speak too definitively of performance having not benchmarked it, but the parts on offer inside the GS75 Stealth definitely give away a high power profile. With this setup, you could easily play the latest games with ray-tracing activated at playable frame rates.",
    "NVMe PCIe SSD options should make for speedier game load times as well, which is crucial when you’re crunched for time and want to get a game session in. Meanwhile, MSI’s improved Cooler Boost Trinity+ fans are cooling the system, supposedly more efficiently than ever.",
    "As for battery life, MSI is keeping its lips tight on that front. We don’t expect much from a gaming laptop of this size, but we’ll see for sure in a full review.",
    "The MSI GS75 Stealth takes what made the GS65 Stealth an Editor’s Choice winner and blows it out to 17.3 inches – we have nothing to complain about that. The power profile in this laptop, coupled with its relative portability, will be a force to be reckoned with in 2019.",
    "Of course, this won’t feel like a MacBook Air in your backpack, so understand that this is about as portable as a 17.3-inch gaming laptop gets. Also, we’re a bit bummed by the lack of macro keys, given the laptop’s size.",
    "All in all, we’re immediately impressed by the MSI GS75 Stealth, bringing the best of the 15.6-inch GS65 Stealth into an even bigger package. Here’s to seeing how the laptop holds up in a full review.",
    "Check out all of TechRadar's CES 2019 coverage. We're live in Las Vegas to bring you all the breaking tech news and launches, plus hands-on reviews of everything from 8K TVs and foldable displays to new phones, laptops and smart home gadgets."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design and display",
    "10": "Performance",
    "13": "Early verdict"
  },
  "links": {
    "CES 2019": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "MSI GS65": "https://www.techradar.com/reviews/msi-gs65-stealth",
    "TechRadar's CES 2019 coverage": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets"
  }
}