{
  "source": "https://www.techradar.com/reviews/snes-classic-mini",
  "title": "SNES Classic Mini review",
  "category": "gaming",
  "updated": "2021-11-09T14:53:19.399Z",
  "author": "jon-porter",
  "summary": "Take a trip down 16-bit memory lane",
  "verdict": "Every bit as lovingly designed as its predecessor, the palm-sized device is packed with almost every one of the best games produced for the system, and includes the bonus addition of the never previously released Star Fox 2. With the SNES Classic Mini, Nintendo has really hit its retro console stride.",
  "pros": [
    "Two controllers in box",
    "Great selection of classics",
    "Star Fox 2 is a great addition"
  ],
  "cons": [
    "Controller cords could be longer",
    "Front port cover is a little flimsy",
    "No AC adapter in UK box"
  ],
  "article": [
    "For those of us who grew up playing the original Super Mario, Zelda or Final Fantasy games, the current resurgence of retro games and consoles is a beautiful, pixelated delight.",
    "Of course for anyone else all the retro game furore might either be fun or confusing as hell. However, it's the gamers who clearly remember those early titles that the SNES Classic Mini is really aimed at. This is a console unashamedly for those who miss the good ol' days of gaming.",
    "Even before the Wii's 'Virtual Console' gave us the ability to buy and play select classics on new hardware, Nintendo has been consistently committed to bringing back many of its classic games. Until now, these have usually been through re-releases or bundled collections on new platforms.",
    "But the SNES Classic Mini is a little bit different. It represents an all-in-one retro gaming experience along with the authentic, Nintendo-made hardware.",
    "While the NES Classic Mini suffered from some annoying design quirks that got in the way of all the nostalgic Nintendo fun, the SNES Mini largely solves these problems, as well as throwing in some new features.",
    "You can get a few key NES games on the Nintendo Switch Online service anyway – but for now the SNES Classic Mini is the place to get your hands on some straight-on SNES nostalgia.",
    "The SNES Classic Mini comes in two distinct styles. Our review unit is the version that was released in Europe, Australia and Japan – it has a grey chassis and red, yellow, green and blue face buttons, while North Americans have to make do with a purple-accented model.",
    "We're not going to wade into the 25 years worth of arguments about which version of the console is the better-looking one, but suffice to say the UK/Australia version looks better, and anyone who thinks otherwise is just plain wrong. Sorry (not sorry).",
    "As you can see, the console itself is very similar in design to the NES Mini. It's compact and it's light, but it feels sturdy enough when placed in front of your TV.",
    "On the top of the machine, the console has the same power and reset buttons found on the NES Mini. The power control is a sliding switch this time around, and there’s also a fake button labelled 'Eject'. Unsurprisingly, considering the console’s lack of cartridges, it doesn't do much.",
    "So far, so NES Mini, which is to say it's a machine designed with all the love and respect in the world for its source material. Some people might find that ludicrous, but we reckon most Nintendo fans will lap it up.",
    "Round the front of the machine, however, things take a turn for the worse, with a fake pair of controller ports which need to be removed to reveal the real deal behind them.",
    "It's a minor point, sure, but having this fake front means the console looks a little untidy when you're using it – it's awkwardly pulled down by the controller lead, and the whole console just doesn't look as well put-together as its older brother.",
    "Thankfully, with the controller, Nintendo appears to have made the single biggest improvement over the NES Mini.",
    "When the first retro console came out in 2016 it was universally criticized for having a ridiculously short controller cable that was just 30 inches (around 76cm) long.",
    "Thankfully the length of the cable on the SNES Mini controller has been upped to a much more respectable 56 inches (around 142 cm). In our home it's still not quite long enough to reach all the way to our couch, but it's much better than having to hover right in front of the television.",
    "For comparison's sake, the SNES’s controller was around 90 inches (around 228 cm) long.",
    "So the SNES Mini's controller is better, but in our ideal world its cord would be longer still. Maybe if Nintendo ever puts together a Nintendo 64 Mini it will finally reach parity with the original console...",
    "The controller itself feels great, and has that Nintendo quality that's always missing from third-party gamepads. Compared to the ultra-clicky buttons on the Nintendo Switch you might find the SNES's controller buttons a little squashy, but they're still very usable.",
    "People have pointed out that the controller isn't quite the same as the one that came with the original console, but the differences are minor enough to only be apparent if you place the two next to each other.",
    "Thanks to its connector, you should also be able to plug the controller into a WiiMote and use it to play SNES games on the Wii or Wii U's virtual console, should you want to play any games that aren't included on the SNES Mini itself.",
    "Two controllers come in the box, which means the machine is immediately ready for some multiplayer gaming. It's another key improvement over the original, and we're very thankful for it.",
    "If you really don't like the controllers, we've got a simple fix – if you're willing to splash a bit more cash that is. 8bitdo released a wireless controller for the SNES, which looks almost like the native one but with a slightly grayer face. Just pop the accompanying wireless dongle into the slot where you'd place the standard controller wires and you're good to go!",
    "Boot up the SNES Mini and you're greeted with the same fantastic retro-styled user interface as the NES Mini has.",
    "Scrolling left and right allows you to choose from your list of games, which can be sorted by name, number of players, how recently they were played, release date, or publisher.",
    "Nintendo’s been emulating most of these games in some form or another for years, so it's no surprise that the SNES Classic MIni offers a pretty perfect recreation of them.",
    "By default the games are emulated with a slight smoothing filter applied, to take the rough edges off the pixels that would have been smoothed out by CRT televisions of old, but you can also run them with 'pixel perfect' emulation if you choose, or else apply a slightly heavy-handed CRT filter for some real scanline goodness.",
    "We were perfectly happy to leave the console set to its default mode, but if your personal preferences differ then these alternative options should have you covered.",
    "Switching between games is handled by the console's 'Reset' button. It's a little annoying when you first get the console out of the box and you're gleefully switching from game to game to try everything out, but by the time you sink your teeth into a title, having to use the button is no more annoying than switching cartridges or discs in consoles before the days of downloadable games.",
    "Although playing these games with the SNES Mini's controller feels like as authentic an experience as you're likely to get, Nintendo has allowed for a couple of modern conveniences with the updated hardware.",
    "Making a return are save states, where you're prompted to use whenever you jump out of a game (a process that still, somewhat annoyingly, requires you to press the Reset button on the console itself). You can save up to four states, which should be more than enough for most people.",
    "New to the SNES Mini, however, is the ability to rewind save states by up to 45 seconds. You do this by selecting a save state and hitting the 'X' button, and you can then scroll back through your gameplay to pick a moment to retake control.",
    "Yes, you could absolutely use this feature to cheat your way through the harder games included on the console, but we'd be much more inclined to make use of it if we suddenly died at the end of an otherwise flawless run of a level in Contra III.",
    "With saves often being much less convenient in these older games, the rewind feature ends up being a bit of a lifesaver. On one occasion we were having so much fun in Super Metroid that we forgot to save for almost half an hour – and being able to quickly rewind the game after death was far preferable to playing through the entire section again.",
    "Yes, it's cheating, but you're free to not use it if it bothers you.",
    "With a starting library of just 20 games Nintendo is inevitably going to leave a few people disappointed (cough, Chrono Trigger fans, cough), but for our money we think the SNES Classic Mini has more or less every game on it that you'd bring up in a conversation about how great the old console was.",
    "As we mentioned above, there is now a hack available if you want to get some more titles on the box through unofficial channels.",
    "What's surprising is how well many of the games have aged. Super Metroid might be a 2D, 16-bit title, but it could easily be released today as a retro-styled indie title and you wouldn't bat an eyelid. It's tight, it's polished, and it's just as easy to understand and play today as it was over 25 years ago when it was first released.",
    "The Legend of Zelda: A Link to the Past continues to look absolutely incredible, with the level of artistry that goes into something as simple as Link's animation wondrous to behold. There's a reason why people continue to claim this is the best Zelda game, and the result is its utterly timeless appeal.",
    "Oh, and then you've got Super Mario World and Final Fantasy III (known as Final Fantasy VI in Japan), which are both probably the best games ever released in their respective genres.",
    "There's a reason these games have spawned entire genres, but what's incredible is that although more recent releases have added and tweaked them, the cores that are present in these originals are just as enjoyable and playable as ever.",
    "There are a couple of games in here that haven't aged quite as well, not because of the way they look but because of their slightly dated design conventions. Super Ghosts and Ghouls and Contra III still look great, but we found them a bit of a slog to play through. Call us 21st century mollycoddled gamers, but they weren't for us.",
    "Despite variations in how fun we found each of the games, almost every single one of them is a classic that in its own way went on to define the modern gaming landscape.",
    "Of course, the most notable game included on the console is Star Fox 2, a game that until now has never actually been released. It was originally in development in the 1990s as a sequel to the original game, but was canceled close to release due to Nintendo shifting its focus towards the Nintendo 64 console.",
    "You'll need to complete a portion of the original Star Fox to unlock it for play, but once you do so, you'll find it a fascinating look into a bygone era.",
    "Its blocky polygonal graphics (which were only possible on the 2D-focused console thanks to the mythical Super FX chip that was built into the game's cartridge itself) are a little rough, but look past the dated exterior and there's still a fun shooter at its core.",
    "It might not appeal to everyone, but its inclusion is a massive win for gaming history enthusiasts.",
    "Yes, in an ideal world the SNES Classic Mini's game library would be limitlessly expandable, but we'd argue that at a certain point it would lose the charm of being a simple offline device, free from the firmware updates and DLC of modern gaming.",
    "If you're desperate for more games to play, you can always use the controllers to play more games on the Wii’s virtual console, or you can take matters into you own hands and hack the console yourself...",
    "Disappointed by the lack of games? Us too. Check out our rundown of the 10 classic games the SNES Mini is missing.",
    "Although Nintendo could have gotten away with releasing a slightly modified NES Mini and updated controllers, the SNES Classic Mini feels like a much more complete package.",
    "Including two controllers in the box is a great move, while the selection of games covers almost all of the classics – and the added rewind function means you should be able to make it through even the most unapproachable of the bunch.",
    "With just 21 games it's inevitable that some are going to be disappointed, but the inclusion of Star Fox 2 is a win whichever way you look at it. An expandable games library would have pleased more people, but even then it's unlikely that every game would have managed to come along for the ride.",
    "We have a couple of gripes with the console, and both are to do with the controllers. The first is the small plastic flap that covers the two controller ports. Having to leave this open while the controllers are plugged in makes the console look a little disheveled while in use.",
    "The second is that the length of the controller cables still leaves a little to be desired. It’s better than the NES Mini, sure, but considering that Nintendo has tacitly admitted it was an issue, it's surprising that the company didn't go all the way and make the cables as long as the original's.",
    "But beyond that, this is exactly what you'd want a retro console to be: lovingly designed, packed with classics, and functional for a modern audience. Whether you're looking to revisit the games of your youth, or get introduced to them for the first time, the SNES Classic Mini is a real treat."
  ],
  "headers": {
    "6": "Design",
    "23": "Functionality and user interface",
    "35": "Games",
    "50": "Final verdict"
  },
  "links": {
    "NES Classic Mini": "https://www.techradar.com/reviews/nintendo-classic-mini-nes",
    "Nintendo Switch Online": "https://www.techradar.com/news/nintendo-switch-online-release-date-features-and-online-multiplayer",
    "a wireless controller for the SNES": "https://www.techradar.com/news/bring-your-snes-classic-edition-into-modernity-with-this-wireless-controller",
    "a hack available": "https://www.techradar.com/news/good-news-the-snes-classic-mini-is-just-as-hackable-as-the-nes-classic-mini-was",
    "hack the console yourself": "https://www.techradar.com/news/good-news-the-snes-classic-mini-is-just-as-hackable-as-the-nes-classic-mini-was",
    "the 10 classic games the SNES Mini is missing": "https://www.techradar.com/news/10-classic-games-the-snes-mini-is-missing"
  }
}