{
  "source": "https://www.techradar.com/reviews/beelink-l55-thin-client-mini-pc",
  "title": "Beelink L55 thin client mini PC review",
  "category": "computing",
  "updated": "2019-12-10T06:45:50Z",
  "author": "desire-athow",
  "summary": "A surprising little workstation that packs a lot of value",
  "verdict": "The Beelink L55 is a fantastic piece of hardware marred by minor issues that can be easily resolved. Buy it while you can if you are in the market for a capable thin client/mini PC with a few tricks up its sleeve.",
  "pros": [
    "Capable processor",
    "Dual Gb LAN ports",
    "DisplayPort plus HDMI",
    "Generous amount of RAM and storage space",
    "Keen price"
  ],
  "cons": [
    "No card reader",
    "USB 2.0"
  ],
  "article": [
    "Beelink is a known quantity at TechRadar HQ. This Chinese manufacturer has, over the past three years, carved a niche in the competitive mini PC market with devices such as the BT7, the minuscule A1 and the enticing M1. it is now back with, what looks on paper, as its best mini PC yet.",
    "Physically, nothing about the L55 points to an exciting product. It has a dark grey finish, with a matt rubber coating which is probably - in our opinion - the best option for a mini PC. The front houses a red button, two USB 3.0 ports (one allowing fast charging) and an audio connector. No card reader which is a bit of a disappointment and no VESA mount; you are however provided with a bracket that allows you to put the mini PC at the back of a monitor or even on the wall.",
    "The rear is where all the interesting things are located; there’s two dual Gigabit LAN ports for a start plus a full DisplayPort connector as well. That complements four USB ports (two of which are USB 2.0), an HDMI connector and a proprietary power port.",
    "There’s plenty of air vents on the sides and a small one at the back; there’s none on the front and on the bottom. This palm-sized mini PC measures 12.80 x 12.60 x 4.60cm with a weight of only 342g (excluding the power adapter).",
    "The L55 uses an old but still very capable processor, the Core i3-5005U. This is a four year old CPU with two cores, four threads, a 2GHz frequency, 3MB cache and a 15W TDP. Its Intel HD Graphics 5500 is still capable of driving two 4K monitors and its average Passmark score of 2909 is decent.",
    "That’s paired with 8GB of RAM (single slot), a 256GB M.2 SSD and an Intel AC3165 wireless chip which provides wireless connectivity (Bluetooth 4.2 and 802.11ac). Unlike the M1, the L55 gives you the option to add an extra SATA-based 2.5-inch drive, either a hard disk or SSD.",
    "All in all, the L55 has all the hallmarks of a very capable entry level workstation, will the benchmarks confirm this?",
    "The L55 runs on Windows 10 Home without any bloatware which is always a good sign. A blue LED light confirms that the device is indeed on. One thing you will notice straight away is the whirring of the fan, whose pitch is determined by the load on the PC. Unlike other PCs, where the fan goes only on or off, this one has a variable speed.",
    "When it comes to performance though, numbers put it somewhere between the M3-6Y30, an old favourite of Chinese manufacturers that is popular in laptops, and the Pentium Silver J5005. In other words, it is good enough for most tasks when it comes to compute; its storage subsystem is similarly adept thanks to a proper SSD rather than eMMC storage and 8GB of system memory help it score an honest overall score of 1530 on Passmark.",
    "If you have a spare Windows 10 license, looking at barebones alternative does make sense as it gives you more flexibility with regards to configurations. However, most businesses would probably prefer to get a turnkey system.",
    "The Chuwi GT Box is the most obvious alternative to the L55; same configuration and price. However, it can’t match the L55 when it comes to the second LAN port and the additional DisplayPort. You have to give it to the GT Box though, it does have a very nice design that’s reminiscent of the old Mac Pros.",
    "The Jumper EZbox also uses the same hardware (and price tag) but with half the SSD capacity and just one LAN port. However, some might prefer the fact that it has two HDMI ports, a card reader and a Type-C connector. HDMI ports are far more ubiquitous than their DP counterparts, especially on older displays.",
    "The L55 has a twin brother called the U55 which is essentially the same model with a HDMI connector in lieu of the DisplayPort and a Type-C connector replacing the second LAN connector. It is cheaper by $10 and while we can see the appeal of such a system, we’d still go for the L55.",
    "Beelink didn’t put a foot wrong here. The L55 is, without any doubt, one of the best mini PCs we’ve tested to date in that price range; it’s hard to believe that this is a sub $300 with a Core i3 CPU and 512GB SSD. If your business can afford a few of those (always keep one available as a spare), then the L55 should be more than capable to deliver all but the most demanding business tasks.",
    "A pair of 4K-capable video ports coupled with two LAN ports and plenty of system memory and storage means that this is a unique product at a very attractive price point. The old processor shouldn’t put you off either as the Broadwell architecture can still hold its own very well."
  ],
  "headers": {
    "1": "Design",
    "4": "Specifications",
    "7": "Usage and performance",
    "9": "Competition",
    "13": "The business take"
  },
  "links": {
    "BT7": "https://www.techradar.com/reviews/pc-mac/pc-mac-desktops/beelink-bt7-mini-pc-1324365/review",
    "A1": "https://www.techradar.com/reviews/beelink-a1-tv-box",
    "M1": "https://www.techradar.com/reviews/beelink-m1-mini-pc",
    "Chuwi GT Box": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-1380704957956456700&p=https%3A%2F%2Fwww.gearbest.com%2Fmini-pc%2Fpp_009635949386.html",
    "Jumper EZbox": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-7319158584042463000&p=https%3A%2F%2Fwww.gearbest.com%2Fmini-pc%2Fpp_009125215297.html%3Fwid%3D1433363",
    "U55": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-8374919036550003000&p=https%3A%2F%2Fwww.gearbest.com%2Fmini-pc%2Fpp_009626027566.html%3Fwid%3D1433363#goodsDetail"
  }
}