{
  "source": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/acer-aspire-e15-1306852/review",
  "title": "Acer Aspire E 15 review",
  "category": "computing",
  "updated": "2019-07-02T16:00:05Z",
  "author": "jacob-grana",
  "summary": "More work than play in this all-rounder, but a great value",
  "verdict": "Acer’s Aspire E 15 is a budget laptop that offers more than its asking price suggests. This chunky device features a huge variety of ports, a top notch processor and a super comfortable keyboard. It even games a little, though the enterprise user or student is really this laptop’s target market.",
  "pros": [
    "Lighter than it looks",
    "Work (and finger) friendly keyboard",
    "Lots of new and old ports and inputs",
    "Huge touchpad"
  ],
  "cons": [
    "Flimsy construction",
    "Bland display"
  ],
  "article": [
    "Describing Acer’s 15.6-inch Aspire E 15 laptop couldn’t be easier. It has all the things you want, all the things you don’t want, and all the things you thought were buried with the ET Atari 2600 carts in that New Mexico landfill.",
    "That may be a little vague, so here are some clearer details: the E 15 has a numpad keyboard, VGA port and optical drive. Compared to today’s high-end computers, we wouldn’t blame you for looking for the VHS slot (betamax versions are releasing soon – we kid).",
    "In all seriousness, the E15 is a fine laptop. Better than fine, actually. This laptop plays games, it multitasks, it connects with everything and, yes, it really does feature an optical drive. It’s a budget laptop that will get you through all of your daily duties – just don’t expect to play the Witcher 3 on its highest settings.",
    "It’s quite a large laptop, though – which it needs to be to fit all of those features in. For some, a five pound device doesn’t warrant a second look, but if you’re on a budget, you really should consider the Acer Aspire E15.",
    "Plus, with Amazon Prime Day coming on 15th July 2019, we may see further price cuts to the Acer Aspire E 15. This will make it an even more compelling buy if the price drops further.",
    "The Aspire E 15 is no looker, but at least its price isn’t an eyesore. At $599 (£424, about AU$779), Acer’s jack-of-all-trades device leaves your piggy bank intact.",
    "Key competitors, like the Dell Inspiron 15 7000 ($999, £1,399, AU$1,499) and the HP Pavilion 15t ($849, £458, AU$1,545) are no wallet-busters either, but they’re still not as cheap as the E 15.",
    "Of the bunch, Dell’s Inspiron is the only device marketed as a true gaming laptop, and its optional GTX 1060 graphics chip backs up that claim. For the Aspire E 15 and the Pavilion 15t however, gaming is merely a side-quest: they’re sporting an MX150 and 940MX, respectively.",
    "The Aspire E 15 is also highly customizable: models with processors from AMD to the Core i7 can be had, depending on your budget. To no one’s surprise though, Acer is pushing the E 15 configuration that showcases Intel’s 8th generation Core i5.",
    "This processor is the stand-out piece of hardware on an otherwise pedestrian spec sheet, and it helped our review Aspire E 15 more than hold its own on our benchmark tests. (The Inspiron 15 7000 and Pavilion benchmark well too, but they’re top-tier configurations have Intel‘s older, 7th gen processors.)",
    "When you think ‘15-inch laptop,’ ‘fit’ isn’t the typical descriptor that comes to mind. Too often, 15-inchers are bulky, chunky and wonky – not the E 15. Because it’s weight is evenly distributed across the device, the E 15 avoids the paperweight feel that plagues a lot of big laptops. For a big-bodied device, it’s light on its feet.",
    "Unfortunately, a consequence of this ‘light-foot’ design philosophy is flimsiness. The E 15’s panels have a hollow quality – none more so than it’s display. It’s unnervingly flexible. Lift the E 15 by its screen at your peril.",
    "Wide-screen, full HD, decent viewing angles: the E 15 has nearly all the trappings of a great screen. Its one major flaw – and the one that may ultimately keep it out of movie and game night – is its poor color contrast.",
    "Grainy, gray-tinged and rather dark, the E15’s display turns any movie into something out of the French New Wave. Not bad if you’re a cinema buff, but most users will find the experience underwhelming. As much as anything, the E 15’s display makes it a work-first laptop.",
    "The shine isn’t on the E 15’s screen, but rather on its backlit keyboard. Its keys are robust and well-spaced despite having to share with a numpad; and their deep, springy travel is perfect for the professional typer. There’s a lot of real estate available on the E 15, and its keyboard uses it well.",
    "We can gladly say the same for the E 15’s extra-large touchpad. It’s big, but not gratuitous, and leaves plenty of room for resting palms. It supports multi-touch gestures and has great palm rejection as well as smooth scrolling. Its click is also solid if a little uneven – near the top of the touchpad, the action gets stiff.",
    "Further cementing the E 15’s work-first reputation is its excellent selection of both new and legacy ports. USB ports from 2.0 to Type-C, as expected, adorn the left and right sides of its base, along with an HDMI and Ethernet port.",
    "What is perhaps unexpected – and sets the E 15 apart from the Inspiron and Pavilion – is its inclusion of a VGA port and optical drive. While their presence may hurt the E 15’s profile, they certainly add to its appeal, especially for enterprise users and students. Acer’s laptop is one of the few that can accommodate so-called legacy tech, like wired projectors, which many businesses and schools still use."
  ],
  "headers": {
    "5": "Price and availability",
    "10": "Design and display",
    "14": "Inputs and connectivity"
  },
  "links": {
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Dell Inspiron 15 7000": "https://www.techradar.com/reviews/dell-inspiron-15-7000-gaming-2017",
    "HP Pavilion 15t": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/hp-pavilion-15-1320215/review"
  }
}