{
  "source": "https://www.techradar.com/reviews/chuwi-minibook-2-in-1-laptop",
  "title": "Chuwi Minibook 2-in-1 laptop review",
  "category": "computing",
  "updated": "2019-07-18T13:59:51Z",
  "author": "desire-athow",
  "summary": "Is it a tablet? Or a laptop? Or a netbook?",
  "verdict": "The Chuwi MiniBook 2-in-1 laptop is an engineering feat but probably not what we’d call a productivity champion. It will get heads to turn but you will definitely get more done on a traditional laptop. The keyboard and pointing device are simply not good or comfortable enough.",
  "pros": [
    "Affordable",
    "Speedy even in its base configuration",
    "2-in-1 works well",
    "Type-C compatible with Power Delivery mode"
  ],
  "cons": [
    "Input peripherals are challenging",
    "8-inch is too cramped",
    "Battery life could be better"
  ],
  "article": [
    "The success of the original GPD Pocket computer on Indiegogo in 2017 (more than $3.5m raised from 8,500 backers) has attracted the attention of one of the more ambitious Chinese players in the market, Chuwi.",
    "The latter has managed to raise nearly $500,000 at the time of writing (with 40 days to go) with a similar product, the Minibook. But is it better than its competitor and does it have what it takes to succeed against more traditional models?",
    "We remember fondly the first Asus EEE PC 701 from 2007, the original UMPC (Ultra Mobile Personal Computer). It was a head turner, captured the imagination of millions and sparked a true computing revolution. The Minibook is the closest to the original netbook that we’ve seen in years.",
    "Chuwi engineers have opted for an 8-inch display rather than a 7-inch one; their rationale is that it is the ideal size for Windows having seen the Chuwi Hi8 become one of their most popular sellers with more than one million units. We don’t necessarily agree though with more on that later.",
    "When closed, the Minibook looked like a book; at 201 x 129 x 19.3mm for a weight of around 662g, it is small enough to be carried around without trouble but, pocketable, it is not, compared to say, the Gemini PDA.",
    "Designers chose a business space grey finish for the color scheme and aluminum as the main building material for its lightness, toughness and ability to dissipate heat effectively. The build quality is excellent and there’s no hint of sub-par assembly or weaknesses in the chassis.",
    "There’s a microSD card reader on the right of the device with an audio connector and a full size USB 2.0 port. The left hand side houses a Type-C connector - that doubles as the charger port - a micro HDMI connector (which is inverted) and a full size USB 3.0 port.",
    "Having a USB Type-C connector that supports power delivery means that you can connect a docking station that powers the device and connects it to other peripherals.",
    "The bottom of the Minibook contains a flap that hides an M.2 SSD, four rubber feet and an air grid. Two hinges hold the touchscreen display in place. The latter is a full HD+ model (1920 x 1200 pixels, 16:10 aspect ratio) with a front facing 2-megapixel camera on the left bezel; it flips around 360 degrees to transform into a tablet with a footprint similar to the iPad Mini.",
    "The backlit keyboard was always going to be a compromise. In lieu of a touchpad, Chuwi introduced a Super Optical Finger Navigation (SOFN) module which is a tiny square input peripheral. You have two mouse buttons as well below the space bar.",
    "Chuwi missed an opportunity by not including a fingerprint sensor in the power button. There’s also no physical audio control on the laptop; a volume rocker would have been great.",
    "There’s two variants of the Minibook; one that runs an Intel Core M3-8100Y and another one with an Intel Celeron N4100. Now here’s the funny thing, on paper, the N4100 should be faster than the 8100Y as it has four cores compared to two for the 8100Y. Both have the same base speed of 1.1GHz and 4MB of cache.",
    "The 8100Y however has a much higher turbo boost speed (3.4GHz vs 2.4GHz) and benefited from a number of improvements as part of the Amber Lake architecture series. As such, it delivers about twice the performance (as measured on Geekbench) on single-core tests and matches the N4100 on multi-core ones despite having half the core count.",
    "Oddly enough, the M3 CPU uses LPDDR3 while the slower N4100 is paired with the newer, faster and more power efficient LPDDR4 memory. The N4100 comes with a SATA SSD (128GB in our test machine) while the M3 model features NVMe models (up to 512GB).",
    "The rest of the specification sheet reads as follows: Intel 3165 Wi-Fi module and a 26.6Whr battery with support for PD charging which means that you can charge it with a portable battery (or even a smartphone charger).",
    "The Minibook has an active cooling system and it became evident when under load during our benchmarks. It has a small heatsink fan which means that there is a perceptible whirl when running resource-heavy applications.",
    "As expected, the device runs on Windows 10 and doesn’t come with any bloatware whatsoever. Chuwi’s diminutive laptop performed on par with other N4100 device like the Teclast X4 with Geekbench scores that are about half that of the Core i5-8250U (single and multi-core).",
    "The screen is responsive, bright and holds its own in broad daylight with the brightness slider set to maximum. The keyboard and the SOFN module performed as expected. While the keys are generous in size with good feedback, decent travel and spacing between then, the lack of a palm rest makes touch typing near impossible. Function and system keys have also had to be heavily modified in order to fit on the keyboard.",
    "As for the SOFN module, it requires a learning curve, which may be more or less steep depending on the user. It doesn’t feel as intuitive as a touchpad and it is probably - partly at least - why Chuwi added touchscreen functionality to this device.",
    "When it came to battery life, the Minibook proved to be a bit of a disappointment; in our 10 hour Youtube video playback battery test, it scored only 3hr32 minutes. That was expected because of the small battery.",
    "The GPD Pocket 2 doesn’t transform into a tablet but otherwise boost a similar specification to the Minibook. It boosts a Core M3-8100Y CPU, 8GB of RAM and 128GB storage with a 7-inch full HD touchscreen display. At $750, it is significantly more expensive than the Chuwi Minibook.",
    "The One Netbook One Mix 2S remains the main rival to Chuwi’s candidate. It appears to be almost identical but comes with a higher price tag at $800 and with a bundled stylus pen which cannot unfortunately be stored inside the netbook. An even more powerful model with an Intel Core i7-8550U is available.",
    "The Minibook will wow those who have always wanted to use a Netbook. It is everything a Netbook ever was and more. It can transform into a tablet, has more connectivity options than a lot of popular Ultrabooks and can even be charged by a power bank.",
    "The size meant that the input peripherals are the biggest area of compromise. You will need to have a keyboard and a mouse (and perhaps a bigger external display) to make the most of that device.",
    "The alternative pointing device works but just while the keyboard is too cramped to allow proper touch typing. Yes you will probably be able to do some light document editing but forget about writing a report.Which is why we believe that, just like Netbooks quickly transitioned to 10.1-inch format, the Minibook 2 (or whatever it will be called) will end up with a bigger screen, a proper keyboard and most importantly, a touchpad.",
    "We also believe that a full HD resolution on such a small screen is a bit of a waste. 1280 x 800 pixels would have worked, perhaps bumping the battery life a bit and lightening the GPU’s load by halving the number of pixels displayed.",
    "Everything else though: the build quality, the processor, pricing, storage, memory or the battery life is excellent otherwise. So much so that it is difficult to fault it especially at this price. Business users will need to bear in mind that after sales is likely to be patchy as Chuwi doesn’t have the global presence as the top four or five global PC vendors."
  ],
  "headers": {
    "2": "Design",
    "11": "Hardware",
    "15": "Performance and in use",
    "20": "The competition",
    "22": "Business take"
  },
  "links": {
    "Asus EEE PC 701": "https://www.techradar.com/news/best-asus-laptops",
    "Gemini PDA": "https://store.planetcom.co.uk/products/gemini-pda-1",
    "iPad Mini": "https://www.techradar.com/reviews/ipad-mini-2019",
    "SATA SSD": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "GPD Pocket 2": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FUpdate-CPU-m3-8100Y-Windows-Graphics-Bluetooth%2Fdp%2FB07H2XGD6M%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2939371294128724500-20",
    "One Netbook One Mix 2S": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FNetbook-Ultrabook-Portable-M3-8100Y-Original%2Fdp%2FB07L7DVDL3%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3790711431200768500-20"
  }
}