{
  "source": "https://www.techradar.com/reviews/jbl-link-bar",
  "title": "JBL Link Bar review",
  "category": "audio-visual",
  "updated": "2019-10-04T22:58:11Z",
  "author": "ted-kritsonis",
  "summary": "JBL embraces Android TV... but it’s not a two-way street",
  "verdict": "The JBL Link Bar packs in admirable sound quality but comes at the cost of some staple features you would expect in an Android TV device.",
  "pros": [
    "Android TV included",
    "Good sound performance",
    "Plenty of ports"
  ],
  "cons": [
    "Google Assistant is slow",
    "No surround sound expansion",
    "Bugs still need squashing"
  ],
  "article": [
    "What if you could solve two issues with your TV at the same time? You could improve on the sound quality by setting up a sound bar, and also get an acclaimed smart TV platform to view the content you like most.",
    "That’s the premise behind the JBL Link Bar, a smart sound bar that comes with Android TV built-in. With better sound and quick access to popular streaming apps, it comes off as a win-win... except for the choppy performance along the way.",
    "The Link Bar is as typical a sound bar as you’ll get, visually speaking: It’s neutral in just about every respect, save for the unusually long form factor. It’s about 40-inches wide, which is considerably longer than the Sonos Beam at 25.59 inches. At under 3-inches high, it’s fairly short, and could nestle under a TV, but JBL includes brackets to mount it on a wall if that's more your speed.",
    "On the back are several connectivity options, including three HDMI inputs, plus optical, Aux-In and Ethernet ports. The HDMI ARC port is the most important because it pulls in the audio signal from the TV, while sending the video signal back the other way. JBL didn’t include support for Dolby Vision or DTS:X, nor enabled a method with which to pair the Link Bar with other speakers for a surround sound setup. We didn’t get to test it, but there is an optional subwoofer, the SW10, that works wirelessly with the Link Bar, adding some extra bass to the sound signature.",
    "We’ll get to the sound a little later, but the other half of this equation is the Android TV side. JBL may have envisioned this for non-smart TVs, but we figure that any TV would apply, especially if it’s a smart TV with an otherwise lacking interface baked in. With Android TV comes Google Assistant, adding voice control to the whole package.",
    "What’s not immediately clear is that the Link Bar is not exactly the same experience as that of a Sony Bravia TV or the Nvidia Shield, for example. For starters, not all apps are there. As of this review, there was no sign of Prime Video. It’s an absence that you can only remedy by using the Prime app’s Chromecast function to push content over to the bar.",
    "We had no issue setting up the Link Bar, which was really a two-stage process of hooking it up physically, and then getting Android TV going, including updates. The additional USB ports have pass-through capabilities, so you could hook up a game console, cable box or Blu-ray player. The only real benefit we noticed in trying that is talking to Google Assistant — and seeing responses onscreen — without having to change inputs.",
    "The included remote is pretty easy to learn. There are dedicated buttons for both Netflix and Google Assistant, along with shortcuts to HDMI, optical/Aux-In and Bluetooth. Unfortunately, the remote has no control over any other device that’s plugged into the bar. So, if it’s a Blu-ray player or cable box, you’ll need those remotes within arm’s length too.",
    "Pairing the Link Bar with a mobile device or computer was simple, though we didn’t always have to listen to music via Bluetooth. Apps that supported Wi-Fi or Chromecast were alternatives, not to mention some streaming music services, like Spotify and SoundCloud, already have apps on Android TV.",
    "JBL doesn’t emphasize that the HDMI ARC port is of great importance. If you plan to use the Link Bar with an older TV predating ARC-designated ports, you will need to go with a different setup. If you use the optical Toslink, then the TV’s audio will route through the sound bar. You can then use the ARC output to a regular HDMI input on the TV, except you would have to go into the TV’s settings and manually switch the audio to ‘external audio’ or something similar.",
    "Despite any workarounds, we would advise against getting the Link Bar if your TV doesn’t have an ARC port. It’s not worth the hassle, and there are alternatives, even if you have to get a sound bar and streaming device separately.",
    "It is interesting how, despite running Android TV, the execution isn’t universal. We already noted some missing apps, but also some shakiness in the interface itself. Google Assistant, for reasons we can’t fully understand, is slower here than it is on other devices using the same platform.",
    "It took seconds just to register a query or command, much less respond with anything. It was a delayed interaction we simply weren’t used to on other devices. Then there was the strange fact we couldn’t add the Link Bar to a speaker group on the Google Home app. Normally, smart speakers would show up on the list, where you can select the ones you want and play music on them simultaneously. We were never able to do that here.",
    "The Link Bar’s brightest spot is its sound quality. We came away liking the clarity and volume that pulsated out of the sound bar, particularly the way it handled mids and highs. Without introducing too much distortion or sibilance at higher volumes, the sound profile holds steady.",
    "We would hesitate to say the sound bar offers really deep bass. Perhaps with the wireless sub it does, but on its own, the low end is decent, though not spectacular. When we watched movies with a lot of explosions, or listened to music with plenty of bass, we got to feel some of the punchiness of the lows come through.",
    "Without question, the Link Bar would be an upgrade to any TV’s audio, simply because it’s clearer at louder volumes and spreads sound better at all times. As a Bluetooth speaker for music, it’s convenient, and you always have Chromecast as an option to push audio over.",
    "JBL’s Link Bar is supposed to be a deal at $400 (£349.99, AU$599) for the sheer fact it’s an amalgamation of different devices and services. You get a sound bar, smart speaker and smart TV platform all in one. Plus, you can add a wireless subwoofer to add some extra bass to the sound. The issue is that the smart TV portion needs to fix what’s missing.",
    "If JBL can do it through firmware or software updates, then there’s at least a chance of improving what’s already here. We just don’t know when, or if, the company plans to do that and you may want to hold off until they address those things. If you’re willing to pay more, consider a Sonos Beam with an Nvidia Shield instead, both of which are available now and offer a more complete experience."
  ],
  "headers": {
    "2": "Design",
    "6": "Setup",
    "9": "Android TV performance",
    "13": "Sound quality",
    "16": "Verdict"
  },
  "links": {
    "Sonos Beam": "https://www.techradar.com/reviews/sonos-beam-review",
    "Sony Bravia TV": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
    "Nvidia Shield": "https://www.techradar.com/news/a-refreshed-nvidia-shield-tv-looks-like-it-could-be-on-the-way"
  }
}