{
  "source": "https://www.techradar.com/reviews/instream",
  "title": "InStream review",
  "category": "computing",
  "updated": "2020-01-25T17:13:05Z",
  "author": "michael-graw",
  "summary": "Ease of use at the cost of integrations and advanced sales tools",
  "verdict": "InStream is easy to use, but it’s missing a lot of features that businesses need in a CRM. It lacks a mobile app, integrations, and advanced sales tools.",
  "pros": [
    "Relatively inexpensive CRM platform",
    "Searchable communication history with every contact",
    "Simple interface makes it easy to get started"
  ],
  "cons": [
    "Sales reports don’t provide much insight",
    "Very few integrations and some are broken",
    "No mobile available for salespeople in the field"
  ],
  "article": [
    "InStream is a relatively new CRM platform with a modest variety of tools to help manage your business’s sales funnel. The main advantage to this platform is that it provides contact management in an intuitive, easy to use interface. However, InStream stops short of the versatility that other CRM systems provide and doesn’t offer many integrations with other business software.",
    "InStream offers several different pricing tiers. Much of the difference between them is how many contacts your business is allowed to record. In contrast to other CRM platforms, all plans are paid month-to-month and you can upgrade or downgrade at any time.",
    "The Freelancer plan costs $6 per user per month and allows up to 500 contacts. A Basic plan costs $10 per user per month and increases your contact limit to 5,000. A Business plan costs $19 per user per month and offers 25,000 contacts. With a Premium plan for $29 per user per month, all contact limits are removed.",
    "InStream’s features are centered around lead management and organizing client communications. You can add an unlimited number of custom fields to any contact, as well as tag and organize conversations with leads and clients. Together, these features make it easy to see and search the entire history of communication between your company and a contact.",
    "InStream will even show you who in your team has had the most contact with that client in the past, so that employee can reach out when it’s time to check in or propose a new deal.",
    "InStream integrates with most popular email clients, although the stability of these integrations seems to be something of a trouble point for the software. Google recently stopped supporting InStream integration, so Google Drive users will have difficulty linking up online documents and email with the platform.",
    "Integration difficulties aside, InStream does offer an internal live chat system as well as a calendar. You can use these tools to add internal comments to specific contacts or threads, as well as set reminders to reach out to a client on a specific date.",
    "One of the more helpful features that InStream offers for managers is a sales funnel view, which allows you to easily see where every lead and client falls in your company’s pipeline. Leads can move from ‘Proposal’ to ‘Negotiation’ to ‘Deal Won’ categories, and you can easily track which employees were responsible for shepherding the process and the value of each prospective deal.",
    "InStream also offers reporting tools, which lean heavily towards readability over data intensity. The platform’s reports are essentially an alternative way of looking at your sales funnel. Unfortunately, they don’t offer much insight into what communication or employees are achieving the most success. This is a major shortcoming for InStream, particularly for businesses looking to maximize revenue.",
    "Where InStream really falls short is in offering integrations. Most CRM platforms live or die by their extensibility, and InStream doesn’t have many functions you can add.",
    "The main integrations of note are with LinkedIn, Facebook, and Twitter. InStream can scrape contacts from LinkedIn, although this doesn’t go as far as similar tools from competing platforms. InStream will also notify you when your company is mentioned on social media, although it stops short of letting you manage social accounts from within the software.",
    "Other than that, the only external tools that the platform works with are email clients. InStream doesn’t even work with Zapier, so there’s no mechanism for developing custom integrations.",
    "The most attractive thing about InStream is the platform’s interface. Where a lot of CRM platforms are busy, confusing, and overwhelming, InStream offers a simple environment with comfortable menus and intuitive messaging systems. This is particularly helpful when starting out with the software, since there is relatively little that managers need to set up before inviting team members to start creating contacts.",
    "However, InStream’s interface is limited just like the rest of the platform. There are no customizable dashboards, so you’re essentially stuck with the software’s default layout. In addition, InStream does not have a mobile app available for salespeople in the field.",
    "InStream also struggles with offering support. The company is based in Poland and does not have a US-based customer service team. As a result, it is difficult for US users to get support during standard US business hours. On top of that, the company is slow to respond to emails asking for information.",
    "The lack of instantaneous customer service is made more problematic by InStream’s relatively small user community. There is not much documentation on the company’s website, nor is there a forum where you can get answers from other InStream users.",
    "You don’t have to give up on integrations and advanced customer management features to get a CRM software that’s both affordable and easy to use. Zoho CRM does a good job of making its platform accessible, while offering seamless integration with the entire Zoho ecosystem of business software. Alternatively, if you have a larger budget, Capsule offers a very clean user interface with advanced sales reporting and task management features.",
    "InStream is a very easy to use CRM software, but it lacks the depth that most businesses need for managing clients and communication tasks. The platform is very light on integrations and the sales reporting tools that managers have access don’t offer much in the way of insights. Worse, US-based businesses may have difficulty getting timely support from InStream’s customer service team."
  ],
  "headers": {
    "1": "Plans and Pricing",
    "3": "Features",
    "7": "Sales Predictions",
    "9": "Integrations",
    "12": "Interface and In Use",
    "14": "Support",
    "16": "The Competition",
    "17": "Final Verdict"
  },
  "links": {
    "CRM platform": "https://www.techradar.com/best/the-best-crm-software"
  }
}