{
  "source": "https://www.techradar.com/reviews/tcl-5-series-s517-s515",
  "title": "TCL 5-Series (S517, S515) review",
  "category": "televisions",
  "updated": "2019-01-04T00:24:54Z",
  "author": "nick-pino",
  "summary": "Stuck in the middle",
  "verdict": "With a bit of tweaking you can turn the TCL 5-Series into a solid, mid-level LED TV. It doesn’t have the highest peak brightness at its price point, and suffers from the existence of the much-superior 6-Series that costs just $100-$200 more.",
  "pros": [
    "4K, HDR with Dolby Vision",
    "Roku TV built-in",
    "Solid sound performance",
    "Value pricing"
  ],
  "cons": [
    "Low peak luminance",
    "Smart system slowdowns",
    "Mediocre upscaling",
    "The 6-Series is a better TV"
  ],
  "article": [
    "How much are you willing to spend on a 4K 55-inch TV? If you’re being optimistic, your answer is somewhere in the ballpark of $500, if not a bit less. While most TVs in that price range utterly disappoint, there’s one manufacturer who’s continued to impress - that’s TCL.",
    "A great example of an affordable-yet-fantastic screen is TCL’s S405 4K HDR TV, colloquially referred to as the 4-Series. It was the best-selling TV for most of 2018 and, at $379, one of the best deals around. If you needed more evidence of TCL’s excellent low-cost screens, you could also look at the TCL 6-Series TVs, which are available on Amazon in a 55-inch screen size for around $600, and the entry-level 3-Series that starts at around $150.",
    "In between all these TVs sit the new TCL 5-Series, which we’re reviewing here. At just $449 for a 55-inch TV, it’s a solid contender that lives up to TCL’s mantra by looking good and costing less than you’d expect.",
    "So, what’s the problem? While the 5-Series packs in a number of great features like Roku TV and Dolby Vision HDR, it’s the 5-Series’ compromises in performance and low overall brightness that ultimately make the middle child of TCL’s lineup one of the least appealing.",
    "The TCL 5-Series is definitely in that budget range: the model we were sent for review, the 55-inch TCL 55S517, has a regular retail price of $499, but can often be found for $449.",
    "If you’re looking for something smaller, the S517 5-Series comes in 43- and 49-inch variations that will only set you back around $429 and $449, respectively, and it comes in a larger 65-inch version that supposed to cost $899, though, often goes on sale for $749.",
    "If you can live without the Bluetooth-enabled voice search remote, the 5-Series also has a lower cost alternative called the S515 that’s available exclusively at Best Buy. There’s no difference between the S517 and S515 other than the smart remote (the S515’s remote uses an IR blaster and doesn’t do voice search), and you can usually save around $50 by buying an equivalent S515 model when there’s not a sale going on.",
    "One of the reasons TCL screens cost less than the competition is that the design is simple, understated and basic - you won’t find a wallpaper mode here, or flush wall mount included in every box. Instead, TCL’s screens are aimed at the everyday viewer.",
    "What that means is that the 5-Series is relatively a plain jane, so to speak. The bezel is delightfully trim around the sides and top of the screen, and the legs are inoffensive. The average depth of the TV at its thickest point is around an inch, and at its thinnest point roughly half of that. It doesn’t have the same thinness as LG’s W8 Wallpaper OLED, but that’s absolutely fine for a TV in this price range.",
    "What’s less fine is that there really is no cable management in the back of the TV: Wires come in from all angles and, without any sort of covering or grooves to hide them, they splay every which way and make an entertainment center look cluttered.",
    "While it’s not as big of a deal, there are only three HDMI ports on all the TCL S517 screens. That’s enough room for you to plug in a cable box, a soundbar and a game console, but leaves no room for a Blu-ray player or second console. Thankfully, you won’t need a slot for a streaming video player, TCL built one straight into the TV.",
    "The inclusion of Roku TV should be a very easy win for the 5-Series. It’s one of the best TV platforms on the market, and rarely crashes or stutters. (Rarely, being the operative word here.) But, unfortunately on the 5-Series, it’s a bit of a mixed bag with some good experiences and some not so good experiences.",
    "At several points throughout our testing, Netflix crashed or stalled, ultimately requiring us to power down the TV and restart. Other apps, Amazon Prime Instant Video and PlayStation Vue, were at times sluggish to respond to the remote.",
    "These are minor inconveniences and, on the other hand, having access to Amazon Prime Video, Netflix, PlayStation Vue, HBO Go, Google Play Movies & TV, YouTube and dozens of other services all on the same platform was great.",
    "Unfortunately, it’s hard to know who to blame when things go awry. It seems like it could be the TV, as Roku TV often excels on other sets, and yet, in the same breath, it could be said that the other streaming services besides Netflix worked relatively well. They weren’t lightning-quick loading content, but the 5-Series performed just as well with them as most lower-end streaming boxes like the Roku Premiere or Amazon Fire TV.",
    "In better news, a few of these services even provide 4K HDR streams - the Roku TV Netflix app even offers some content in Dolby Vision as long as you subscribe to the highest tier plan. Throw in Roku TV’s Featured Free program that offers close to a dozen free movies and TV shows that change every week or two, and you have a library of content to choose from without ever subscribing to cable.",
    "Last but not least, if you buy the S517 version of the TV, TCL includes the Roku TV smart remote. It has a built-in microphone that can process voice requests and uses Bluetooth instead of an IR signal for commands like volume up and volume down. There’s no headphone jack on it, however, so private listening needs to be done through the Roku app.",
    "HD/SDR is where this TV really shines… well, maybe ‘excels’ is the better word. While the TCL 5-Series isn’t necessarily that bright, HD/SDR is a format doesn’t require an exceptionally bright TV to capture all the details and color - and that’s why most HD/SDR content we watched looked really good on the 5-Series.",
    "So how un-bright are we talking? Even when we were watching the brightest 4K HDR content we could find it was way less than 1,000 nits peak brightness. And while that made a big difference when it came to 4K/HDR content, that lower level of peak brightness actually didn’t matter that much when we were watching something on cable or streaming on a non-HDR service like Hulu, Sling TV or PlayStation Vue.",
    "Brightness, obviously, is important. It’s the thing that helps you pick out details in darker scenes and makes colors more rich and vibrant. Again, this becomes a big problem when watching 4K HDR content which has lower black levels and higher peak brightness, but here in the land of HD SDR it wasn’t something we even noticed.",
    "Similarly, upscaling worked just fine on the 5-Series. Some content looked better than others when taken from an HD resolution to 4K, but at no point did we see anything absolutely appalling happening. TCL is still a ways behind market leaders like Sony, Samsung and LG in terms of visual processing, but has certainly closed the gap in the last year.",
    "If you’ve yet to see a truly bright HDR television (like Samsung’s QLED series) it’s hard to know what you’re missing out on - beautiful, bright images that fill the room with light and make every detail visible to the naked eye. Unfortunately, without a bright LED panel, that’s really not possible - and the TCL 5-Series falls into that trap.",
    "4K HDR images, therefore, have the clarity necessary to get the job done - it is a 4K UHD screen after all - but the lackluster colors and low brightness keep it from achieving cinema-quality greatness.",
    "In practice, what that means is that movies like Mowgli: Legend of the Jungle, that were mastered in 4K/HDR, don’t really live up to their greatest potential. Jungle scenes that should drip lush greens and bright sky blues look a bit dull. There are some nice scenes throughout the film, but they’re nowhere near as good as they could be on another screen.",
    "There’s also the problem with how the TV handles motion, which is to say, not very well. While things are a bit better when you head into the settings and turn motion smoothing off and opt instead for the natural cinema mode, artifacting is hard to ignore in most action sequences and games.",
    "Dolby Vision support is certainly welcome here and everywhere, but with a low peak luminance, you’re not really getting the full experience.",
    "To end things on a bit of a high note, sound performance is strong on the TCL 5-Series. In our time with the TV, we were able to keep the TV set at a reasonable volume level of around 30, and rarely had to use closed captions to catch missing words.",
    "Of course, all living rooms aren’t made equal and while the 5-Series certainly excelled in our modest San Francisco apartment, there’s no guarantee the results would carryover into something a bit more spacious.",
    "Also, while it's not the best screen we've come across for music listening (not even in the top 10, really) it's fine to play a tune or two and especially easy to do thanks to the built-in Chromecast that accepts streams from YouTube and others.",
    "If you’re looking to buy a new living room screen that will wow your friends and family when they come over for movie night, the TCL 5-Series probably isn’t the ticket - it’s too dim to show off any HDR or 4K films you might have access to, and the smart platform hiccups are more likely to be embarrassing than they are to shock and awe.",
    "While the 5-Series’ lack of brightness and connectivity issues are detrimental to its overall performance, what’s more damaging is the fact that TCL makes another TV called the 6-Series that’s significantly better and costs just a bit more. It makes for a much better viewing experience to an increased brightness and we didn’t have any problems with Roku TV, despite testing the 6-Series for a longer period of time.",
    "All that said, the 5-Series is absolutely fine as a second screen, either for a bedroom or a dorm room where something cheaper and dimmer would be ideal. It’s the kind of TV that won’t woo any cinephiles in your life, but it doesn’t break the bank, either."
  ],
  "headers": {
    "4": "Price",
    "7": "Design",
    "11": "Smart TV (Roku TV)",
    "17": "HD/SDR Performance",
    "21": "4K/HDR Performance",
    "26": "Sound",
    "29": "Final verdict"
  },
  "links": {
    "TCL 6-Series": "https://www.techradar.com/reviews/tcl-6-series-r615-r617"
  }
}