{
  "source": "https://www.techradar.com/reviews/basecamp",
  "title": "Basecamp review",
  "category": "computing",
  "updated": "2019-11-25T12:37:52Z",
  "author": "jacob-parker",
  "summary": "Easy-to-use system to organize your business better",
  "verdict": "The Basecamp interface might be a little overwhelming for beginners, but experienced managers are sure to appreciate the efficient way it handles projects and client communication.",
  "pros": [
    "Usable free version",
    "No “per user” pricing",
    "Keep all your project info in one place",
    "Fully-featured mobile application"
  ],
  "cons": [
    "Lacks some advanced features",
    "Interface can be confusing at times"
  ],
  "article": [
    "Basecamp is one of the best-known project management platforms in the world. Its goal is to help the companies and teams which rely on it to achieve higher levels of productivity through better communication and organization. But how successful is Basecamp in accomplishing that aim?",
    "This project management software certainly has some programming pedigree behind it. Basecamp’s parent company, also called Basecamp, is where Ruby on Rails was created. To find out if this is the right product for you, check out the comprehensive Basecamp review below.",
    "Compared to other project management services, Basecamp offers a pleasingly simple pricing scheme. There are only two Basecamp versions. The first is Basecamp Personal, which is completely free to use. And then there’s Basecamp Business, which costs $99 per month or $82.50 per month with an annual subscription.",
    "Although that might sound a little pricey, you have to remember that a single Basecamp Business subscription covers an unlimited number of users. By contrast, competing management systems often charge per user as well as per month.",
    "Basecamp Personal is useful, but it’s only appropriate for small projects. Think student group assignments or organization for social events. That’s because Basecamp Personal users only get 1GB of storage space and room for just three projects at a time.",
    "Basecamp Business, on the other hand, gives you 500GB of room for project files and the ability to create an unlimited number of projects and user accounts. Also, key Basecamp management features such as a centralized company management account and project templates are only available through the paid version of Basecamp.",
    "Like the features of the Basecamp Business system, but don’t want to pay quite yet? Then you’ll be glad to hear that Basecamp offers a 30-day free trial of its Business system. Even better, when you start your trial you won’t be asked for payment details, so you’ll never get charged by mistake.",
    "If you need Basecamp for a non-profit or educational organization, you might qualify for a discount Basecamp Business rate. Consider contacting the Basecamp team directly to find out if you’re eligible.",
    "Basecamp is intended to be an all-in-one project management system that gives you access to the same features you’d normally have to sign up to multiple services to get. This tool comes with file storage, document editing, realtime chat, and advanced to-do list features to replace those offered by standalone platforms like Google Drive, Slack, and Asana.",
    "One of the central Basecamp features is a team member chatroom known as Campfire. Here, users involved in a particular project can shoot messages to one another, attaching emojis or files if they need to.",
    "The worst thing about working with different programs that aren’t talking to each other is that it’s easy to get overwhelmed by a huge number of unrelated notifications that drag you away from the task at hand. Basecamp handles Campfire and project notifications much better, with the ability to switch off all notifications at set times.",
    "Another key Basecamp feature is the ability to preserve certain conversations for your whole team to see. That means that everyone knows exactly what the client is looking for, or what their boss thought about the team’s last piece of work. Keeping everyone on the same page makes things efficient and prevents avoidable disputes.",
    "Plus, if you have a Basecamp Business subscription, you can create limited client accounts to share approved documents directly with your customers without leaving the Basecamp system.",
    "To ensure your team stays on task, Basecamp offers automatic project progress check-ins. That means users will regularly be asked to share their personal to-do list for the day and to say how they’re prioritizing different tasks. If your employees work remotely, these tools will save you from the dull chore of messaging daily to ask each worker what they’re doing.",
    "In Basecamp, everything is divided up into different projects. Each project gets its own screen which contains all work-related material including discussions, schedules, and tasks. Sometimes, this approach can feel a little cluttered. However, once you’re familiar with the system, it will mean you can jump into a project and immediately see the latest progress or find key information.",
    "When a user loads up the Basecamp system, they’ll be taken to a dashboard that displays all of their projects as well as a central company “HQ”. In the HQ area, key announcements and notices are displayed for all employees. The beauty of the Basecamp system is that it allows users to focus on the projects they’re involved in while keeping up-to-date with news at the company level too.",
    "Basecamp’s company-wide messaging tool, Ping, can be accessed through a shortcut at the top of any Basecamp screen. So can other important areas such as recent user activity, individual tasks, bookmarks, and schedule.",
    "Basecamp is available on OS X and Windows as a desktop application. But if your team members need to stay connected to work on the move, they can also access your Basecamp system through iOS and Android applications. These apps have almost all of the same capabilities as their desktop equivalents, letting you view notifications, project schedules, or Campfire messages from your phone.",
    "If you run into trouble with your Basecamp installation, there are numerous guides and tutorial videos available in the Basecamp support centre to help you get up and running again. But if you need extra help, you can send the Basecamp support team a support request.",
    "Technical staff are available during CT working hours and typically respond within 20 minutes. It’s worth noting that Basecamp Business subscribers will get priority assistance, but Personal users shouldn’t be kept waiting too long for help either.",
    "When stacked up against alternative project management tools, such as Zoho Projects, Basecamp is clearly more focused on improving your productivity through better communication rather than advanced project tracking features. For example, Gantt charts come standard with other project management tools but can only be added to Basecamp through third-party integrations.",
    "Are members of your team complaining about having to work in different programs that don’t talk to one another? If you want a convenient way to organize your business, track individual or team tasks, and communicate with clients, Basecamp could well be the right project management system for you.",
    "Because Basecamp fees don’t scale with the number of users on your system, this platform is particularly worth considering if you need a project management tool to manage a large operation affordably."
  ],
  "headers": {
    "2": "Plans and Pricing",
    "8": "Features",
    "14": "Interface and In Use",
    "18": "Support",
    "20": "The Competition",
    "21": "Final Verdict"
  },
  "links": {
    "project management": "https://www.techradar.com/best/best-project-management-software",
    "contacting": "https://basecamp.com/discounts",
    "support centre": "https://basecamp.com/support"
  }
}