{
  "source": "https://www.techradar.com/reviews/hp-spectre-x360-15-2018",
  "title": "HP Spectre x360 15 (2018) review",
  "category": "computing",
  "updated": "2019-11-14T00:42:32.809Z",
  "author": "jason-cipriani",
  "summary": "This powerful 2-in-1 just about does it all",
  "verdict": "If you’re looking for a device that can last all day, is powerful enough for casual gaming and doesn’t cost a future, then the Spectre x360 15 is worth considering.",
  "pros": [
    "Crisp display",
    "Long battery life",
    "Fast biometrics"
  ],
  "cons": [
    "A little on the heavy side",
    "Touchpad is finicky"
  ],
  "article": [
    "Did you know the HP Spectre x360 15 (2018) isn’t the newest HP Spectre on the block? Read our review of the HP Spectre x360 15T (2019), Microsoft’s most recent Surface release.",
    "The HP Spectre line of 2-in-1 laptops and Ultrabooks has built up a reputation for including ultra-power and ultra-portability over the years. And, the HP Spectre x360 15 2018 leans more towards the former, with beefy Intel Kaby Lake Refresh silicon, a flexible hinge and a fingerprint sensor. And, it works: this laptop has been out for a year, but the HP Spectre x360 15 2018 is still keeping up with its Whiskey Lake-equipped competition.",
    "With a gorgeous 4K display with touch and an included pen, it’s easy to see how the HP Spectre x360 15 is among the best 2-in-1 laptops available right now. This laptop even packs enough battery juice to make it a contender for the classroom and office alike.",
    "Basically every PC manufacturer makes a device like this, with products like the Microsoft Surface Book 2 and the Dell XPS 15 2-in-1. But, in the face of so many rivals, it can be hard for the Spectre x360 to get attention. How does it fare? Let’s find out.",
    "This particular model of the Spectre x360 in the US is currently priced at $1,399 (about £1,055, AU$1,873) at the time of writing. Its regular price of $1,599 (about £1,206, AU$2,140) includes everything you see in the spec list to the right.",
    "There are less expensive models on offer. For instance, for just $1,369 (about £1,032, AU$1,833), you get the same Intel Core i7 processor, 8GB of RAM, a 4K display and a 256GB SSD. However, you can beef that up to $2,369 (about £1,787, AU$3,172) to get a 2TB SSD and an Intel Core i7-8705G.",
    "You can pick up a similar Spectre x360 15 in Australia for AU$3,199. However, instead of using an Nvidia graphics chip, you’ll get an AMD Radeon RX Vega M GPU and 360GB of SSD space, rather than the 512GB in the US model. It’s a decent trade off, considering the processor is bumped up to the Intel Core i7-8705G.",
    "HP takes a similar approach in the UK, using a Radeon GPU and faster processor while cutting the included memory down to 8GB and leaving the SSD at 512GB.",
    "The HP Spectre x360 15 is in the same league as the Microsoft Surface Book 2 and Dell XPS 15 in terms of price. The XPS 15, without a 4K display and with discrete Radeon Vega graphics, starts at $1,299 (about £957, AU$1,650). If you want a 4K display comparable to the Spectre’s, you’ll have to throw down $2,099 for a similar XPS 15 in the US.",
    "With the Surface Book 2, however, you’re looking at $2,499 (£2,349, AU$3,649) for the entry-level model, equipped with a beefier Nvidia GTX 1060.",
    "The HP Spectre x360 15 has a sleek and elegant appeal to it. A dark grey housing is broken up only by shiny gold highlights on the edges, surrounding the touchpad and hinges. Once you open the laptop, you’ll be greeted by a vibrant 15.6-inch 4K touch display with slim bezels on the vertical sides, with a thicker bezel on the bottom and top – both to make room for the webcam, and to make it work better as a tablet.",
    "With total measurements of 14.13 x 9.84 x 0.76 inches (35.9 x 25 x 1.94cm; W x D x H) and weighing in at 4.59 pounds (2.14kg), you’ll need to be ready to lug this machine around. Admittedly, it’s not the heaviest laptop we’ve reviewed, but it’s a bit on the hefty side for a convertible device. In other words, you aren’t going to want to hold this in tablet mode for too long.",
    "If you look on the left side of the HP Spectre x360 15, you’ll find a charging port, a full-size USB 3.1 port, a speaker grille, a 3.5mm headphone jack, an SD card slot and the power button. On the right is a Thunderbolt 3 port, a USB-C port and an HDMI input. There’s also another speaker grille, a fingerprint sensor and a volume rocker.",
    "By placing the fingerprint sensor, power and volume keys on the sides of the housing, HP made it possible to unlock or adjust volume when the screen is rotated all the way into tablet mode.",
    "Speaking of rotation, the hinges on the HP Spectre x360 15 are strong enough that the screen stays in place whether you’re typing away on the keyboard or tapping the screen to select items.",
    "The touchpad is centered with the HP Spectre x360 15, rather than the keyboard, so it’s a bit off-center to the left, thanks to a number pad to the right of the keyboard.",
    "The HP Spectre x360 15’s display is nice and sharp, if not just a bit over saturated. The text is free of any pixelation, thanks to that 4K resolution, and images were clear, too. It’s going to be extremely hard to complain about the display here, regardless what you do with the device – whether it’s watching some Netflix or browsing Facebook.",
    "The Spectre x360 makes for a good Windows Hello partner, offering both a fingerprint sensor and facial recognition. We set up both unlock methods during our testing and found the facial scanning tech to be faster and easier to use.",
    "As you wake the laptop, it begins looking for your face using the webcam at the top of the display. Within a blink of an eye (but try to avoid blinking too much), the Spectre unlocks.",
    "The fingerprint sensor is on the right side of the laptop, next to the volume rocker. It’s only slightly recessed within the housing, so you can easily find it without even looking. But, we found that it could be difficult to line up our registered digits with the sensor to get a consistent reading and, in turn, unlock the HP Spectre x360 15.",
    "Included in the box is a stylus and a AAAA battery. Yeah, four A’s – we counted them a few times just to be sure. The HP Spectre x360 15 pen has two buttons on it, one to erase part of your writing or drawing and the other to select an item or right click on something.",
    "So, the pen does require power, but there is no convoluted Bluetooth pairing or setup process. Once you power the pen on for the first time, the HP Spectre x360 15 will recognize and accept input from the stylus.",
    "Once you get that out of the way, there’s a comforting familiarity when holding this stylus, with similar weight to that of an everyday pen. Turning on the stylus is done by tapping the tip to the surface and gliding it across the notebook’s display.",
    "The HP Spectre x360 15’s stylus feels natural when jotting on the display, with little to no latency between writing and marks appearing on the display.",
    "First reviewed July 2018"
  ],
  "headers": {
    "4": "Price and availability",
    "10": "Design and display",
    "17": "Biometrics",
    "20": "Stylus and pen input"
  },
  "links": {
    "HP Spectre x360 15T (2019)": "https://www.techradar.com/reviews/hp-spectre-x360-15t-2019",
    "Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "Kaby Lake Refresh": "https://www.techradar.com/news/computing-components/processors/kaby-lake-intel-core-processor-7th-gen-cpu-news-rumors-and-release-date-1325782",
    "Whiskey Lake": "https://www.techradar.com/news/intel-whiskey-lake",
    "best 2-in-1 laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "Surface Book 2": "https://www.techradar.com/reviews/microsoft-surface-book-2",
    "Dell XPS 15 2-in-1": "https://www.techradar.com/reviews/dell-xps-15-2-in-1",
    "Microsoft Surface Book 2": "https://www.techradar.com/reviews/microsoft-surface-book-2",
    "Dell XPS 15": "https://www.techradar.com/reviews/dell-xps-15-2018"
  }
}