{
  "source": "https://www.techradar.com/reviews/agiloft-service-desk",
  "title": "Agiloft Service Desk review",
  "category": "computing",
  "updated": "2020-09-18T08:32:29Z",
  "author": "mark-pickavance",
  "summary": "Ultimate flexibility",
  "verdict": "A system with this level of customisation and business process integration should be ideal for IT support, but it requires a full understanding of the tool to get the most out of it. And, the price per agent per month is high.",
  "pros": [
    "Free option",
    "Ultimate flexibility",
    "API on Enterprise Tier"
  ],
  "cons": [
    "High cost per agent",
    "Complicated configuration"
  ],
  "article": [
    "Agiloft started life as Integral Solutions Corp in the 1990s. Its first product was called SupportWizard, a helpdesk support solution that used MySQL as the database to store its records.",
    "It’s since evolved into a CRM, contract management and IT service support modules, and Agiloft Service Desk is the latter.",
    "Where other ticketing systems hint that they might be useful for IT support, Service Desk is built specifically for this role and is ITIL and ITSM compliant.",
    "With this specification and the ability to handle workflow and change management, any expectation that this might be a cheap solution should be dismissed right away.",
    "Businesses are willing to pay a high price for the right product, but is Agiloft Service Desk worth these big monthly costs?",
    "As this is a business tool meant for either internal service centre or for supporting external clients with a service contract, what it doesn’t have is much in the way of social media connections.",
    "This system is intended to field support requests that come by web-portal, phone, email or SMS, and there is also a very basic chat system.",
    "These all serve to drive a ticketing system, and alongside that is a service catalogue, event management, knowledgebase, contract management, surveys, projects, tasks and a release management system.",
    "If you go with the ITIL option when setting up the system, you will find it already primed to handle ‘incidents’, resolve ‘problems’ and create a rule-based workflow for supporting a live project.",
    "For many helpdesk scenarios, this is complete overkill, but for those supporting a large business with a bespoke internal platform, it’s precisely the level of control and management that is often required.",
    "What’s especially gratifying is that data can be moved in and out of the system easily, and the extensive integrations include Twitter, Skype, LogMeIn Rescue, DocuSign, Bomgar, and payment accounts.",
    "A sync system can also link Exchange and QuickBooks and can even be configured to interact with external 3rd-party apps via file drops or API calls.",
    "If you need specialist links to CRM or other platforms, an API can be used by Enterprise customers to craft their own linkage, enabling the level of automation and workflow that is required.",
    "To say that the functionality on offer with Agiloft Service Desk is comprehensive is a massive understatement.",
    "The interface for this product won’t win any design awards, because it’s almost entirely devoid of any purely aesthetic style choices.",
    "It’s simply a web page that has a banner across the top, hierarchical menu down the left and the contents in a panel to the left.",
    "Depending entirely on what role the user has, the menu contains a different selection of menu headings, with the most complicated selection being reserved for admin accounts.",
    "Every feature and function are accessible from this login, and the level of customisation available is incredible.",
    "Any table that supports the system can have additional fields added, and controls can be put in place as to the data that they can contain and precisely the groups of users that can see and alter them.",
    "Our only reservation is that the administrative structure is massively complicated and extensive, to the point where it is easy to forget where you added something if you then need to subsequently alter it.",
    "What many of the pages do is web-based database manipulation, and once you understand how the various master tables and their support lists work, it all makes more sense.",
    "But for anyone using this for the first time, it’s initially a rather daunting trip down the rabbit hole.",
    "Security on this system operates on two distinct levels. On one, it controls who can login, and on another what they see when they succeed in doing that.",
    "All users have a user account and password that gives them access, but the system can go much further depending on the security levels that a business might demand.",
    "LDAP and Windows Active Directory can be used if these exist, or a GSSAPI Negotiation Mechanism (SPNEGO) for Single Sign-On using Google OAuth 2.0.",
    "Two-factor authentications are also supported using the Google authenticator, or by SMS or custom security APIs. And, by allowing the automatic authentication of login requests via a trusted SAML 2.0 identity provider.",
    "Once inside the system, a whole new level of security takes over that is defined by the system administrators that is linked to the groups that a user is in and the role they’ve been given.",
    "Based on these settings, the interface is redefined based on what features and data they have access, and what changes they’re able to make.",
    "While all of this will take some planning to work with defined business procedures, it should be possible to authenticate those who are using the system and also give them the features and controls they need. But, avoid giving them cart blanch over all the tables and features.",
    "As security goes on helpdesk tools, it doesn’t get much better than this.",
    "Unexpectedly, Agiloft Service Desk has a free trial that provides standard integrations, task workflow, ITSM modules and basic rules for up to five power and five portal users.",
    "What you don’t get with the free option is any support, making it unsuitable for anything other than evaluation and experimentation.",
    "The four paid tiers are labelled Professional, Professional Extended and Enterprise, and there is also a quoted Enterprise Extended tier with no pre-defined price model.",
    "A Professional license is $45 per month and adds support and better timer-based rules.",
    "However, you need to move up to Professional Extended, costing $65 per agent per month if you need vendor, customer or employee portals. Or, to handle multiples languages, or use pre-built integrations.",
    "Enterprise costs $75 per license per month and provides full open integration API’s, enabling internal systems to interface easily. And, as big companies are inherently paranoid about servers that aren’t under their direct control, there is also an option for in-house deployment.",
    "Any company with a large support team will be paying a very large monthly bill with Agiloft, especially if they have Enterprise licensing. This expenditure only approaches being worth it if all the power in this solution is wielded, and not just the basic helpdesk functionality.",
    "What concerns us is that how to get the most out of this solution might take some considerable time to understand, and in the meanwhile, the company is paying for features it isn’t using.",
    "To properly leverage the monthly costs and the work needed for deployment probably necessitates the employment of a staff member with Agiloft Service Desk expertise, another ongoing monthly cost to consider.",
    "As a helpdesk solution, Agiloft Service Desk is hard to criticise.",
    "It does everything that Agiloft claims for it, and dramatically more than many of the competitor solutions.",
    "Implemented well it could make a support team highly effective part of the business that helps others deliver their services within defined procedures and timescales.",
    "Conversely, delivered badly this could be an expensive exercise that consumes valuable resources while delivering much the same helpdesk experience as a much cheaper solution.",
    "There is a high degree of organisation and commitment that goes alongside using a tool like Agiloft Service Desk, so be prepared to provide that and plenty of people resources if you go down this road.",
    "We wouldn’t recommend this for SMBs, but Enterprise customers might love it."
  ],
  "headers": {
    "5": "Features",
    "14": "Interface",
    "22": "Security",
    "30": "Plans and pricing",
    "39": "Final verdict"
  },
  "links": {
    "Agiloft Service Desk": "https://www.agiloft.com/help-desk.htm",
    "ticketing systems": "https://www.techradar.com/best/best-helpdesk-software",
    "free trial": "https://www.agiloft.com/free-trial.htm",
    "four paid tiers": "https://www.agiloft.com/pricing-sd.htm"
  }
}