{
  "source": "https://www.techradar.com/reviews/sonos-ikea-symfonisk-lamp-speaker",
  "title": "Sonos IKEA Symfonisk lamp speaker review",
  "category": "audio-visual",
  "updated": "2019-09-13T09:35:47Z",
  "author": "andrew-murphy",
  "summary": "Light and sound combine in this IKEA and Sonos collaboration",
  "verdict": "It’s difficult to know what kind of sound to expect from a lamp, but the Symfonisk doesn’t leave us disappointed.",
  "pros": [
    "Well balanced, open soundstage",
    "Clever home cinema features",
    "Fully integrated into Sonos network"
  ],
  "cons": [
    "Timing and organisation a little slack",
    "Could be more expressive"
  ],
  "article": [
    "Lights and music have long been great bedfellows – so much so that perhaps the most peculiar thing about Sonos and IKEA's Symfonisk lamp speaker is that it could be considered an oddity at all.",
    "It is also only one of two products currently on sale at IKEA that look set to be part of a lengthy partnership – the Symfonisk bookshelf speaker – and given both products undercut the Sonos One on price, they may be one of the most cost-effective ways to get the Californian audio brand into your home.",
    "Make sure to check out our guides to the best wireless speaker the best smart speakers for the best of the bunch; otherwise read on below for our in-depth Symfonisk lamp speaker review.",
    "[Update: Sonos IKEA speakers are about to get easier to control with a new puck-shaped remote that you can mount on your wall. The IKEA product page for the button only appears to be live in France, but it does reveal that it will cost €14.99. That works out at around $16 / £13 / AU$24 based on current conversion rates.]",
    "The Symfonisk range goes for cheap, with the lamp speaker retailing at $179 / £150 / AU$269 in both black and white colorings (compared to $99 / £99 / AU$149 for the bookshelf speaker). It is available exclusive through IKEA.",
    "IKEA has played its part with the Symfonisk’s striking aesthetic, but those who’ve previously had traumatic experiences with the home interior company’s flat pack furniture need not worry. There’ll be no missing screws, lost marbles or home-wrecking final straws: just screw in a bulb, put in place the shade, plug in the figure-of-eight power lead and your lamp speaker is ready to go.",
    "It hasn’t the slimmest of profiles, but the Symfonisk lamp’s design does well not to go over the top on ornamentation, allowing it to blend into the room should you so wish.",
    "The only other physical connection is an ethernet port – which we’d suggest employing if possible for the fastest and most reliable internet connection – while the rest of the unit is bare but for an on/off light switch, and some play/pause and volume controls for music playback.",
    "The Symfonisk is built to take a standard light bulb, but this of course means you could also choose to fit it with smart bulb – like Philips Hue – and never actually have to tamper with it until it requires changing. The only downside to that would be the necessity of a second app to control lighting, as unsurprisingly that isn’t catered for by Sonos.",
    "A glance at the Symfonisk’s spec sheet will tell you that this is not merely an IKEA lamp with a few drivers supplied by its partner. The Symfonisk is embedded in the Sonos ecosystem like a Soviet-era spy, aping the kind of intuitive functionality that makes it one of the best-regarded multi-room systems.",
    "That means it’ll connect to any other of the company’s speakers on the same network, as well as performing in stereo if you choose to pair it with another of the same speaker. Purchasing two Symfonisk lamp speakers would also open the possibility of creating a 5.0 or 5.1 package in tandem with one of Sonos’s home cinema products, such as the Sonos Beam; place them either side of the sofa or bed and you can use them as rear channels in a rather slick surround sound system.",
    "Costs inevitably begin to rise as you aim to release the Symfonisk’s full potential, but those who do so can be confident in their investment – as Sonos promises to deliver all relevant future updates to its IKEA speakers as well as its own in-house product range.",
    "In the same vein as Sonos’ own speakers, there will be no Bluetooth connectivity with the Symfonisk lamp, with all music being sent via your home network. It is, however, compatible with Apple AirPlay 2 and Spotify Connect for those who want to play music without necessarily using the Sonos app.",
    "What you will find within the Sonos app, however, is its TruePlay technology. Using the microphone on your smartphone or tablet, it will run through a series of tests to optimise your speaker’s sonic output, as its needs will vary depending on surrounding walls and surface on which it is stationed.",
    "Otherwise, there is also a two-band EQ for fine-tuning bass and treble response. In our test room, the Symfonisk sounded most comfortable with a less prominent low end, and Sonos’s Loudness feature left on – the latter helping add a little focus and punch.",
    "But little effort is required, in truth, as the Symfonisk lamp offers a pleasingly easy listen straight out of the box. Its circular form facilitates an airier soundstage than its bookshelf stablemate, with plenty of weight and solidity in line with other Sonos speakers. The output doesn’t lose a whole lot of focus despite the wider dispersion, aptly filling the room with music.",
    "The balance is fine, but taking out a little bass helps the soundstage from becoming overly cluttered, without sacrificing those sturdy foundations. Clarity can suffer as pieces become busier – this is not the level of transparency you’d expect from the Sonos One, but neither are you spending quite so much – although it fares better in this regard than the Symfonisk bookshelf speaker.",
    "In essence, this is a good speaker for background listening – as we would expect would be its primary function, given its dual purpose as a table lamp – but still just about insightful enough to hold our interest when we offer it more attention.",
    "The Symfonisk’s rhythmic and dynamic sense is adequate, holding a beat with confidence and relaying grander shifts well, but it can sometimes feel somewhat pedestrian in comparison with true class-leading speakers at a similar price. It glosses over some of the subtler details you might hear on the Sonos One, but the general character of the music is present, and that’s what we’d expect for this kind of money.",
    "Overall, then, the Symfonisk lamp is an accomplished wireless speaker, and a fine addition to the Sonos family – despite, you know, being a lamp. We would have welcomed a more refined product and some snappier timing, but the Symfonisk lamp speaker is still well worth appreciating.",
    "In a highly competitive market, IKEA and Sonos have created a product that truly sets them apart, and we shouldn’t imagine it’ll be long before we spy a Symfonisk speaker in somebody’s living room. We’ll certainly be playing a few tunes on it when we do."
  ],
  "headers": {
    "4": "Price and availability",
    "5": "Design",
    "9": "Features",
    "13": "Performance",
    "19": "Verdict"
  },
  "links": {
    "a lengthy partnership": "https://www.techradar.com/news/sonos-and-ikea-collaborated-to-make-a-speaker-lamp-and-bookshelf-speaker",
    "Symfonisk bookshelf speaker": "https://www.techradar.com/reviews/sonos-ikea-symfonisk-bookshelf-speaker",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review",
    "best wireless speaker": "https://www.techradar.com/news/best-speaker",
    "best smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "Sonos IKEA speakers are about to get easier to control": "https://www.techradar.com/news/sonos-ikea-speakers-are-about-to-get-easier-to-control",
    "IKEA product page": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2443480814543428600&xs=1&url=https%3A%2F%2Fwww.ikea.com%2Ffr%2Ffr%2Fp%2Fsymfonisk-telecommande-volume-noir-40433780%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fsonos-ikea-symfonisk-lamp-speaker",
    "IKEA": "www.ikea.com",
    "Sonos Beam": "https://www.techradar.com/reviews/sonos-beam-review",
    "Spotify Connect": "https://www.techradar.com/reviews/spotify"
  }
}