{
  "source": "https://www.techradar.com/reviews/huawei-p20-lite",
  "title": "Huawei P20 Lite review",
  "category": "phones",
  "updated": "2019-02-18T11:56:09Z",
  "author": "jon-mundy",
  "summary": "Huawei's mid-ranger is a notch or two below its brothers",
  "verdict": "The Huawei P20 Lite supplies a little iPhone X design magic at a third of the price, but with limited notch compatibility and sub-par performance it somehow manages to feel a little expensive.",
  "pros": [
    "Attractive design",
    "Crisp, expansive display",
    "Face unlock works"
  ],
  "cons": [
    "Limited notch support from apps",
    "Below-par performance",
    "You can get much better specs for less money"
  ],
  "article": [
    "Update: after Google suspended Huawei's future access to Android Play Store and security updates, there are serious question marks over the future of Huawei and Honor phones.",
    "While Google and Huawei have promised to support phones currently on the market, it's not clear how long they'll receive Android updates or access to the Google Play Store, which would severely curtail their usefulness compared to the competition.",
    "If the Huawei P20 and the Huawei P20 Pro were designed to mix with smartphone royalty, then the Huawei P20 Lite is down there scrapping with the middle classes.",
    "At a price of £329 (around $455 / AU$580 – though don’t expect to find it widely available in the US), the P20 Lite is roughly half the price of the Huawei P20, and counts the likes of the Moto Z2 Play as a direct rival.",
    "Just like that other mid-ranger, Huawei’s phone attempts to trickle down a little of the glamour and panache from higher up the range. Despite its lower price tag, the P20 Lite retains the dominant edge-to-edge display and distinctive notch of its big brothers.",
    "Add to that a dual-lens camera, a speedy fingerprint scanner and Android 8.0, and the Huawei P20 Lite starts to look a lot like a middleweight contender for the new edge-to-edge generation.",
    "While it’s a solid effort from one of the world’s biggest manufacturers, however, there are a few notable shortfalls that might make you question whether it truly provides value for money.",
    "You could say that the main purpose of any ‘Lite’ phone is to provide a rough approximation of the flagship at a more accessible price point. It needs to be readily identifiable as part of the family, yet smart about where it cuts corners to come in under budget.",
    "For the most part, the Huawei P20 Lite meets that brief with a fair amount of style.",
    "Indeed, style is the operative word here. All three P20 phones represent a design departure for the Chinese brand after the smart-but-humdrum Huawei P10.",
    "Just like the rest of the smartphone world, Huawei has switched to an all-screen design philosophy. The P20 Lite has a relatively small chin, minimal side bezels, and a cut-out notch at the top of the display containing the front camera and earpiece.",
    "In keeping with the obvious debt it owes to the iPhone X (more on which in the next section), the Huawei P20 Lite can use the camera sensors stored in that notch to read your face and unlock your phone.",
    "While Face Unlock seems to work quickly and accurately (even in pitch dark conditions, unlike other Face ID wannabes) it doesn’t seem to be as advanced or secure as Apple’s solution.",
    "As evidence of this, Face Unlock is switched off by default, and you have to fish through the menus to manually switch it on. The way it scans your face instantly in the set-up phases also suggests that it isn’t truly obtaining a detailed 3D map of your face like Face ID.",
    "Still, there’s no denying Huawei’s solution works quickly to unlock the phone. Set the P20 Lite to wake when you pick it up, and you won’t have to think about unlocking it at all.",
    "If you’re using the phone for business usage, or wish to ensure the utmost levels of security, you might want to stick with the default fingerprint sensor.",
    "As we’ve already mentioned, Huawei has taken a fresh approach to design with the P20 family. It’s not hard to spot the continued influence Apple has over the manufacturer’s work, however.",
    "Just like its brothers, the Huawei P20 Lite is in thrall to the iPhone X. It’s got a very similar footprint and shape, and of course there’s that familiar notch eating into the top edge of the expansive display.",
    "The notch itself is a lot narrower than the iPhone equivalent, doubtless owing to the less advanced front camera array we discussed above. It’s a little wider than the Essential Phone’s notch, though.",
    "In one respect, the P20 Lite is even closer to the iPhone X design than its big brothers are, thanks to the omission of a front-mounted fingerprint sensor. Curiously, this has been shifted to a more regular (for Android) position on the rear.",
    "That’s not to say that the P20 Lite has used the extra space particularly smartly. There’s still a noticeable chin below the display, with a Huawei symbol positioned there in place of a button.",
    "When it comes to daily use, the rear fingerprint sensor is a good one. It let us in way more times than it kept us out, and in super-quick time at that. It wasn’t as finicky about finger positioning as some lesser phones continue to be either.",
    "The P20 Lite’s metal rim is nothing to write home about. It has a matt finish and a slightly curious pair of ridges running about the outside, which actually combined to make us think it was made of plastic until we felt its cool touch.",
    "Still, the phone feels nice and premium in the hand owing to its all-glass and metal make-up. It’s a shame the side buttons feel so plasticky and nondescript, but these are the sort of minor shortcuts that can combine to shave pounds off the final price.",
    "Talking of shaving pounds, the Huawei P20 Lite weighs in at a relatively scant 145g. With dimensions set at a mere 148.6 x 71.2 x 7.4mm, it really is a supremely pocketable piece of kit.",
    "Despite its small size, the Huawei P20 Lite manages to cram in a 5.84-inch display, thanks to the whole edge-to-edge approach. This manifests itself in a somewhat unorthodox 19:9 aspect ratio.",
    "While this makes for an impressive canvas when flicking through the home screen and native apps, it seems to have little practical use. Many apps remain unoptimised for this kind of display, with Android understandably slower in adopting notched displays than iOS.",
    "YouTube offers you a regular rectangular picture by default, with thick black borders either side.",
    "Games aren’t always entirely optimised for this kind of display, either. One of the biggest releases of recent times, Final Fantasy XV: Pocket Edition, exhibited strange visual artefacts when pushing it into full screen.",
    "Still, the display itself is capable and attractive. It’s an LTPS TFT, which means that it’s sharp and accurate even though it lacks the contrast and punch of an AMOLED.",
    "A more noticeable drawback of not having an AMOLED display comes if you really can’t abide that notch, and opt to hide it in the options menu. With the AMOLED-packing Huawei P20 Pro, this option would make the notch all but disappear. Here (as with the P20) you can clearly see that they’re merely ‘black’ sections of screen to the left and right of the notch.",
    "Another thing the P20 Lite display shares with the P20 is resolution. While flagship Android phones often go for QHD resolutions, the Huawei P20 went with 1080 x 2240, and didn’t suffer remotely. The P20 Lite follows suit with a 1080 x 2280 screen, and sure enough it’s plenty sharp enough for pretty much all tasks.",
    "Many thanks to Vodafone for providing us with a Huawei P20 Lite for review"
  ],
  "headers": {
    "7": "Dropping down a notch",
    "16": "Design",
    "25": "Display"
  },
  "links": {
    "Google suspended Huawei's future access to Android Play Store": "https://www.techradar.com/news/huawei-ban",
    "Huawei P20": "https://www.techradar.com/reviews/huawei-p20-review",
    "Huawei P20 Pro": "https://www.techradar.com/reviews/huawei-p20-pro-review",
    "Moto Z2 Play": "https://www.techradar.com/reviews/moto-z2-play",
    "Huawei P10": "https://www.techradar.com/reviews/huawei-p10",
    "iPhone X": "https://www.techradar.com/reviews/iphone-x-review",
    "Essential Phone": "https://www.techradar.com/reviews/essential-phone",
    "Vodafone": "https://www.awin1.com/awclick.php?awinmid=1257&awinaffid=103504&clickref=trd-us-6442241711079756000&p=https%3A%2F%2Fwww.vodafone.co.uk%2F"
  }
}