{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-a70-hands-on",
  "title": "Hands on: Samsung Galaxy A70 review",
  "category": "phones",
  "updated": "2019-04-10T16:25:54Z",
  "author": "john-mccann",
  "summary": "All the right specs in all the right places",
  "verdict": "A solid mid-range smartphone with the right specs in the right places. If Samsung can get the price right, it could be a very attractive offering.",
  "pros": [
    "Attractive design",
    "Great screen",
    "Big battery"
  ],
  "cons": [
    "Cameras don't dazzle"
  ],
  "article": [
    "The Samsung Galaxy A70 is a mid-range smartphone aimed at young people who love to create, share and consume live video content (as well as all the other social activity and communication they are involved in).",
    "Of course, just because Samsung says the Galaxy A70 is for the youth market doesn't rule it out for any other ages, and with a solid spec list it could attract a wider range of suitors.",
    "The phone includes a 6.7-inch Full HD+ display (with a single camera-sized notch), octa-core chipset, 6GB or 8GB of RAM, 128GB of storage, in-display fingerprint scanner, three rear cameras and a sizable 4,500mAh battery. In short, there's a lot going on here.",
    "The Samsung Galaxy A70 release date is set for April 26, but Samsung didn't reveal which countries it would arrive in. We do know, however, that it will be available in the UK after Vodafone confirmed it would stock the handset.",
    "In Australia, the handset will be available come June 2019, with a price tag of AU$649.",
    "We're still in the dark when it comes to the Samsung Galaxy A70 price and availability in other markets, but we'll update this article as soon as we hear more.",
    "The Samsung Galaxy A70 boasts a glass and metal design, with the former adorning the front and rear of the phone, sandwiching a metal frame, providing a strong and premium feel.",
    "Measuring 164.3 x 76.7 x 7.9mm the Galaxy A70 is relatively easy to hold in one hand (although those with smaller palms may still find it a struggle), and it isn't overly heavy.",
    "You'll find the power and volume keys on the right side in easy-to-reach positions, while on the base the Galaxy A70 packs a headphone jack – something its larger sibling, the Galaxy A80, doesn't have.",
    "There's also a speaker and a USB-C port for charging, while the SIM tray is found at the top of the left side. You'll be able to pick from one of four colors for the Galaxy A70: black, blue, pink and white.",
    "One of the A70's better qualities is its huge, 6.7-inch display with a bright and colorful sAMOLED panel and a Full HD+ (1080 x 2400) resolution providing an excellent viewing experience for a mid-range phone.",
    "There is a small notch at the top of the screen, something Samsung calls its Infinity-U Display, and we didn't find it got in the way during our short time with the Galaxy A70.",
    "The screen has one more trick up its sleeve as well: an in-display fingerprint scanner for secure logins and possibly authentication, much like we saw in the Galaxy S10 and Galaxy S10 Plus.",
    "The Samsung Galaxy A70 comes with three rear cameras, consisting of a main 32MP (f/1.7) snapper, an 8MP (f/2.2) ultra-wide angle, 123 degree lens and a 5MP (f/2.2) depth camera for portrait mode effects (where the background is blurred).",
    "On the front, selfie fans will be happy with the 32MP (f/2.0) front-facing camera.",
    "Samsung's Live Focus mode – which produces blurred background portrait shots – uses both the 32MP camera and 5MP depth sensor to produce photos which look pretty good, although the line between focused foreground and out-of-focus background isn't as sharp as in similar images taken on pricier devices.",
    "The ultra-wide camera is easy to switch to within the camera app and provides you with a field of view greater than the human eye, allowing you to capture more of your surroundings, including some that you won't catch in your peripheral vision.",
    "The snaps we took with the Galaxy A70 during our short time with it looked acceptable for a mid-range device – which, well, it is – but there was a little bit of muddiness and lack of detail in the low light shots from the event floor.",
    "As previously mentioned, the Galaxy A70 comes with a sizable 4,500mAh battery. That should provide decent battery life performance, but you'll have to wait for our full review to see if it can deliver.",
    "There's also support for 25W fast charging, allowing you to top up quickly if you find yourself running a little low.",
    "The Galaxy A70 also comes well-equipped when we look at performance, with an octa-core Snapdragon 675 chipset backed up by either 6GB or 8GB of RAM, depending on your region.",
    "There's a healthy 128GB of storage, and this can be extended by using a microSD card, with the Galaxy A70 supporting cards up to 512GB in size.",
    "On screen you'll be treated to Android 9, which has been coated in Samsung's One UI. That's the same interface you find on the Galaxy S10 and S10 Plus, so the A70 is in good company in terms of software.",
    "The Galaxy A70 we got hands on with wasn't running final software, but it seemed smooth under finger, although it's not the slickest phone we've used.",
    "The Samsung Galaxy A70 is a solid mid-range smartphone with the right specs in the right places. There's enough power, a great screen, good cameras and a huge battery which should make for a decent smartphone experience.",
    "However, the middle of the smartphone market is a crowded one, so Samsung will need to set the Galaxy A70 price just right for it to have a chance of standing out."
  ],
  "headers": {
    "3": "Samsung Galaxy A70 release date and price",
    "6": "Design and display",
    "13": "Cameras",
    "18": "Battery and specs",
    "24": "Early verdict"
  },
  "links": {}
}