{
  "source": "https://www.techradar.com/reviews/canon-eos-rp-review",
  "title": "Canon EOS RP review",
  "category": "cameras",
  "updated": "2019-02-21T13:29:41Z",
  "author": "matt-golowczynski",
  "summary": "Full-frame on a shoestring",
  "verdict": "Arguably a much more compelling proposition for those looking to move to full-frame mirrorless shooting than the EOS R, the EOS RP is blessed with a good build, great image quality, sound autofocus performance and many further pleasures. The sheen is only rubbed off a little by a lack of logical lens options and compromised video capabilities, but if you already own EF lenses and have no use for video it might be just what you were hoping Canon would end up releasing.",
  "pros": [
    "Compact and light body",
    "Very good value for money",
    "Generous buffer - better than quoted",
    "Very good AF performance",
    "Responsive touchscreen"
  ],
  "cons": [
    "Limited native lens selection",
    "Rolling shutter and crop in 4K video",
    "Slightly sensitive metering system",
    "No sensor-based image stabilization",
    "Underwhelming battery life",
    "Silent shooting very limited"
  ],
  "article": [
    "These past six months have been some of the most eventual in recent memory when it comes to new photography kit. With three new mirrorless systems, all bearing full-frame fruits, a market that Sony has up until now had (almost) had to itself is now set to become a whole lot more vibrant.",
    "Canon’s first release, the EOS R, was met with mixed emotions, and the fact that the company kicked things off with just one relatively pricey model immediately gave Nikon and Panasonic’s dual-model debuts a little more appeal. Now, with the EOS RP, the company has matched its rivals in providing a more accessible way into its system. Indeed, with an RRP of $1299/£1399 for the body and an EF adapter, it’s managed to seriously undercut most of its closest competitors from the off.",
    "The EOS RP is based around the same RF lens mount as the debut EOS R model, which means that it accepts the four RF lenses developed for the system so far (and will support the six currently under development). Thanks to an adaptor that comes with the camera as standard, it’s also possible to use an exhaustive collection of EF and EF-S optics, which is just as well when you consider that two of the current RF lenses cost more than the EOS RP itself.",
    "In place of the EOS R’s 30.3MP full-frame sensor, the EOS RP is furnished with a 26.2MP alternative. This is fitted with an optical low-pass filter to prevent aliasing artifacts from appearing in images, and it supports the familiar Dual Pixel CMOS AF system that handles phase-detect autofocus operation for both stills and Full HD videos.",
    "Autofocus itself can performed conventionally when using the viewfinder or LCD, or through the touchscreen, where you just tap on the subject to bring it into focus. It’s also possible to select one of 4779 focusing points to place against the subject, and to use manual focus in conjunction with focus peaking where necessary. With a working range of -5EV to 18, the camera should also do well when faced with poorly lit subjects.",
    "Unlike its Panasonic S1, Sony A7 II and Nikon Z6 rivals, the EOS RP's sensor isn’t equipped with its own image stabilization system, so you’ll need to make sure that the lens you’re using is. When capturing videos, however, a dual-mode Movie digital IS mode can be called upon, and this can work with a lens-based Image Stabilizer for greater effect (a partnership dubbed Combination IS).",
    "Videos themselves are captured in either 4K UHD (3840 x 2160) quality to a maximum 25p, or in Full HD (1920 x 1080) or Standard HD (1080 x 720) to 60p, although the camera is only able to shoot 4K video with a crop factor of 1.6x. This is precisely the same crop as when using an EF-S lens on the camera (in conjunction with one of three adapters), and you can also apply this crop when shooting standard HD footage, should you need a little extra reach.",
    "It's also not possible to use Dual Pixel CMOS AF when capturing 4K videos, which means you need to use either contrast-detect AF or manual focus. 8bit 4:2:0 footage can be captured internally, and 8bit 4:2:2 footage can be output through the HDMI port, although there's no Log shooting profile, which may disappoint those looking to use the EOS RP for more considered video recording. That said, it’s great to find 3.5mm ports for microphones and headphones around the camera's side, and you can also extract 8.3MP stills from 4K videos if you need to.",
    "Driving the camera is the company’s latest DIGIC 8 processing engine, which allows for 5fps burst shooting, or 4fps when you have the continuously focusing Servo AF option enabled. This also allows for Raw images to be captured in either conventional raw or more efficient C-Raw flavours, in addition to the standard JPEG. On top of that, many familiar features such as Highlight Tone Priority, four-mode Auto Lighting Optimizer and five separate Lens Aberration Correction options can be called upon to get images closer to the end result without software.",
    "In terms of connectivity, the camera sports both USB Type-C and micro HDMI ports, although the former is the older 2.0 standard, rather than the 3.1 we find on most current models. On the inside, Wi-Fi and Bluetooth allow the camera to be paired with a smartphone, which allow you to download your images to your device and control the camera remotely.",
    "A single card slot next to the battery swallows SD, SDHC and SDXC memory cards, and while it wouldn’t have been a surprise to find support for only the UHS-I specification, Canon has also provided support for the newer UHS-II standard too. Not sure what this means? Read up on everything you need to know about memory cards.",
    "Canon quotes a single figure for battery life of just 250 frames per charge, rather than separate figures for the EVF and LCD. Such a figure is pretty average for a pocketable compact camera, so to find this on a full-frame mirrorless model aimed at a more discerning user is disappointing. That said, these figures are determined according to CIPA testing methods, and in real-world use you're likely to be able to capture more than 250 frames on a single charge. The added convenience of USB charging also means you don't necessarily have to lug the supplied charger wherever you go."
  ],
  "headers": {
    "2": "Canon EOS RP: features"
  },
  "links": {
    "EOS R": "https://www.techradar.com/reviews/canon-eos-r-review",
    "currently under development": "https://www.techradar.com/news/canon-confirms-six-further-rf-mount-lenses-are-in-the-works",
    "Panasonic S1": "https://www.techradar.com/reviews/panasonic-lumix-s1r-review",
    "Sony A7 II": "https://www.techradar.com/reviews/sony-alpha-a7-ii-review",
    "Nikon Z6": "https://www.techradar.com/reviews/nikon-z6-review",
    "Read up on everything you need to know about memory cards": "https://www.techradar.com/news/sd-memory-card-buying-guide"
  }
}