{
  "source": "https://www.techradar.com/reviews/1more-triple-driver-bt-in-ear-headphones",
  "title": "1MORE Triple Driver BT review",
  "category": "audio-visual",
  "updated": "2019-11-20T23:04:06Z",
  "author": "lewis-leong",
  "summary": "Great sound but bad battery life",
  "verdict": "The 1MORE Triple Driver BT in-ears are one of the best sounding wireless headphones in its class, but they don't quite live up to the storied reputation of their wired counterparts.",
  "pros": [
    "Excellent build quality",
    "Detailed, dynamic sound",
    "Reliable wireless connection"
  ],
  "cons": [
    "Below average battery life",
    "Expensive",
    "Latency when watching video"
  ],
  "article": [
    "1MORE made its name with the Triple Driver in-ear headphones, one of the best value pairs in the audio world, which led to it winning our Best in Class award. The company followed up with its similarly excellent 1MORE Triple Driver on-ear headphones, one of the best sounding wired on-ear headphones we’ve heard.",
    "Since then, 1MORE fans have been clamoring for the company to release wireless headphones and thus convinced the company to release the 1MORE Triple Driver BT in-ears, which we’ve had the chance to test out.",
    "As the name suggests, the Triple Driver BT in-ears feature the company’s triple driver technology as well as hi-res audio support for Android devices via Sony’s LDAC codec. While they're great for Android devices iPhone users aren’t left out either, as the headphones are also optimized for AAC lossy digital audio compression.",
    "However, while the wired 1MORE Triple Driver in-ears represented a home run for the company, the 1MORE Triple Driver BTs have a few fundamental flaws that stop us recommending it to anyone but audiophiles. Here’s why.",
    "When the 1MORE Triple Driver BT in-ears first came out, they cost $199 / £130, which works out at around AU$350 if you can find a way to import them.",
    "But now, thanks to some major price drops, you can often find them for just under $100 / £100, and could cost even less on major deal days like Black Friday, Cyber Monday or during Amazon's annual sales day(s), Amazon Prime Day.",
    "Compared to similar models like the Bose SoundSport Frees, this is pretty expensive. But is the price justified? You'll just have to read on to find out.",
    "The 1MORE Triple Driver BT in-ears are neckbuds, which means they aren’t truly wireless. Instead, they have a separate part that rests comfortably on your neck. The earbuds are connected to the neck section via a thin rubber-coated cable, which feels comfortable, if not particularly durable.",
    "The earbud housings are the exact same design and materials you’ll find on the wired Triple Driver in-ear model. Milled out of a metal alloy, the earbud housings look and feel luxurious but durable at the same time. The rest of the headphone is made of silicone and plastic, keeping them lightweight for extended listening sessions.",
    "All of the headphone’s controls are located on the left side of the neckband. Power is located on top with a big play/pause/music control button located on the inside. There’s also a volume rocker that’s easy to operate, even with gloves on.",
    "The USB-C charging port is also located on the left and supports fast charging. 1MORE claims you can get seven hours of music playback from one hour of charging. This isn’t quite as fast as the OnePlus Bullets Wireless, but it still charges quickly.",
    "If you were a fan of the wired 1MORE Triple Driver in-ears and simply wished they were wireless, you’re in for a bit of a disappointment – although the sound quality is just as good, poor battery life and latency issues let the wireless version down.",
    "The two headphones share similar resolution but the 1MORE Triple Driver BT in-ears are a lot warmer sounding thanks to a bass bump that makes electronic, pop, and rap music really enjoyable to listen to.",
    "Mids are still well represented, although at times the bass bleeds into the mids, making them sound slightly muddy at times. Highs are detailed and never sound sibilant, which make them great for long listening sessions. The overall sound stage is good and manages to communicate the position of individual instruments – but, it's not the widest we've heard.",
    "Switching between iPhone and Android, we found that the LDAC support does wonders in helping the headphones sound the best they can. The sound features a touch more resolution with the LDAC codec, which isn’t surprising as it offers higher bit depth and sampling rates than AAC.",
    "In terms of noise isolation, the 1MORE Triple Driver BT in-ears are good at blocking out a noisy commute, but not as good as headphones with active noise cancellation like the Jabra Elite 65es or Libratone Track+.",
    "One nice feature is that 1MORE have a dedicated mobile app that lets you EQ the headphones as well as run pink noise to break them in.",
    "1MORE claims the Triple Driver BTs support seven hours of playback but we saw closer to six hours. This is the most disappointing part of the 1MORE Triple Driver BT in-ears, as the industry average is eight-plus hours on a single charge. The second most frustrating thing about these headphones is the latency when watching video – it’s nowhere near as bad as the Bose SoundSport Frees but it’s still noticeable.",
    "The wired 1MORE Triple Driver in-ears were an easy recommendation for most people who wanted a good sounding and durable in-ear headphone. This time around, the 1MORE Triple Driver BTs are harder to recommend thanks to a couple of major flaws.",
    "The biggest flaw is the below average battery life. We managed to get a little over six hours on a charge, which is disappointing when true wireless headphones are approaching that same listening time – you'd expect neckbuds to last longer than that.",
    "Additionally, the 1MORE Triple Driver BT in-ears are expensive at $199 (£130 / AU$350). Competition in this price range is high and the Triple Driver BTs just don’t stand out. Audiophiles may gladly trade battery life for sound but for most people, the RHA MA390 Wireless provide 80% of the 1MORE’s sound for less than half the price.",
    "Average battery life and tough competition in the wireless headphone space means audiophiles will enjoy the Triple Driver BTs, but those looking for longer battery life, ANC, and more features will have to look elsewhere."
  ],
  "headers": {
    "4": "Price and availability",
    "7": "Design",
    "11": "Performance",
    "18": "Final verdict"
  },
  "links": {
    "Triple Driver in-ear headphones": "https://onemore.pxf.io/c/221109/306643/4751?subId1=trd-us-6594969275860571000&sharedId=trd-us&u=https%3A%2F%2Fusa.1more.com%2Fcollections%2Fheadphones",
    "1MORE Triple Driver on-ear headphones": "https://www.techradar.com/reviews/1more-triple-driver-over-ear-headphones",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Bose SoundSport Frees": "https://www.techradar.com/reviews/bose-soundsport-free-true-wireless-earbuds",
    "OnePlus Bullets Wireless": "https://www.techradar.com/reviews/oneplus-bullets-wireless",
    "Jabra Elite 65es": "https://www.techradar.com/reviews/jabra-elite-65e",
    "Libratone Track+": "https://www.techradar.com/reviews/libratone-track-review",
    "true wireless headphones": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "RHA MA390 Wireless": "https://www.techradar.com/reviews/rha-ma390-wireless"
  }
}