{
  "source": "https://www.techradar.com/reviews/lexmark-mb2236adw",
  "title": "Lexmark MB2236adw review",
  "category": "computing",
  "updated": "2020-01-25T11:44:18Z",
  "author": "jim-hill",
  "summary": "A fully-featured 4-in-1 scaled down for the small office",
  "verdict": "All the functionality of a premium office laser printer at a price that will suit the small business.",
  "pros": [
    "Small footprint",
    "Strong security",
    "Fast print speed",
    "Wi-fi is built in"
  ],
  "cons": [
    "No front USB",
    "Limited print resolution",
    "Basic 2-line display",
    "Stingy starter cartridge"
  ],
  "article": [
    "On paper, the Lexmark MB2236adw looks like the kind of serious all-in-one laser printer that you’d expect to find in a large office. It certainly has all of the features, including duplex printing, a large 50-sheet automatic document feeder and raft of security options. In the flesh, it is smaller than expected and manoeuvring it from the box to our test bench was an easy one-person lift.",
    "Scaled down to suit the small office and a smaller workgroup, it’s easy to accommodate the Lexmark MB2236adw and the price of around £148 (about US$194, AU$270) is surprisingly accessible too. It doesn’t have the paper or toner capacity of premium machines like the Xerox WorkCentre 6515, which is why Lexmark recommends a lower maximum monthly duty cycle of 30,000 (compared with Xerox’s 50,000). It is also slower and lacks a touchscreen interface, but the feature set is actually very similar, which means the Lexmark would suit a wide range of small businesses.",
    "If the Lexmark MB2236adw looks a little top-heavy, that’s because the scanner bed overhangs the printer by a few centimetres on either side, and on top of that is a fairly sizable automatic document feeder that can hold 50 sheets of paper. The mono printer on which it is mounted is a much more compact design. So compact that to fit A4 paper in the main tray, you have to extend it so that it protrudes through a flap at the rear of the machine by a couple of inches. It all means that the dimensions of the base of this unit give you a deceptively small footprint and it may take up slightly more room than you think.",
    "The single paper tray can hold 250 sheets, while the manual feed slot above it swallows envelopes or letter headed paper one item at a time. The output bin can hold 150 printed pages.",
    "The tilting control panel is mounted conspicuously on the front and unlike the premium devices that offer a touchscreen, Lexmark has kept the cost down by specifying a very simple two-line LCD. There is at least a button keyboard beside it, so entering Wi-Fi passwords is not too arduous a process.",
    "Below it you can see a blocked off USB port. This is a little frustrating as it means there’s no way to print from, or scan to a thumb drive. You’ll need to look higher up Lexmark’s range to find an active USB input. There is, however, the usual square USB port at the rear and an Ethernet port.",
    "This is a generously featured four-in-one and in addition to printing, scanning, copying and faxing you’ll find auto duplexing and manual dual side scanning taken care of and an ADF that can hold 50 documents. When photocopying you can reduce or enlarge the image easily. Wi-Fi is included, which means you can print and scan via the Lexmark companion app. There’s no Wi-Fi Direct, or NFC, so you can’t hijack the machine with your smartphone, which is a pity, but not unusual with this kind of office-based product.",
    "It is a monochrome printer and one black toner cartridge is included. As is often the case, the bundled starter cartridge contains less toner than a standard cart and this one is particularly stingy with only enough to print 700 pages. A high yield cartridge would give you 6,000, but given that it costs about the same as the printer itself, you wouldn’t expect to find one in the box. Toner for this printer is not cheapest.",
    "There’s a full suite of security features, which includes the ability to set a PIN password that you have to type in before collecting your printout and wireless printing via AirPrint, or Google Cloud Print is possible.",
    "The specifications are impressive at this price point too. It prints quickly at 34ppm and the first page out time is not too sloppy at around 8 seconds. That’s faster than any inkjet, but slower than any of Xerox’s current laser printers. A 1GHz processor with 512MB of memory provides the brains, which is plenty for a printer.",
    "The print and scan resolutions are somewhat limited at 600 x 600dpi and the paper capacity isn’t great at 250 sheets, especially as there’s is no option to add another paper tray.",
    "Removing all of the packaging around the toner cartridge is a bit of a palaver, but nothing that requires IT assistance and the rest of the setup procedure is facilitated by a dedicated app that can be downloaded onto your iOS/Android device. For some reason this is a separate app from the Lexmark Print app, which won’t help you. Follow the instructions on your smartphone and it will find your Wi-Fi network and join it without having to use the printer’s own, rather crude, interface.",
    "In operation, you will sometimes need to read the scrolling information on the printer’s two-line display and respond by pressing the rubber buttons. We found the menu system to be unintuitive and more complicated tasks, like setting up your email with your SMTP is pretty confusing and unlike other devices of this type, the app is no help at all. In some ways, it is quite refreshing to be able to press a single hard button to make a photocopy, but there’s no doubt that a touchscreen would have made most other tasks a lot easier.",
    "When it comes to printing, the Lexmark MB2236adw is quite quick to respond, turning out the first page in about eight seconds and churning out single side pages at about the quoted rate of around 34ppm. Duplex pages are far slower at 17ppm, but at least it they are auto duplex and not manual. Black print looks good and sharp on white laser paper. It is only when you try to print or copy non-black text or images, that the results look a little grey and washed out. Also, very small point size text can look less well defined when viewed through a magnifying glass. That’s in comparison to other laser printers at a similar price point.",
    "The Lexmark MB2236adw is also somewhat fussy about the media that you feed it. Paper that is too heavy or porous tends to come out curled, or the print looks noticeably greyer than with dedicated laser paper. Also, a rather heavy DL envelope that we slipped into the manual feed tray caused a paper jam.",
    "Photocopies are made quickly and look as faithful to the original as you can expect from a machine that is limited by its 600dpi scan quality. The enlarge and reduce function worked well when making copies and the EDF proved reliable in taking care of automated print jobs.",
    "If you want all the functionality of a photocopier-style four-in-one, but can’t justify the expense of a premium machine, then the Lexmark MB2236adw is likely to fit well in your office. The smaller size is an advantage and the price is attractive. Printing is fast enough and so is the quality provided you stick to dedicated laser paper. It’s a pity there’s no Wi-Fi Direct facility, or an active front USB input, but that aside, your getting a lot for your money here."
  ],
  "headers": {
    "2": "Design",
    "6": "Features and specifications",
    "11": "Setup and operation",
    "13": "Performance",
    "16": "Final verdict"
  },
  "links": {
    "laser printer": "https://www.techradar.com/news/best-laser-printer",
    "Xerox WorkCentre 6515": "https://www.techradar.com/reviews/xerox-workcentre-6515"
  }
}