{
  "source": "https://www.techradar.com/reviews/gigabyte-aorus-15-sa",
  "title": "Gigabyte Aorus 15-SA review",
  "category": "computing",
  "updated": "2019-08-05T12:48:11Z",
  "author": "jeremy-laird",
  "summary": "Gigabyte’s new gaming portable punches above its weight",
  "verdict": "Gigabyte’s new gaming portable packs Nvidia GTX 1660 Ti graphics and punches above its weight, but battery life is poor.",
  "pros": [
    "Great gaming performance",
    "Good screen",
    "Competitive pricing"
  ],
  "cons": [
    "Poor battery life",
    "All-plastic chassis",
    "Noisy under load"
  ],
  "article": [
    "What’s the right recipe for a great gaming laptop? It starts with a fast GPU and a solid CPU. Then you want a great display. These days that means a quality LCD panel, probably based on IPS technology, with a triple-digit refresh rate.",
    "Then add plenty of fast RAM and a quick SSD with enough space for a decent games library. Oh, and if it was all packaged up in a nice looking chassis with fairly portable proportions and decent battery life, that would be nice, too.",
    "It’s a lot to ask. And when you get the right answer, the price attached to it is usually megabucks. But not with the new Gigabyte Aorus 15. It’s a 15.6-inch gaming portable with Nvidia GeForce GTX 1660 Ti graphics, a six-core Intel CPU and a 144Hz panel.",
    "So, it definitely ticks several of those boxes - we’ll find out momentarily if it can manage all of them. But it sneaks in under £1,500 / $1,500. OK, still a fair wad of cash. But pretty sharp when you consider how easy it is to spec high-end gaming portables up to double that money and beyond.",
    "If you’re looking for a gaming portable that captures the notion of diminishing returns, the Gigabyte Aorus 15-SA 2019 pretty much nails it.",
    "Our review model rocks in at $1,479 (about £1,400, AU$$2,800). But spec it up with an Nvidia RTX 2060 GPU and keep the specs otherwise identical, and you’ll need to cough up another $350.",
    "Trim it out with an RTX 2070 and a 240Hz panel and you’re looking at $2,198. Ouch. At sub $1,500, the Auros 15 feels like decent value, despite its plastic chassis. At over $2,000, it’s a whole different story.",
    "As specified, the Gigabyte Aorus 15 cuts a reasonable design dash. For sub $1,500 / £1,500, given the specs including six-core Intel chip and speedy Nvidia GPU, you can forgive the all plastic chassis.",
    "It’s mostly a problem in terms of ambience, rather than build, as it feels reasonably robust with the exception of the flimsy screen lid. Style-wise, it’s obviously a gaming laptop. Cue bevelled geometry and RGB-backlit keyboard. But it doesn’t shove the gaming remit down your throat. It’s sober enough to not look ridiculous in a professional context, let’s put it that way.",
    "At just a little under of an inch thick, it’s in the moderately thin and light notebook category, while the slim bezels on three sides of the display help keep the rest of the proportions in check and also ensure the Gigabyte Aorus 15 looks up to date. Nothing dates a laptop like fat bezels, these days.",
    "Features-wise, the Aorus 15 has it pretty much nailed given the price point. The most critical component is the Nvidia GeForce GTX 1660 Ti graphics chip. It’s the most powerful non-RTX chip Nvidia does. That means it lacks support for ray tracing, but cranks out frames very nicely in conventional games, which is currently nearly all games.",
    "It’s well matched to the 15.6-inch LCD panel. For this model, it’s supplied by LG, based on IPS technology and sports a 1080p resolution. That relatively modest native resolution means you have a decent shot at making the most of the panel’s 144Hz refresh.",
    "Elsewhere, the Aorus 15 is pretty well loaded. There’s an Intel Core-i7 9750H six-core CPU, which will surely deliver all the processing power you’ll ever need, 16GB of DDR4 and a 512GB NVMe M.2 SSD, a second M.2 slot available for additional drives and space for a 2.5-inch drive, too.",
    "The Gigabyte has you well covered for ports, too, with three high speed USB A sockets, a USB Type-C port, plus DisplayPort, HDMI and LAN. If you’re looking for obvious omissions, well, the Aorus does lack support for adaptive refresh technology. It’s indicative of the fact that this is a fairly price-orientated laptop and shouldn’t be a deal breaker."
  ],
  "headers": {
    "4": "Price and availability",
    "7": "Design"
  },
  "links": {}
}