{
  "source": "https://www.techradar.com/reviews/alienware-m15-review",
  "title": "Alienware m15 (2019) review",
  "category": "computing",
  "updated": "2019-07-11T18:57:30Z",
  "author": "mark-knapp",
  "summary": "Daring to be different has a price",
  "verdict": "The Alienware m15 OLED delivers incredible performance and a stunning display, but all of that comes at a high price. And, a few quirks of the display keep it from being a perfect package.",
  "pros": [
    "Stunning 4K OLED display",
    "Substantial power",
    "Ports galore"
  ],
  "cons": [
    "Breathtaking price",
    "Soft touch easily blemished",
    "Odd display issues"
  ],
  "article": [
    "Dell has revamped its Alienware offering by going thinner than ever before and trimming down the bezels around the display to offer a compact 15-inch laptop in the Alienware m15, and the model we’ve reviewed tops it all off with a rare treat for laptops: an OLED display.",
    "The Alienware m15 is available starting at $1,299 (£1,418, about AU$1,865) for a lower-end model that combines an Intel Core i5-8300H processor (CPU), an Nvidia GeForce GTX 1660 Ti graphics chip (GPU), 8GB of memory (RAM), a 1TB hybrid drive (HDD) and a Full HD display, but it’s not available in Australia. The model we’ve reviewed gets substantially stepped-up specs and a 4K OLED display that brings the price up to $2,779 (£2,488, AU$4,579)",
    "There’s some question as to how long Dell will keep this Alienware model available as well, as the company has already introduced an even thinner and lighter Alienware m15 R2. It will also have to compete with the newly refreshed Razer Blade 15, which offers a newer Intel Core i7-9750H CPU, competitive graphics and display options, and an enviable design while maintaining close price parity.",
    "For instance, the upcoming Razer Blade 15 model with a 4K OLED screen will cost $3,299 (£3,149, about AU$4,740), which is a step up, but it has a more compact design, the display supports touch, the GPU is stepped up to an RTX 2080 Max-Q, and the CPU is an Intel Core i7-9750H. The display also has HDR400 certification and 100% coverage of the DCI-P3 color space.",
    "When the Alienware m15 came out, it was the company’s thinnest Alienware laptop to date, though it has since been succeeded by the m15 R2. At 14.3 x 10.8 x 0.7 inches and about 4.78 pounds, this m15 actually feels like a travel-worthy gaming laptop, easily sliding into out backpack’s laptop sleeve.",
    "The design has its fair share of premium aspects, with magnesium alloy construction for most of the chassis, and a soft touch coating on the top and bottom of the keyboard section. There’s plenty of ‘gamer’ aesthetic going on as well, with an angular design that see the display and keyboard both come out to a point.",
    "The angles aren’t friendly for comfort though, as they can dig into our wrist on occasion. That’s a bit unfortunate, as the keyboard is otherwise a pleasure to use. The keycaps could benefit from more contour, but the 1.4mm key travel feels just right, and they have an overall poppy feel that makes quick typing on them a breeze.",
    "The Alienware m15 also includes a full numeric keypad, the first on an Alienware laptop below 17 inches. So, it’s truly ready to serve as a productivity machine. This inclusion does leave the typing experience feeling off center, though, because it is off center. There are some thoughtful inclusions here though for touch typing, such as the raised bumps on the Delete, S, and numeric pad 5 keys, allowing them all to be located by feel.",
    "The keyboard has RGB backlighting, as do the Alien head logos located above the keyboard and on the back of the display. While the color options are plentiful, there’s no per-key options. The keyboard is split into four lighting zones. While not as pleasing as per-key lighting, the lighting is at least effective.",
    "The trackpad is smooth, but a lack of individual buttons isn’t exciting, limiting any potential for casual gaming with the trackpad. The trackpad actually does a great job of rejecting a second finger on it, so we can rest one finger on the left click, while moving another finger around on the trackpad to move our cursor, and then click right away, avoiding the cursor jitter than can come from tapping down onto a trackpad.",
    "With the Alienware m15 OLED model, the display is the star of the show. It may have substantial bezel around the top and bottom of the screen, but those black bezels are easy to ignore, thanks to the OLED.",
    "The first thing we noticed when we powered on the device was the fact that it was OLED. Before even confirming that it was OLED, the pure black of the display was apparent.",
    "Dark scenes in video are gorgeous. We played a Blu-ray copy of Guardians of the Galaxy, and even in scenes where there wasn’t pitch black, the depth of darkness that the screen can achieve gives that feeling of pure black. This is especially beneficial when watching videos with a letterbox, as those pixels will just be black and blend almost seamlessly with the bezels.",
    "We thought to play some games we knew would have some serious darkness going on, so played a bit of the indie classic Limbo, which uses the stark contrast of black and white for artistic effect, and it looks stunning. Deceit and Borderlands: The Pre-Sequel are both also gorgeous, with the colors and line work popping in Borderlands, and the darkness really standing out in Deceit.",
    "The display also has a 4K UHD resolution and 400 nits of peak brightness, so even on sunny days we can see the display clearly. We were told our unit had an anti-glare display, but there’s every indication that it is a glossy, highly-reflective display. All the same, we can see what we’re doing in direct sunlight.",
    "As gorgeous as the combination of the 4K resolution, OLED technology, and 400-nit brightness make the display, it comes with some noticeable quirks. We spot occasional flicker from the display which may be connected to a refresh system that prevents burn-in.",
    "The brightness settings are also a little weird. If the display wakes at full brightness, it is not the display’s true full brightness, stepping down one level actually increases the brightness and then going back up one level increases it further, as this seems to activate an HDR mode.",
    "We also noticed a limit to how much light the display can pump out at once. When it’s set to maximum brightness and we have a text document open (i.e., a mostly white space) on one half of the screen and a black background on the other, the text document is bright. But, if we pull up a second text document on the other half of the screen, the two become noticeably dimmer, as the display can’t seem to keep all the light colored area at that high level of brightness.",
    "Alienware also mentions support for the DCI-P3 color gamut, but we can find no settings to enable this, with the system seeming locked to sRGB.",
    "There’s no shortage of inputs on the Alienware m15, with three USB ports on the sides, a headset jack (ours actually stopped working during testing) on the left, and a somewhat inconveniently positioned Ethernet port on the left side. The rear has a Thunderbolt 3 port, Mini Display Port 1.3, and HDMI 2.0 port as well as the connector for the Alienware Graphics Amplifier.",
    "Images credit: TechRadar"
  ],
  "headers": {
    "1": "Price and availability",
    "4": "Design"
  },
  "links": {}
}