{
  "source": "https://www.techradar.com/reviews/amd-radeon-rx-5700",
  "title": "AMD Radeon RX 5700 review",
  "category": "components",
  "updated": "2019-10-31T15:34:41Z",
  "author": "bill-thomas",
  "summary": "1440p PC gaming at a bargain",
  "verdict": "At its price point, the AMD Radeon RX 5700 is an absolute powerhouse, bringing 1440p gaming at Ultra settings to the the mainstream. It's easily one of the best graphics cards today.",
  "pros": [
    "Excellent performance",
    "Plenty of software features",
    "Affordable"
  ],
  "cons": [
    "Blower-style cooler",
    "No ray tracing"
  ],
  "article": [
    "The best graphics card, in our minds, will offer excellent performance at a price point that makes sense. You can pack in all the features in the world, but without that critical price to performance ratio, everything else falls apart. Luckily, the AMD Radeon RX 5700 adheres to this, delivering respectable performance at a great price point.",
    "With this graphics card, you’ll be able to play all the best PC games at 1440p, even with all the settings turned on. And, the fact that the AMD Radeon RX 5700 brings about 2GB more VRAM than the Nvidia GeForce RTX 2060 at the same price point makes the value proposition even juicier.",
    "The AMD Radeon RX 5700 is available starting today, July 7, for $349 (about £275, AU$500), and it’s targeting the $349 (about $275, AU$500) Nvidia GeForce RTX 2060. And, in that matchup, it looks like the AMD Radeon RX 5700 will likely win every time. It has more VRAM, and more raw gaming power.",
    "However, we could see users be tempted to jump up to either the Nvidia GeForce RTX 2060 Super or the AMD Radeon RX 5700 XT, both running for $399 (£315, AU$580). Either of these cards will provide between 10-15% more performance, but you’re paying around 13% more, so it evens out.",
    "This is pretty much thanks to the renewed competition in the war between AMD and Nvidia, and we hope that new AMD Navi products help keep prices competitive like they have here.",
    "The AMD Radeon RX 5700 is based on the new 7nm RDNA graphics architecture, and thanks to the die shrink, its capable of a lot of things that the previous architecture, GCN, just wasn’t.",
    "Right off the bat, this built-for-gaming graphics architecture increases performance-per-clock by 1.25x, automatically squeezing more performance out of the graphics card at stock settings. And, when the higher core counts of these GPUs are taken into consideration, it’s no wonder that the AMD Radeon RX 5700 outshines something like the Radeon RX 580.",
    "Another big improvement to these graphics cards is the inclusion of PCIe 4.0. Now, this will only work on AMD Ryzen 3rd Generation systems equipped with an X570 motherboard, but you should see graphics performance improve thanks to the boosted bandwidth.",
    "But, AMD Navi isn’t just about new hardware features. AMD has plenty of new software up its sleeve, including new image quality-boosting FidelityFX features. This library of effects is open-sourced, which means that developers can include them without having to pay royalties – which should lead to much wider adoption than something like Nvidia GameWorks.",
    "The most important of these features, by far, is Contrast Adaptive Sharpening, or CAS. This technology can be implemented into games by developers, and it will make upscaling an image a lot more clear and detailed. If, for instance, you’re looking to play a game on that 4K monitor you just bought, but don’t have the horsepower to run it, you can simply render the game in 1440p, and CAS will intelligently sharpen the upscaled image, making it look closer to native 4K.",
    "Even if your favorite game doesn’t implement this new technology, you’re still in luck, as Radeon Image Sharpening, or RIS, is available in pretty much every game. This is a setting you turn on in the Radeon Adrenaline software, and it will sharpen the image, without making it look weird.",
    "Plus, for any esports gamers out there, AMD is including its Radeon Anti-Lag software, which will make your CPU and GPU work more in sync, cutting down on input lag.",
    "The fact that at $349 (about £275, AU$500), the AMD Radeon RX 5700 is able to boast performance as good as it does is simply mind-blowing. No matter what game we tried to run, 1440p at Ultra settings was a walk in the park.",
    "Even Shadow of the Tomb Raider, a notoriously difficult game to run, is able to get well over 60fps in our testing. In fact, in certain indoor areas, like when we're grappling with a challenge tomb, we get close to 90 fps.",
    "This is reflected in our benchmarks, too. For instance, in 3DMark TimeSpy extreme, the AMD Radeon RX 5700 blew the Nvidia GeForce RTX 2060 out of the water, with a score of 3,753 versus Team Green’s 3,413. And, it didn’t stop there: in Firestrike Ultra, the 5700 scored 5,355 to the RTX 2060’s 4,352 points. In this narrow price bracket, the Radeon RX 5700 takes home the prize when it comes to performance in synthetics.",
    "Don’t worry, though, that translates to actual games, too. In Metro Exodus, at 1080p Ultra, the AMD Radeon RX 5700 got a rock-solid 60fps, compared to the RTX 2060, which fell behind at 53 fps. With in-game performance like that, the AMD Radeon RX 5700 is a no-brainer in this price range.",
    "If you’re looking to play the best PC games at 1440p, and you’re looking to save some money, the AMD Radeon RX 5700 is a great option. It obviously isn’t going to power your games at 4K 60 fps, but that’s not what it’s built for.",
    "There may be some who say that the 5700 XT makes more sense for just 50 bucks or quid more, but at the end of the day, $50 is $50. It’s easy to see that the AMD Radeon RX 5700 is one of the best AMD graphics cards you can buy today."
  ],
  "headers": {
    "2": "Price and release date",
    "5": "Features and chipset",
    "12": "Performance",
    "16": "Final verdict"
  },
  "links": {
    "best graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "best PC games": "https://www.techradar.com/news/best-pc-games",
    "Nvidia GeForce RTX 2060": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060",
    "Nvidia GeForce RTX 2060 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060-super",
    "AMD Radeon RX 5700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-5700-xt",
    "AMD Ryzen 3rd Generation": "https://www.techradar.com/news/amd-ryzen-3rd-generation",
    "AMD Navi": "https://www.techradar.com/news/amd-navi",
    "4K monitor": "https://www.techradar.com/news/best-4k-monitors",
    "Shadow of the Tomb Raider": "https://www.techradar.com/news/shadow-of-the-tomb-raider-review-a-fitting-end-to-lara-crofts-redemptive-reboot",
    "Metro Exodus": "https://www.techradar.com/reviews/metro-exodus-review",
    "best AMD graphics cards": "https://www.techradar.com/news/amd-graphics-cards"
  }
}