{
  "source": "https://www.techradar.com/reviews/vibes-hi-fidelity-earplugs",
  "title": "Vibes Hi-Fidelity Earplugs review",
  "category": "audio-visual",
  "updated": "2019-04-17T17:11:56Z",
  "author": "lewis-leong",
  "summary": "Save your hearing with these comfortable, durable earplugs",
  "verdict": "The Vibes are durable and reusable earplugs that will save your hearing at loud concerts. While they may not live up to the hi-fidelity claims, their comfort, fit, and durability make them a great companion for concerts.",
  "pros": [
    "Comfortable over long sessions",
    "Durable construction",
    "Discrete looks"
  ],
  "cons": [
    "Case is easy to lose",
    "Highs lose their shimmer",
    "Warm tonal balance shift"
  ],
  "article": [
    "There’s nothing that quite compares to listening to a live musical performance but, many times, a live concert can potentially damage your hearing.",
    "For years, the way audiophiles preserved their hearing was by picking up a pair of foam earplugs at the drugstore - but store-bought earplugs aren't meant to last and can dull the music experience.",
    "Vibes thinks they have a solution with their hi-fidelity earplugs. The company claims their earplugs drop 22 decibels across the frequency range to maintain tonal balance and allow you to enjoy the concert as it was meant to be heard, but at a lower volume.",
    "After spending time with the Vibes, we came away impressed with their construction, comfortable fit, and ability to make loud concerts enjoyable. While audiophiles may nitpick about the loss of resolution in high frequencies, their ease of use make them a great companion for a night of live music.",
    "The Vibes earplugs look like a pair of earbuds but without a cable attached to them. The white silicone ear tips are attached to a short stem, which houses an acoustic filter and have a clear chamber.",
    "Inside the box, Vibes includes small, medium, and large sized tips to help you find the right fit and the medium tips fit our ears well and we never worried about them falling out.",
    "In the ear, the Vibes earplugs are extremely discrete and many may not notice them in your ears at all. In fact, they could pass for a very small set of true wireless headphones. The stem also acts as a grip for you to position the earplugs in your ear canal and helps removal.",
    "Included in the box is a small plastic case, which is nice but easy to lose since they can’t attach anywhere. We would have preferred a case that could be clipped to a bag or on a set of keys to take with us wherever we go but the included case works fine to protect the earplugs.",
    "We attended a Justin Timberlake concert at Oracle Arena in the San Francisco Bay Area to test out the Vibes and overall, we were satisfied with how they performed.",
    "While Vibes claims these earplugs are “hi-fidelity,” they do end up coloring the sound a bit. The most noticeable change in tonal balance is that the highs end up being rolled off and lose a lot of resolution. Mids are great, which helps vocals shine, but bass is a bit overwhelming at times.",
    "We tried listening with the earplugs in and out and found that the Vibes did in fact lower the loudness just enough to be at comfortable listening levels without muting the music too much. Additionally, the sound without the Vibes had much more energy but highs began to hurt and distort. Putting the Vibes in our ears tamed the energy and distortion, making for a much more enjoyable listening experience.",
    "Even better, over three hours, we had no issues with the Vibes earplugs in terms of comfort: These are one of the most comfortable earplugs we’ve tried and the excellent build quality means you can wear these again and again without wasting cheap foam earplugs.",
    "While the Vibes may fall a bit short on their hi-fidelity claims, we enjoyed using them because of their comfort and discrete design. At the end of the day, protecting your hearing is more important than squeezing every last drop of detail and resolution from a live performance. You can save that for your home stereo.",
    "In terms of competitors, the Etymotic ER20XS are an excellent alternative that include a better case and a neck chord that tethers the two earplugs together, making them harder to lose. However, both the Vibes and Etymotic will temper the highs and bring the focus around the mids. In terms of comfort, the Vibes may satisfy a larger number of users, especially those who dislike the triple flange tips of the Etymotic.",
    "If you're an avid concert-goer and want to preserve your hearing as best as you can without missing too much of the show, the Vibes are worth their $23.98 (£21, AU$49) price tag."
  ],
  "headers": {
    "4": "Design",
    "8": "Performance",
    "12": "Final verdict"
  },
  "links": {
    "true wireless headphones": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around"
  }
}