{
  "source": "https://www.techradar.com/reviews/gaming/handheld-consoles/nintendo-3ds-931771/review",
  "title": "Nintendo 3DS (2011) review",
  "category": "gaming",
  "updated": "2019-07-19T14:26:14Z",
  "author": "tom-pakinkis",
  "summary": "The world's first 3D handheld games console",
  "verdict": "The Nintendo 3DS (2011) has the potential to be a massive stride forward from its predecessors and another landmark product that Nintendo can lay claim to.",
  "pros": [
    "3D without glasses!",
    "Best DS graphics yet",
    "Augmented reality shows potential"
  ],
  "cons": [
    "3 hour battery life is poor"
  ],
  "article": [
    "UPDATE: This model has now been discontinued. See the box right for current 2DS and Nintendo 3DS models, or read on for our review of the 2011 model below...",
    "When Nintendo first launched the Nintendo DS in early 2011, it was a landmark moment.",
    "After all, Nintendo is responsible for iconic household names like Super Mario, SNES and Gameboy, all of which have made a massive contribution to how we play games today.",
    "But the Japanese company has also been busy redefining the modern medium with its most recognised bit of kit – the Wii, dragging everyone from nine year old girls to 79-year-old grandparents around the TV to wave a white remote in the air.",
    "Nintendo's current handheld line – the Nintendo DS – has had a similar amount of pull on the public, creating a world where everyone's a gamer. You might be Brain Training on the bus or leaping over spike pits at lunch, either way you're a part of a video game boom (at least in terms of awareness) that's never been seen before, and that's largely thanks to Nintendo.",
    "After such success you might forgive Nintendo for resting on its laurels and, indeed, since the UK release of the first DS back in 2004, the progression of the portable has been something of a slow evolution.",
    "Sticking a couple of extra letters on the end of each edition, with devices like the DS Lite, the DSi and the DSi XL Nintendo made the common alterations; making things bigger/smaller/lighter, adding a camera here and a bit more power there.",
    "The core of the DS remained the same though; a book-like, dual-screen handheld with the touch functionality that augments the gaming experience with an extra dimension of interactivity that spawned the DS success in the beginning.",
    "But now, with the release of the Nintendo 3DS, Ninty is having a punt at revolutionising video games for a third time and 'extra dimension' is the key phrase again.",
    "The 3DS originally launched for well over £200 – closing in on £300 in many stores. But after poor sales, Nintendo has slashed the price drastically, and the console can now be picked up for a little over £110.",
    "At first glance it looks like a shinier, sleeker version of its brothers and it still has the same dual-screen, touch sensitive set up. This time, however, the top screen boasts the ability to beam your gaming experience in full auto-stereoscopic 3D - that's 3D without the need for a pair of 3D specs.",
    "Ok, so the likes of Avatar have already reignited the 3D interest for cinema and Sony's pushing 3D gaming on the PS3 – pricey TVs and cumbersome glasses included – but unassisted, palm of your hand 3D is a completely different and massively exciting prospect.",
    "The Nintendo 3DS has the potential to be a massive stride forward from its predecessors and another landmark product that Nintendo can lay claim to. If it works, that is. We've been working on our Nintendo 3DS review for the last week - here's the verdict..."
  ],
  "headers": {},
  "links": {
    "DS Lite": "https://www.techradar.com/reviews/gaming/handheld-consoles/nintendo-ds-93912/review",
    "DSi": "https://www.techradar.com/reviews/gaming/handheld-consoles/nintendo-dsi-533759/review",
    "DSi XL": "https://www.techradar.com/reviews/gaming/handheld-consoles/nintendo-dsi-xl-674713/review"
  }
}