{
  "source": "https://www.techradar.com/reviews/nubia-x",
  "title": "Hands on: Nubia X review",
  "category": "phones",
  "updated": "2019-01-11T20:25:03Z",
  "author": "david-lumb",
  "summary": "Two screens, less bezel",
  "verdict": "The Nubia X is a high-specced midrange smartphone in its own right, but with two screens, it's a great choice for notch-haters and selfie lovers.",
  "pros": [
    "Fully functional second display",
    "Upgraded selfie game with 16MP + 24MP main cameras",
    "Excellent spec sheet"
  ],
  "cons": [
    "Unclear when, or if, it will launch globally",
    "Will we even have enough uses for a second screen?",
    "Last year's Snapdragon processor"
  ],
  "article": [
    "In the quest to maximize smartphone display area while keeping selfie cameras, manufacturers have introduced clever workarounds to avoid the dreaded notch. While some have used pop-up lenses (like the Oppo Find X and Vivo Nex) or hidden lenses behind a sliding front screen (Xiaomi Mi Mix 3), Nubia went in a different direction with the Nubia X: using a second screen on the phone’s rear just below its dual cameras, which leaves the front free of lenses.",
    "The Nubia X was released in China back in October 2018, and despite showing the phone off at CES 2019, the company hasn’t announced when (or if) the phone will reach global markets. But, from the short time we’ve had with the phone, we thought it was a solid alternative for notch-haters and anyone tired of low-megapixel front-facing lenses.",
    "The first thing to point out: the 5.1-inch HD+ (1,520 x 720) OLED rear display is smaller and has a lower resolution than the 6.26-inch FHD+ (2,280 x 1,080) LCD front screen, but both are fully-functional touchscreens. You can switch between the two at will to navigate around – and there are good reasons to swap for certain situations.",
    "The most obvious is to take selfies with the rear-facing 24MP f/1.7 + 16MP f/1.8 dual cameras. But the rear display also has an eyestrain-easing blue light filter, which has several settings to let you gradually step down from full color to black-and-white. Want to read ebooks on your phone at night? This setting is for you.",
    "There are a few methods to swapping screens. You can navigate to the phone’s settings and manually switch from front to back, though that’s a bit cumbersome. You can also set the phone to automatically swap when you flip the device over.",
    "Finally, you can activate touch-sensitive buttons on the side of the screen: squeeze it in the middle (arrows will appear if you’ve done it right) before flipping the Nubia X and voila, you’ll swap screens. In practice, the latter isn’t the easiest thing to pull off.",
    "If you despise bezels, the Nubia X’s design is worth the dual-screen swapping, with the company claiming a 93.6% screen-to-body ratio. (It’s worth pointing out that GSMArena and basic napkin math with the phone’s 154.1 x 73.3 x 8.4 mm dimensions put the figure at 86.6%, a notable discrepancy.) Assuming Nubia is correct, its measurements barely edges out the 93.4% ratio in the Xiaomi Mi Mix 3 and puts it just under the 93.8% of the Oppo Find X.",
    "Regardless, the front display does have very thin bezels. The rear is more noticeably boxed-in, but it will probably take a few years for both sides to reach parity. In any case, the rear screen just looks like a slightly-shrunken version of the front.",
    "And yet, the front screen is a traditional display whereas the rear rests underneath the phone’s transparent casing. While that doesn’t hinder its touchscreen sensitivity, it is pretty reflective, making the rear screen a bit harder to see if there are bright lights around. Plus, that makes any fingerprints very noticeable.",
    "This isn’t a dealbreaker per se – just don’t expect both screens to be equally easy to read in all circumstances.",
    "There are advantages to having two screens. You can choose to have each display run separately: for instance, having one open to a document or photo and the other to email or text message if you wanted to reference something while you’re typing.",
    "There’s other ways you’ll supposedly be able to take advantage of a second touchscreen, like having parts of the rear display function as buttons (think triggers/bumpers on console controllers) while playing games.",
    "Another more subtle advantage is that you’ll have one (and only one) set of cameras, meaning they’ll be taking the same quality shots whether you’re shooting regular photos or selfies.",
    "Nubia also designed ambidexterity into unlocking the phone, with fingerprint scanners on both sides – so you can unlock it with the same finger or thumb no matter which side is up.",
    "The Nubia X packs a Snapdragon 845, which makes sense given it debuted in China last fall – well before the 855 was ready. That does make it slower on paper than phones slated to come out this year with Qualcomm’s newest chip, but the Nubia X’s selling point is novelty, not cutting-edge performance.",
    "But if you want a beefier Nubia X, you can get it: the phone’s base model has 6GB RAM/64GB storage, but you can step it up to 8GB RAM and 126GB, 256GB or a whopping 512GB of space.",
    "The battery is a respectable 3,800mAh, and the phone is dual SIM. It runs Android 8.1 Oreo out of the box, and it’s unclear when the phone will upgrade to Android 9 Pie. Unfortunately, we’re relying on third-party metrics, as Nubia has been tight with details.",
    "The Nubia X is a valiant effort to maximize smartphone screens: the rear display is fully functional, which is certainly a feat compared to earlier efforts at adding a rear screen.",
    "But it’s important to note that these predecessors were focused on adding supplemental functionality: the Meizu Pro 7 and Pro 7 Plus added a quadrant-size screen on the back to display essential info (time, notifications, etc), while the Yota 3’s rear screen was e-ink only.",
    "Just how useful is a full second screen, really? We’re eager to find out, and discover if flipping the phone is faster than, say, manually swapping apps. The rest of the phone is packed with good specs and a decent camera, so it’s clearly not just a device with a novel gimmick.",
    "It’s unclear when we’ll find out: Nubia hasn’t disclosed when (or if) the Nubia X will roll out to US or European markets, though bringing it out to CES 2019 is a clear hint that they intend to sell elsewhere. Likewise, we don’t know how much it will cost, though GSMArena noted it’s priced at the equivalent of €450."
  ],
  "headers": {
    "6": "But how useful is a second screen?",
    "14": "Robust specs supporting its novel design",
    "17": "Early verdict"
  },
  "links": {
    "Oppo Find X": "https://www.techradar.com/reviews/oppo-find-x",
    "Vivo Nex": "https://www.techradar.com/reviews/vivo-nex",
    "Xiaomi Mi Mix 3": "https://www.techradar.com/reviews/xiaomi-mi-mix-3-review",
    "CES 2019": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "GSMArena": "https://www.gsmarena.com/zte_nubia_x-9347.php",
    "napkin math": "http://phonesabout.com/screen-to-body-ratio-calculator-for-smartphonetablet/",
    "Meizu Pro 7": "https://www.techradar.com/news/meizus-latest-smartphone-wants-you-to-check-out-its-rear",
    "Yota 3": "https://www.techradar.com/news/dual-screen-yotaphone-3-has-now-launched-and-its-as-odd-as-ever"
  }
}