{
  "source": "https://www.techradar.com/reviews/wiwe-portable-ecg-monitor",
  "title": "WIWE portable ECG monitor review",
  "category": "appliances",
  "updated": "2019-11-08T12:20:31Z",
  "author": "mark-pickavance",
  "summary": "Credit card sized electrocardiograph",
  "verdict": "Not a cheap gadget, but it manages to provide a quick cardiograph that can detect a range of problems without visiting a doctor. And, it could be ideal for anyone monitoring an existing condition.",
  "pros": [
    "Easy to use",
    "Clinical-grade electrocardiogram",
    "Sharable results"
  ],
  "cons": [
    "Expensive"
  ],
  "article": [
    "Due to poor diets and lifestyles, many people these days will run into issues with their heart at some stage.",
    "One effective means to assess if the critical pump in the human body is working well is electrocardiography (aka ECG or EKG). In this test, the electrical changes caused by the muscle activity in each heartbeat is recorded by external sensors, and compared with known good and bad patterns to reveal possible issues.",
    "A medically performed ECG usually requires electrodes to be placed on the skin near the heart, and a medical professional to make the recording and subsequent analysis.",
    "The WIWE portable ECG monitor is designed to avoid the visit to a cardiologist and yet still provide useful information about the health of the owner’s heart.",
    "Is this too good to be true, or is it another gadget for the health-obsessed?",
    "The WIWE can be bought directly from the makers for €289, or it can be found on Amazon.co.uk for £248.86. Official retailers are also located in Hungary, Australia, The Netherlands, Slovakia, Croatia, Germany, Romania, Austria, Bulgaria, Pakistan and the UAE.",
    "The WIWE device comes in black and white, and a cardboard box so precisely made that it reminds us of Apple packaging.",
    "In the promotional material, the monitor is described as being credit-card-sized. While the width and height are roughly the dimensions of a card, at 5.7mm it's much thicker than the typical 0.75 mm of most plastic payment cards.",
    "On the edges are a Micro-A USB port for charging and a power button, and on the face are two sensors for the placement of fingers and a stylish heart-beat LED to show the unit is powered.",
    "But the hardware is only part of this solution, To record an ECG using the WIWE you will also need a mobile phone or tablet, and the appropriate WIWE app for either Apple iOS or Android, depending on your mobile platform persuasion.",
    "The connection between them is via Bluetooth, and the app provides screen-based instructions as to when to place your digits on the recorder and some quick feedback about the data captured.",
    "The whole process takes about a little over a minute, can be done away from home or the doctors, and you get immediate feedback about the different aspects of the heart and how it is currently performing.",
    "Included in the tests are an ECG, detection of stroke risk (AFIB), risk of sudden cardiac arrest, a measurement of blood oxygen levels and heart rate.",
    "The WIWE will also work as a pedometer if you haven’t already got one of those handy. But frankly, the cost of a pedometer is tiny, and your phone will do this job for free.",
    "A full battery charge should be enough for 135 tests to be performed, and the last 50 of these are stored on the device before being overwritten.",
    "Once an evaluation has been processed the resulting cardiograph data can be shared in PDF format with your doctor or whomever.",
    "We couldn’t help but be impressed by the build quality of the device and analysis of the captured data, but there are a few areas we’d like to see enhanced.",
    "The only significant weakness of this solution is the mobile app software, which needs some work to fix some obvious developer originated annoyances.",
    "When you first configure the system, it asks for your date of birth and then defaults this date to the day of the install, illogically. What makes this worse is that the date selection gadget only offers months and days, and it took our reviewer over 200 swipes to go back to the year and month he was born.",
    "A minor point, and one that could be quickly fixed, but it irritated us enough to mention it.",
    "We also noticed that the promotional images include a picture of a person holding the device with their thumbs on the sensors, but the software instructs the user to place their index fingers on the pads. We tried it both ways, and the results were practically identical.",
    "But it might be that one is preferable, whichever that is.",
    "What is good about the software is that it can handle multiple accounts, allowing many family members to use the device without any restriction.",
    "Given the cost of the hardware, not having any user restrictions is a good choice and when the cost is shared between others, it is easier to justify the investment.",
    "As with any device that is designed to reveal potentially concerning information about a person’s health, we came to the WIWE unsure as to if it was a positive thing or potentially detrimental.",
    "For those with an illness anxiety disorder, these devices can be used to justify concern to medical professionals that might not be a significant issue under closer examination.",
    "Equally, for those that don’t visit their doctor regularly, the warning signs that it can detect could avoid more serious complications arising unnoticed.",
    "There is a fine balance here, and we’re not medically trained to determine where the WIWE fits into the range of ECG capturing devices. That it has a Class IIa CE mark in the medical device category is impressive, although it was never meant as a replacement for a 12-lead professional ECG equipment.",
    "The company behind this product seem remarkably confident that it is precise, but with any system that involves unsupervised data collection errors can occur.",
    "One positive control in place is that the system requires multiple readings before submitting data for analysis, reducing the chance of an abnormal read skewing the assessment.",
    "Where it might prove invaluable is for a person with an already known issue that needs to track their condition and be alerted if the performance of their heart is heading in the wrong direction.",
    "However, for this analysis and sharable cardiographs, the price might seem high, putting it out of the range of most individuals for an impulse purchase. Or is would be if other cheaper ECG machines were available, and at this time, we couldn’t find any.",
    "The Apple watch may have FDA-clearance as an ECG, but it costs more than the WIWE and assumes you have an Apple iPhone. And, because of the dual sensor system, we suspect that the WIWE is superior to the Apple device.",
    "The more elaborate devices that are using in a doctor’s surgery or hospital cost thousands and aren’t a practical purchase for anyone but the very rich.",
    "When considering cost, it is important to factor that for most Europeans there is little or no expense in getting a cardiograph should your general practitioner advise it. And they will probably recommend exactly that test if WIWE analysis points to a problem.",
    "Given the high cost of healthcare services in other regions, notably the USA, the WIWE might provide a useful way for a whole family to avoid unnecessary and expensive medical bills.",
    "The WIWE isn’t a toy, but it doesn’t make you an instant cardiologist either.",
    "For everyone, wherever they are, the WIWE is about the start of a health-related conversation, and one they could conceivably have without it.",
    "That said, for those with a potential issue, this device could be a lifesaver, and for them, a bargain at any price."
  ],
  "headers": {
    "5": "Price and availability",
    "6": "Design",
    "17": "Software",
    "24": "Final verdict"
  },
  "links": {}
}