{
  "source": "https://www.techradar.com/reviews/fitbit-ionic-review",
  "title": "Fitbit Ionic review",
  "category": "fitness",
  "updated": "2020-05-26T11:44:20Z",
  "author": "james-peckham",
  "summary": "The Fitbit Ionic is a good try, but not quite iconic",
  "verdict": "The first ever smartwatch from Fitbit is a fitness watch at its heart. If you’re looking for some wristwear to use while exercising the Fitbit Ionic may suit you, just don’t expect a similar experience to other smartwatches out there.",
  "pros": [
    "Fitbit Pay works well",
    "Great fitness features",
    "Solid battery life"
  ],
  "cons": [
    "Controversial design",
    "Little bit slow",
    "Limited music offering"
  ],
  "article": [
    "Long rumored, the Fitbit Ionic was the company's first true smartwatch. Fitbit has become synonymous with fitness trackers, but with the Ionic the company decided to expand into a whole new market.",
    "The Ionic combines its fitness know-how with the smarts of a variety of companies it’s bought – such as Pebble, which Fitbit acquired in 2016 – and brought it all together to add an impressive new wearable to its range.",
    "Offering similar features to expensive alternatives such as the Apple Watch range and Wear OS watches, the Fitbit Ionic is a serious contender to be the smartwatch you choose to wear when you’re out running or hitting the gym.",
    "However, there's now the additional competition of the Apple Watch 5, which adds LTE and its best fitness tracking yet, not to mention the incursion of Garmin into the fitness smartwatch space with products like Forerunner 645.",
    "Since the launch of Ionic, we've also seen Fitbit introduce three new smaller and more affordable smartwatches called the Fitbit Versa, Fitbit Versa Lite and Fitbit Versa 2. If you're planning to buy a smartwatch from Fitbit check these out as they're all cheaper, offer a slimmer design and many of the same features as the Ionic.",
    "Plus Fitbit CEO James Park has also confirmed the company has plans to produce a Fitbit Ionic 2 in the future, but there's no clear sign yet on when we'll see that introduced.",
    "Below we're going to focus on the Fitbit Ionic though, so read on below for our full review of the company's very first smartwatch.",
    "The Fitbit Ionic launched as the most expensive wearable yet from Fitbit. At £299.95 / $299.95 / AU$449.95 it cost more than the Fitbit Surge running watch did at launch, but a bit less than products like the Apple Watch 5 or Samsung Galaxy Watch Active 2.",
    "Since the launch of the cheaper Fitbit Versa and Fitbit Versa 2, we've seen the price drop some way to around $180 / £200 / AU$350 at certain times of year. The cheaper price makes it a much easier purchase as your next running watch, but it's still not as cheap as some other capable Fitbit products.",
    "The Fitbit Ionic is a comfortable fit on your wrist, and compared to a lot of modern smartwatches is particularly light – so much so that you'll instantly notice how lightweight this feels on your wrist, which makes it a more pleasant to wear while working out than, say, the LG Watch Sport.",
    "It’s a good fit for everyday use too, being comfortable to wear at a keyboard, which should encourage you to wear it all day to ensure the most accurate readings possible.",
    "It’s waterproof, so you can take this in the shower or even go swimming with it – more on that in the fitness section.",
    "The body of the watch is made of aluminum and features very small antenna bands on the sides, but it’s attractive and is easily the best-looking Fitbit product so far. That said, we found the design to be rather divisive, with friends and family either loving the look or hating it.",
    "You may well love the look of the Fitbit Ionic, but if you’re bothered about what others think just bear in mind that it’s not likely to have the universal appeal of, say, the Apple Watch.",
    "There’s one hardware button on the left-hand side with another two on the right that sit in similar positions to those on the Fitbit Blaze and enable you to move around the watch’s UI.",
    "Each is slightly raised too – Fitbit presumably thinks this will help you find them more easily when you’re fumbling around for the buttons while sweating and gasping for breath when pushing yourself.",
    "We found the buttons worked for making the UI simple, plus it’s a touchscreen, so you can cycle through the apps by swiping.",
    "There are leather and plastic strap options available with secure fasteners on each so the Ionic won't fall off when you're out for a jog.",
    "We used both, and the plastic option is comfortable for when you’re sweating in the gym, while the leather strap is a much more attractive look – so you might want to get both if you want to wear this watch both for working out and dining out.",
    "The display on the Fibit Ionic is a full-color screen that’s rectangular, unlike the more square Apple Watch or most Android Wear watches, but it is reminiscent of the Blaze’s screen. This one is quite a bit bigger though, and that’s down to the bezels being thinner.",
    "That said, the bezels are relatively thick on the Fitbit Ionic. It’s one of our major criticisms of the design, and we think there’s a lot of wasted space below and above the screen. Fitbit could have included a much larger and more useful display instead.",
    "Also, the Fitbit logo is annoyingly placed just below the screen, taking up quite a bit of room on the wearable.",
    "The resolution of the LCD screen is 384 x 250, and we particularly like how bright it is – it reaches 1000 nits, which is the same as the Apple Watch 2 and means you can view it even in bright sunlight when out on a run.",
    "We found the touchscreen to be a little slow to respond sometimes, and we often had to move our wrist fairly violently for the raise-to-wake feature to work. That’s particularly annoying when you’re working out and you need a clear look at your stats fast."
  ],
  "headers": {
    "7": "Fitbit Ionic price and release date",
    "9": "Design and display"
  },
  "links": {
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "Wear OS watches": "https://www.techradar.com/news/best-wear-os-watch",
    "Apple Watch 5": "https://www.techradar.com/reviews/apple-watch-5-review",
    "Forerunner 645": "https://www.techradar.com/reviews/garmin-forerunner-645-music-review",
    "Fitbit Versa": "https://www.techradar.com/reviews/fitbit-versa-review",
    "Fitbit Versa Lite": "https://www.techradar.com/reviews/fitbit-versa-lite-review",
    "Fitbit Versa 2": "https://www.techradar.com/reviews/fitbit-versa-2-review",
    "Fitbit Ionic 2": "https://www.techradar.com/news/fitbit-ionic-2",
    "Fitbit Surge": "https://www.techradar.com/reviews/gadgets/fitbit-surge-1270574/review",
    "Samsung Galaxy Watch Active 2": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-2-review",
    "Fitbit Blaze": "https://www.techradar.com/reviews/wearables/fitbit-blaze-1312660/review"
  }
}