{
  "source": "https://www.techradar.com/reviews/ampler-curt",
  "title": "Ampler Curt review",
  "category": "appliances",
  "updated": "2019-12-23T12:57:27Z",
  "author": "macarthy-danzig",
  "summary": "The Ampler Curt is an undercover e-bike that’ll pass as a conventional machine",
  "verdict": "Fast, light, and very stylish; the Ampler Curt is so speedy you might find yourself outrunning its motor.",
  "pros": [
    "Undercover looks",
    "Light and fast",
    "Integrated lighting and mudguards"
  ],
  "cons": [
    "Only gentle assistance",
    "Slight drag from the hub motor",
    "Fixed battery"
  ],
  "article": [
    "So minimalist no one you overtake will guess you’re benefiting from extra electrical assistance, the all-black Ampler Curt is super svelte in both looks and weight.",
    "All-but hiding the fact it is an electric bicycle in its refined frame, the Ampler Curt offers great value and performance in an increasingly busy market. Read on for our full thoughts.",
    "Created in Estonia and based in Berlin, the €2,890 (approx £2,475, $3,210, AU$4,670)",
    "Ampler Curt currently ships to your door for free. They also run a test ride program, although at the moment this is confined to major European cities, with London the only UK option.",
    "Arriving in a huge box and almost fully built, the bike comes with easy to follow instructions and a quality mini-tool set.",
    "As neat an e-bike as you’ll find, the Ampler Curt wears its electric features lightly. Turning on via a button just above the bottom bracket and charged using an adjacent port, its battery is hidden in the conventionally sized downtube. Powering a slim rear hub motor, not only is this system slick enough to leave the Curt almost indistinguishable from a conventional bike, it’s so light it weighs almost the same too.",
    "To achieve this it uses a slightly smaller battery than most, meaning you’ll likely achieve closer to the lower end of its claimed range. Still, it has range enough for city use, or more remote expeditions if you’re prepared to pedal a bit.",
    "Providing two assistance modes, you can play with the bike’s set-up via a dedicated app. Alternatively, these can be accessed by the button on the frame, although given its position, this is tricky while riding. It’s also worth noting the Ampler Curt’s battery can’t be easily removed, so you’ll need to bring it inside to get a charging lead to the bike.",
    "Whether carrying the bike up stairs or sprinting up hills, the first thing you notice about the Curt is its low weight. Backed by skinny tyres and a low front end, it’s a nippy bike by any standards. With extra help provided by the motor, it’s an easy bike to keep rolling, even if the subtle assistance means it’s not always the fastest away from the lights.",
    "Herein lies a slight and unexpected problem. While we’re happy pottering around on an upright Dutch-style hybrid below the UK’s 15.5 miles-per-hour e-bike speed limit, on the Ampler we were frequently above this. The result was spending an increased amount of time with your legs rather than the motor doing the work.",
    "On the plus side, you get a better work out, the battery lasts longer, and you’ll arrive at your destination faster. Still, it does often leave you wondering if it wouldn't be nice if the speed limit was lifted a little.",
    "This regulatory gripe aside, the components are generally excellent. Taking the place of an oily chain is a clean-running and low maintenance Gates Carbon belt, the brakes are Shimano's powerful and ever-reliable M6000 callipers, while little touches like the foam grips and nicely shaped saddle are equally welcome.",
    "The rolling stock is good too, although despite being a favorite road racing tyre, we wonder if the Continental Grand Prix 4-Season models fitted to the Ampler might be a little fragile for everyday city use.",
    "With a geometry that’d be agile even on a non-electric hybrid, the Ampler Curt is great for whizzing in and out of traffic. It’s also fun to ride just for the hell of it, with the only thing holding it back at higher speeds being the slight drag caused by the extra mass of the motor. The overall design is great too, with features like the integrated rear lights, which are drilled into the seat-post, showing an uncommon level of attention to detail.",
    "More a problem of the way ebikes are currently regulated, I do feel that fast e-bikes have a few unresolved contradictions; primarily the fact that once above 15.5 miles-per-hour you’re left lugging the extra electronics with no benefit. However, the Curt makes this almost effortless enough for it not to be an issue."
  ],
  "headers": {
    "2": "Price and availability",
    "5": "Design",
    "8": "Performance",
    "13": "Verdict"
  },
  "links": {}
}