{
  "source": "https://www.techradar.com/reviews/unihertz-titan-ruggedised-smartphone",
  "title": "Unihertz Titan ruggedised smartphone review",
  "category": "phones",
  "updated": "2019-08-19T09:24:56Z",
  "author": "desire-athow",
  "summary": "A mobile clearly inspired by the Blackberry Passport",
  "verdict": "The Unihertz Titan is a truly unique smartphone; just like the Atom, it will divide opinions. For the price though, it delivers exceptional value for money thanks to that physical keyboard, a big battery and a great hardware combo.",
  "pros": [
    "Excellent value for money",
    "Great performance",
    "Well built",
    "Keyboard works nicely",
    "Capacitive touchpad",
    "Wireless charging"
  ],
  "cons": [
    "Kika keyboard",
    "Takes some time to adjust to the physical keyboard",
    "Chunky"
  ],
  "article": [
    "Unihertz surprised us in 2018 with the Atom, a smartphone that sat proudly in its own ultra-niche category, that of very small smartphones. In 2019, they’re at it again with the Titan, a ruggedized smartphone that comes with a physical keyboard, a very direct reference to the Blackberry Passport from 2014.",
    "But is that too much (or too little) in a world where virtual rules the roost and where Blackberry no longer build smartphones? Well, more than 3,000 pre-orders have already been received for the smartphone at the time of writing on Kickstarter. So there’s definitely a demand for such a niche product but will it be enough to ensure its success? We’ve got a prototype at hand so read on.",
    "It is too early to say what TCL, the Chinese behemoth that owns the license for Blackberry smartphones, will say about the as but the inspiration from the Blackberry Passport is all too obvious. That aside, the phone is big and is best used with two hands, both for the keyboard and the screen. More on that later.",
    "Our caliper shows that it is about 16.7mm thick, only beaten by the Zoji Z11 from Homtom while its surface area (153 x 93mm) means that it will sit rather uncomfortably in any pocket, if at all. This seems to be the sort of smartphone you will pull from the inside pocket of your blazer or raincoat, especially when hitting the scale at 305g.",
    "The front contains an 8-megapixel camera next to a status light, the proximity/light sensor, the square 4.5-inch display and the physical keyboard; the first row of which contains five system keys, two on each side of the home button which doubles as the fingerprint sensor and is also a capacitive touchpad.",
    "As for the three other rows, they are arranged in a V-shaped and contain only letters, no doubling up here, only single function keys. The Kika keyboard app is loaded by default and kicks in when hitting a text field, displaying as options, numbers and other special characters.",
    "At the back is a single 16-megapixel rear camera with an LED flash and a speaker grill. On the left edge is located a customisable button (switches rear torch by default) and the SIM tray drawer. On the right is the power button and the volume rocket. An audio port and a Type-C connector can be found on the top and bottom edges; note that they are not covered by any flap as would usually be the case on other ruggedised smartphones.",
    "Bear in mind that this is an IP67-rated phone so it should, in theory, easily survive a drop in shallow non-salty water. Unihertz confirmed that Titan is splash, water, and dust resistant and was tested under controlled laboratory conditions with a rating of IP67 under IEC standard 60529.",
    "Ditto for any drops on hard surfaces like concrete floors. The keys are not flush with the screen but Unihertz appears to have included a few design tricks like an elevated top bezel, to mitigate any falls.",
    "A last word: The design of the Titan and more specifically its finish are reminiscent of the Blackview rugged devices (like the BV9500 Pro) that we have tested recently. They seem to originate from the same OEM based on anecdotal evidence.",
    "One thing you can’t fault Unihertz is the fact that it uses (relatively) high end hardware to kit its smartphones. The Titan is no exception; no you won’t find the P70 in it but instead the P60 (AKA the MT6771) which is not that far behind. The Mediatek CPU is paired with 4GB of RAM (DDR4) and 128GB onboard storage (eMMC 5.1). You can add in a microSD card as well although you’d need to sacrifice the second SIM card location.",
    "Note that Titan has confirmed that final models will have 6GB of RAM rather than 4GB. The rest of the specification is spot on for a mainstream smartphone: FM Radio, 802.11ac, 10W wireless charging, a 6Ah battery, global LTE support, NFC plus an 18W power adaptor but no bundled headphones.",
    "The phone is no slouch thanks to a balanced component set. The P60 is a good match for the generous amount of system memory and onboard storage and the screen is bright and very much what you’d expect from a mid-range model. The 1440 x 1440px screen resolution is surprisingly usable but bear in mind that because of its girth and weight, this is a two-hand smartphone.",
    "The Titan performed decently on all our benchmarks as the numbers can attest. Note that it runs on stock Android 9.0 with the July 5th Android security patch. Other than the usual Google web services, the phone comes with a few apps that we’ve seen just a few days ago on the BV6100 and are usually part of the Mediatek software bundle.",
    "These include FM Radio, SOS, SIM toolkit, Cell broadcast and Game Mode. Also in the bag is a suite of DIY apps that can come in handy (pun intended); these tend to be bundled with the majority of ruggedised smartphones that we’ve reviewed over the past few years.",
    "Then there’s Kika. We have strong reservation about Titan using the Kika keyboard from Kika Tech. In December 2018, a thorough investigation from Buzzfeed uncovered a shocking story about how popular apps - including Kika keyboard - exhibited deceptive and malicious behavior and were removed from Google’s Play Store.",
    "Unihertz came back to us saying that they used a customized version of Kika keyboard and they have made \"sure that there is no malware in it\".",
    "How about the keyboard then? It is backlit (although the one on our prototype was unevenly lit) but you cannot switch if off; the keys are big enough for our liking but we found typing to be laborious and error-prone. Your mileage will vary wildly but you may have to try first. Blackberry users that have used a physical keyboard before will, no doubt about it, have flashbacks of what life used to be back in the days.",
    "The phone came with lift to wake by default and this can be turned off in settings. One last thing, face-unlock is available for added convenience (but not security).",
    "The Blackberry Key2 and Key2 LE are the nearest competitors to the Titan but neither come with an IP6x rating or a big battery. They do however have a Qualcomm system-on-chip which almost certainly means better performance and have the kudos associated with the Blackberry range. Just bear in mind that they also carry a premium; the 4GB/64GB Key2 LE costs $459, almost twice the price of the Titan.",
    "And just for the kicks, the keyboard-less Ulefone Armor 6, which we reviewed recently, cost $300. It is a ruggedised device with the same hardware configuration as the Titan. The former has a smaller battery, an older version of Android but an extra camera, 6GB of RAM and a bigger screen.",
    "Bear in mind that you can’t buy the Titan right now. You can only back them on Kickstarter and hope for delivery in December 2019. The phone carries a suggested retail price of $359 but is currently on pre-order for $259, which is exceptional value for money given the hardware that you’re getting.",
    "On the whole, bar some minor niggles, we had a thoroughly good time with the Titan. Like Marmite though, the physical keyboard is something you will either like or hate. Almost all former Blackberry users have switched either to Android or iOS, leaving only a tiny fraction (0.02% according to the latest NetMarketshare report) on RIM OS.",
    "Would we use it as our daily driver? No. It is simply too bulky for our day-to-day workflow. However, its haptic feedback combined with a real keyboard, wireless charging AND an IP67 rating means that it is a perfect candidate for out-and-about professionals that need a phone that can take a few knocks.",
    "We can see the likes of Zebra and TCL keeping a close eye on the success of the campaign. A successful Titan may well give the necessary momentum for the creation of a ruggedised version of the Key2 complete with business options like swappable batteries or a barcode reader."
  ],
  "headers": {
    "2": "Design",
    "10": "Hardware",
    "12": "Usage and performance",
    "19": "Competition",
    "21": "Final verdict"
  },
  "links": {
    "Atom": "https://www.techradar.com/reviews/unihertz-atom",
    "Titan": "https://www.kickstarter.com/projects/jellyphone/titan-unihertz-rugged-qwerty-smartphone/description",
    "Blackberry Passport": "https://www.techradar.com/reviews/phones/mobile-phones/blackberry-passport-1266671/review",
    "Zoji Z11": "https://www.techradar.com/reviews/homtom-zoji-z11-rugged-smartphone",
    "ruggedised smartphones": "https://www.techradar.com/best/best-rugged-smartphones",
    "BV9500 Pro": "https://www.techradar.com/reviews/blackview-bv9500-pro",
    "BV6100": "https://www.techradar.com/reviews/blackview-bv6100-ruggedised-smartphone",
    "investigation from Buzzfeed": "https://www.buzzfeednews.com/article/craigsilverman/google-removes-cheetah-kika-apps",
    "Blackberry Key2": "https://www.techradar.com/reviews/blackberry-key-2-review",
    "Key2 LE": "https://www.techradar.com/reviews/blackberry-key2-le-review",
    "Ulefone Armor 6": "https://www.techradar.com/reviews/ulefone-armor-6-rugged-smartphone"
  }
}