{
  "source": "https://www.techradar.com/reviews/dynabook-tecra-x40-f-business-laptop",
  "title": "Dynabook Tecra X40-F business laptop review",
  "category": "computing",
  "updated": "2019-10-23T16:00:47Z",
  "author": "desire-athow",
  "summary": "The company formerly known as Toshiba makes a comeback",
  "verdict": "The Dynabook Tecra X40-F is a good but not great business laptop. Its support for 32GB in a convenient form factor is what sets it apart from the competition. There are some improvements to be made, albeit minor ones.",
  "pros": [
    "Surprisingly well priced",
    "Optane memory",
    "Support for 32GB RAM",
    "4-year onsite by default"
  ],
  "cons": [
    "Screen doesn’t go as bright",
    "So-so battery life",
    "Can get noisy",
    "No Ethernet ports"
  ],
  "article": [
    "The only entry for Dynabook on Wikipedia is that of a concept for a tablet with a keyboard, one that dates from more than fifty years ago. The year-long metamorphosis of Toshiba PC’s business into Dynabook only gets one line, proof perhaps of the amount of work that the entity, now majorly owned by Sharp Corporation and, by extension, Taiwan-based Foxconn group has to do to (re)capture market share and minds.",
    "The process has already started and the first flagship products under the Dynabook brands have landed. The X40-F is the first one we’ve reviewed, squarely aims at the B2B market and is on sale in the US for as little as $1,146 (F1430). The model we are testing today, the F-BTO (F-13V in Europe), is the top of the range model and costs $2709 direct.",
    "If there’s one thing that Toshiba has been known for, it is that the brand designers tend to stick to a particular design vernacular putting pragmatism ahead of aesthetics. Toshiba laptops, for example, are very rarely the lightest, the thinnest or aiming to win the most design prizes.",
    "Instead, the priority is given to versatility, battery life and serviceability, features that resonate with the audience that the X40-F is trying to reconquer. That means being able to take away the base by removing a dozen screws to access the components inside, that means having a laptop that’s roomy inside (17mm thick) to house the hardware comfortably while offering a BTO (built to order option).",
    "The use of a magnesium alloy chassis means that the weight is kept down to 1.22Kg; Dynabook claims that the body of the X40-F has been “engineered” to MIL-STD-810G standards for ”dependable strength and durability”, not that we’d recommend that you drop it. Note that Dynabook has adopted an Onyx Blue colour scheme across its entire Tecra range in mark contrast with the competition that tend to stick to brushed silver metal or black anthracite finish.",
    "There’s plenty of air vents at the back and below the device plus you will find two downward firing Harman/Kardon speakers. There’s a smart card reader, a microSD card slot, two USB 3.1 Type-C/Thunderbolt 3 ports and a full size HDMI connector on one side, plus a Kensington lock, an audio connector and a USB 3.1 port on the left.",
    "The power connector plugs into one of the TB3 ports to deliver up to 45W of power (20V, 2.25A); you can also use it to charge more recent smartphones with a type-C connector.",
    "Dynabook is the only brand out there that codes its own laptop firmware. This comes with pros and cons; it allows you to offer features that others can’t. Having an industry standard BIOS also makes you a more popular target but also makes it easier to find any vulnerability easier thanks to the sheer number of eyes looking at the code.",
    "The built-to-order option offers you plenty of flexibility with regards to components but forget about cutting edge. The Whiskey Lake-based Intel Core i7-8565U CPU that powers the laptop is more than a year old now and is still a 14nm part (and doesn’t support Intel’s vPro) while the Wi-Fi is still limited to two-year old Intel Wireless-AC 9560 which does not feature the newer Wi-Fi 6 speeds. There’s no mobile modem/embedded SIM option by the way.",
    "Still, there are good bits: The Tecra X40-F is one of the few ultrabook-class devices on the market that can take 32GB of RAM and this does have serious implications for professionals who need that amount of memory as they no longer have to opt for larger, heavier mobile workstations.",
    "Then there Optane; this is the first Ultrabook that we’re testing with Intel’s revolutionary storage-class memory. There’s 32GB of it and it is used as a buffer for the 1TB NVMe SSD. Does it accelerate data reads and writes? Read on.",
    "Last but not least the tiny power supply unit comes with a long cable, which is always welcomed, especially for large boardroom tables. Dynabook offers hardware-based security components like Trusted Platform Module 2.0 (TPM) as well as well as compatibility with the new Secured-core initiative from Microsoft.",
    "The laptop didn’t disappoint when it came to benchmarks. Its CPU is faster than its predecessor, the 8550U on single thread performance but ties on video performance and multithread. As for its storage subsystem, its write speeds are one of the best we’ve seen in a laptop, aided by the Optane memory, while its read numbers are decent without wowing us.",
    "Battery life turned out to be a bit of a turn off. With its 46Whr battery, it reached four hours and 43 minutes while the Fujitsu Lifebook U939x managed a whopping two hours extra on a slightly bigger battery. The latter is more expensive and can only accommodate 16GB of system memory.",
    "The screen is one of the weaker points; it is matte, always good for a touchscreen. However, its brightness is a notch lower than what we’d expect and the bezels seem to be a tad too big.",
    "The keyboard and touchpad are flawless; the latter providing with a premium, silk-as-smooth experience. The keyboard backlit is either on or off and does provide with a decent amount of travel without being too mushy or noisy. The distance between keys is about average but the size of the keys could be improved but at least it is spill resistant. Mote the presence of a Synaptic fingerprint reader and two physical buttons - located above the touchpad - that emulate the right and left mouse ones for the Accupoint pointing device.",
    "The provided laptop ran on Windows 10 Pro and did come with some proprietary management solutions as well as some bloatware (Winzip, Iolo. Candy Crush etc). Note that the device can be noisy under load with the fan kicking in to cool the components; we also noticed some static sound.",
    "Last but not least, you get four years onsite warranty out of the box; the only major manufacturer to do so.",
    "Dynabook sets the bar high with an ultra-thin laptop that can take 32GB memory and 1TB SSD, making it ideal for say, programmers who need laptops with as much memory as possible for compiling code. HP didn’t have any similar lightweight laptop; the three models available at the time of writing are far too big for an apple-to-apple comparison.",
    "The ThinkPad P1 Gen 2 is in a similar position; it is the only laptop from Lenovo that can offer 64GB memory - let alone 32GB - in a thin-and-light chassis. It is a true mobile workstation though which means that it is bigger (and heavier) while offering more versatility. The processor performance for a start is lopsided; the i5-9400H surpasses 11,000 marks on Passmark while the i7-8565U struggles to hit 9,000. It can also accommodate two SSDs, a 4K multi-touch display and offers a 80Wh battery, VPro and Wi-Fi 6 by default. The price with a 4K display? $2618. Just remember that it is about 2mm thicker and around 500g heavier.",
    "The head-turner of the group though as to be the new XPS 13 7390; this laptop straddles both the B2B and B2C markets with an offering that combines bleeding edge technology with a sky-high price. $2909 is what you can expect to pay for a 10th generation CPU, 32GB of RAM, a 4K touchscreen, Wi-Fi 6 and 4-Years ProSupport Plus with Next Business Day Onsite Service and accidental damage. And unlike the rest of the competition, this is a 2-in-1 convertible. No vPro here though.",
    "The Toshiba PC brand is a powerful one; it isn’t surprising that most of the online retailers we’ve queried pair it with Dynabook in order to transfer the goodwill of the former to this new name. The red logotype is still what comes up when you look for Dynabook at Newegg for example (and confusingly, the e-retailer thinks that Dynabook laptops are gaming ones).",
    "Overall, the Dynabook Tecra X40-F suffers from an average battery life, the lack of better CPU and Wi-FI upgrades. If you don’t need 32GB memory and can stick to 16GB like 99.99% of the market, then there are even more choices to explore. We loved the aesthetics although the bezel size might look dated to some and we’d love to have one Ethernet port rather than having to rely on a dongle."
  ],
  "headers": {
    "2": "Design",
    "7": "Hardware",
    "12": "In use",
    "18": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "F1430": "https://us.dynabook.com/computers/laptops/tecra/X40/X40-F1430",
    "F-BTO": "https://us.dynabook.com/computers/laptops/tecra/X40/X40-F-BTO",
    "Fujitsu Lifebook U939x": "https://www.techradar.com/reviews/fujitsu-lifebook-u939x-2-in-1-convertible-business-laptop",
    "programmers who need laptops with as much memory as possible for compiling code": "https://www.techradar.com/news/best-laptop-for-programming",
    "mobile workstation": "https://www.techradar.com/news/best-mobile-workstations",
    "XPS 13 7390": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9985670715990282000/https://www.dell.com/en-us/work/shop/dell-laptops-and-notebooks/new-xps-13-2-in-1-7390/spd/xps-13-7390-2-in-1-laptop/cax13w10p1c115"
  }
}