{
  "source": "https://www.techradar.com/reviews/nacon-asymmetric-wireless-controller",
  "title": "Nacon Asymmetric Wireless Controller review",
  "category": "gaming",
  "updated": "2019-07-24T13:34:45Z",
  "author": "vic-hood",
  "summary": "The rhythmic expression of functional design",
  "verdict": "A comfortable and well-built controller for those who prefer asymmetric sticks similar to the Xbox One controller. However, wireless connectivity can be a pain and we missed the DualShock 4's built-in speaker and motion sensor features.",
  "pros": [
    "Suited to those who prefer Xbox controllers",
    "Works on PS4 and PC",
    "7 hour battery life",
    "Comfortable and well built"
  ],
  "cons": [
    "USB Bluetooth receiver needed for wireless",
    "No light bar, motion sensor or built-in speaker",
    "Slight delay"
  ],
  "article": [
    "The DualShock 4 controller that comes as standard with the PlayStation 4 isn't necessarily for everybody. While some players appreciate the sleek, smaller design of the DualShock 4, others prefer what the Xbox One controller has to offer: a more robust, larger gamepad with asymmetric design - in this case, sticks which sit diagonally from one another.",
    "But, Nacon aims to bring that same gamepad experience to PS4 players with the Nacon Asymmetric Wireless Controller, which boasts a chunkier design and asymmetric sticks for those who fancy a bit of a change-up.",
    "Developed by gaming accessory specialist Nacon, the Asymmetric Wireless Controller is compatible with PlayStation 4 consoles – and PCs, for those wanting a controller input over a mouse and keyboard. It's also officially endorsed by Sony, so it should definitely work on your PS4 and PS4 Pro.",
    "We took the Nacon Asymmetric Wireless Controller for a test drive to give you our official verdict on whether it's worth trading in the DualShock 4 for a newer model.",
    "The first thing you'll notice about the Asymmetric Wireless Controller is that it is considerably chunkier than the DualShock 4 - or, it has a bit of extra weight to it. If you're someone who prefers a weightier, bigger controller then you may prefer this design. However if, like me, you have smaller hands then you may struggle slightly with the larger build.",
    "The controller still has a touchpad, two sticks, a D-pad and the DualShock 4's other standardized buttons but the main difference is the size and placement of these.",
    "To start, the D-pad and left toggle have been swapped from the design of the DualShock 4. The left stick now sits on the top left of the controller and the D-pad now sits parallel to the right stick. It's the same design as the Xbox One controller and the main draw of this controller.",
    "The touchpad and buttons themselves are also larger, as are the trigger and LB/RB buttons. This potentially increases accessibility for some players who may struggle with dexterity issues.",
    "However, if you're looking for a snazzy design then you may be disappointed. While the controller feels comfortable and well-built, its plain black design leaves much to be desired - unless you prefer the classic look.",
    "For the gamepad itself, the controller comes with a USB Bluetooth receiver for wireless play and a charging cable. The Asymmetric Wireless Controller boasts up to seven hours battery life once fully charged, and will even light up in different colors to let you know what percentage charge is left.",
    "The Asymmetric Wireless Controller is fit for purpose and typically works like a treat but there are definitely some cracks in performance.",
    "The controller can be connected either through the charging cable or wirelessly. The actual micro USB cable that comes with the controller is pretty short, so playing while connected could prove a pain unless you have a longer cable.",
    "It's likely that you'll opt to play wirelessly but, unlike the DualShock 4, the Asymmetric Wireless controller can't simple connect to the PS4 at will. To connect wirelessly, you need to plug the wireless receiver into your PS4 or PC - it simply pops into your USB port at the front.",
    "However, a problem arises if you want to attach more than one of these controllers to a PS4. For a start, you can really only attach two wirelessly as there's only two USB ports on the front of the PS4. Secondly, Nacon warns in its user manual that plugging in more than one receiver can result in interference issues. Not ideal.",
    "We also notice an occasional delay when using the controller wirelessly - definitely not ideal.",
    "It's worth noting that the Asymmetric Wireless Controller doesn't include certain features that the DualShock 4 has and that can lead to an issue with some games. While a lack of built-in speaker and dynamic light bar might be lacklustre, it's the lack of motion sensor which could cause an actual issue.",
    "While there's not that many games that use motion sensor anymore, there are still some that do. Case and point, while testing the controller we're also playing through Detroit: Become Human. The game makes use of motion controls for QTEs but, without a motion sensor in the controller, we can't actually use the gamepad for this title. This would be the case for any game that uses motion sensors and it's definitely worth noting.",
    "The Nacon Asymmetric Wireless Controller is a comfortable controller that brings the Xbox one gamepad experience to PS4 players. It's robust, classic and well-made but isn't without its performance issues.",
    "It's worth noting that you may not be able to play games which require motion controls (such as Quantic Dream titles) and that you'll probably only be able to play with one at a time to avoid interference issues.",
    "However, it's a solid controller that has a strong battery life and is potentially more accessible to some players."
  ],
  "headers": {
    "4": "Design and features",
    "10": "Performance",
    "17": "Final verdict"
  },
  "links": {
    "DualShock 4 controller": "https://www.techradar.com/reviews/gaming/games-consoles/controllers/dualshock-4-controller-1157615/review",
    "PlayStation 4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS4 Pro": "https://www.techradar.com/reviews/ps4-pro",
    "user manual": "https://www.nacongaming.com/wp-content/uploads/2019/03/PS4OFPADWL_IB_ENNL.pdf"
  }
}