{
  "source": "https://www.techradar.com/reviews/mmodal",
  "title": "M*Modal review",
  "category": "computing",
  "updated": "2021-09-13T10:53:03Z",
  "author": "jonas-p-demuro",
  "summary": "The top-ranking conversational AI platform",
  "verdict": "M*Modal has a lot of the right ingredients for a capable voice transcription system, that add up to less than the sum of the parts, and falls short when it comes to voice accuracy, the key metric of any transcription service.",
  "pros": [
    "Available iOS & Android apps",
    "Partner digital voice recorders",
    "Toll free phone support"
  ],
  "cons": [
    "Opaque pricing ‌",
    "Some users have low accuracy",
    "Restrictive contracts"
  ],
  "article": [
    "When we think of the 3M‌ corporation, it is one of those multi billion dollar companies that has a presence in lots of different markets, both industrial and consumer. While they may be known among the public more for their adhesives (like the infinitely useful Post-it’s), 3M also provides supplies to the medical and dental industries, so it may not be as much of a stretch for them to be in the medical transcription space.",
    "While this is more of a recent development, in February 2019, 3M acquired M*Modal, a large medical transcription company valued at $1 (‌£0.78)‌ billion. M*Modal on its own brings to the table two decades of transcription experience, with a global workforce of over 8,600, and revenue of approximately $200 (‌£155.6)‌ million. It is used by over 8,000 organizations worldwide.",
    "M*Modal offers a choice of medical transcription programs. The first is Fluency Direct, which is cloud based, and suitable for use by any medical specialty. The goal is through EHR templates, reports can be created, edited and signed right into the EHR.",
    "No worries if the clinician’s EHR is supported as it can work with over 200 of them at last count, including Epic, Cerner and AthenaHealth. It is designed to start working without training, to “Contextually understand the physician narrative,” so it can better comprehend clinical content. This is because Fluency Direct uses the speech profiles of over 200,000 clinicians in their collective database. The voice profile of each clinician gets hosted in the cloud, and then the clinician can utilize it to dictate from anywhere, at anytime, and on any of the devices- with the same high level of accuracy.",
    "There are also advanced voice commands, and macros to more easily allow the clinician to navigate through the EHR, contributing to a higher level of efficiency and satisfaction for the clinician using this platform. Single sign-on further enhances the productivity for the physician when using this product.",
    "A unique feature is the Computer-Assisted Physician Documentation (CAPD). The goal is to provide guidance to the clinician as the note is created, in terms of ICD-10 education, Clinical Documentation Improvement (CDI), and quality initiatives. This is done as “Automated, real-time, and interactive intelligence” gets applied to the physician’s documentation to generate actionable insights.",
    "The second plan offered is Fluency Flex, which gets used by over 450 users for the creation of over 15,000 documents each week. This is a front end speech recognition tool, which combines speech recognition, with voice commands, and voice driven standards. Physician productivity is enhanced, through a process that simplifies incorporation of prior documentation efforts. Overall documentation quality is increased, with less need for Health Information Management (HIM) intervention as deficiencies in documentation get identified with documentation warnings, and Computer-Assisted Physician Documentation (CAPD) messages.",
    "Another benefit is the reduction in transcription costs at the physician can complete the transcription independently.",
    "Users report variable results when it comes to accuracy on the M*Modal platform. While some praise it, others complain worse results than prior medical transcription platforms they have used previously. There are user reports of low accuracy, requiring constant editing, and slowing the entire process down which defeats the whole reason to use a medical transcription service, rather than just typing the whole thing out.",
    "There are also some reports of extreme difficulties such as the latest software upgrades providing less usability, and misspells repeatedly of simple names. Also, in use the system does not learn from its mistakes to improve over time.",
    "Exacerbating these issues above is that M*Modal requires contracts that lock users in, which makes it difficult to switch around if you are dissatisfied.",
    "According to the M*Modal website, customer support is available via a single option, a memorable toll free number, 888-DICTATE. No information is provided on the hours of operation, or if other contact methods, such as email are offered as well.",
    "The service is a cloud based SaaS, with no desktop software to install, and runs through a web browser. Unlike many other competing dictation solutions, there is an Android app, and also has an iOS one as well.",
    "The pricing of M*Modal’s services is nowhere on the website, and completely opaque with company contact required for any information of the options and costs. One plus compared to others is that there is information on ancillary equipment for the medical transcription process, including digital voice recorders, and dictation microphones with integrated controls to work along with the service.‌",
    "M*Modal appears to be a promising service from a large player in the medical transcription market, and backed by 3M.‌ With a choice of plans, tie ins to digital recorder models, and mobile apps for both the major platforms, on the surface there is plenty to like.‌ Delving deeper though, we encounter issues around the accuracy of the service at recognizing words, and contracts that lock users in, which leaves us cold, and advise users to carefully consider if M*Modal meets their needs prior to signing up."
  ],
  "headers": {
    "2": "Features",
    "8": "Drawbacks",
    "11": "Support",
    "13": "Pricing",
    "14": "Final verdict"
  },
  "links": {
    "M*Modal": "https://mmodal.com/",
    "EHR": "https://www.techradar.com/best/best-electronic-health-record-ehr-software",
    "Cerner": "https://www.techradar.com/reviews/cerner-powerchart-emr"
  }
}