{
  "source": "https://www.techradar.com/reviews/i-box-century-review",
  "title": "I-box Century review",
  "category": "audio-visual",
  "updated": "2019-01-24T11:32:19Z",
  "author": "henry-st-leger",
  "summary": "A half-baked Alexa speaker",
  "verdict": "The I-box Century speaker looks the part, but doesn’t offer a reliable smart speaker experience or offer the sound quality to justify its asking price.",
  "pros": [
    "Attractive vintage design",
    "That’s it"
  ],
  "cons": [
    "Not portable",
    "Frustrating volume control",
    "Not the Alexa we know and love"
  ],
  "article": [
    "At first glance, the I-box Century smart speaker hopes to hit that sweet spot in the audio market: a smart assistant-enabled speaker that doesn’t overlook the importance of style.",
    "The I-box brand specializes in Alexa-enabled audio hardware, including in its range portable speakers, alarm clocks, and add-ons to boost the audio or battery performance of an existing Amazon Echo speaker. But the I-box Century’s vintage radio design may make it the prettiest of the lot.",
    "This isn’t a DAB radio, mind you – you can see our list of the best DAB radios for that – although you’ll be able to access various digital radio stations, music sources, and more through either Alexa or your smartphone.",
    "Coming in three gorgeous colors, and powered by Amazon’s Alexa voice assistant for hands-free control, the I-box Century certainly seems an attractive proposition. But what is it actually like to use?",
    "At £129 (around $165 / AU$230), the I-box Century is a decent step above the Amazon Echo’s £89 ($99 / AU$119) asking price, although it’s just shy of the £139 ($149 / AU$229) Amazon Echo Plus, which offers an audio boost over the flagship Echo.",
    "Although it’s made by a UK brand, the I-box Century is available to buy through Amazon or iboxstyle.com, and ships internationally.",
    "The I-box Century is certainly easy on the eye. Coming in a dashing Stone Blue, Charcoal or Cream finish, with a neat gray mesh over the two 2.5-inch drivers, the Century blends the looks of a vintage radio with the smart assistant capabilities now expected from just about every speaker coming to market.",
    "Or at least, that’s the sell. However, while the I-box Century’s design succeeds in terms of old-school charm, it’s less successful when it comes to fulfilling its basic function as an audio speaker and smart speaker.",
    "This is a wired speaker, meaning it’s destined for life in your kitchen or living room, on a windowsill, bookshelf, or similar. That’s a shame, because its compact size and breezy coloring would make it ideal as a portable Bluetooth speaker. Its handle gives it the appearance of something to be lightly swung by the hip on the way to a 1950s picnic, but you can’t really take it anywhere.",
    "The top of the I-box Century features a smattering of buttons for playback, which all require a surprisingly firm push. The power button doubles up as the ‘mode’ button, which switches between Bluetooth, Wi-Fi (i.e. Alexa), and an auxiliary mode for cabled audio sources. One pleasing touch is the color-coded LED, which jumps between green, blue and yellow for the respective modes.",
    "The volume control also has no markings for ‘high’ or ‘low’ volume, and will scroll endlessly in either direction – it certainly looks sleek, but it’s impossible to tell what volume setting you left it on, or if the speaker is ‘paused’ or simply muted.",
    "You get two additional buttons for muting and ‘waking’ Alexa. You’ll have to connect to Wi-Fi through the I-box Player app first though, and then connect the speaker through the Amazon Alexa app too.",
    "So, how good is the I-box Century speaker’s audio?",
    "Compared to the Amazon Echo’s 2.5-inch woofer (for low frequencies) and 0.6-inch tweeter (for high ones), the I-box Century packs in two 2.5-inch mid-range drivers for a total 16W output.",
    "While the mid-range frequencies are reasonably clear, there really isn’t much bass at all. Anything more pumping than an acoustic guitar track or chatty podcast feels a bit weightless, without the low frequencies needed to give music any real presence. That’s fine if you’re just using the Century as a casual kitchen radio, but a bit disappointing given the three-figure sum you’re paying for it.",
    "The Alexa smart assistant also doesn’t sound as you’d expect. The I-box Century emits an odd monotone voice that sounds like a bad impersonation rather than the real deal, even if the capabilities of the AI should technically be the same.",
    "You can ask I-box’s Alexa the same questions as any Amazon Echo speaker, whether that’s the weather, traffic, trivia, or navigation through music streaming services and apps – and even multi-room audio for up to eight connected speakers. The I-box Century’s mic, though, isn’t as sharp at picking up voices as a regular Amazon Echo, and won’t be as quick to respond.",
    "You can ask I-box’s Alexa for the same things as any Amazon Echo speaker, whether that’s weather or traffic information, or answers to trivia questions, and use it to control music playback from streaming services – you can even set up multi-room audio for up to eight connected speakers. However, the I-box Century’s mic isn’t as sharp at picking up voices as a regular Amazon Echo, and won’t be as quick to respond.",
    "Those issues are compounded by a slowness for the speaker to wake up, with it requiring one or two minutes to warm up its smarts before Alexa will start speaking to you. And, while it’s hard to quantify exactly, we also found the I-box Century more likely to respond with “sorry, I’m having trouble understanding at the moment” than our Amazon Echo Plus connected to the same Wi-Fi network.",
    "The I-box Century will generally function fine as an Alexa-enabled smart speaker – but the user interface isn’t quite as seamless or reliable as you might hope for.",
    "If having a sleek-looking kitchen radio with basic voice functionality is more important to you than having the smartest or best-sounding speaker you can get for your budget, then you may well be won over by the I-box Century’s vintage charms.",
    "Otherwise, you’re probably better off with the cheaper Amazon Echo or similarly-priced Echo Plus."
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Design",
    "12": "Performance",
    "19": "Our verdict"
  },
  "links": {
    "Amazon Echo": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review",
    "best DAB radios": "https://www.techradar.com/news/audio/hi-fi-radio/best-dab-radio-which-one-should-you-buy-901928",
    "Alexa voice assistant": "https://www.techradar.com/how-to/the-best-amazon-echo-alexa-skills-and-how-to-install-them",
    "Amazon Echo Plus": "https://www.techradar.com/reviews/amazon-echo-plus-review",
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079"
  }
}