{
  "source": "https://www.techradar.com/reviews/nimble",
  "title": "Nimble CRM platform review",
  "category": "computing",
  "updated": "2021-02-15T19:01:17Z",
  "author": "michael-graw",
  "summary": "An inexpensive CRM platform with lots of tools for client communication",
  "verdict": "Nimble is an extremely capable CRM platform with advanced tools for lead generation and a focus on maximizing your results from client communications.",
  "pros": [
    "Numerous unique, advanced tools for lead generation",
    "Simple contact segmentation",
    "Archived message history and social media at a glance",
    "User-friendly interface with mobile app available"
  ],
  "cons": [
    "Unified inbox won’t receive Facebook messages",
    "Support isn’t always easy to get",
    "Inbox doesn’t let you organize email into folders"
  ],
  "article": [
    "Nimble is a communication-focused CRM tool that makes it easy to keep in touch with your leads and clients. The platform includes some powerful tools to generate new leads, as well as provides a user-friendly way to manage messages, segment clients, and stay on top of social media. For everything that Nimble has to offer, this CRM software is surprisingly cheap, too.",
    "Nimble makes pricing simple, with a single plan that’s available for $19 per user per month if you pay annually or $25 per user per month if you pay month-to-month. You get all of Nimble’s features, plus up to 25,000 contacts, 1,000 custom fields, and 2 GB of storage space per user. Upgrades are available if you need more contacts or storage.",
    "You can try out Nimble free for 14 days to see if the platform works for your business.",
    "Nimble has a ton of features for lead prospecting, client communication, and social media management:",
    "The platform offers a truly impressive number of different methods to bring contacts into your CRM database.",
    "If you’re prospecting for new leads, you can use Nimble’s email signature parsing feature to automatically capture contact data from email footers. Salespeople in the field can also use Nimble’s mobile app to take a picture of a business card. Nimble will automatically parse the data to create a new contact for you.",
    "Or, try the Smart Contacts app. This browser plugin allows you to click on a person’s or company’s name, and it will automatically pull up whatever social media and contact information it can find for you. Better yet, you can save that data to a new contact right from your browser.",
    "Last, but certainly not least, there’s Nimble’s ‘prospector’ tool. If you visit a company’s website, this tool will automatically extract all of the contacts it can find—including from pages that can’t be found using the site’s public navigation. Just beware that you only get 10 uses of the prospector tool per month included with your plan.",
    "Once you have contacts in your database, you can segment them however you like. This is where Nimble’s custom fields come into play. Simply create tags and then drag and drop them onto your contacts to create flexible lists.",
    "Another nice feature in Nimble is the unified inbox. You can get messages from your email, Twitter account, Microsoft Teams, and other platforms all in one place. Unfortunately, you won’t find Facebook messages here since Facebook discontinued support for most CRM platforms in 2015.",
    "All of your communications with a client or lead are archived to that contact, so you can always go back and see what was said. This record can be shared with your team—or not if you want privacy. Plus, if you have social media details saved for a contact, Nimble will automatically display their latest posts so you can see what they’ve been up to since your last message.",
    "Nimble’s interface is very easy to use, which is something of an accomplishment given how many tools this platform offers. The most notable feature is the dashboard, which gives you a clear overview of everything you need to know about when you first get to work in the morning. Your dashboard shows deals in progress and any status updates, upcoming events, new messages, and social media updates from your contacts. You can customize all of the information displayed, including marking contacts as ‘important’ to prioritize their updates and messages.",
    "The rest of Nimble’s tools are segmented into six different tabs, which makes it straightforward to find what you need. Better yet, the platform doesn’t require much setup out of the box, so by the end of the 14-day free trial you should have a pretty good sense of what Nimble can do for you.",
    "Nimble does have a mobile app for iOS and Android, which is a big plus if you have salespeople in the field. It’s essentially a mobile version of the web client—the only notable tool added is the ability to scan in business cards. It would be nice if Nimble’s mobile app made tools for social media management easier to access, since this is a common on-the-go need. But, this is a pretty minor inconvenience.",
    "Nimble’s support is something of a letdown. You can only get customer service via live chat or email, and responses can sometimes take until the next business day. On top of that, while the Nimble team holds weekly webinars, there’s surprisingly little documentation about the platform’s features.",
    "Nimble has carved out a niche for itself as a low-priced lead generation and client communication platform. But, if you need more project management and reporting capabilities, consider Zoho CRM or Salesforce. Both of these platforms offer many of the same communication tools as Nimble, but add in more team collaboration, task tracking, and project mapping features.",
    "Nimble is a very capable CRM software for companies looking to generate new leads and keep in touch with clients. The platform sports an easy to use interface with plenty of integrations and some very advanced lead scraping tools. While Nimble isn’t a full-blown project management platform, it’s a great choice for small businesses who want to maximize the value of their communications."
  ],
  "headers": {
    "1": "Plans and Pricing",
    "3": "Features",
    "4": "Lead Prospecting",
    "9": "Communication Management",
    "11": "Interface and In Use",
    "14": "Support",
    "15": "The Competition",
    "16": "Final Verdict"
  },
  "links": {
    "CRM tool": "https://www.techradar.com/best/the-best-crm-software"
  }
}