{
  "source": "https://www.techradar.com/reviews/virus-cleaner-antivirus-cleaner-max-security",
  "title": "Virus Cleaner: Antivirus, Cleaner (MAX Security) review",
  "category": "computing",
  "updated": "2019-05-06T11:26:53Z",
  "author": "mike-williams",
  "summary": "A one-stop, do-everything antivirus, privacy and speedup suite",
  "verdict": "MAX Security's antivirus is underpowered, but its mix of security, privacy and maintenance tools is more interesting. Worth taking for a spin.",
  "pros": [
    "Stacks of features",
    "Easy to use",
    "Some tools you won't see elsewhere"
  ],
  "cons": [
    "Unimpressive detection rates",
    "Overpriced ad-free version"
  ],
  "article": [
    "Virus Cleaner: Antivirus, Cleaner (MAX Security) is a top-rated free Android antivirus, security and maintenance app with a claimed ten million users and a 4.8 star rating on Google Play.",
    "The app has all the main features you'd expect: real-time antivirus protection, on-demand scans, system cleanup tools, an app locker to protect sensitive apps with a PIN or pattern, and a call assistant to easily block unwanted calls.",
    "MAX Security looks and feels very similar to Hyper Speed's Antivirus Free 2019 - Scan & Remove Virus, Cleaner. The interfaces look a little different and MAX Security has a few welcome extras, but they have the same scanning engine, the same reporting interface, and give the same results and recommendations. It looks like they're both developed from the same code base.",
    "There are no limits or restrictions to MAX Security's free version, although of course you will get to see lots of ads, before some functions, after others, and occasional ads which appear while you work.",
    "If this all gets too much, upgrading for $1.99 a month, dropping to $0.99 on the annual plan (the same prices as Antivirus Free 2019), enables going ad-free. That might make for a more comfortable life, but keep in mind that many top antivirus companies have security suites which can cover multiple devices (desktops and mobile) for a lower per-device cost. These will typically have better antivirus protection, too, although they generally won't include the same number of cleanup and optimization tools.",
    "MAX Security's interface follows the same basic rules as most of its Android security cousins, with a big scan button, a caption for your security status, and a few icons for its various function areas (Junk Clean, Phone Boost, CPU Cooler, Battery Saver, Notification Organizer, App Lock.)",
    "The scanning process and results appeared to be identical to Antivirus Free 2019. Tap a button and you'll wait around a minute for the first report, just a few seconds after that.",
    "The app correctly located our test malicious app, and sensibly recommended that we enable real-time protection, enabling dangerous apps to be detected as they're installed. But the rest of the report was padded out with suggestions to use or enable other features, including the call assistant, app locker, 'charging improver' (which looks for problems which reduce the charging rate, apparently), and more.",
    "MAX Security's Cleanup tool improves on Antivirus Free 2019, finding more system data to delete on our test PC, and getting closer to CCleaner in its junk-finding thoroughness.",
    "The CPU Cooler, Battery Saver and Wi-Fi Boost functions are also a little smarter, finding the most CPU, energy and network-hungry apps, but allowing you to decide which you'd like to close.",
    "The App Locker is more standard, allowing you to protect key apps (email, messaging, browsers) with a pattern or PIN code, and optionally take a pic of anyone who enters the wrong password. Neat idea, but it's essentially the same functionality you'll get in most similar apps.",
    "A capable Call Blocker enables blocking calls from private or unknown numbers (everyone but contacts). You could also choose to block everyone who isn't on your whitelist, or you can build a blacklist of people you never want to hear from again.",
    "The Notification Organizer, another module apparently shared with Antivirus Free 2019, displays your notifications, allows them to be selected and deleted individually, and enables hiding notifications from specific apps. We probably wouldn't use it very often (old notifications aren't a real drag on device performance, whatever these apps claim), but it's an improvement on the more basic cleaners which typically old delete notifications without giving you any options or control.",
    "For all its similarities with Antivirus Free 2019 and other Android management apps, MAX Security also has some small but interesting tools which you won't often see elsewhere.",
    "A Clipboard Manager, for instance, maintains a history of everything you've copied to the clipboard for easy recall later. That can be very useful, although there are some potential privacy risks, especially as the feature is enabled by default. (Forget about the manager, copy passwords or other vital items to your clipboard, and they'll be available to anyone with access to your device.)",
    "A Big Files screen lists oversized files of various types (video, audio, documents, apps, files you rarely use) and enables deleting any you don't need. It's a simple idea, but could be a better way to free up space than the regular junk cleaners.",
    "Other bonus features include a wifi speed test, a Data Thieves screen which looks out for apps accessing the network when your screen is locked, and a data monitor to help you track and manage your data use over time. You could find free alternatives without much difficulty, but having them bundled makes life easier, and it's good to see one of these system apps include some more original touches of its own.",
    "We run a few simple tests on every antivirus app to get a basic feel for its capabilities, but for the big picture, we check reports from the independent testing labs.",
    "AV-Comparatives' Android Test 2019, the current pick of the benchmarking crop, assesses the performance of 250 Android antivirus apps against 2,00 of the most common Android threats of 2018.",
    "MAX Security ranked equal 54th with a detection rate of 87.8%. Thirteen other apps received an identical score, apparently because most use the same Antiy OpenAVL engine.",
    "While that's an unimpressive score, it's similar to the performance of some big commercial names (Panda managed 91.6%, Dr. Web 90.8%), and outperformed others (Comodo detected only 77.6%.)",
    "Still, clearly there's much better protection around. 23 packages, mostly from top vendors like Bitdefender and Kaspersky, blocked 100% of threats, and many ad-sponsored apps did well. Lookout Security and Antivirus managed an excellent 99.6%, for instance, while Qihoo's 360 Security wasn't lagging far behind at 99%. MAX Security is a likeable app, but you probably shouldn't rely on it as your only antivirus.",
    "MAX Security's malware detection rates are way behind the best of the rest, and many of its other features feel like clones of other products, but there are just enough unusual functions to make it worth a try."
  ],
  "headers": {
    "5": "Features",
    "17": "Protection",
    "22": "Final verdict"
  },
  "links": {
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "Android Test 2019": "https://www.av-comparatives.org/tests/android-test-2019-250-apps"
  }
}