{
  "source": "https://www.techradar.com/reviews/hp-color-laser-150nw",
  "title": "HP Color Laser 150nw review",
  "category": "computing",
  "updated": "2021-03-03T17:29:43.926Z",
  "author": "jim-hill",
  "summary": "HP’s simple printer is the smallest, but not the best",
  "verdict": "This delightfully small and simple design is yours for a song, but the poor performance of this printer coupled with a lack of key features are major concerns.",
  "pros": [
    "Simple and compact design",
    "Low price",
    "Wi-Fi and Ethernet",
    "USB cable included"
  ],
  "cons": [
    "No auto duplex",
    "No display panel",
    "Poor paper handling",
    "Poor performance"
  ],
  "article": [
    "This unassuming device from HP is officially the smallest color laser printer on the market and is aimed squarely at the home or small office. It’s also one of the most affordable such devices at around £159 (about $199, AU$285).",
    "The refreshingly simple design does, however, mean that there is no display, and only the most basic features in order to keep the asking price down. Wi-Fi is built-in of course and there’s room for 150 sheets in the printer’s only paper tray, but there’s no auto duplex mode and it can’t print on envelopes. Instead, HP has designed this little print-only device for those seeking the speed and economy of a laser without the high initial cost.",
    "The HP Color Laser 150nw is the entry-level model in a new range of laser printers that tops out with the HP Color Laser MFP 179fnw four-in-one device (which has the same small footprint).",
    "HP has done much to miniaturize printers with its tiny Tango inkjet and the world’s smallest mono laser in the HP LaserJet Pro M15w. This latest model claims to be the smallest color printer going by footprint.",
    "It doesn’t look particularly small, but the HP Color Laser 150nw is a little shallower than every other printer. So shallow that the first thing you have to do to fit any A4 paper inside is extend the paper tray outwards, which compromises its stylish design and makes the footprint a whole lot bigger than you are initially led to believe.",
    "Nonetheless, the Color Laser 150nw is a very small and well-designed unit with a pleasingly minimal look that could fit unobtrusively into any small office.",
    "There are sockets at the rear for power, Ethernet and USB cables, and one single paper input tray at the front. There’s no front USB port, unfortunately, and no display. The control panel consists simply of four buttons on the top of the machine.",
    "The four toner cartridges account for the bulk of the space inside, and the main paper tray has room for 150 sheets of paper, with the out-tray capable of holding 50 printed sheets before it becomes congested.",
    "This stripped-down print-only device comes with only the most essential features. Wi-Fi is built-in with Wi-Fi Direct available for connecting your smartphone without joining a network. There’s also an Ethernet port at the rear and a USB Type-B port beside it. Sadly, there’s no front USB port for flash memory drives.",
    "There is only one paper-in tray, which can hold 150 sheets, and while the paper-out tray is on top of the printer and looks like it could hold a similar amount, it can actually only hold 50 sheets before it becomes congested, as we’ve already mentioned.",
    "There’s no NFC connectivity and no display of any kind. Instead, you can press and hold the Resume key for 10 seconds to print out a page revealing the printer’s status and any errors it is experiencing. The absence of an auto-duplex mode is a more serious omission because printing only on one side of the page will impact your paper budget, as well as the environment.",
    "There is a manual duplex mode, but even if you can figure out how to enable this, it still means you have to stand beside the printer and turn the paper over by hand.",
    "Four toner cartridges come pre-loaded giving you enough black, magenta, yellow and cyan to print 1,000 mono pages and 700 color. A replacement set of toner of the same capacity will cost around £186 (about US$233, AU$333). That’s significantly more than the cost of the printer itself, and it makes the cost per page higher than most laser printers at around 3.5p for mono pages and 19.6p for color documents.",
    "With no display, you’ll need to use your smartphone and the companion app called HP Smart to get your new printer to join your Wi-Fi network. This should be straightforward, although for some reason our sample refused to accept the network, or any Wi-Fi Direct password. However, assuming all goes according to the very brief instructions in the manual, the setup procedure should be quite quick.",
    "Having no display of any kind also adds an element of guesswork, making you wonder if the printer is actually working or not. The first page out time is very slow and if you’re not patient, you will find yourself printing duplicate pages by mistake.",
    "We waited for 1 minute 6 seconds for a color document to emerge and 45 seconds for a page of text. Consecutive sheets do churn out more quickly and HP quotes a print rate of 18 ppm for mono pages, but we found that figure to be optimistic. Color pages are quoted at 4ppm which is more realistic. In short, we’d have to say that this is not a fast laser printer.",
    "During testing we experienced more than one paper jam with up to five sheets of plain A4 paper becoming stuck in the system. The specifications suggest that heavy paper and recycled paper should be fine, but we would advise sticking with smooth laser paper of medium weight to avoid jams. Needless to say, it won’t print on envelopes of any size.",
    "The HP Color Laser 150nw prints consecutive pages of plain black text at a reasonably fast rate and at a reasonable quality. The characters are crisp and light enough to read at very small point sizes, and satisfyingly full and contained when printing bold letters.",
    "It is, however, more dependent upon the media that you feed it than other laser printers. With more porous recycled paper, for instance, things start to look rough around the edges, very small point sizes become unreadable and paper jams become likely. To avoid this, stick to smooth laser paper.",
    "Many laser printers turn out mono and color pages at exactly the same rate, but the HP Color Laser 150nw is far slower when it comes to color. As we already mentioned, we clocked the first page out time at well over a minute, which was long enough to make us wonder if the printer was even connected. With no display, you can never be sure.",
    "Color documents tend to look soft and lack the vivid clarity other laser printers manage. Laser printers are never great at printing photographs, but HP’s 150nw is particularly poor in this respect. Photos suffer from color banding and look shiny, blocky and unrealistic. The print quality is limited to 600 x 600 dpi, which is the lowest resolution we’ve seen in a laser printer – and is low enough to give any image a grainy, dotty appearance.",
    "In lieu of a display panel, this printer informs you of paper feed problems by flashing a red LED exclamation mark. It’s incredibly irritating, but you’ll have to get used to it because in addition to the paper jams, the printer frequently fails to recognize when paper is loaded in the tray.",
    "You can print out a page that will tell you the printer’s network status and an error report. However, we found that the ‘error information’ was never helpful and only wasted yet more paper. Beside the red exclamation point is the backlit power button which also flashes continuously in standby mode until you power it right down. We were driven to masking the LED with parcel tape.",
    "Overall, the print quality here is acceptable for many tasks, but it’s below average and the print speed is frustrating. Yes, consecutive pages trot out at a reasonable pace in black and white when all goes well, but the first page out time is way too slow.",
    "Of more concern is the printer’s intolerance to anything but smooth A4 laser paper. You may find that the money you saved in buying a cheap printer is soon wiped out by the amount of media wasted in paper jams, printing out error pages, and printing on a single side.",
    "On paper and in the flesh, the HP Color Laser 150nw looks like a smart, conveniently compact and refreshingly simple print-only device at a price that’s too good to be true.",
    "The user experience, however, is frustrating, and the overall performance disappointing. It is too slow to process and print the first page and we shouldn’t have to suffer paper jams when printing on plain A4 paper.",
    "Print quality is fine with text, but not great with color documents, and terrible with photos. Its inability to print on envelopes might not be a problem for many of us, but who doesn’t want to print on both sides of the page? While the lack of a display is inconvenient, the lack of auto-duplex is a real problem.",
    "The HP Color Laser 150nw is certainly cheap, but remember that a set of replacement toner costs considerably more than a new printer. Spend a little more on a decent printer and you’ll save money in the long run."
  ],
  "headers": {
    "3": "Design",
    "8": "Features and specifications",
    "13": "Setup and operation",
    "17": "Performance",
    "25": "Final verdict"
  },
  "links": {
    "HP LaserJet Pro M15w": "https://www.techradar.com/reviews/hp-laserjet-pro-m15w"
  }
}