{
  "source": "https://www.techradar.com/reviews/diesel-on-axial",
  "title": "Diesel On Axial review",
  "category": "wearables",
  "updated": "2019-12-14T13:00:03Z",
  "author": "jennifer-allen",
  "summary": "For those who like their watches big",
  "verdict": "The Diesel On Axial smartwatch has a rugged and masculine appearance that will appeal to those looking for a tougher and more daring-looking timepiece than most. Under the hood, it's a fairly typical high-end Wear OS smartwatch, but that's not a bad thing. It is expensive though.",
  "pros": [
    "Memorable design",
    "Comfortable fit",
    "Built-in speaker"
  ],
  "cons": [
    "Battery life still a little weak",
    "Wear OS can be sluggish",
    "Not for small wrists"
  ],
  "article": [
    "Diesel's second foray into the smartwatch world after the Diesel On Full Guard, the Diesel On Axial maintains the brand's strong focus on eye-catching design while also making sure it has the features to back up its looks.",
    "It's essentially a rebranded Fossil smartwatch, but more specifically a rebranded Fossil Gen 5, making it a cut above many of the rest.",
    "It's a bit expensive, but for the price you're getting some memorable looks that you just can't get anywhere else.",
    "The Diesel On Axial retails at a recommended retail price of $350/£339 (around AU$510). Few discounts can be found in the US, but for UK buyers, it's already available for between about £280 and £315 at Amazon, depending on your color choice.",
    "The options come down to Gunmetal-Tone, Bronze Stainless Steel, Blue Denim, or Black Leather. Depending on your choice, you can have a stainless steel bracelet style strap, denim strap, or a genuine leather strap.",
    "The Diesel On Axial isn't subtle by any means. It's brash in how much it wants to be noticed, thanks to its porthole-style watch face that offers a series of rivets around the edge to give it a steampunk look.",
    "While we don't like to give watches genders, this feels like a stereotypically masculine timepiece. Everything about it is rugged and tough, right down to its chiseled and textured buttons that stand out from the crown almost like an old-fashioned stopwatch, yet somehow manage to be eminently more fashionable.",
    "The watch bezel itself is massive. It's a 48mm watch and it feels incredibly oversized on small wrists. You definitely need to ensure you have at least medium-sized wrists, as this can look almost comical on dainty arms. The 24mm strap further expands that sentiment. But while it's big, it is at least comfortable.",
    "Despite such an oversized nature, the screen itself is fairly typical of a Fossil-based watch. It's a 1.28-inch AMOLED display, with an impressive resolution of 416 x 416, which helps a lot. That's the same as the Fossil Gen 5, but better than many smartwatches.",
    "Fashionistas will be disappointed to note there's no noticeable Diesel logo in sight, other than one on the back of the timepiece which obviously no one will see while you wear it.",
    "The Diesel On Axial uses the same hardware as the Fossil Gen 5. It has a Qualcomm Snapdragon Wear 3100 chipset, 8GB of storage, and 1GB of RAM.",
    "After some initial teething problems where the watch wasn't keen to respond following setup, we found it worked reasonably well with only some minor slowdown issues after extended use.",
    "It's certainly superior to older chipsets and those watches with less RAM, although you'll still wish for the speed to match your smartphone. Smartwatches really shouldn't demand the exaggerated taps they invariably require.",
    "There are useful features here, like a built-in speaker for if you want to take calls from your watch, provided your phone is tethered to it. There's also built-in GPS, heart rate monitoring, waterproofing (although only up to 3 ATM), and Google Pay support.",
    "It's all run-of-the-mill, but it's stuff you shouldn't strictly take for granted when picking out a fashion smartwatch.",
    "Diesel also tosses in some dedicated apps such as a Steps Goal app and the Diesel T-ON-I app. The latter is a kind of motivational tool with a keen sense of humor. It's not afraid of throwing some backhanded compliments at you or insulting you a little as it encourages you to go about your business.",
    "It's a small bonus but a charming one that makes the Diesel On Axial stand out from the crowd. Similarly, dedicated watch faces like the default animated tunnel effect one are a neat way of continuing to look different.",
    "The Diesel On Axial suffers from similar issues to other recent Fossil Gen 5-based smartwatches. Its GPS hates being too far from your phone. It's a frustrating issue if you plan on taking a jog without your phone, although we'll admit we do tend to prefer the accuracy that comes from keeping smartwatches tethered to phones at all times.",
    "Elsewhere at least, the Diesel On Axial performs pretty well. Heart rate monitoring seems fairly accurate, and while we'd suggest buying a separate strap for your workouts, whatever strap you choose should still do the job without too much excess sweat.",
    "Thanks to the chipset that the Diesel On Axial uses, you're able to tweak battery life quite extensively. It's possible to streamline the features you want to use, saving you battery life while still allowing you to do the things you want to do.",
    "It's not an ideal solution, but while we wait for improved batteries across the board with Wear OS watches, it will do. At least it gives you the power to do what you want.",
    "Skip using any battery modes and expect to need to recharge your watch overnight if you've been using it all day. Your mileage may vary though. We were able to stretch it to a day and a half without changing our day's plans.",
    "First reviewed: December 2019"
  ],
  "headers": {
    "3": "Diesel On Axial availability and price",
    "5": "Design and display",
    "10": "Specs and features",
    "17": "Fitness",
    "19": "Battery life",
    "22": "Don't buy it if..."
  },
  "links": {
    "Diesel On Full Guard": "https://www.techradar.com/reviews/diesel-on-full-guard",
    "Fossil Gen 5": "https://www.techradar.com/reviews/fossil-gen-5-smartwatch"
  }
}