{
  "source": "https://www.techradar.com/reviews/optoma-nuforce-be-live5-review",
  "title": "Optoma NuForce Be Live5 review",
  "category": "audio-visual",
  "updated": "2019-02-11T15:25:24Z",
  "author": "becky-roberts",
  "summary": "Bluetooth earbuds you can believe in",
  "verdict": "Optoma has a good track record when it comes to decent-sounding earbuds with long-winded names – and the NuForce Be Live5s don’t buck that trend.",
  "pros": [
    "Water resistant",
    "Wide range of ear tips",
    "Beautifully clear and crisp sound",
    "Punchy and energetic delivery"
  ],
  "cons": [
    "Imperfect packaging",
    "Not the last word in sonic subtlety",
    "Bass light"
  ],
  "article": [
    "Why tick one box when you can tick two? As much as the Optoma NuForce Be Live5s look like ordinary Bluetooth earbuds, they go the extra mile to discreetly accommodate sport fiends with a sweat-/water-resistant build and optional in-ear wing tips.",
    "Optoma has as much of a proven track record with verbosely-named, sub-£100 in-ears as it does with budget projectors, and as we suspected these newcomers only add to the brand’s lofty credentials.",
    "At $99 (£89.99 / around AU$150), they aren't too pricey, but you can get decent wireless earphones for cheaper, like the RHA MA390s, which come in at $70 (£60 / AU$100).",
    "We like to be thorough in our reviews, but rarely do we talk packaging. This is one of those scarce occasions, although unfortunately for the wrong reasons. We opened the box to find one of the earpieces was pretty determinedly wedged into its foam holding, and after some pretty unsuccessful (and fearful) yanking, we had to resort to tearing it up just to dislodge it.",
    "It’s not a great first impression, but at least it’s one the Be Live5s confidently overcome.",
    "To their credit, they sport a workout-friendly design that won’t put off those purely after a pair for day-to-day use, opting for a universally appealing in-ear design with subtle exercise enhancements as opposed to wieldy ear hooks or fluorescent details. They’re sporty buds in ordinary buds’ clothing, you could say.",
    "Their aluminum alloy housings retain the customary NuForce cylindrical design, here in a choice of all-back or navy/gold finishes. For the sake of ergonomics, 4mm has been shaved off the depth of the housings compared to their predecessors, the BE6is, and they sit at a 22.5-degree angle for better fitment, too.",
    "Thanks to those advancements, as well as the choice of Comply memory and silicone tips and two sizes of in-ear wings (or ‘mounts’, as Optoma refers to them), we find their fit secure and unobtrusive. These won’t be falling out in a hurry, even if you are in one.",
    "Their water-resistant build has been rated IPX5, which officially means they should survive ‘water projected by a nozzle’ – something to bear in mind if your running route goes past a car wash. Or, you know, if it rains. And the magnetic exterior that keep the buds together when they’re hung around your neck is a handy, if nowadays common, bonus.",
    "They come with a compact carry case wrapped in the kind of woven fabric you can’t help but fondle during every trip to IKEA, too.",
    "The in-line remote, which logically hangs a finger-length below the right earbud, is easy to use thanks to the raised markings on its rubber strip, and its usefulness is unquestionable – it allows the making and taking of calls, the launch of voice assistant Siri or Google Assistant on your phone, and music playback control for volume and track skipping. It’s also where the USB Type connector is for charging.",
    "Optoma’s eight-hour battery doesn’t quite compete with some competitors, such as the RHA MA390 Wireless (12 hours) or Optoma’s own NuForce BE Sport4 (10 hours), but it’s by no means poor.",
    "Importantly, the claim is in line with our experience, although not unreasonably you’ll get closer to seven hours with the volume turned up high.",
    "Just be aware that when it’s approaching the end of its charge, the rather loud and frequent “battery low” proclamation in your ears during a downtime listen of a Hygge-inspired playlist can be rather alarming.",
    "Having been impressed with every Optoma headphone that has passed through our doors, we instinctively have high expectations of these newcomers – and largely they don’t disappoint.",
    "Optoma knows a thing or two about projecting images and, it seems, sound too. We play Sharon Van Etten’s ‘Afraid of Nothing’ and are immediately won over by the clear crispness and confident directness of the Be Live5’s delivery.",
    "They appear adamant to engage rather than be deemed only suitable for background listening, but in the same breath that boldness is well-judged, ensuring they don't come across as garish as that friend of yours who has no filter.",
    "There’s the transparency to communicate the lo-fi charm of Ariel Pink’s psychedelic garage pop, and the energy to get you riled up with that Ultimate Gym playlist you follow on Spotify.",
    "There’s room for improvement. They aren’t the last word in subtlety or spaciousness – insight at this price is more respectable than remarkable, and that bold character of theirs sacrifices openness in their soundstage.",
    "We’d point sound performance purists to the SoundMagic E11BTs, which we very recently awarded 4.5 five stars and eclipse the Optomas in terms of overall balance, detail and toe-tapping rhythmic ability.",
    "Bass junkies should be wary, too. With a frequency preference that very much favors the midrange and the top end, which does wonders for vocal-led tracks and for creating an impression of clarity, the Be Live5s don’t quite have the low-end weight to be heralded completely balanced, or that bass fiends will be truly satisfied with.",
    "With Twilight Sad’s ‘The Arbor’, they’re more accomplished in capturing the shimmer of the keyboards than the heft of the drum beat, and they don’t manage to quite anchor that infamous bass line in Spinal Tap’s ‘Big Bottom’ as well as we’d like.",
    "Their clear, direct and up-for-it-delivery makes for an entertaining listen, mind, and their decent battery life and sport-friendly design ensure their talents are well-rounded and competitive in the sub-$100 market.",
    "They may not offer class-leading subtlety or bass weight, but here Optoma has combined an engagingly clear sound, a decent battery life and a sport-friendly design to good effect in what is yet another successful pair of attractively-priced in-ears from the brand.",
    "Because of that, the Optoma NuForce Be Live5s are Bluetooth buds you could recommend to your friends. If you can be bothered to say their mouthful of a name time and time again, that is.",
    "Image credits: TechRadar"
  ],
  "headers": {
    "3": "Design",
    "10": "Features",
    "14": "Performance",
    "22": "Final verdict"
  },
  "links": {
    "RHA MA390": "https://www.techradar.com/reviews/rha-ma390-wireless",
    "NuForce BE Sport4": "https://www.techradar.com/reviews/optoma-nuforce-be-sport4",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "SoundMagic E11BT": "https://www.techradar.com/reviews/soundmagic-e11bt"
  }
}