{
  "source": "https://www.techradar.com/reviews/nubia-alpha-review",
  "title": "Nubia Alpha review",
  "category": "wearables",
  "updated": "2020-07-24T13:33:21Z",
  "author": "tom-bedford",
  "summary": "A wearable, flexible, durable smartphone – with major issues",
  "verdict": "At its core the Nubia Alpha is a fascinating device, but there just aren’t enough apps for it to be a valuable wearable or smartphone, and it has enough bugs and issues to make it feel temperamental to use.",
  "pros": [
    "Long display can be useful",
    "Useful fitness functions",
    "Simple UI"
  ],
  "cons": [
    "Gesture controls are temperamental",
    "Various functions affected by bugs",
    "Limited communication options"
  ],
  "article": [
    "What is the Nubia Alpha? It’s a question we’ve been mulling over during our time reviewing this novel device. Nubia thinks it’s a smartphone, with the company implying that the form factor is coincidental to its main calling as a phone, but in terms of appearance and function it’s clearly a wearable.",
    "Certainly we’ve been using the Nubia Alpha (or Nubia ⍺, as the company is styling it) as both a wearable and a phone, and it definitely straddles the two form factors, but it feels like the ZTE-owned manufacturer missed a trick by not focusing on some of the other novel aspects of the device.",
    "There’s more to the Nubia Alpha watch than its identity issues – it’s one of the first devices to have a flexible screen, which wraps around the wrist and sits at different angles depending on how tightly you wear the device, and it’s the first wearable in a while to have its own camera – and a surprisingly good one, as well.",
    "So forget everything you know about smartphones, and about wearables, as we try to figure out what the Nubia Alpha is, and if it’s worthwhile as your next tech purchase.",
    "The Nubia Alpha was released in the US and Europe on April 25, several months after it was made available in China, including an LTE version which is exclusive to the country.",
    "You can pick up the device for $449 (roughly £340, AU$640) – the price is in US dollars on Nubia’s website wherever you are.",
    "Nubia also plans to release a special gold version of the device at some point, which will cost roughly $100 (about £75, AU$140) more, but we’re not sure yet what regions will get this model.",
    "Although the Nubia Alpha is technically a hybrid of smartwatch and phone, to look at it, you’d be forgiven for thinking it’s been inspired by those electronic ankle tags that get slapped on convicts.",
    "That is to say, the Nubia Alpha is a rather chunky device – it weighs 158g, or more than three times the Apple Watch 4’s 48g, and together with dimensions of 51.33 x 47.1mm x 13.8mm for the dial, that makes it a big beast.",
    "Compared to other wearables, you can definitely feel it on your wrist; that’s not necessarily a problem, as it’s comfortable to wear, and we quickly got used to wearing it while exercising or sleeping without it being annoying, but some people will prefer devices that can easily be ignored – and it’s hard to ignore the Nubia Alpha.",
    "Thanks in part, no doubt, to its bulk, the Nubia Alpha is a very sturdy device – over the course of our time with the wearable we bumped and scraped it on just about every surface imaginable without inflicting much more than a couple of nicks so if you need a rough-and-tumble wearable you could do a lot worse than with the Alpha.",
    "The Nubia Alpha’s looks are quite divisive – while we initially thought it looked a little ungainly, its appearance quickly grew on us, and we’d now call it a good-looking watch, although that’s definitely a subjective opinion.",
    "The stainless steel band makes the Alpha look suave yet understated – we wouldn’t be totally surprised to see James Bond wearing one of these (and it would do wonders for Nubia’s sales figures).",
    "Speaking of the band, you can easily remove links to shrink the size of the Alpha to fit your wrist – that’s not something we can say about every similar premium watch, so we appreciate the opportunity here.",
    "There’s no need to hold out for a Samsung Galaxy Fold to see how flexible screens work, as the Nubia Alpha’s screen is bendable, takes up roughly a third of the device’s total circumference. It’s one of the Alpha’s most novel features, and it lends a futuristic appearance to the device – but, more than that, it’s actually pretty useful.",
    "The screen is four inches across diagonally – the Alpha’s screen isn’t very wide though, so there isn’t as much screen real estate as on a device like the Pixel 3 with its 5.5-inch display.",
    "It’s an OLED display – that’d be a fine on a smartphone, but you’re not exactly going to be watching Netflix or playing games on the Alpha, and in general the screen quality is fine.",
    "The Nubia Alpha’s screen is plastic, so there’s a little friction when you swipe along it, but you’re not going to be doing any complex gestures, so again this won’t be a huge problem.",
    "There were certain circumstances in which the Nubia Alpha’s long screen was hugely useful – when viewing our daily calendar, for example, or a long chain of texts, it was great to be able to see our meetings or messages disappear into the distance.",
    "Most of the time, however, we didn’t make that much use of the longer display, mainly because, depending on how tight you have the watch, much of the screen won’t be visible as it disappears round your wrist.",
    "Most features of the phone are designed to fit in the ‘main’ section of the display, so there weren’t many occasions when we needed to see the entire screen."
  ],
  "headers": {
    "4": "Release date and price",
    "7": "Design",
    "14": "Display"
  },
  "links": {
    "Samsung Galaxy Fold": "https://www.techradar.com/reviews/samsung-galaxy-fold",
    "Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review"
  }
}