{
  "source": "https://www.techradar.com/reviews/borderlands-3-review",
  "title": "Borderlands 3 review",
  "category": "gaming",
  "updated": "2019-11-27T17:00:20.782Z",
  "author": "lloyd-coombes",
  "summary": "Vault(ing) Hunter",
  "verdict": "A franchise unwilling to innovate is no bad thing - Borderlands 3 is a rollicking good time which offers plenty of content and surprising depth.",
  "pros": [
    "New locations to visit",
    "Incredible arsenal of weapons",
    "Surprisingly varied endgame",
    "Deep RPG systems"
  ],
  "cons": [
    "Not all that funny",
    "Poor vehicle combat"
  ],
  "article": [
    "After a considerable hiatus, it’s time to return to Pandora and rip, tear, shoot and loot your way to victory. But does the Borderlands formula hold up in 2019, or should this vault have been left sealed?",
    "For the uninitiated, the Borderlands franchise is built upon the pursuit of gear. Players earn loot at an almost obscene rate, constantly unlocking new weapons and abilities with which to battle through stylized environments. Borderlands 3 doubles down on everything that makes the franchise great, but also maintains some of the series’ less enjoyable idiosyncrasies. I suppose you could say it’s sticking to its seemingly endless number of guns.",
    "Returning to Pandora feels like a homecoming - if the home you’re returning to is a Mad Max-inspired desert planet where the only thing more dangerous than the bandits wreaking havoc in its arid spaces is the local wildlife. Thankfully, in its jump to the current generation, Borderlands 3 offers more exciting locales too. While Pandora has its own charm, it’s exciting to leave the wasteland behind in search of more exciting climates. Each of the new environments stand apart from each other, from Promethea’s huge structures and urban streets to the swampy depths of Eden-6 that widen the franchise’s color palette tenfold.",
    "Borderlands 3’s commitment to its aesthetic is inspiring, and once again the cel-shaded design, complete with thick outlines combines with excellent use of color and the aforementioned new intergalactic beauty spots to form a kind of mayhem-laden comic-book fever dream.",
    "Fittingly for a franchise that continues to market itself with one of its many standard Psycho grunts, character designs are excellent - both in terms of players and enemies. All four Vault Hunters exude personality, from Zane’s Irish accent to FL4K’s deadpan utterances.",
    "Unfortunately, it’s with Borderlands 3’s dialogue that cracks begin to show. While humor is entirely subjective, so many of the game’s ‘funny moments’ simply don’t stick the landing. Perhaps its audience has matured over the last five years, but many of the references and memetic callbacks just feel like a chance to introduce tired pop-culture reference after reference.",
    "It’s exhausting, but it isn’t without its positives - enemy death cries are an easy highlight, and hearing a bandit yell “my chilli recipe dies with me” still brings a smile to my face even dozens of hours in.",
    "Borderlands 3’s campaign revels in its own absurdity, and for the most part that’s fine. The Calypso Twins, primary antagonists and intergalactic internet superstars, have managed to unite the various Bandit factions in an effort to mobilise a force to unlock vaults hidden below Pandora’s surface.",
    "It’s standard MacGuffin fare, but the shame of it is that the Calypso Twins simply aren’t as interesting as previous villain Handsome Jack. While they taunt via a radio system, they’re just lacking any charisma and can feel like a podcast you’ve tuned out of after a few conversations.",
    "Other bosses don’t fare much better, despite some entirely unique designs. Many conform to the ‘run around an arena killing small enemies and flanking the big bad’ methodology, but occasionally cheap difficulty spikes keep things frustrating more than challenging. For example, one enemy can electrocute the arena’s floor, offering absolutely no reprieve.",
    "Thankfully the reason you’re probably here, the gunplay, feels just as good as it ever has. Weaponry is once again the star of the show, and guns in Borderlands 3 are impressively varied. The much-publicized ‘guns on legs’ are fun, as are guns that double as throwable explosives when reloading, guns that send enemies flying sky high, or guns that eat through currency when used.",
    "Despite the variety, each feels given its chance to shine. While you’ll be constantly cycling out weapons again and again to test out new ones, the design of each feels lovingly handcrafted. One early submachine gun offered dual sights but no real other perks, but flicking between both optics was so satisfying that we kept using it long after its utility wore off. Many weapons now have alternate firing modes, so the most unassuming pistol can fire rockets or become a taser with a click of a button.",
    "Gunplay feels great, but movement is where Borderlands 3 has taken baby steps to offer a more modern experience. Your character can now vault and slide, and while these feel long overdue and seemingly minor at first, trying to return to (the admittedly excellent) Borderlands 2 without being able to hop over small pieces of level geometry or baseball slide with a shotgun blast shows just how big a difference these small tweaks can make.",
    "These weapons can be wielded by one of the franchise’s trademark four classes, and each offers a surprisingly diverse play-style. Zane’s ability to throw out a clone of himself that can deal damage is great, but being able to switch places with said clone (essentially teleporting) is a game-changer. Meanwhile, Moze’s ability to summon a mech is a perfect last resort manoeuvre, and FL4K’s various monster minions can quickly thin a horde. For our money, Amara offers the most badassery for your buck, able to summon phantom limbs from the ground to smash and slam enemies.",
    "When combining all four characters’ active skills, attributes and varied weaponry in co-op, Borderlands 3 is the perfect way to spend an evening with friends. Loot can be instanced or fought over, while each class has four skill trees to pour experience into which can result in vastly different character builds. In fact, Borderlands 3 arguably offers better RPG systems than any shared-world shooter, despite that genre’s focus on constructing a character that fits a playstyle.",
    "Unfortunately, both vehicular traversal and combat feel too imprecise to be anything more than a novelty that wears thin quickly, despite the ability to customize vehicles and summon them often. It’s often more fun to use the game’s litany of junkyard scrappers to cover large stretches before hopping out to deal damage on foot.",
    "Where Borderlands 3 packs its most welcome surprise is in its endgame content. While there are no raid-style encounters (at least yet), there’s plenty more to see, do, shoot and loot once you roll credits on the main campaign. Circle of Slaughter is a basic horde mode, where players can earn exclusive loot by killing enemies and completing side objectives, while Mayhem Mode doubles loot quality but increases enemy health and adds some modifiers.",
    "You can even unlock a new rank system when the campaign is over that offers bonus statistics to tweak for each of your classes, while there’s also a New Game Plus mode if you’re ready to do it all over again for better loot. The new Proving Grounds offer wave-based enemies and bosses that will shower you and your team with loot - if you’re efficient enough.",
    "Borderlands 3 feels like a time capsule of sorts. Despite the prevalence of on-going service games and shared world shooters like The Division or Destiny, Gearbox Software’s first game in three years feels refreshingly comfortable - the videogame equivalent of your favorite movie being on TV on a rainy afternoon. It arguably doesn’t offer a great deal that’s new, but with each journey through it you’ll come to appreciate it more."
  ],
  "headers": {
    "5": "Not big, and not clever",
    "10": "Hoarderlands",
    "13": "Class warfare",
    "18": "Verdict"
  },
  "links": {
    "vault and slide": "https://www.techradar.com/news/borderlands-3s-quality-of-life-features-are-its-crowning-glory"
  }
}