{
  "source": "https://www.techradar.com/reviews/gtech-sport-electric-bike",
  "title": "Gtech eBike Sport review",
  "category": "fitness",
  "updated": "2021-03-22T12:50:19Z",
  "author": "macarthy-danzig",
  "summary": "The Gtech eBike Sport is a simple and good value first e-bike",
  "verdict": "A low-cost e-bike that’s durable enough for everyday use. Despite basic brakes, its simple construction and operation largely won us over.",
  "pros": [
    "Cheap",
    "Simple single-speed drive",
    "Comparatively light"
  ],
  "cons": [
    "Single frame size",
    "Basic brakes",
    "No mudguards"
  ],
  "article": [
    "'Cheap' and 'simple' may not be words you usually associate with the idea of electric bikes, but they're the factors that Gtech has doubled down on with its Gtech eBike Sport, and mostly with good results.",
    "Somewhat incongruously this smart little bicycle is made by a brand better known for its vacuum cleaners. But Gtech's made enough smart concessions here to cement them as a potential contender in the burgeoning crop of the best electric bikes out there.",
    "Read on for our ride-on thoughts in this full review.",
    "Some readers may be asking ‘how much for a bike!?’, but £1,000 (around $1335 / AU$1940) isn’t really a lot to pay, meaning the Gtech slots in as one of the cheapest ebike options out there. But how does it divide its budget?",
    "Stripped of its electric parts, the remaining bike would probably be fairly priced around £400-500. However, a few clever tricks improve its performance above what you might expect of something at that price-point.",
    "Foremost among these is its single-speed drivetrain. Driven by a clean-running Gates Carbon belt drive, this cuts down weight, maintenance, and simplifies the operation of the bike. Plus with the extra assistance, you won’t feel the lack of gears. Originally only available direct, the Gtech is now sold through a range of bricks and mortar retailers, too.",
    "With a single-speed drive and rear hub motor, the Gtech’s quick-release bottle-style battery sits discreetly on its downtube. Combining to provide two levels of assistance, dubbed normal and eco, these are selected using the sole button on the battery, which also turns the bike on.",
    "Incredibly simple, a small LCD screen shows the charge remaining. Otherwise, the lack of a conventional display or controller leaves the handlebars pleasingly uncluttered, while also keeping costs down.",
    "Also simple is the Gtech’s one-size-fits-all philosophy. Ideal for riders around 5ft 10”, those over 6ft will end up with a slightly odd fit, while anyone much shorter than 5ft 6” will be better served by the step-through frame version.",
    "Let’s start with the electronics. With a 36-volt motor and 200wh battery, the Gtech’s drive system doesn’t have quite the pep as some alternatives. This means you’ll have to put in a little effort at the pedals to get it moving. Pleasingly the power it does provide is very naturally added via the bike’s built-in computer. Improving upon what your legs are doing, the Gtech never feels like it’s getting away from you, and about the only time we wished for more juice was when pulling away from the lights.",
    "Charging time is good at around three hours, and while the claimed range of 30 miles only applies if you do a lot of the work yourself, it’ll manage both legs of most daily commutes on a single charge.",
    "On to the components. The aluminium frame and fork are light, while the ergonomic saddle and grips are comfy and unobtrusive. Crucially, the tyres are pretty puncture-proof, a big benefit when a rear flat will mean having to disconnect the motor to remove the wheel.",
    "So what don’t you get? Compared to earlier versions there are no mudguards, so you’ll need to add these unless you want a soggy posterior. There’s just one gear, although we like this feature. We’re less keen on the brakes though. In the interests of cost-saving, the Gtech uses v-brakes, not the more modern disc calliper type. Suffering slightly in the wet but still decently powerful, the issue is more how they’ll wear out quicker while also eating into the bike’s rims, resulting in larger and more regular servicing bills.",
    "The Gtech rides like a nimble hybrid, but with the extra power of electrical assistance. It’s light to manoeuvre or carry, and it looks way better than you’d expect given its budget pricing.",
    "Overtaken somewhat since first launched, it’s still good value. For shorter journeys, and if you can live with the slightly middling level of extra oomph and lack of disc brakes, it remains a solid budget runaround."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "9": "Performance",
    "13": "Verdict"
  },
  "links": {
    "electric bikes": "https://www.techradar.com/best/electric-bike",
    "best electric bikes": "https://www.techradar.com/best/electric-bike"
  }
}