{
  "source": "https://www.techradar.com/reviews/august-view-doorbell-camera",
  "title": "Hands on: August View Doorbell Camera review",
  "category": "appliances",
  "updated": "2019-04-09T19:52:30Z",
  "author": "nick-pino",
  "summary": "A platform-agnostic smart doorbell with a 1440p camera and interchangeable faceplate",
  "verdict": "In a world filled with increasingly closed-off devices, the August View could offer a sharp, platform-agnostic doorbell for your burgeoning smart home… if August’s software gets an upgrade.",
  "pros": [
    "Slim new design",
    "Interchangeable faceplate",
    "1440p camera",
    "Comes with Chime"
  ],
  "cons": [
    "Live view can be hit or miss",
    "No video on Home Hub",
    "Chime connection issues",
    "Subscription-based storage plans"
  ],
  "article": [
    "After making its debut at CES 2019 earlier this year, the August View is nearly ready to make its way to your front door. The smart doorbell sports a new-and-improved design and a 1440p camera that’s wireless, battery-powered and compatible with all three of the major smart home platforms.",
    "At $229 (around £175, AU$325), the View is slightly more expensive than the Ring 2 Video Doorbell that costs just $199 and is exactly the same price as the Nest Hello, however August includes both the doorbell and Chime in the same box.",
    "We got a chance to set one up at our own home, and while we didn’t have enough time to put it through its paces with numerous visits from guests, we wanted to give you an initial look at the future of doorbell tech.",
    "Let this be said, the August View is a serious improvement on August’s previous designs. The View is long and sleek, and should fit more entryways compared to its blocky, square-shaped predecessors.",
    "The front of the View is perfectly minimal - there’s just a single button that’s encircled by an LED light and a fisheye lens with a 1440p sensor. That makes any video captured on the August View a slightly higher resolution than other doorbells on the market that still capture 1080p, and could help you spot details and identify unwanted guests should the need arise.",
    "Even better than the upgraded camera is the View’s built-in battery and Wi-Fi antenna that allows it to remain unconnected to any electrical circuit and will last between three and six months before needing to be recharged.",
    "Inside every August View box you’ll find the smart doorbell itself, a wall-mounting plate, a few screws and a Chime unit that sits inside your house and ring whenever there’s a visitor.",
    "How difficult mounting the plate is depends solely on the material found near your front door. The building we live in has a concrete exterior, which means mounting was a bit more difficult than most and required some extra tools like a ¼-inch masonry bit. If the front of your house is made from a more pliable material, however, you should be fine with just a power drill or a screwdriver and the screws that come in the box.",
    "The last design aspect that’s worth mentioning is that the August View sells additional interchangeable faceplates that will allow you to better match your home’s style. At launch you’ll be able to pick from a plastic faceplate in red, white or blue for $14.99 per faceplate, or a metal faceplate that comes in brass, satin nickel, midnight gray or bronze for $29.99 each.",
    "While we haven’t been able to spend too much time with it, the August View’s specs are promising: We’ve already mentioned the 1440p camera, but there’s also a built-in microphone and speaker that allows for two-way conversation with the person at the door.",
    "Unfortunately, however, that two-way conversation will only include a live video feed if you use the app or an Amazon Echo Show speaker - as of right now, Google doesn’t support third-party security devices on the Google Home Hub. That’s not a deal-breaker as you’ll still be able to connect the View to both Google Assistant and Apple HomeKit, but for now video remains relegated to either Amazon or the app.",
    "Speaking of the app, we found the August app to be a decently useful companion. It certainly helps with the setup process by showing step-by-step directions, allows you to unlock the door if you have an August smart lock and you can get a live view of the outside at any time once the View is connected to your Wi-Fi network.",
    "The only problems we’ve had so far, and ones that will require further testing, are that the View will disconnect periodically from the Wi-Fi network (not ideal for a security device that should be on 24/7) and loading the live view feed takes upwards of 15-20 seconds (again, not ideal when you want to quickly see what’s happening outside). We also had problems connecting the View to the Chime, though, August says should be automatically connected the minute you take it out of the box.",
    "We'll continue to test these features over the coming weeks and will report back once we've had some more time with it.",
    "Of course, no matter what comes out of our performance tests, it’s important to remember that while August offers a basic free subscription package that stores thumbnails and clips, accessing those clips after 24 hours requires you to upgrade to either the Premium or Premium Plus package that costs $2.99/month for 15 days of storage or $4.99/month for 30 days of storage, respectively. So be ready to have a new recurring monthly payment if you want complete coverage.",
    "On paper the August View sounds great: It's compatible with all three of the major players in the smart home space right now, offers 1440p video coverage and, because it's battery-powered, can be installed on any home or apartment.",
    "Unfortunately, however, there seems to be some issues with performance at the moment. We had difficulty getting the Chime to connect to the View and with the View to stay connected to our Wi-Fi network despite a strong, consistent signal. When the camera is up and running, connecting to the live view can take between 15 and 20 seconds to connect, and by then any activity you wanted to see might have left the premises.",
    "If August can iron out these issues in the coming weeks, the August View could be a solid competitor to the Ring 2, despite being slightly more expensive. If it can't, well, there are a few other great options out there."
  ],
  "headers": {
    "3": "Design and setup",
    "9": "Performance",
    "15": "Early verdict"
  },
  "links": {
    "CES 2019": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "Ring 2 Video Doorbell": "https://www.techradar.com/reviews/ring-video-doorbell-2",
    "Nest Hello": "https://www.techradar.com/reviews/nest-hello"
  }
}