{
  "source": "https://www.techradar.com/reviews/happyfox-help-desk",
  "title": "Happyfox Help Desk review",
  "category": "computing",
  "updated": "2019-09-11T18:15:26Z",
  "author": "mark-pickavance",
  "summary": "Ultimate flexibility",
  "verdict": "A powerful and easy to use system that isn’t as competitively priced as it once was. But whatever is asked for this software, it might well be worth it for the high level of customisation and integration on offer.",
  "pros": [
    "Easy to use",
    "Effective automation",
    "API integrations"
  ],
  "cons": [
    "SMS and Chat cost extra",
    "Getting more expensive",
    "No trial without demo"
  ],
  "article": [
    "Happyfox sounds like something that Bob Ross would accidentally insert into one of his paintings, but it’s a company headquartered in Irvine, California.",
    "Its primary products are all software as a service (SaaS) support platforms, and the most important of these is a help desk solution that offers extensive integrations.",
    "With a strong reputation to uphold, are recent price increases and stronger competition making this Happyfox less appealing?",
    "Helpdesk solutions are invariably built around a ticketing system, and Happyfox has one of the slickest of these we’ve seen.",
    "It is so elegant that Happyfox could easily be deployed without a training programme in a small business, almost overnight.",
    "Tickets can be manually created, via email, be generated by a customer portal or automatically by social media postings. Whatever the entry channel, the information is handled by an automated process to link it to existing requests or other tickets from the same source.",
    "The system has internal code running designed to avoid two agents trying to resolve the same issue from two tickets and repeating the exercise. That tickets can be merged is a very useful facility.",
    "A smart rule system can automate initial responses and direct the customer to a self-help system while they wait for an agent to be available.",
    "These are just a few of the features of Happyfox that are designed to reduce the agent workload and streamline enquiry responses.",
    "What’s also a strong point of this solution is its multi-lingual nature, as the system supports more than 35 languages inherently. And, the knowledge base can also be created with translated help contents to support more nationalities natively.",
    "One minor complaint we have is that there is no download-and-try option with Happyfox.",
    "To get access to a trial, you must accept a 30-minute demo of the product where the Happyfox representative will discuss your needs.",
    "While the company might have convinced itself that this is a better way to snag potential customers, we’d contest that given even the smallest hoop to jump through most IT managers will head to a competitor with a downloadable trial.",
    "Within the practical constraints applied by web-based applications, Happyfox has a very slick and uniform interface that feels mature.",
    "However, if you don’t like the way it looks or even the fields presented within ticket creation, for example, you can change it all.",
    "This is easily one of the most customisable help desk tools we’ve seen, and the changes that can be made are more than just a re-branding exercise.",
    "Custom fields, categories, statuses, priorities are all available, and many more areas can be tailored to specific business needs.",
    "When the system is first initialised, Happyfox asks some basic questions about the industry the system is going to be deployed and uses general templates to provide the typical needs for those. But once the system is up it can be dramatically altered if those aren’t the preferences that are required.",
    "Our only concern about interface customisation is that an obsessive manager might be tempted to change things all the time because they can. Some control must be exercised over this process, or agents will become confused about what to expect when they come to use the system.",
    "Every helpdesk solution these days has role-based security and uses SSL to project the web interface from prying eyes, and Happyfox is no exception.",
    "What it also offers at all tiers is single sign-on (via Google Apps/SAML), IP based login restrictions and two-factor authentication.",
    "Higher tiers have single sign-on via JSON Web Token (JWT), digitally signed emails (DKIM) and password policy management.",
    "The latter two options are limited to Enterprise customers, but logically that is the segment that would want this exact functionality.",
    "The pricing of service desk software is currently polarising into cheap products that are looking for high volume customers and those with more expensive solutions which offer tools that can be tweaked to fit more exactly into a business and its processes.",
    "Happyfox sits somewhere in between those two positions.",
    "It isn’t so expensive that it puts everyone but Enterprise customers off, and it also offers enough flexibility to attract those who want everything tailored to specific needs.",
    "Currently, Happyfox has four plans; Mighty, Fantastic, Enterprise and Enterprise Plus.",
    "These correspondingly cost $29, $49, $69 and $89 per agent per month on an annual contract, and an extra $10 each month on each if you pay monthly.",
    "The exact breakdown of what features you get at each level is complicated. But, in terms of the critical features, you only get Asset Management at Enterprise and above. Multi-branding needs Fantastic or better, as do satisfaction surveys.",
    "What was unexpected, is that all tiers get almost all the third-party integrations, with only RingCental Phone integration, Microsoft Dynamics CRM, Stripe and Send SMS being limited to Fantastic or higher.",
    "What you get at each tier is still good value for money, but Happyfox was once cheaper and being double the entry point of other products will be a stumbling block for some.",
    "Less of an issue is the functionality Happyfox has, which is generally very good and meshed with a well-designed interface.",
    "Integration to other software is also mostly good news, with the popular CRMs supported along with a range of SSO (single sign-on) options. There are two places this integration model is weak, and those include chat and SMS tools.",
    "Previously Happyfox supported third-party chat and SMS products, but it decided to remove these those options and make both these functions exclusively in-house.",
    "It’s a rather obvious move to generate more revenue that ignores what the customers might prefer.",
    "Happyfox Live Chat costs $29.99, $49.99 or $99.99 per agent per month, depending on the tier chosen, effectively doubling the cost of using the Help Desk.",
    "You can get around these limitations if you are prepared to use the Happyfox API to craft linkages, but this is just another deployment cost that customers shouldn’t need to pay.",
    "Even with the additional expenses and a cost per agent that can easily be bettered, Happyfox users are generally very pleased with this solution due to the effectiveness of the ticket handling solution and the solidity of the platform.",
    "We’d put it up there with Vivantio Pro and Freshservice as the best in class, but both those products are overtaking Happyfox in inherent functionality they offer at the lower tier plans. And for the cost-conscious, Zoho is much cheaper."
  ],
  "headers": {
    "3": "Features",
    "13": "Interface",
    "19": "Security",
    "23": "Plans and pricing",
    "37": "Final verdict"
  },
  "links": {
    "Happyfox": "https://www.happyfox.com/",
    "SaaS": "https://www.techradar.com/news/what-is-saas",
    "Helpdesk": "https://www.techradar.com/best/best-helpdesk-software",
    "four plans": "https://www.happyfox.com/help-desk-price/",
    "CRMs": "https://www.techradar.com/best/the-best-crm-software",
    "Happyfox Live Chat": "https://happyfoxchat.com/live-chat-pricing",
    "Freshservice": "https://www.techradar.com/reviews/freshservice",
    "Zoho": "https://www.techradar.com/reviews/zoho-desk"
  }
}