{
  "source": "https://www.techradar.com/reviews/htc-desire-12s",
  "title": "HTC Desire 12s review",
  "category": "phones",
  "updated": "2019-08-03T14:00:00Z",
  "author": "basil-kronfli",
  "summary": "Misses the mark in almost every way",
  "verdict": "The HTC Desire 12s doesn't make much sense. There are other HTC phones that offer more for less, and the competition blows it out of the water. While the design and screen are highlights, they aren't enough to make up for the phone's poor performance or battery life.",
  "pros": [
    "Design feels good in-hand",
    "Screen looks good",
    "Minimal bloatware"
  ],
  "cons": [
    "Poor battery life",
    "Under-powered internals",
    "Lackluster camera experience"
  ],
  "article": [
    "The smartphone industry has a lot to thank HTC for; the One M7 was a classic. The original Desire was integral in bringing Android to the masses, and even in recent years, it has impressed us with the likes of the HTC U11.",
    "Unfortunately, though, while its VR business is thriving with the excellent HTC Vive range, its smartphone business is just scraping by, and nowhere is this more evident than in the HTC Desire 12s.",
    "For a phone that costs the same as great alternatives like the Realme 3 Pro, Honor 10 Lite or Moto G7 Power, you get an under-powered experience and a single camera, not to mention a dated version of Android.",
    "On paper, it’s a bit of a bust from the get-go, but what’s the phone like to use in reality?",
    "The HTC Desire 12s can be picked up for £179 (around $215/AU$315) right now SIM-free with 32GB of storage in the UK.",
    "There’s a 64GB version too, and while it isn’t as widely available right now, it can be picked up for about £199 (roughly $240/AU$355) if you shop around. We’ve had no word on US or Australian availability.",
    "The HTC Desire 12s, which is available in Charcoal Black or Crystal Silver, isn’t a bad looking or feeling phone.",
    "Its plastic body sits well in the hand, feels solid, the screen is a comfortable size - not too big and not too small at 5.7 inches. It also has all the buttons we need, and a headphone jack.",
    "Having said that, at the bottom of the phone there's a micro USB port, alongside a mono speaker, two tell-tale low-end elements.",
    "On the right side there's a power button, on the left there's a volume rocker and around the back there's a single camera and a fingerprint scanner. The scanner is well placed and easy for a fumbling finger to find.",
    "The HTC Desire 12s’ plastic body has a high-gloss finish across the sides and the top portion of the back. The bottom two-thirds of the back sports a horizontal striated pattern. This does a good job of repelling fingerprints compared to the glossy part.",
    "It definitely isn’t a super-premium finish, but we wouldn’t expect it to be given the price of the HTC Desire 12s; so while we don’t love it, we don’t hate it either.",
    "The 5.7-inch LCD screen sports an 18:9 aspect ratio and 720 x 1440 resolution. This definitely isn’t a best-in-class display, with the likes of the Honor 20 Lite ramping things up to Full HD.",
    "It does still manage to deliver fair viewing angles, even if the color balance leans towards blue hues, and while it isn’t the sharpest screen in the shop with a pixel density of 282 pixels-per-inch, it showcases websites, the UI and your media about as well as we’d expect a sub-$250/£200 phone to do. It’s also bright enough for comfortable viewing outdoors, which is great."
  ],
  "headers": {
    "4": "Price and release",
    "6": "Design and screen"
  },
  "links": {
    "One M7": "https://www.techradar.com/reviews/phones/mobile-phones/htc-one-m7-1131862/review",
    "Desire": "https://www.techradar.com/reviews/phones/mobile-phones/htc-desire-679515/review",
    "HTC U11": "https://www.techradar.com/reviews/htc-u11-review",
    "HTC Vive": "https://www.techradar.com/reviews/wearables/htc-vive-1286775/review",
    "Realme 3 Pro": "https://www.techradar.com/reviews/realme-3-pro-review",
    "Honor 10 Lite": "https://www.techradar.com/reviews/honor-10-lite-review",
    "Moto G7 Power": "https://www.techradar.com/reviews/moto-g7-power-review",
    "Honor 20 Lite": "https://www.techradar.com/reviews/honor-20-lite-review"
  }
}