{
  "source": "https://www.techradar.com/reviews/avg-antivirus-free",
  "title": "AVG AntiVirus Free review",
  "category": "computing",
  "updated": "2019-02-14T10:10:43Z",
  "author": "mike-williams",
  "summary": "Customize your security with this ultra-configurable antivirus",
  "verdict": "AVG is accurate and highly customizable – but stable-mate Avast Free is even better.",
  "pros": [
    "Highly configurable",
    "Above-average detection rates",
    "No-strings free"
  ],
  "cons": [
    "Pointless performance scan",
    "Avast has same engine but more features"
  ],
  "article": [
    "AVG AntiVirus Free is a popular antivirus tool from the now Avast-owned AVG Technologies.",
    "The package includes all the features you'd expect – an antivirus engine, real-time download and email scanning, web filtering to block malicious links – and doesn't have any ads, restrictions or significant limitations designed to force you to upgrade.",
    "AVG products now use the same technologies as Avast, but they have their own mix of features, and very different interfaces. Avast Free has more extras than Avast, but the varying look and feel means you might want to check out both.",
    "If the free build isn't enough, AVG Internet Security extends the feature set with a firewall, webcam protection, secure DNS to avoid fake websites, folder access control to thwart ransomware, and a welcome bonus in AntiVirus Pro for Android.",
    "This looks expensive to us at $79.99 for a year, even though it supports unlimited devices – a one-year, 10 device license for Bitdefender Internet Security 2018 is similar at $89.99, and a three-year license works out cheaper than AVG at $199.99.",
    "AVG AntiVirus Free is easy to find any download from the website, and you'll be getting started with the product in a very few seconds.",
    "A neat Customize Installation option gives an unusual level of control, with the ability to disable behavioral monitoring, web filtering, real-time file checking and more. It's the same approach as used by Avast Free Antivirus, although AVG doesn't have nearly as many extras (it's missing the Rescue Disk, Software Updater, Password Manager and Security browser extension.)",
    "AVG borrows another smart Avast feature in its Passive Mode. If the installer detects another antivirus during setup, it doesn't demand you remove that tool, instead installing AVG with real-time protection turned off. This significantly reduces the chance of any conflicts, while still allowing you to use AVG for on-demand scans. And if you're sure the programs will run together, or you're willing to take the risk, you can tell AVG to turn off Passive Mode in a couple of clicks.",
    "There's another big installation plus in the lack of any need to register the program. You can sign up to create a My AVG account if you like, and it could help you monitor several AVG-equipped devices from one place, but that's not compulsory and you're able to use the program without providing any personal details.",
    "Setup is very straightforward, then, and the program doesn't even demand that you reboot your system. It just pops up the AVG AntiVirus Free interface and you're able to explore its features immediately.",
    "AVG AntiVirus Free opens with a straightforward console highlighting the areas it protects (Computer, Web & Email) and the modules not included in the free edition (Hacker Attacks, Privacy and Payments.)",
    "One click on the Scan Computer button tells the program to check your system, or you can choose from six scan types. Computer Scan is the equivalent of a regular quick scan, and Deep Scan is a full system scan. USB/DVD Scan checks your removable drives, and there are scans to check specific folders, to schedule a scan to run at boot time, and to check your PC for performance issues.",
    "The Schedule Scan option looks like it's going to be just another way to automate a quick or full system scan, but that's just the start. You can also use the feature to create multiple custom scans which do almost anything you want.",
    "You can have the scan check running processes, for instance. It can examine specific files, folders and drives. You can even set up a scan which prompts you to choose a target at run time. You're able to define the files to be scanned, archive types you'd like to be checked, performance optimizations to be applied, the actions to perform on any threats, and how to handle reporting.",
    "Despite this feature being called Schedule Scan, you don't have to set up your custom scan to run automatically. Create something to, say, scan your Downloads folder and unpack any archives, and it will be listed under the other scan types. You can add other custom scans in the same way and run them on-demand. Experienced users who like to fine-tune their security will love the control this gives them.",
    "If you're happy with the standard Computer Scan, it delivers reasonable protection at very high speed. The initial scan may take several minutes, depending on your system and the files to be checked, but we found subsequent checks were usually complete in 15-30 seconds.",
    "A final report highlights any discovered malware, as well as checking browser add-ons, a welcome extra touch.",
    "Unlike Avast, AVG AntiVirus Free doesn't use a browser extension as a first line of internet defense, which means dangerous URLs aren't highlighted in your search results. The core antivirus engine still detects and blocks web threats, though, and will also scan any downloads you make, so you're still well protected.",
    "A Performance check highlights the amount of junk files on your PC, any broken Registry keys, startup programs which might be extending your boot time, and any 'PC health problems'. There's no check for missing software updates, unfortunately, and our report had a significant error, warning that our PC was 'vulnerable to unwanted changes' because User Account Control was turned off (in reality, it was on and set to the highest level of protection).",
    "That's a significant issue, especially as the performance report is really just advertising. The free version can tell you about these 'problems', but you can only resolve them by installing a trial of AVG PC TuneUp – if you buy that, it'll cost you a chunky $49.99 a year.",
    "There's a small bonus feature in AVG's File Shredder, a simple tool which securely deletes files or folders to ensure confidential data can't be recovered. It's useful, and there's no harm in having it available – as long as you don't accidentally shred something important, anyway – but AVG's version is basic, and there are far more capable freeware shredders available.",
    "Elsewhere, AVG's Game Mode has now become Do Not Disturb Mode. Turn it on and whenever you're running a full-screen application, the package will now hide notifications from Windows and other apps, as well as its own.",
    "AVG's final highlight is its Settings dialog, which gives vast control over almost every area of how the program works. Choose the File System Shield, for instance, and you can define what the program does when you open, write or execute a file, when removable media is connected to your system, the files to scan or exclude, the actions to perform when a threat is found, any report file to generate, and more.",
    "How many of these settings you'll use is open to question, but we still applaud AVG's effort in giving you this level of customization. If nothing else, it allows you to see exactly how the program behaves, and a little fine-tuning could enable optimizing your setup for performance or security.",
    "AVG and Avast now use the same engine which combines the best of both companies' antivirus technologies, and although independent testing doesn't always give consistent results, the products generally perform very well.",
    "AV-Test's December 2018 Home User report finds AVG and Avast blocking 100% of test threats and raising fewer false alarms than most. Can't do much better than that.",
    "AV-Comparatives Real-World Protection report summary for July-November 2018 placed AVG as equal fifth place in a field of 21. That's a very acceptable performance, and only Bitdefender, F-Secure, Trend Micro and Avira did better.",
    "SE-Labs December 2018 consumer testing report uses a very different scoring system of its own, and placed AVG AntiVirus Free at a disappointing tenth out of fourteen.",
    "AVG may not quite offer market-leading performance, then, but in our experience it's more accurate and reliable than most of the competition, and leaves even some high-priced commercial products trailing in its digital wake.",
    "An accurate antivirus and strong all-round performer. This is a smart choice for AVG fans, though Avast Free could be better for everyone else – it offers the same core protection and even more features."
  ],
  "headers": {
    "5": "Setup",
    "10": "Features",
    "24": "Protection",
    "29": "Final verdict"
  },
  "links": {
    "AVG AntiVirus Free": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-6585359720738209000/https://www.avg.com/en-gb/free-antivirus-download",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "AV-Test's December 2018 Home User report": "https://www.av-test.org/en/antivirus/home-windows",
    "AV-Comparatives Real-World Protection report": "https://www.av-comparatives.org/comparison"
  }
}