{
  "source": "https://www.techradar.com/reviews/acer-predator-galea-500",
  "title": "Acer Predator Galea 500 review",
  "category": "computing",
  "updated": "2019-03-28T18:52:50Z",
  "author": "bill-thomas",
  "summary": "Preying on your wallet",
  "verdict": "The Acer Predator Galea 500 is simply too expensive for its own good. This gaming headset is good enough for gaming audio, but falls short everywhere else. Unless all you do is play games, you might want to look elsewhere.",
  "pros": [
    "Extremely comfortable",
    "3D audio is great for gaming"
  ],
  "cons": [
    "Expensive",
    "Remote is easy to accidentally bump",
    "Poor sound performance in music and films"
  ],
  "article": [
    "The Acer Predator Galea 500 is an odd gaming headset: while the sound quality is decent and it’s built well, it has a very loose fit and a high asking price. Depending on who you ask, these two factors could be a deal breaker, but with the unique 3D sound and attractive aesthetics, things get complicated.",
    "In our mind, the best PC gaming headsets are going to be the ones that manage to hit a golden balance between price and performance. While the Acer Predator Galea 500 does perform well, its $299 (£249, about AU$420) price tag throws things off balance.",
    "At this lofty price point, the Galea 500 has some pretty rough competition, like the sublime $299 (£299, AU$480) Astro A50 and the $329 (£299, AU$459) SteelSeries Arctis Pro Wireless. Both of these headsets are wireless, which the Galea 500 isn’t, and offer sublime audio quality that far exceeds what the Galea 500 can do.",
    "This means that the Acer Predator Galea 500 is a decent headset that is way more expensive than it needs to be. So, this headset is hard to recommend unless you can find it on sale, or you’re just a huge fan of the Acer Predator aesthetic.",
    "We would be lying if we said the Acer Predator Galea 500 wasn’t an attractive headset. But, again, in its price range, this headset doesn’t look as premium as it should — especially given the shortcomings elsewhere in the device. It has an all-black metal design, with a faux-leather strap beneath the metal band that connects the cans. The earpads are made of the same material, and it makes for a soft, comfortable headset that you’ll forget is even there.",
    "The elastic nature of the headband does make it a very loose fit, however, so if you prefer tighter headsets like we do, you may not be a fan. What we are fans of, though, is the illuminated Predator logo on each side of the headset. It’s not RGB, but the teal color contributes to the aesthetic successfully, and we wouldn’t change it even if we could.",
    "Now, at this price point, we’d expect this headset to be wireless, which it isn’t. Instead, it uses USB via a braided nylon cable that feels as durable as it is premium. In the middle of the cable, though, is a controller with huge blue button right in the middle of it that switches between the Waves Nx 3D audio setting and three equalizer settings — for movies, sports and music. We’ll go more in depth about these settings here in a bit, but let’s talk about that giant blue button.",
    "As a general rule, having huge buttons that are easy to bump while playing games or just moving your arms are a bad idea. There are so many times that we are playing games only to have the audio setting suddenly change. It doesn’t completely break the sound, but it sure is enough to distract us from our game.",
    "Just like everything else about it, the design of the Acer Predator Galea 500 is fine. It does its job, and looks good enough, but we expect more from a headset that costs 300 bucks.",
    "The Acer Predator Galea 500 has this super unique 3D audio mode that will shift the sound as you move your head. Turn your head to the right, and the sound that was ahead of you is now played primarily in your left ear. This works brilliantly, and is easily the highlight feature of the entire headset. We used it to play Assassin’s Creed Odyssey for an amount of time we don’t feel comfortable revealing, and the world just came alive — the light fit of the headset combined with this awesome 3D audio setting made us forget we were even wearing a headset.",
    "If you do decide to pick up this headset, there’s a small button on the bottom left hand side of the controller that will calibrate it – do that immediately, because you’re not going to want to play games without this feature turned on, it’s just that good.",
    "However, problems start to appear when you’re doing anything other than gaming.",
    "Ordinarily, we wouldn’t exactly expect a gaming headset to be great for movies or music, but – and we hate to keep coming back to this point – the Acer Predator Galea 500 is $300. We used this headset to listen to a bit of music while working and, man, it did not fare well.",
    "Like so many people, we’ve been obsessing over Lil Wayne’s Tha Carter V over the last few weeks (we waited five years; well worth it) and it just sounded flat. The heavy bass and the high pitched chimes in “Uproar” managed to blend into each other. We honestly had a better music experience with our MacBook Pro’s built-in speakers.",
    "So, if all you’re going to do is play games, then this headset’s performance is going to blow you away. However, if you plan on doing literally anything else with it, you’re going to have a better experience with a headset that costs a fraction of what the Galea 500 does.",
    "The Acer Predator Galea 500 simply costs way more than it needs to. It has one landmark feature in its amazing Waves Nx 3D audio setting, but that one feature doesn’t justify the astronomical price of this headset. We understand that it’s a gaming headset, and there’s going to be a subset of users that think that gaming performance is all that matters. And, for those people, the Acer Predator Galea 500 might be worth the money.",
    "For everyone else, though, we’d advise getting a gaming headset that sounds just as good or better for a third of the price (or is at least wireless for the same price), and buying some of the best PC games with the money they save.",
    "Image Credits: TechRadar"
  ],
  "headers": {
    "4": "Design",
    "9": "Performance",
    "15": "Final verdict"
  },
  "links": {
    "best PC gaming headsets": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675",
    "Astro A50": "https://www.techradar.com/reviews/gaming/gaming-accessories/astro-a50-gaming-headset-review-1083794/review",
    "SteelSeries Arctis Pro Wireless": "https://www.techradar.com/reviews/steelseries-arctis-pro-wireless-headset",
    "Assassin’s Creed Odyssey": "https://www.techradar.com/news/assassins-creed-odyssey-review",
    "best PC games": "https://www.techradar.com/news/best-pc-games"
  }
}