{
  "source": "https://www.techradar.com/reviews/alcatel-1x-2019-review",
  "title": "Alcatel 1X (2019) review",
  "category": "phones",
  "updated": "2019-06-11T14:23:15Z",
  "author": "jon-mundy",
  "summary": "Here's what saving money on your smartphone can cost you",
  "verdict": "If you’re looking for an all-round accomplished smartphone for $120/£100, we’re tempted to say that it doesn’t exist (yet). At the very least, the Alcatel 1X isn’t that phone, thanks to terrible performance and a substandard camera.",
  "pros": [
    "Decent 5.5-inch display",
    "Solid but light build",
    "Android skin not too flabby"
  ],
  "cons": [
    "Terrible performance",
    "Poor camera",
    "Old version of Android"
  ],
  "article": [
    "With the Alcatel 1X (2019), the Nokia-owned brand (yes, really) has returned with another low-priced Android smartphone.",
    "As the name suggests, it’s far from a radical makeover - sharing the same moniker as the 2018 model of the phone - but there are a couple of notable quality-of-life improvements.",
    "A much better display and a more nuanced camera make this simple, solid phone a safer bet than the original Alcatel 1X.",
    "Unfortunately, the guts of this supremely cheap smartphone remain the same, leading to the kind of hamstrung performance that demonstrates the difference between 'cheap' and 'good value'.",
    "The Alcatel 1X price is $120/£100 (around AU$180), making it an extremely affordable option for those on the tightest of budgets, but still in need of an Android-powered handset.",
    "For an awful long time now the Moto G series has ruled the budget smartphone roost. But it’s questionable whether a phone that costs $299/£239/AU$399 (as the Moto G7 does) can still be considered ‘budget’.",
    "The Alcatel 1X’s pricing, then, is inarguably its defining feature. You’re getting a largely functional smartphone experience for less than half the price of the current entry-level king. But it has lost one of the previous model’s primary talking points.",
    "After debuting on the original Alcatel 1X, Android Go is nowhere to be seen here. The Alcatel 1X (2019) ditches Google’s lightweight OS, so you don’t get the same stock version of Android, nor any of the optimized Android Go app versions.",
    "The latter are freely downloadable from the Google Play Store, but given how much the phone struggles with general performance it’s a shame they weren’t pre-installed.",
    "On the plus side, this year’s Alcatel 1X has gained a dual-lens camera. That’s something we’re now used to seeing at most price points, but not necessarily the $120/£100 one.",
    "The 2MP secondary lens serves up depth information to the 13MP main camera, so it’s not there for zoomed-in or wide-angle shots. Rather, it enables you to take portrait shots with exaggerated bokeh effects, which can then be adjusted after the fact.",
    "The Alcatel 1X design is just about as good as you could hope for in such a cheap phone. It’s solid, unassuming, extremely light (just 130g), and it doesn’t flex or creak too much when you give it a squeeze.",
    "It’s an all-plastic affair with a grippy ‘pebble paint’ finish to the rear cover, which also wraps around the bottom half of the edges.",
    "We didn’t find this particularly appealing from a visual standpoint, nor is it quite as resilient to smudges and marks as was seemingly intended. But it did make the phone a doddle to wield on a sweaty spring day.",
    "Our test model misses out on a fingerprint scanner, which is a pretty major omission in this day and age. Having to tap in a four-digit code (plus the maddening need for an ‘accept’ button) feels like an affront to usability, regardless of that price tag.",
    "Alcatel has included its own facial recognition system in Face Key, which works pretty reliably. However, it’s nowhere near as secure as fuller implementations like Apple’s Face ID, nor is it as watertight as fingerprint authentication. It also takes a good second to register your face, despite its low-tech nature.",
    "Flip the Alcatel 1X (2019) over, and the screen has filled out to fill most of the front. This is no bezel-less wonder, but an 83% screen-to-body ratio is nothing to be sniffed at, and the phone’s forehead and chin are far from imposing.",
    "We’re looking at a surprisingly decent screen too. While its 720 x 1440 HD+ resolution (essentially 720p with a longer 18:9 aspect ratio) is definitely below what we’re accustomed to these days, we didn’t pick up on any egregious pixelation. 5.5 inches feels just big enough, too.",
    "Indeed, the picture quality in general is commendably on point. It’s an IPS LCD that gets plenty bright enough, and the colors are suitably crisp and balanced. You don’t get the impression that there’s a huge air gap between the layers of the display, as used to be the case with cheap phones of this kind."
  ],
  "headers": {
    "4": "Alcatel 1x price",
    "5": "No Go",
    "11": "Design and display"
  },
  "links": {
    "the 2018 model": "https://www.techradar.com/reviews/alcatel-1x",
    "Moto G7": "https://www.techradar.com/reviews/moto-g7-review"
  }
}