{
  "source": "https://www.techradar.com/reviews/nubia-red-magic-mars",
  "title": "Hands on: Nubia Red Magic Mars review",
  "category": "phones",
  "updated": "2019-01-10T23:55:38Z",
  "author": "david-lumb",
  "summary": "Gaming features on a budget",
  "verdict": "A powerful (but untested) budget gaming phone with a few tricks up its sleeve.",
  "pros": [
    "Neat gaming features: performance mode, shoulder buttons",
    "Powerful specs for a low cost"
  ],
  "cons": [
    "Last year's processor",
    "Uncertain gaming performance"
  ],
  "article": [
    "Nubia debuted its Red Magic gaming phone last year in China and, at CES 2019, the company announced that an upgraded version, the Red Magic Mars, will soon come to the US. Its impressive specs and $399 (£313/AU$555) starting price could win over mobile gamers in America when it launches in Q1 2019, though it's unclear when Nubia's phone will be coming elsewhere.",
    "Following the April 2018 launch in China, Nubia released the Red Magic phone in Europe after IFA and then in India in December 2018. Which makes sense, given how big mobile gaming is in those regions – but given how it's ramping up in the US, the Red Magic Mars could be a frontrunner for best budget gaming handset for Americans who can’t afford the top-tier Razer Phone 2 or Asus ROG Phone.",
    "Affordability aside, the Red Magic Mars is still competitive with the big gaming phone boys, given its high specs for a midrange phone. For the new US version, Nubia swapped out the Snapdragon 835 for the newer 845, though that puts the phone behind every device packing the new Snapdragon 855.",
    "Even so, the phone is a bargain – but we can’t vouch for its quality as a gaming device: Nubia hadn’t installed any games beyond PlayerUnknown’s Battlegrounds, which the floor associates couldn’t manage to sign into (the game requires you to sign into an account). Pity.",
    "The Red Mars Magic – which looks virtually unchanged from the Red Magic, aside from the new shoulder buttons (more on that later) – is unquestionably designed to appeal to gamers, with an anodized aluminum body chiseled into a slightly raised trapezoid.",
    "In other words, it’s in line with the ‘geometric’ style seen in gamer-appealing devices. But Nubia’s phone is a bit more restrained, looking less asymmetrically jagged than the Asus ROG Phone (which our reviewer described as looking like a Decepticon) and more like a mature device that won't be as embarrassing to pull out in public.",
    "Trade show floor models came in a dark red with black trim and black with bright red trim, though there’s also a dark gray 'urban camouflage'-looking model. The metal casing has a matte finish that offers some grip, but it’s the raised 'tent' geometry that will likely help most with holding the Red Magic Mars during intense gaming sessions. Your fingers rest comfortably on either side of the phone’s spinal ridge when holding it sideways.",
    "That’s the way you’d be handling the phone anyway when playing games like PUBG or Fortnite, but one of the Red Magic Mars’ signature features is a physical switch at the top edge of one side that activates the phone’s gaming mode (called “Red Magic Game Space”) which automatically flips the screen to landscape and brings up a rotating carousel of installed games, while also minimizing notifications and boosting performance.",
    "It’s nifty, if a bit gimmicky, but the physical switch is solid (much like the toggle on the side of the OnePlus 6T) and out of the way, so you’ll never accidentally flip it on.",
    "Switch on the gaming mode, turn the phone sideways, and you’ll find the Red Magic Mars’ other play-enabling feature: two touch-sensitive pads on the corners that act as shoulder buttons. They seem much like the shoulder buttons on the Asus ROG Phone, so we’ll have to see how they compare when we fully review the Red Magic Mars.",
    "These are remappable to whichever in-game functions you desire, a Nubia representative told TechRadar, but since we didn’t get a chance to play any games, we can’t vouch for their responsiveness.",
    "In theory, these are great features that free up screen space and make action a bit more fluid: for example, by reconfiguring the buttons to ‘jump’ and ‘fire’ functions in a shooting game, you can move and attack without taking your thumbs off the directional controls. They’re spaced far enough apart that you won’t hit the volume or lock buttons in between the shoulder pads.",
    "No gamer phone would be complete without some RGB styling, of course. Given its more restrained design, the Red Magic Mars’ light-up feature is a strip along the casing’s spine, just below the fingerprint sensor. You can pick colors and customize how they appear – flowing, flashing, colliding, and so on.",
    "The Red Magic Mars comes in three tiers with escalating RAM and storage: an ‘Essential’ model with 6GB of RAM and 64GB storage (starting at $399; that's about £313/AU$555), ‘Superior’ with 8GB RAM and 128GB of space (US price undisclosed) and finally a limited-edition ‘Conquerer’ version with a whopping 10GB of RAM and 256GB of storage (coming soon, US price undisclosed).",
    "Given the still-speedy Snapdragon 845 processor, these specs are a real bargain, putting the Red Magic Mars in the same power-at-a-discount category as the OnePlus 6T.",
    "And if you needed another reason to pick Nubia’s phone over the latest OnePlus, the Red Magic Mars has its own complex cooling system. The phone has a copper cooling tube (conceptually similar to the one in the Razer Phone 2 and Asus ROG Phone) that redirects heat from the CPU and GPU, plus cooling ports, layers of graphene and the phone’s 'tent' design to improve \"air convection\" according to Nubia’s press release.",
    "The rest of the specs are pretty standard for a midrange phone, which presumably haven’t changed from the Red Magic sold in China and India (aside from bumping up to the Snapdragon 845).",
    "The press release didn’t include exact specs, but the US version of the Red Magic will come with Android 9.1 Pie, according to Android Authority. It’s unclear if the US release will also be dual-sim and dual-standby (4G + 4G) like the Red Magic.",
    "The display is a sharp FHD+ (2160 x 1080), while the lithium-polymer battery is a respectable 3,800mAh, though we’ll have to wait for our full review to see how quickly it drains during intense gaming sessions. The phone has a rear 16MP f/1.8 main camera and 8MP f/2.0 front lens.",
    "The handset packs DTS 7.1 channel sound and a dedicated DAC, along with a headphone jack awkwardly placed on the top. The Red Magic Mars also has ‘4D’ haptic vibration that can be turned off, if you wish.",
    "Given that Nubia’s Red Magic debuted the better part of a year ago, the slightly-upgraded Red Magic Mars no longer qualifies as the hottest gaming device on the mobile market: in the interim, Razer and Asus both introduced powerful phones with advanced gaming performance features and accessories.",
    "But both of those are on the premium end of the phone spectrum, and the Red Magic Mars will come in at half (or more) the price of those devices. Its own unique game-enhancing features are pretty neat, at least in theory.",
    "It’s hard to gauge a gaming phone that we haven’t gotten to, you know, play games on. But if you were looking for a gaming smartphone and don’t have near the budget to pick up a Razer Phone 2 or Asus ROG phone, this could be your ticket to playing on the go. Just don't expect quite as top-level performance as the latter two, especially with their 120hz and 90hz refresh rates (it's unclear, but unlikely, that the Red Magic Mars refreshes as quickly).",
    "The Nubia Red Magic Mars will start selling on Nubia's website in the US on January 31 2019, per Android Authority, and will allegedly go on sale in Europe on the same day at an undisclosed price. It's unclear when, or if, it's coming to other regions."
  ],
  "headers": {
    "4": "Gamer style, but a bit grown up",
    "13": "Good specs, though not the absolute best",
    "20": "Early verdict"
  },
  "links": {
    "debuted": "https://www.techradar.com/news/best-phone",
    "CES 2019": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "then in India": "https://www.techradar.com/news/nubias-red-magic-gaming-smartphone-to-launch-in-india-on-december-20",
    "Razer Phone 2": "https://www.techradar.com/reviews/razer-phone-2",
    "Asus ROG Phone": "https://www.techradar.com/reviews/asus-rog-phone-review",
    "OnePlus 6T": "https://www.techradar.com/reviews/oneplus-6t-review",
    "Android Authority": "https://www.androidauthority.com/nubia-red-magic-mars-global-availability-price-940321/"
  }
}