{
  "source": "https://www.techradar.com/reviews/avita-liber-14",
  "title": "Avita Liber 14 review",
  "category": "computing",
  "updated": "2019-09-06T11:41:56Z",
  "author": "jeremy-laird",
  "summary": "A colorful alternative to the usual laptop suspects",
  "verdict": "The Avita Liber 14 is a colourful alternative to the usual thin-and-light laptop suspects, but it’s not entirely compelling when it comes to performance or features.",
  "pros": [
    "Colorful design",
    "Friendly documentation",
    "Decent build quality"
  ],
  "cons": [
    "Middling battery life",
    "Moderate performance",
    "Not enough RAM"
  ],
  "article": [
    "Distracted by the sharp blue color of the Avita Liber 14-inch laptop? Don’t be. While it is very much a feature of this new line of portables, it’s also just one of 14 available colors. In other words, if you don’t like electric blue, you’ll almost certainly find something that suits.",
    "Still, the point of the jazzy colors is very much to turn your attention to a new player in the laptop market. ‘Colour up your life’ goes the official Avita tagline and it’s a welcome change from the usual dour, predictable and specification-led marketing.",
    "That said, there’s plenty of competition in the roughly £600/$700/AU$1,000 segment for this thin-and-light effort. Dell will do you an Inspiron 13 5000 for slightly less, for instance. HP offers an AMD-powered Envy x360 for similar money. Granted those are both 13-inch models. But the likes of the Acer Swift 3 14-inch is around the same price. Game on.",
    "At £530 (around $650, AU$1,000), the new Avita Liber finds itself in a very crowded and competitive market for thin-and-light laptops.",
    "Many buyers will need significant convincing to step away from the big, established brands in the shape of similarly priced alternatives like the aforementioned Dell Inspiron 13 5000, HP Envy X360 and Acer Swift 3, to name but a few.",
    "Indeed, with some seriously slick and powerful notebooks like the Huawei Matebook 13 available for just a little bit more, the new Avita Liber certainly has its work cut out. It’ll take more than a few snazzy colors to have an impact.",
    "US and Australian pricing has yet to emerge, but we expect it to be positioned similarly in those markets.",
    "Fourteen sparkly colorway options aside, there’s no doubting where the Avita Liber finds design inspiration. It’s very much an Apple MacBook informed laptop from the shape of the chassis, to the layout and look of the keyboard and the screen hinge and bezel. If Apple had made a 14-inch MacBook Air from the previous generation, it would have been an awful lot like this.",
    "In many regards, that’s a good thing. You get an all-alloy chassis for starters. OK, it’s a rung below the best PC laptops for absolute build quality, which are themselves a step behind Apple’s peerless chassis engineering. But it’s still a sturdy and robust feeling system.",
    "Arguably less welcome is the MacBook-esque screen bezel. With the current vogue for vanishingly slim bezels, the chunky borders around the Avita Liber’s 14-inch display look dated. Still, it’s an IPS-type panel with 1,000:1 contrast rating, so we have no quibble with the display itself.",
    "As for features, the specifications are reasonable, but with a few weak areas. At this price point in a thin-and-light laptop with an Intel CPU, the Core i3-8130U dual-core model is adequate. Where we’re slightly less convinced is the SSD and RAM. At just 128GB, the former is pretty stingy. What’s more, it runs on the slower SATA interface as opposed to being a speedy PCI-E drive. As for the 4GB of RAM, it’s simply not enough at virtually any price in 2019.",
    "In regards to the rest, there’s a large touchpad, which is very welcome, a claimed 10-hour battery life (ditto) and reasonable connectivity. The latter includes a pair of Type-A USB 3.0 ports, one USB Type-C, Mini-HDMI and a MicroSD card reader. A finger-print scanner allows for pain-free and password-free security.",
    "One final feature of note is the packaging and documentation. It’s nicely presented and welcoming, with easy, straight-forward instructions. As a purchase for anyone tech-averse, you could do a lot worse than the Avita Liber."
  ],
  "headers": {
    "3": "Price and availability",
    "7": "Design and features"
  },
  "links": {
    "Inspiron 13 5000": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-inspiron-15-5000-1297284/review",
    "Envy x360": "https://www.techradar.com/reviews/hp-envy-x360-13-2019",
    "Acer Swift 3": "https://www.techradar.com/reviews/acer-swift-3-2020",
    "Huawei Matebook 13": "https://www.techradar.com/reviews/huawei-matebook-13"
  }
}