{
  "source": "https://www.techradar.com/reviews/riva-concert-review",
  "title": "Riva Concert review",
  "category": "audio-visual",
  "updated": "2019-01-28T15:31:46Z",
  "author": "becky-roberts",
  "summary": "A Sonos challenger with greater ambition than execution",
  "verdict": "Despite its overwhelming likeness to Sonos’ most affordable smart speakers, the Riva Concert bravely stands out from the smart speaker crowd with a couple of unique selling points - vast connectivity, and portability via an optional built-in battery. But it fails to truly compete with similarly priced, class-leading rivals, such as the Sonos One, when it comes to sound quality - and that prevents it from gaining our wholehearted approval.",
  "pros": [
    "Reliable and intuitive Riva Voice app",
    "Vast connectivity",
    "Loud, very listenable sound"
  ],
  "cons": [
    "Lacks the sonic clarity and insight of class leaders",
    "No multi-room support yet",
    "Absent of some music streaming apps"
  ],
  "article": [
    "They say imitation is the sincerest form of flattery...in which case Sonos should be truly honored by the Riva Concert’s arrival. The smallest of Riva Audio’s two Alexa-enabled WiFi speakers, the Concert bears more than a passing resemblance to the Sonos Play:1 with its cylindrical build, wraparound aluminum mesh top, tailed by a black strip, and top-panel control buttons. Universal aesthetic appeal: check.",
    "The likeness is about as subtle as Shaggy and Scooby, but you’d quickly ring a few disparities in a Spot The Difference. Firstly, the Concert is slightly larger in every dimension – taller (at 7 inches), wider and deeper (both at nearly 5 inches) – although we’re talking mere millimeters difference.",
    "The prominent buttons are more akin to those you’d spy on an Amazon Echo smart speaker, complete with the iconic blue light ring that illuminates to show source selection. Plus, the Riva logo (which lights up during Alexa commands) is proudly brandished on the front.",
    "But actually, the newer Sonos One speaker is generally the more apt comparison – what with the Concert’s Amazon Alexa voice assistant support and the same $199 / £199 price tag hung around its neck (that works out at around AU$365, but it doesn't look like the Concert's available in Australia just yet.)",
    "The question is, can the Riva Concert further that analogy by matching its rival for class-leading features and performance?",
    "Things get off to a strong start. Power up the Concert, and once you’ve downloaded and opened the Riva Voice app (free from the Apple App Store or Google Play Store), the in-app set-up instructions are intuitive and grandparent-proof. The whole process is only as long as it takes to make a brew.",
    "From there, you have a choice of music sources. Streaming services span Spotify, Amazon Music Unlimited and TuneIn Radio, with Airplay, as well as DLNA for streaming networked files (up to 24-bit/192kHz) stored on a media server, also available over WiFi.",
    "Internet down? Then you have 3.5mm and USB (the latter is also a charging port) inputs in addition to Bluetooth. So while you miss out on the built-in access to other streaming services such as Apple Music, Tidal and Deezer, the Riva can at least play their catalogues via Bluetooth.",
    "Offline connectivity also justifies the existence of Riva’s optional Arena battery pack, which offers 15 hours playback on the fly – plenty of juice for even the most hardcore summertime picnic-er.",
    "The Riva app is more functional than fancy – scrolling through media server libraries is in list form, which can be fairly wearisome when they are thousands of songs strong. But credit to Riva, and to borrow a Steve Jobs adage, “it just works”.",
    "We can only hope that bringing extra Riva speakers into a multi-room mix won’t spoil app stability, however at this time multi-room functionality (that is, the ability to group and simultaneously control multiple Riva speakers around a household) is on the Concert’s ‘coming soon’ list.",
    "Present and correct at this time is Amazon Alexa voice control, which, for the uninitiated, allows users to control music playback and ask questions from their Riva hands-free with just the sound of their voice.",
    "You can, for example, demand that a specific song, artist, album, radio channel or playlist be played, or that volume level be changed to a figure between one and ten. You can ask for weather, calendar and local information, set an alarm, control other Alexa-enabled home devices or simply save yourself a Google search. What’s the distance between London, UK and Sydney, Australia? “10,600 miles as the crow flies,” apparently. Take note, though: Alexa calling and messaging is not currently supported on the Riva Concert.",
    "Riva has clearly built adequately sensitive microphones into the Concert, as even across a room, and even during music playback at mid-to-high volume levels, you don’t have to raise your voice to be heard and obeyed.",
    "There’s a privacy button to mute the speaker’s microphones so there’s no risk of Alexa interrupting, and even more handy is the ability to change the volume of Alexa independently of your music’s volume in the app settings. Because let’s face it, Alexa can be annoying.",
    "By and large, the Concert’s user experience receives the same acknowledgement as a lucky losing Gladiator: a thumbs-up approval. They move towards a middling position when it comes to sound quality, mind you.",
    "The Concert’s three ADX drivers and three passive radiators (one each on the speaker’s front and both sides) chuck out a room-filling sound that belies the speaker’s compact size and modest-on-paper 50-watt output. Whether we stream directly from Spotify, or play BBC Radio 2 over AirPlay, or Tidal over Bluetooth, the Concert’s rendition of whatever is thrown at it is very listenable. Musical, even.",
    "There’s a likable warmth and tonal balance to the Riva’s presentation, and as we tune into Spoon’s 'Inside Out' we’re pleased with the bass heft on offer.",
    "But compared to the forerunning Sonos One, it’s performance is lacking. We play Patrick Wolf’s 'The Magic Position' on both speakers and the opening guitar strums and violin scrapes are much more tangible through the Sonos. There’s a greater sense of space between instruments and more detail goes hand in hand with greater dynamic insight.",
    "Over to 'The Optimist' by Anna von Hausswolff, and the Riva’s rendition lacks the dynamic variation in the piano-playing, as well as the transparency to uncover the subtle inflections of her haunting vocal, to really pull you in.",
    "The Sonos is much clearer, too, making the Concert sound comparably compressed, like it’s been sat on. That’s only made worse by selecting the ‘power’ mode in the app, so we’d keep it on its default setting, ‘Trillium’ – Riva’s patented technology that works to upmix a song’s stereo signal and outputs it through three channels to virtually create a bigger soundstage.",
    "It’s an easy technology to praise considering the sizable sound kicked out by the Riva, but ultimately the world is well furnished with better-sounding smart speakers.",
    "The Riva Concert has immediate appeal thanks to its well thought-out design, vast connectivity and positive user experience.",
    "But unless you’re particularly keen on physical connections and/or the Concert’s portability option, we can’t recommend that it take the top spot on your smart speaker shopping list due to its uncompetitive sound quality at its price. And because of that, our thumbs are still horizontal."
  ],
  "headers": {
    "5": "Design and features",
    "9": "Usability",
    "16": "Sound quality",
    "22": "Final verdict"
  },
  "links": {
    "Sonos Play:1": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/sonos-play1-1189345/review",
    "Amazon Echo": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "Deezer": "https://www.techradar.com/reviews/deezer",
    "Arena battery pack": "https://rivaaudio.com/arena-battery/"
  }
}