{
  "source": "https://www.techradar.com/reviews/chuwi-lapbook-plus-laptop",
  "title": "Chuwi LapBook Plus laptop review",
  "category": "computing",
  "updated": "2019-07-28T17:52:39Z",
  "author": "desire-athow",
  "summary": "An “ironic” laptop",
  "verdict": "Buy the LapBook Plus if you need a large 4K display in an ultrathin form factor at a budget. However Chuwi made one big compromise when designing this laptop and depending on your priorities, it might be a make or break one.",
  "pros": [
    "Design",
    "Gorgeous 4K display",
    "Lightweight",
    "Low price"
  ],
  "cons": [
    "Proprietary power connector",
    "Poor performance",
    "Battery doesn’t charge beyond 91%"
  ],
  "article": [
    "Although Alanis Morissette penned Ironic almost 15 years ago, it is a fitting song for Chuwi’s latest laptop.",
    "The LapBook Plus is billed as a mobile 4K movie theater but is paired with a totally inadequate Intel Atom X7-E3950 processor - so we know it will end badly, we just don’t know by how much.",
    "So how does it fare in our tests?",
    "Chuwi engineers appear to have pulled out all the stops with the LapBook Plus, the company's fourth model after the LapBook SE, the LapBook Air and the LapBook 12.3.",
    "Its design reminds us of another Chuwi laptop, the Aerobook, which uses the same double sided aluminum-magnesium alloy metal with a space grey finish as well as chamfered corners and a brushed finish. In other words, it looks like the Apple MacBook Air albeit bigger.",
    "At 1.47kg, it is one of the lightest 15-inch laptops around, far below the Dell XPS 15 9570 laptop - in fact, only the LG Gram 15, with its sub-1kg weight, beats it (although that comes at a hefty price). Chuwi also chose to add a numeric keypad rather than eliminate it completely. There’s no perceptible flex either to the keyboard or to the display.",
    "Like the MacBook Pro, the screen connects to the base via a single hinge, and it comes with a large touchpad, one of the largest we’ve seen to date. The 15.6-inch display may not covered with glass (like the Aerobook), but does have a bezel as thin as 8mm.",
    "There’s a micro HDMI port, a USB 3.0 Type-A connector and a proprietary power connector on the left with another USB 2.0 port, an audio connector and a microSD card slot on the right - although unfortunately there's no USB Type-C connector.",
    "Chuwi’s jewel in the crown is its 4K IPS display, boasting a 100 percent sRGB color gamut and 300-nit brightness. This is where the biggest chunk of the bill of materials (BOM) probably ended up and rather than just spend most of the money on the processor and team it with 4GB of RAM and 64GB eMMC, Chuwi did the opposite and bundled 8GB of LPDDR4 memory with a 256GB M2.SSD; there’s a free M2 slot should you want to add another storage device.",
    "The CPU that Chuwi ended up pairing with the 4K display is an Intel Atom X7-E3950 which is equipped with an Intel HD Graphics 505 GPU that can handle 4K and has 18 EU cores. This is a three-year old CPU, part of the Apollo Lake family, with four cores, four threads and a base frequency of 1.6GHz.",
    "Worth noting that this is an embedded part which means that it has been designed to be used as a fanless, passively cooled processor and its TDP (12W) points to that.",
    "The rest of the spec sheet includes a 36.5Whr battery, Intel Wireless-AC 3160 Wi-Fi and a 2-megapixel webcam and a pair of speakers.",
    "It requires pure graphical grunt to power more than eight million pixels, that the amount of picture elements on the LapBook Plus’ display and that’s four times what you’d find on a full HD display. Sadly, the graphics subsystem on the E3950 is woefully inadequate for the task. Yes, it ticks the “can power 4K at 60Hz” box but that’s the same as saying you can use a bucket to fill an Olympic pool.",
    "The keyboard is more than adequate; it is a backlit model and comes with large, well proportioned key caps and generous key pitch (the distance between the centers of two adjacent keys) and a decent amount of travel. We would have liked a bigger gap between the numeric keypad island and the other keys.",
    "The touchpad is one of the largest we’ve seen to date and is, ironically, too big perhaps as it requires wider wrist motion to cover the entire surface, which can be uncomfortable at times. It doesn’t have any physical buttons but it was sensitive enough to be used almost effortlessly.",
    "Battery life was adequate - at 3h30min - given the battery capacity and the need to power a 4K monitor. However the battery level never reached 100 percent charge for some reason, staying stuck at 91 percent, and Wi-Fi performance was slightly iffy initially but settled down during the testing period.",
    "You won’t find a laptop with a 4K display in the price range of the LapBook Plus; arguably, that’s one of the two reasons you’d even consider Chuwi’s latest model. The other being the fact that it is one of the lightest laptops with this form factor.",
    "The LapBook Plus we were sent can be bought from Gearbest for $440. However while this price includes delivery, it is exclusive of any taxes that may be levied by the relevant authorities or the courier companies on behalf of the vendor.",
    "You will have to spend more than twice the outlay ($900) to grab a new Dell XPS 13 (9370) laptop with a 4K display albeit in a smaller 13.3-inch form factor. That ultrabook is in another category altogether with a quad-core Intel Core i5 processor with 8GB of memory and touchscreen capabilities.",
    "Want a 15-inch screen laptop on a budget but don’t want 4K? Then consider the ASUS VivoBook F510QA ($469 at Newegg). It is powered by an AMD A12-9720P APU which should be about as powerful as the Atom CPU in the LapBook. You get twice the system memory plus an additional 1TB hard disk drive as well as 256GB SSD.",
    "If you prioritise performance, then the Lenovo IdeaPad 330s ($500 at Newegg) swaps the 4K display for an AMD Ryzen 5 2500U. That processor should be at least twice faster than the X7-E3950 CPU with a far faster GPU. It also comes with a Type-C connector as well.",
    "Want something even cheaper? At $300, the Aiwo I6 from Gearbest sports a full HD display, a more powerful Intel J3455 processor, 8GB of RAM and a 256GB SSD. If you want to splurge and stay within budget then opt for the $350 Aiwo I8 which swaps the J3455 for an Intel Core i3-5005U. Old but still powerful.",
    "The Chuwi LapBook Plus is an unbalanced system - the laptop equivalent of a supercar fitted with a one litre engine. Swapping the CPU for something beefier would be the obvious solution until you look at Intel’s price list. The cheapest Intel Core processor, the Core i3, costs $281 which is more than 5X what the E3950 costs. That problem is further compounded by the ongoing CPU shortage.",
    "That said, the rest of the components of the LapBook Plus are not that bad. 8GB of RAM coupled with 256GB SSD (which can be augmented via another free M2 slot) is on part with what we’d expect from a mainstream laptop. Battery life is below par as expected given the 8.3 million pixels that need to be managed.",
    "The next version should either have a better processor (and smash the suggested retail price) or cut down elsewhere (memory, storage) if it wants to keep the 4K display with the same SRP of $499."
  ],
  "headers": {
    "3": "Design",
    "8": "Hardware",
    "12": "In use and performance",
    "16": "The competition",
    "22": "Verdict"
  },
  "links": {
    "LapBook Plus": "https://www.chuwi.com/product/buy/Chuwi-LapBook-Plus.html",
    "LapBook SE": "https://www.techradar.com/reviews/chuwi-lapbook-se",
    "LapBook Air": "https://www.techradar.com/reviews/chuwi-lapbook-air",
    "LapBook 12.3": "https://www.techradar.com/reviews/chuwi-lapbook-123",
    "Aerobook": "https://www.techradar.com/reviews/chuwi-aerobook-laptop",
    "Apple MacBook Air": "https://www.techradar.com/reviews/macbook-air-review",
    "Dell XPS 15 9570": "https://www.techradar.com/reviews/dell-xps-15-2019",
    "LG Gram 15": "https://www.techradar.com/reviews/lg-gram-15-2018",
    "Dell XPS 13 (9370)": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-9528861843067710000&murl=https%3A%2F%2Fwww.newegg.com%2Fsilver-dell-xps-13-9370-everyday-value%2Fp%2F1TS-000A-02ZK9",
    "ASUS VivoBook F510QA": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-8191658246135868000&murl=https%3A%2F%2Fwww.newegg.com%2Fp%2F1TS-001A-00PY0%3FItem%3D9SIAEYA9RR8540",
    "Lenovo IdeaPad 330s": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-1143672107107897300&murl=https%3A%2F%2Fwww.newegg.com%2Fgray-lenovo-ideapad-330s-notebook%2Fp%2F1TS-000E-0CJR0%3FItem%3D9SIAEYA8KJ7313",
    "Aiwo I6": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-7511450392132377000&p=https%3A%2F%2Fwww.gearbest.com%2F2in1-laptops%2Fpp_009188977053.html%3Fwid%3D1433363",
    "Aiwo I8": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-6468468870124269000&p=https%3A%2F%2Fwww.gearbest.com%2F2in1-laptops%2Fpp_009589116897.html%3Fwid%3D1433363"
  }
}