{
  "source": "https://www.techradar.com/reviews/creative-pebble-plus",
  "title": "Creative Pebble Plus review",
  "category": "audio-visual",
  "updated": "2019-04-26T23:51:29Z",
  "author": "ted-kritsonis",
  "summary": "You’d be hard-pressed to find better stereo sound for your computer at this price",
  "verdict": "If you don't plan on cranking the volume or mind missing out on some wireless functionality, the Creative Pebble Plus are a solid set of stereo computer speakers. They're criminally cheap, and as long as you temper your expectations, you will get more than your money’s worth with them.",
  "pros": [
    "Decent sound quality",
    "Easy setup",
    "Comes with subwoofer"
  ],
  "cons": [
    "No bass controls",
    "Lots of cables",
    "Not the neatest setup"
  ],
  "article": [
    "Unlike picking out a new surround system that requires a bit of research and planning, upgrading computer speakers is pretty easy. But, for the budget-conscious, it's now even easier thanks to the new Creative Pebble Plus.",
    "For around the cost of a dinner, Creative is underselling and overdelivering with these criminally cheap 2.1 stereo speakers that cost just $40 (around £30, AU$50).",
    "Who doesn’t like a good bargain? We certainly do, and we think you’ll feel the same way about this combination of stereo speakers and sub.",
    "One thing that's surprising, especially at this price point, is that the speakers actually come with a subwoofer (hence the “Plus” in the product’s moniker). There is a Creative Pebble, but for an extra $5, you get the woofer.",
    "Now, the sub could be a bit sturdier and feels a little light, but there is a 4-inch driver inside angled downwards capable of pumping out 4-watts of bass. Other than a single connector in the back, there’s nothing actionable on the sub itself, but the simplicity is expected at this price point.",
    "The other thing you'll notice is the slight slant of the speakers themselves, a relatively minor, yet still significant move. Often times, computer speakers either face straight ahead or offer only a slight angle. Here, both speakers have been set to about a 45-degree angle, pointing them towards your ears when sitting down. Not only does this give the Pebble Plus a more unique look, but it helps with sound quality, too.",
    "In terms of connections, you get the audio connector for the sub, plus a 3.5mm Aux-In and USB plug. The Pebble Plus has no AC adapter, so it won’t take up a space on a power outlet or power bar, and instead draws power from USB.",
    "The good news is that setup is fairly simple considering how few wires there are connected to the speakers... but the bad news is that all the cables run through the right speaker, making it a little challenging for us to lay things out in a neat way - this isn’t one of those 2.1 systems that enables you to be all that creative on the display side of things.",
    "One of the cords you'll need to worry about is USB, which is needed for power. You can obviously plug it into your PC, but a nearby USB port on a power bar served the same purpose. The cables are quite long, and we tried to maintain their bundled state (out of the box) as much as possible.",
    "Keep in mind that you don’t get any wireless capabilities here, so forget Bluetooth, Wi-Fi, AirPlay, Chromecast or any other protocol that saves you from wires. They won’t work here.",
    "The right speaker does have a gain switch underneath and volume dial at the front. We tried different configurations to gauge performance but, truth be told, volume level was a far more important factor in sound quality.",
    "What we mean there is that these speakers, like most other cheap speakers, had an obvious tipping point before distortion set in. It did vary, depending on the track we played, but be prepared to hear it if you go all-out.",
    "For example, Blame It by Jamie Foxx was one of those tracks where we could discern muddier mids, and found similar examples with other R&B and hip hop tracks. The bass does sound more distorted when the song itself has heavy bass in it, but the real sacrifice here is in the mids, and to a lesser extent, the highs.",
    "When we played Def Leppard’s Hysteria album, we noted a nice, balanced sound signature. It didn’t replicate what something 10 times the price would produce, but we never expected that anyway. What was surprising was that complex tracks didn’t sound like a muffled set of instruments. Pianos, saxophones, guitars — they all had some life to them. Such was the case when we played the Battlefield V and Battlefield I soundtracks, along with a number of movie scores done by the late John Barry.",
    "Movies and games offer similar results. Gamers won’t find much to be impressed with here, though that’s hardly the crowd Creative is angling for. Movies and shows, or simply browsing through an array of YouTube clips, we came away hearing a relatively crisp level of sound.",
    "The thing about these speakers is they do have a sweet spot: For instance, if your computer is angled on a desk rather than facing you head on, you’re better off positioning the speakers to face you on from the computer on one end, and toward where you sit facing forward on the other. We don’t know for sure, but we suspect this is one reason why the cables are unusually long.",
    "Going in with measured expectations, we came away feeling good about the overall value of these 2.1 computer speakers. There are Bluetooth speakers that cost much more than this, and don’t offer stereo sound - this setup does, and while they don't stand-up to a Hi-Fi setup, their performance is better than the price would indicate.",
    "It's also worth pointing out that because there's a very minor difference in price between the Creative Pebble and Creative Pebble Plus, we would suggest ignoring the basic 2.0 Pebble speakers and going for the Plus version - the subwoofer is absolutely worth plunking down an extra bit of coin.",
    "All things considered, if you're on a budget, yet really want better computer sound, you will get more than your money’s worth with the Pebble Plus."
  ],
  "headers": {
    "3": "Design",
    "7": "Setup",
    "11": "Performance",
    "16": "Final verdict"
  },
  "links": {
    "Creative Pebble": "https://us.creative.com/p/speakers/creative-pebble"
  }
}