{
  "source": "https://www.techradar.com/reviews/amazon-smart-oven",
  "title": "Hands on: Amazon Smart Oven review",
  "category": "reviews",
  "updated": "2019-09-26T04:21:44Z",
  "author": "david-lumb",
  "summary": "Auto-cook recipes from the cloud",
  "verdict": "The Amazon Smart Oven is a pricier version of the Smart Microwave released last year, but it's far more functional - which makes its Alexa-powered capabilities much more useful, including auto-cooking foods based on cloud-downloaded instructions.",
  "pros": [
    "Extra functionality makes it much more useful",
    "Cloud presets seem like a godsend for untested chefs"
  ],
  "cons": [
    "Pricey compared to other Amazon products",
    "Value dependent on food presets"
  ],
  "article": [
    "Last year, Amazon debuted the Alexa-supporting Smart Microwave - and its follow-up builds on it with even more functionality. The Amazon Smart Oven adds convection heating, air frying and food warming to the mix, along with the usual Alexa functionality.",
    "But that extra oven capability adds up to a lot more cloud-powered Alexa ease - like throwing a chicken into the Smart Oven and, simply, asking Alexa to cook it.",
    "Amazon has uploaded a selection of recipes to Alexa servers (“a couple dozen” to start, with more on the way), enabling the smart oven to automatically cook selections based on cloud-uploaded presets. Want to cook/fry/microwave a different way? The Oven still responds to manual controls (e.g. “warm to 400 degrees F for 20 minutes”).",
    "The Amazon Smart Oven is available for pre-order in the US for $249, with shipping later in the year. That price also includes an Amazon Echo Dot - and rightly so, as the appliance lacks a microphone and isn’t terribly smart without a second Alexa-supporting device.",
    "It’s unclear when the oven will be released in other regions, including the UK and Australia.",
    "The Smart Oven works manually, with a host of buttons on the front and a small numeral screen - in other words, it looks like a conventional microwave.",
    "In fact, the Amazon Smart Microwave is still being sold, and at a substantially cheaper price because the company believes there’s still a market for a very inexpensive appliance. But the Smart Oven is bigger in every way - even literally, as its bay is 1.5 cubic feet, an improvement over the microwave’s 0.7 cubic feet.",
    "For more precision, Smart Oven also has a meat thermometer, which protrudes from the top of the inside. Data from the thermometer feeds directly to Alexa - so it can turn off the oven or lower the temperature at just the right time.",
    "As previously mentioned, the Smart Oven lacks a microphone, making it reliant on other Alexa-equipped devices. But this can be as simple as your Alexa app-equipped phone.",
    "The Oven does have specific features that benefit from other linked devices, though. The camera-equipped Amazon Echo Show series of smart screens, for example, have a new feature called Scan To Cook that scans a barcode and immediately sends the specific cooking instructions to the Oven.",
    "In practice: “Hey [Device], scan to cook” and hold the barcode up for a frozen dinner. Place the frozen dinner in the Oven and hit cook. Presto, perfect meal.",
    "There’s also a dedicated Alexa button on the front of the oven that activates the microphone on a linked Alexa-supporting device.",
    "It’s hard not to like an oven that’s smarter with you. Smoothing out some of the trial-and-error of cooking is a great idea for uncertain or still-learning chefs, especially when harnessing the power of the cloud.",
    "A lot of the Smart Oven’s value lies in those cloud-based cooking presets, and we’re eager to see how varied these auto-recipes become. Sure, the Oven can learn your preferred meals and settings in custom presets, but augmenting the layman’s cooking portfolio - for date nights or late nights - is certainly attractive."
  ],
  "headers": {
    "3": "Amazon Smart Oven release date",
    "5": "Amazon Smart Oven features",
    "8": "Cloud and Alexa",
    "12": "Early verdict"
  },
  "links": {
    "Amazon Echo Show": "https://www.techradar.com/reviews/amazon-echo-show-review"
  }
}