{
  "source": "https://www.techradar.com/reviews/edifier-tws1-true-wireless-earbuds",
  "title": "Edifier TWS1 True Wireless Earbuds review",
  "category": "audio-visual",
  "updated": "2019-10-24T10:17:56Z",
  "author": "jennifer-allen",
  "summary": "Bargain buds that skimp on sound quality",
  "verdict": "For a budget set of truly wireless earbuds, the Edifier TWS1 are a reasonable option to pursue. Don't expect audiophile fidelity here, but do expect to have change left over in your wallet.",
  "pros": [
    "Decent battery life",
    "Quick setup process",
    "Lightweight"
  ],
  "cons": [
    "Mixed sound quality",
    "Limited touch controls",
    "No settings to tweak"
  ],
  "article": [
    "Nowadays, true wireless earbuds come in all shapes and sizes; while some manufacturers have favored slim Apple AirPods-style stems, others have stuck stoically to the more robust-looking designs like the Samsung Galaxy Buds.",
    "That's the case with the Edifier TWS1 earbuds; a chunky pair of earbuds that you'll notice if they happen to fall out (not likely), they're a little plasticky and cheap-looking but there's a good reason for that – they're incredibly inexpensive compared to the competition.",
    "Can budget true wireless earbuds ever perform as advertised? We took them for a spin (and a run) to see how they measure up.",
    "The Edifier TWS1 have a recommended retail price of $49 / £45 on the Edifier site as well as on Amazon. In Australia, they cost AU$79.99, but they're currently reduced to AU$58.",
    "Your options lie between black or white. Somewhat predictably for budget earbuds, these aren't exactly going to be a fashion choice but odds are you'll be happy whichever color scheme you choose.",
    "For now, both colors are the same price but we've got a sneaky feeling white will drop in price sooner than black, if other earbud options are anything to go by – and with Black Friday and Cyber Monday coming up, Amazon deals are pretty likely.",
    "The Edifier TWS1 earbuds get right to the point; they're reasonably chunky to hold as well as to wear, with a few different silicone earbuds to swap out to get the sizing just right for your ears. We found the default option worked best for us, but it's easy enough to swap them out if your ears happen to be smaller or larger than ours.",
    "Admittedly, the Edifier TWS1 aren't exactly stylish. They're functional, but they're reminiscent of an older smartphone, with plenty of plastic involved rather than any stylish metallic coating to be seen. On the plus side, that does mean they're very easy to wipe clean when you get a little sweaty (or happen to drop them in some mud). Tap the top side of the earbuds and you get access to the touch sensitive controls. More on how easy they are to use later.",
    "The charging case is similarly cheap yet cheerful. It's much like a pill box carrier - lightweight and very convenient to toss into your bag or coat pocket. It covers all the essentials, with a magnetic clasp that easily snaps closed when you need it to, meaning you don't need to worry about your earbuds flying out at an inconvenient moment. On its side is where you can connect the micro-USB charging cable; the one included in the box is very short, but it's likely that you have spare cables around that will easily work instead.",
    "The Edifier TWS1 take seconds to set up – take them out of the case and they go straight into pairing mode. A few seconds later and a quick poke around your phone's Bluetooth options and you're good to go. Similarly, once paired, taking them out of the case immediately gets them ready for action – it's something we should be able to take for granted but isn't always the case, even with more expensive models.",
    "There is one quirk, but it's something that's common among true wireless earbuds – you can listen to the left earbud and place the right earbud in the case, but you can't do it the other way round. Not that this is a great hardship by any means, but it's something to be aware of.",
    "While the Edifier TWS1's touch-sensitive controls are useful, their placement is less than ideal. A single tap pauses or plays a song (alternatively, it accepts or ends a call) with a double tap skipping forward and a triple tap skipping backwards. Both earbuds have the same controls so there's no need for you to keep track of which bud does what.",
    "That's great, and it works well and intuitively. It's far easier than having the left earbud dictating calls and the right dictating music.",
    "However, because the majority of the earbud housing is devoted to the controls, it can be tricky to tap accurately when you're on the move such as jogging.",
    "A bigger issue is that you can't change the volume from the earbuds. Instead, you're reliant on digging out your smartphone or using your smartwatch to turn music up or down. That's something that will definitely grate when you're on the move.",
    "The charging case has a built-in 500mAh battery which is good for about 24 hours of charge before you need to find a power source. Combined with earbuds that promise about 8 hours on a single charge and that's impressive stuff.",
    "In practice? Unless you whack up the volume high, that's actually about what we got with maybe 30 minutes at the absolute most in its projected battery life. That's fantastic going – especially at this price.",
    "When true wireless earbuds are as cheap as the Edifier TWS1, it's unlikely that the sound quality is going to be particularly impressive – and that's the case here.",
    "Listening to music with the Edifier TWS1 is fine – just plain old fine. Regardless of what you listen to, from Kanye West's Stronger to more pop based tracks like Katy Perry's I Kissed a Girl, the songs sound a bit distant – a little cold and removed from your ears. Bass is distinctly weak even when listening to a bass heavy track like Hysteria by Muse.",
    "When it comes to the high notes of David Bowie singing Under Pressure, the Edifier TWS1 definitely don't show off his voice like they perhaps could do. There's a lack of detail to the mids and it all gets a bit screechy at heart, indicating an issue with harshness among the treble frequencies.",
    "Simply put, there's no real crispness here. Tested with all the above along with classical music from the likes of Prokofiev and big band jazz tracks, and it's all passable, but not exactly engaging. You won't be discovering previously unheard elements of your favorite songs with these buds.",
    "It's not like you can tweak any equalizer settings to improve things either, which is a reminder that these are some very inexpensive truly wireless earbuds – they're suited for those not too fussed about the quality of their music, who just want some cheap buds to soundtrack their workout or commute.",
    "It's roughly the same when handling calls too. You'll sound distant to others but the sound quality is good enough to get by, if unremarkable.",
    "So, you get what you pay for with the Edifier TWS1. They're easy to use and have fantastic battery life, but they don't sound great. Also, the lack of volume control on the earbuds is a bit of a nuisance.",
    "That price tag, though, is compelling. It wasn't that long ago that you'd have to spend considerably more to enjoy truly wireless earbuds.",
    "If you can stretch to spending more, then there are better options out there like the Creative Outlier Golds, which offer great battery life and far better sound. You'll have to spend nearly twice as much to enjoy those benefits, but the price is still pretty cheap at $99 (about £80, AUD$130).",
    "If you're prone to losing single earbuds or you just aren't too fussed about sound quality then the Edifier TWS1 are a bargain, albeit a bargain you'll soon forget about once you can afford better earphones."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "9": "Features",
    "17": "Sound quality",
    "23": "Final verdict"
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "Samsung Galaxy Buds": "https://www.techradar.com/reviews/samsung-galaxy-buds",
    "Edifier site": "https://www.edifier.com/us/en/headphones-earphones/tws1-true-wireless-earbud-headphones",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Amazon deals": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "smartphone": "https://www.techradar.com/news/phone-and-communications/mobile-phones/20-best-mobile-phones-in-the-world-today-1092343",
    "smartwatch": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Creative Outlier Golds": "https://www.techradar.com/reviews/creative-outlier-gold-true-wireless-headphones"
  }
}