{
  "source": "https://www.techradar.com/reviews/alienware-area-51m-review",
  "title": "Alienware Area-51m review",
  "category": "computing",
  "updated": "2021-02-04T14:23:30Z",
  "author": "jackie-thomas",
  "summary": "An out-of-this-world gaming laptop",
  "verdict": "The Alienware Area-51m is by far the most powerful gaming laptop on the market, thanks to its desktop-class hardware. That would be enough by itself, but the beautiful chassis and comfy keyboard make this one of the best desktop replacement laptops ever constructed.",
  "pros": [
    "Extremely powerful",
    "Aesthetic",
    "Perfect keyboard",
    "Widely user upgradeable"
  ],
  "cons": [
    "Very expensive",
    "Gets hot",
    "Loud fans"
  ],
  "article": [
    "While thin and light gaming laptops catch all the headlines these days, there’s still a market for the massive desktop replacements of yore – and the Alienware Area-51m is here to take things to the next level.",
    "This massive gaming laptop is packed front to back with powerful desktop hardware, bright RGB lighting and more gaming swag than anyone could reasonably handle.",
    "It's easily one of the best 17-inch laptops we've ever tested, so read on to find out more...",
    "The Alienware Area-51m we got in for review is equipped with a full-fat Intel Core i9-9900K processor, 32GB of memory (RAM), 1TB of solid-state drive (SSD) storage, a 1TB solid-state hard drive (SSHD) and a desktop-class Nvidia GeForce RTX 2080. Needless to say, it’s not cheap. To get your hands on this configuration, you’re going to have to fork over $4,499 (£3,818, AU$5,998). That’s a huge ask for a gaming laptop, but you legitimately won’t find better performance anywhere else.",
    "The entry-level model in the US is relatively affordable by comparison. The Alienware Area-51m starts off with an Intel Core i7-8700, 8GB of RAM, an RTX 2060 and a 1TB SSHD, and is available for $1,949 (about £1,480, AU$2,770).",
    "In the UK, the starting configuration has all the hardware above, but with a 256GB SSD and a Core i9 processor for £2,199 (about $2,900, AU$4,121). Australians will have to pay at least AU$3,999 (about $2,800, £2,133) and will get a Core i7, 16GB of RAM and a 256GB SSD.",
    "We’d suggest going with at least 16GB of RAM if you want to pick up the Alienware Area-51m, but the good news is that pretty much everything in this laptop is user-upgradeable – including a socketed CPU and replaceable graphics. This means that you’re not just getting a powerful laptop now, it can stay powerful in the future. This laptop is an investment in a way that no other gaming laptop is.",
    "In fact, the desktop-class socketed components make the Alienware Area-51m a prodigious value, compared to competing laptops like the MSI GT75 Titan. MSI’s desktop replacement will set you back $4,199 (about £3,150, AU$5,900) at the top end, with weaker laptop hardware, and without the possibility of future upgrades. The Alienware Area-51m is more expensive now, but it will last years if you take care of it.",
    "Simply put, the Alienware Area-51m is freaking gorgeous. This is the antithesis of the ‘gaming laptop’ stereotype. This laptop features a beautiful, clean design, and while it’s definitely huge, it doesn’t look like an edgy toy. You won’t feel the need to hide this laptop when people come over.",
    "The Alienware Area-51m weighs a whopping 8.54 pounds, and is 1.7 inches thick at its deepest point. This means you probably won’t be carrying it around anywhere, but it’s actually thinner and lighter than the MSI GT75 Titan.",
    "It looks better, too: the Alienware Area-51m comes in two color options, Lunar Light (white) and Dark Side of the Moon (black), and both options are jaw-dropping. We got the Lunar Light model, and the laptop has a white chassis with black accents in the front, and where the vents are around back.",
    "You’ll find RGB lighting literally everywhere – the keyboard, power button, trackpad, the logo around the back and a ring around the vents in the back all light up in whatever color you’d like. What’s more, unlike many other gaming laptops, the Alienware Area-51m’s keyboard features per-key RGB, which means your imagination is the only limit to how you can make this laptop look.",
    "And, obviously there are more than enough ports on the Alienware Area-51m. On the right side of the laptop, you’ll find two USB 3.1 Type-A ports. Over on the left, you get a Thunderbolt 3, another USB 3.1 Type-A and your headphone and mic jacks. Finally, around the back, there is a Mini DisplayPort, HDMI, Ethernet, an Alienware Graphics Amplifier for an external GPU and two power inputs.",
    "You read that right. For the level of hardware on offer with the Alienware Area-51m, you’re going to need to plug in both a 330W and a 180W power brick. However, you can plug in the 330W power adapter, and it will be good enough to keep the laptop running, it just won’t charge the battery.",
    "As for inputs, the trackpad is nothing to write home about. There are two dedicated hardware clickers, and the trackpad itself is responsive and accurate, even if it is a bit too small for our tastes.",
    "But, that TactX keyboard? It’s divine. Deep travel, quiet, well-spaced, basically every positive adjective we can use applies here. Because the laptop is so huge, there’s a full number pad on the right side of the laptop, along with plenty of macro keys. These macro keys are cool enough on their own, but what really sets them apart is their placement: we don’t ever find ourselves accidentally hitting them while writing or gaming.",
    "The fact that we can comfortably type on this laptop for work without waking up roommates might be one of the best parts about this laptop. You see, a lot of comparable desktop replacement gaming laptops feature loud and clicky mechanical keyboards. While this is awesome for playing games, everything else typically suffers.",
    "The Alienware Area-51m’s fans, however, are loud, pretty much all the time. This is to be expected because of the class of hardware in such a small space (small for desktop parts, anyway), but if fan noise gets on your nerves, you may want to look elsewhere.",
    "For a thicc gaming laptop like this, the Alienware Area-51m has surprisingly thin display bezels. They’re not on the level of one of the best Ultrabooks, but they’re small enough that we don’t notice them in day-to-day use. This is likely because the lid of the laptop doesn’t cover the entire chassis, as there’s about 2 inches of space behind the screen.",
    "Below the display is a Tobii Eye Tracking sensor, and it’s not too obnoxious. You’ll notice it, but just like every other aspect of this laptop’s design, it just fits.",
    "The display itself is a Full HD (1,920 x 1,080) IPS display, running at 144Hz with G-Sync. And, with this GPU, hitting 144 frames per second (fps) in most games is an absolute breeze, so we are regularly able to capitalize on the high refresh rate. Trust us, once you play some Battlefield V on a high refresh rate display, there’s no going back.",
    "Finally, there’s the speakers. They’re located on the front of the chassis and are, frankly, amazing. Even with this extremely loud laptop, these speakers are loud and clear enough that we don’t have to go scrambling for a headset while playing games. There’s plenty of bass and clear detail that it’s almost like having some of the best computer speakers built into the laptop.",
    "Basically, the Alienware Area-51m is a thing of beauty. This isn’t a laptop that you are going to be able to carry around with you, obviously, but we can’t stop staring at it. Alienware has a reputation for crafting unique and awe-inspiring computer designs, and the Alienware Area-51m is proof that the manufacturer hasn’t lost its touch.",
    "Image credit: TechRadar"
  ],
  "headers": {
    "3": "Price and availability",
    "8": "Design"
  },
  "links": {
    "gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "best 17-inch laptops": "https://www.techradar.com/news/best-17-inch-laptop",
    "Intel Core i9-9900K": "https://www.techradar.com/reviews/intel-core-i9-9900k-review",
    "Nvidia GeForce RTX 2080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080",
    "MSI GT75 Titan": "https://www.techradar.com/reviews/msi-gt75-titan",
    "best Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355"
  }
}