{
  "source": "https://www.techradar.com/reviews/anker-soundcore-motion-portable-bluetooth-speaker",
  "title": "Anker Soundcore Motion+ Portable Bluetooth speaker review",
  "category": "audio-visual",
  "updated": "2019-06-12T16:22:12Z",
  "author": "jennifer-allen",
  "summary": "Never judge a speaker by its cover",
  "verdict": "The Soundcore Motion+ is a powerful Bluetooth speaker in an unassuming package. It might look fairly ordinary but its use of Anker's audio technology means this is a speaker that will stand up to more expensive and better known names on the market.",
  "pros": [
    "Excellent audio performance",
    "Decent battery life",
    "Solid waterproofing"
  ],
  "cons": [
    "Bass could be stronger",
    "Looks fairly dull"
  ],
  "article": [
    "In recent years, Anker has carved out quite a respectable reputation for itself when it comes to offering high-quality speakers and headphones at a relatively low price. Typically aimed at those who want decent audio quality without having to pay a fortune, the firm has gone from strength to strength.",
    "Now into the refinement era of the process, Anker has released its Soundcore Motion+ Bluetooth speaker, a device that's more about power than eye-catching good looks.",
    "We tested out the portable speaker and it's business as usual, but that's no bad thing at all. It has almost everything you could want at an appealing price point.",
    "The Soundcore Motion+ retails at $100 / £100, which works out at around AU$140 based on current conversion rates – although it doesn't appear to be available in Australia at this moment in time.",
    "Take the Soundcore Motion+ out of its box and, well, it's not exactly going to thrill you with its looks. It's fine. It looks like nearly all other Bluetooth speakers, distinctly unremarkable and inoffensive, but harmless enough that it’ll suit pretty much any room.",
    "Measuring the length of a couple of smartphones, it won't take up much room on your desk or counter. It's also very easy to pick up with one hand and take around with you, although its near 2.5lb weight means you probably won't want to take it with you on any trips where luggage weight limits apply. This is a speaker that can be portable when you need it to be, but that's not really the priority here.",
    "Take a closer look at the speaker and you'll realize it's actually a bit more stylish than its first impressions suggest. Behind its black grille, you can see the inner workings of the speaker along with the Soundcore logo. It's understated (a familiar theme here), but it's a little more attractive than a simple plain speaker.",
    "The Soundcore Motion+ also has an interesting alignment to it, being tilted upwards at a 15 degree angle. According to Anker, this provides improved sound dispersion – more on that later, but in terms of design, it means the speaker rests on your desk or entertainment unit neatly.",
    "On top of the speaker are the controls. These comprise volume keys (that also double as rewind/fast forward), a Bluetooth pairing button, and an option to increase the bass.",
    "They're tactile buttons so you feel your way around the device rather than look for lit-up displays. That offers mixed results. You save battery life by not having any excessive lights to contend with, but it would be useful to be able to see more when listening to music in the dark.",
    "To the side of the device is the power button, AUX input and USB-C socket for charging the speaker. USB-C connectivity is a useful extra that isn’t as commonplace with Bluetooth speakers as you’d expect just yet.",
    "Battery life itself is pretty reasonable with a 6700mAh capacity, which means the Soundcore Motion+ can also double up as a power bank for your other devices. Up to 12 hours is promised for music playback, although that number may be lower if you tend to play your music at high volumes.",
    "We found at maximum volume, you'll actually only get about five to six hours, but it's unlikely you'll be using it at full volume all the time. A more realistic figure is about 10 hours or so at 50% volume, and that's not bad at all. A full recharge takes about three to four hours, but your mileage may vary here. In all cases, expect that to change significantly if you're also using it as a power bank.",
    "The Soundcore Motion+ is also fine under water-based duress, thanks to an IPX7 waterproofing rating. Although it's not safe to submerge in more than three feet of water, it's still fine to leave next to the pool side or keep in the shower.",
    "As is typical for Anker products, there's also support for the Soundcore app. Via the app, you can tweak the equalizer, choosing between some decent presets or tweaking things manually to your heart's content. It's also possible to set sleep timers and turn the speaker off via the app, which is convenient if you happen to be across the room.",
    "The Soundcore Motion+ utilizes two high-frequency tweeters, neodymium subwoofers, along with a passive radiator.",
    "With a total output of 30W, they pack a surprising punch for the size and price point. Even at high volumes, music sounds crisp with no distortion.",
    "The tilted design helps in some way by 'throwing' music across the room a bit more effectively. The speaker's pretty good at generating a wide frequency range from 50Hz to 40kHz.",
    "This means that you'll hear finer details in the music you listen to, thanks to stronger mids and trebles. There's also Anker's BassUp technology which ensures that bass sounds deeper and richer at all times. We tested it on music ranging from cool and subtle blues to more riff driven guitar music such as Foo Fighters, and felt confident at how good everything sounded.",
    "The ultimate test was to try it out with less professionally tweaked music via a track or two from a local artist. The Soundcore Motion+ still picked up the relevant beats, and ensured we could even spot a few small details we hadn't noticed before. It's all well balanced with nothing sounding too overwhelming at any point.",
    "Granted, the Soundcore Motion+ didn't quite achieve the powerful bass range of something like the JBL Charge 4, but these are the kind of subtle nuances that few will find issue with. That's even more the case when you consider the price of the Soundcore Motion+.",
    "By now, we all know that an AUX connection is regarded as best for sound quality, but Bluetooth here sounds pretty good thanks to Anker's continued use of Qualcomm aptX technology, which means lossless music reproduction while streaming.",
    "You can also pair up two Soundcore Motion+ units to effectively double the volume and create a more accurate form of stereo sound.",
    "The Soundcore Motion+ does a lot with its relatively small form. Able to charge your devices, survive a splash or two, as well as play your music well, it's an appealing device. It might look unremarkable, but it offers pretty much everything you would want from a wireless speaker for casual music listening.",
    "Does it provide the powerful bass of a JBL model? No, but it's also lower in price than its biggest competitor. As a relatively inexpensive alternative to waterproof speakers on the market like the JBL Charge 4, the Soundcore Motion+ could be a sound investment."
  ],
  "headers": {
    "3": "Price and availability",
    "4": "Design",
    "10": "Features",
    "15": "Sound",
    "23": "Final verdict"
  },
  "links": {
    "portable speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "JBL Charge 4": "https://www.techradar.com/reviews/jbl-charge-4",
    "waterproof speakers": "https://www.techradar.com/news/best-waterproof-speaker"
  }
}