{
  "source": "https://www.techradar.com/reviews/jbl-charge-4",
  "title": "JBL Charge 4 review",
  "category": "audio-visual",
  "updated": "2019-12-04T14:18:15Z",
  "author": "lewis-leong",
  "summary": "Minor updates to an already excellent speaker",
  "verdict": "The JBL Charge 4 only offers minor updates to the previous generation but it remains an excellent value in wireless speakers. The Charge 4 can pump out gobs of bass that doesn’t overwhelm, lasts forever, and can top up your phone in pinch. If the bulky size of the Charge 4 doesn’t bother you, it should be at the top your shopping list.",
  "pros": [
    "Balanced, powerful sound",
    "Can charge your phone",
    "Long battery life"
  ],
  "cons": [
    "Some distortion at high volumes",
    "No 360-degree sound",
    "Long charge time"
  ],
  "article": [
    "“If it ain’t broke, don’t fix it,” goes the old adage and that’s exactly the philosophy JBL took when updating its already-excellent Charge 3 speaker. The design is basically identical, as are its specs, but the improvements are subtle and not noticeable until you begin listening to the speaker and realize that the sound quality has been refined.",
    "We liked the JBL Charge 3’s ability to pump out some serious bass but were left a bit underwhelmed with its muted highs. The JBL Charge 4 offers much better tonal balance while still being able to dish out some serious bass that doesn’t overwhelm other parts of the frequency spectrum.",
    "The JBL Charge 4 may seem like a boring update on paper, but it’s still one of the best waterproof speakers around. For the money, you get a speaker that sound great, is tough as nails, acts as a charger for your phone, and lasts all day.",
    "If you put the JBL Charge 3 and Charge 4 next to one another, you’d be hard pressed to find many differences. The cylindrical shape remains as do the exposed woofers, which are an awesome sight when the bass is kicking.",
    "While we were initially concerned with damaging exposed speakers, we’ve had no problems with JBL’s other exposed woofer designs like the Pulse 3 and Charge 3.",
    "On top of the speaker you’ll find all of the speaker’s physical controls. This includes , buttons for power, volume, Bluetooth pairing, media control, and JBL’s Connect + feature, which lets you pair two or more of the company’s other speakers to play in stereo or to amplify music.",
    "Around the back you’ll find a large silicone door that protects the 3.5mm aux, USB-C, and USB-A ports. The inclusion of a full sized USB port means you can use the Charge 4 to top up your phone to keep your music going.",
    "The JBL Charge 4 is a directional speaker, so sound comes from the side with the JBL emblem. This may be disappointing to those looking for 360-degree sound but the speaker gets so loud that everyone can hear the music in a room.",
    "Since the speaker is directional, placement is key and users can either place it horizontal on its foot or vertically on either side. (Pro tip: Placing the speaker vertically can actually help increase bass response if you place it on a surface that helps radiate the bass.)",
    "The biggest improvement of the Charge 4 over the Charge 3 is sonic performance: While the Charge 3 was great for dishing out the bass, the Charge 4 is much more balanced in its approach. The highs are no longer a weakness, allowing instruments like the violin to sing. The mids are also great, allowing vocals to come through loud and clear. Resolution is good, but not great, which is expected for a waterproof and portable speaker in this price range.",
    "The JBL Charge 4 also gets impressively loud. For a medium sized room, playing music at half volume is more than enough to fill the space with sound. At max volume, the speaker is extremely loud for indoor use but the extra volume is appreciated in noisy environments like at the beach. Speaking of the beach, the speaker is IP7X rated so feel free to dunk it or get it dusty.",
    "JBL claims the Charge 4 can last 20 hours on a single charge and we had no problems hitting that number playing music at low to medium volume. However, expect to cut a few hours from that rating if you’re playing at high volume constantly.",
    "For the money, the JBL Charge 4 is a definite no-brainer. For arond $150 (£160, AU$200), you get a speaker that lasts all day, sounds great, can put up with all kinds of abuse, and tops your phone up in a pinch. Yes, there are better sounding speakers but you’ll have to spend much more money. (One of our favorite speakers, the UE Megaboom 3, sounds worse and costs more money.)",
    "The JBL Pulse 3 is a good alternative to the Charge 4 if you want 360-degree sound and a light show but you’ll have to sacrifice battery life (up to 12 hrs) and a slight bit of sound quality. If you value sound quality over all else, check out the Denon Envaya DSB-250BT, but know you’re sacrificing battery life for sound.",
    "Overall, though, JBL's Charge series is still at the top of its class."
  ],
  "headers": {
    "3": "Design",
    "9": "Performance",
    "12": "Verdict"
  },
  "links": {
    "Charge 3": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/jbl-charge-3-bluetooth-speaker-1324500/review",
    "best waterproof speakers": "https://www.techradar.com/news/best-waterproof-speaker",
    "Pulse 3": "https://www.techradar.com/reviews/jbl-pulse-3",
    "UE Megaboom 3": "https://www.techradar.com/reviews/ue-megaboom-3",
    "JBL Pulse 3": "https://www.techradar.com/reviews/jbl-pulse-3",
    "Denon Envaya DSB-250BT": "https://www.techradar.com/reviews/denon-envaya-dsb-250bt"
  }
}