{
  "source": "https://www.techradar.com/reviews/micron-1tb-c200-microsd-uhs-i-card",
  "title": "Micron c200 1TB microSD UHS-I card review",
  "category": "computing",
  "updated": "2019-06-26T06:09:46Z",
  "author": "desire-athow",
  "summary": "The biggest microSD card on the planet, figuratively",
  "verdict": "The C200 is a 1TB microSD card, the largest capacity on the market and a statement of intent. It delivers a decent performance, is cheaper than the competition - by a wide margin - and comes with a 5-year warranty.",
  "pros": [
    "Cheap! Massive capacity",
    "Waterproof, shock proof or x-ray proof",
    "5-year warranty"
  ],
  "cons": [
    "A tad slow",
    "No bundled software",
    "No adapters"
  ],
  "article": [
    "The Micron C200 was announced at MWC 2019 in Barcelona; it is, with the SanDisk 1TB Extreme microSDXC UHS-I, the only other 1TB microSD card currently on the market and like its rival, the C200, sports the three important ratings that attests of its top end status: A2, U3 and V30. At the time of writing, the card was still not on sale in the US although Micron did suggest that the C200 will be generally available by the end of August 2019.",
    "Micron opted for its usual blue finish for this card and as expected there’s not much to write about when it comes to its design. To think though, that we have now reached 1TB on a format that’s almost 15 years old is mind-boggling. Equally extraordinary is the fact that the first microSD cards had a capacity of 32MB; this one has a capacity 30,000 times bigger.",
    "The card makes use of the same advanced 96-layer 3D quad-level cell (QLC) NAND technology that Micron uses in the company’s SSD (like the 9300 Pro and the Micron 1300). The card is rated at up to 100 MBps read speeds and 95 MBps write speeds. In addition, it accelerates writing speeds via Dynamic SLC cache and offers intelligent maintenance during idle time for sustained peak performance.",
    "Note that you won’t be able to buy the card, which carries an SRP of $250, until August 2019.",
    "We tested the C200 using a Dell XPS 15 2-in-1 laptop and a USB Type-C card reader from Startech. We also used the built-in card reader present in this laptop to test it out. As a reminder, once formatted (exFAT), the drive shows 931.46GB of storage space available.",
    "Using the Startech card reader, it achieved 81.92MBps and 78.28Mbps respectively on CrystalDiskMark (read and write speeds). Using the internal card reader it notched 89.89 and 74.49MBps using the same benchmark. AJA System test recorded 79 and 76MBps respectively with the Startech reader and 84 and 81MBps using the card reader of the XPS 15. Read/write speeds of 77.41/74.62MBps and 85.75/82.37MBps were achieved on AS SSD with and without the card reader. We managed to transfer a 10GB file in just over 150 seconds/143 seconds which translates into a real life write speed of 66/70MBps, again, with or without the adapter.",
    "When it comes to Android performance, we used the Ulefone Power 5S and AndroBench. The drive hit sequential read/write speeds of 81/75MBps and 4466/2284 IOPS (read/write in both cases). What does that mean? Synthetic and real life speeds were slower than the rated speeds, which doesn’t come as a surprise. The card is still pretty fast for most applications.",
    "The SanDisk 1TB Extreme microSDXC UHS-I is rated at 160MBps for read and 90MBps for write speeds, which makes it, in theory, the better microSD card. Like the Micron C200, it is also shockproof, X-ray proof, and waterproof but on top of that, includes an SD card adapter and RescuePRO Deluxe one-year file recovery software. For those looking for extra oomph, Sandisk sells the Extreme Pro with a slightly higher read speed (170MBps) coupled with a higher price tag. The Extreme costs $450, the latter likely to be above $550; the C200 however undercuts both significantly at $249.99.",
    "That compares unfavourably with the likes of the Samsung Evo Select or the PNY U3 Pro Elite, both of which sell for $100 for the 512GB version (less than half the price). Memory juggernaut Lexar sells a 512GB U3 microSD card for even cheaper at around $75. At $250, the C200 carries only a small premium which many will be more than happy to pay. Prices of 1TB are bound to fall when Samsung, PNY, Integral, Lexar and others launch their own model but the bottom line for now is, buy a 1TB card if you really need it otherwise, there are far, far cheaper options.",
    "So who is this for? Prospective buyers will include professionals for whom time is an absolute premium and shuffling card carries an opportunity cost: think dashcams, video content creators, drone operators etc. But even then, the Micron C200 seems to be a better deal for the aforementioned reasons. It so happens that this 1TB card is currently out of stock on Amazon, Sandisk’s own online shop and most other retailers we’ve checked. So if you want to buy a 1TB microSD card, you will have to dig or wait.",
    "As a word of warning: whatever you do though. Do not, I repeat, do not buy your 1TB (or 2TB) card from the flurry of small vendors that have emerged on Amazon and eBay. These cards are fake; pure and simple."
  ],
  "headers": {
    "4": "Performance",
    "7": "Final verdict"
  },
  "links": {
    "MWC 2019": "https://www.techradar.com/news/1tb-microsd-cards-will-boost-the-storage-of-your-device-if-you-can-afford-it",
    "9300 Pro": "https://www.techradar.com/news/microns-new-15tb-ssd-is-almost-affordable",
    "Dell XPS 15": "https://www.techradar.com/reviews/dell-xps-15-2-in-1",
    "USB Type-C card reader from Startech": "https://www.startech.com/HDD/Card-Readers/USB-Card-Readers/usb-c-card-reader~SDMSDRWU3AC",
    "Ulefone Power 5S": "https://www.techradar.com/reviews/ulefone-power-5s-rugged-smartphone",
    "Samsung Evo Select": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSamsung-MicroSDXC-Adapter-MB-ME512GA-AM%2Fdp%2FB07MKSGZM6%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8830806003930527000-20",
    "PNY U3 Pro Elite": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FPNY-Elite-MicroSD-Card-P-SDUX512U3100PRO-GE%2Fdp%2FB07KD4XJLX%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1080735827657368000-20"
  }
}