{
  "source": "https://www.techradar.com/reviews/acer-chromebook-514",
  "title": "Acer Chromebook 514 review",
  "category": "computing",
  "updated": "2019-05-10T19:55:45Z",
  "author": "jason-cipriani",
  "summary": "Keep reading if battery life is king for you",
  "verdict": "The Acer Chromebook 514 has solid battery life and an attractive design, but overall performance leaves a lot left to be desired at this price point.",
  "pros": [
    "Long battery life",
    "Well designed"
  ],
  "cons": [
    "Lacking Performance",
    "High price"
  ],
  "article": [
    "As Google continues to push Chrome OS beyond what most of us had ever imagined it would become, Chromebooks continue to gain meaningful software features. With that, new hardware is needed to take full advantage of features like Android apps and Linux installations. There’s even talk that Chrome OS users will gain the ability to install Windows on their devices.",
    "With these new resource-intensive features, Chromebooks at the high-end of the pricing scale are expected to offer a premium experience. The $499 (about £380, AU$710) Acer Chromebook 514 is one of the latest laptops that attempts to try and deliver on that promise. More recently, we found the Asus Chromebook Flip to exceed expectations of what a premium Chromebook should be, while HP’s Chromebook 13 is no slouch either.",
    "The Chromebook 514 falls short of that promise, though, with one exception: battery life.",
    "The Chromebook 514 as configured is currently sold for $499 (about £380, AU$710). For that price, you get an Intel Pentium N4200 processor, 8GB of memory and 64GB of storage. You can find variants of the Chromebook 514 for less, but those models ditch the Intel Pentium processor for an Intel Celeron chip and cut the amount of memory and storage in half. Given the performance woes we list below, we wouldn’t recommend considering these more affordable options.",
    "In the UK, you can find the Chromebook 514 for £399.99 directly from Acer. The biggest difference between the UK and US versions comes down to memory and storage. In the US, you get 8GB and 64GB, respectively. In the UK, both are bumped down to 4GB and 32GB.",
    "The Chromebook 514 lineup isn’t available in Australia, with the Acer Chromebook 14 doing a decent job of filling in for it. At AU$499, the Chromebook 14 comes with an Intel Celeron processor, a non-touch display, 4GB of memory and 32GB of storage in a similar design.",
    "Let’s be clear: $499 for a Chromebook is a lot. It’s a price point normally reserved for premium Chromebooks. The HP Chromebook 13 is equipped with an Intel Core m3 processor at $599 (£730, about AU$800), while the Asus Chromebook Flip C302 and its Intel Core m3 processor will set you back $499 ( £599, about AU$650).",
    "When looking at the devices on paper, it’s hard to not feel that the Chromebook 514 is overpriced.",
    "Acer tucked a 14-inch display in the Chromebook 514’s housing that more closely resembles a 13-inch laptop. Specifically, it measures 12.7 x 9.1 x 0.7 inches (323 x 232 x 17mm; W x D x H) and weighs 3.31 pounds (1.5kg). It’s compact and light enough to throw in a backpack or bag without thinking twice.",
    "The silver housing is broken up only by the Chrome logo on the lid, and four black feet on the bottom of the laptop. On the left side, you'll find a USB-C port, a USB 3.0 port, a microSD card reader and a headphone jack. On the right side, you’ll find another USB-C port and another USB 3.0 port. You can use either USB-C port for charging, a feature we appreciate.",
    "The microSD card reader is a nice touch. Having the option to add more storage to a Chrome OS device is always welcome, though not always needed.",
    "The design of the Chromebook 514 isn’t something that’s going to draw attention to itself, but it doesn’t look boring either. There’s a subtle, yet premium look, that the more we use it, the more we like it.",
    "The 14-inch IPS display isn’t super impressive. It lacks in overall brightness and colors appear muted. The touchscreen itself is smooth and responsive to gestures and taps – we find ourselves frequently reaching up and touching the screen during testing instead of using the trackpad.",
    "Even with a touchscreen, the hinge doesn’t allow the screen to rotate all the way around, turning the Chromebook 514 into a tablet. It does, however, let you lay the screen flat at 180 degrees, behind the keyboard. We can’t think of a use case for this orientation, but hey, having options is always nice.",
    "The trackpad is finicky and, at times, frustrating to use. It consistently fails to recognize gestures that involve multiple fingers. Outside of lackluster gesture support, the trackpad itself is smooth and responds to presses without issue. The touchscreen makes up for what the trackpad lacks.",
    "As for the keyboard, it’s smooth and the keys are responsive. The individually lit keys take very little pressure to activate, which is a dream for touch-typists or those who prefer chiclet-style keys. Of course, the keyboard features the standard Chrome OS layout with the top row consisting of shortcut keys and the Caps Lock key being replaced by a search key."
  ],
  "headers": {
    "3": "Price and availability",
    "8": "Design",
    "14": "Trackpad and keyboard"
  },
  "links": {
    "Asus Chromebook Flip": "https://www.techradar.com/reviews/asus-chromebook-flip-c302",
    "HP’s Chromebook 13": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/hp-chromebook-13-1320005/review",
    "£399.99": "https://www.awin1.com/awclick.php?awinmid=12590&awinaffid=103504&clickref=trd-us-5415300296532910000&p=https%3A%2F%2Fuk-store.acer.com%2Facer-chromebook-514-cb514-1ht-silver",
    "AU$499": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1030888328773657500&xs=1&url=https%3A%2F%2Fwww.acer.com%2Fac%2Fen%2FAU%2Fcontent%2Fmodel%2FNX.GC2SA.003&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Facer-chromebook-514"
  }
}