{
  "source": "https://www.techradar.com/reviews/apple-imac-2017",
  "title": "Apple iMac (2017) review",
  "category": "computing",
  "updated": "2019-06-14T21:25:59Z",
  "author": "joe-osborne",
  "summary": "A fine update to an aging all-in-one iMac design",
  "verdict": "The 2017 iMac is a fine follow up to Apple’s desktop computing platform, but suffers from a few pesky design quirks, as well as its own place amid fast-evolving desktop design trends. Still, for Mac fans in need of an upgrade, the 21.5-inch model presents surprisingly impressive value.",
  "pros": [
    "Gorgeous 4K, P3 color display",
    "Excellent value",
    "Powerful even at entry level"
  ],
  "cons": [
    "Poor audio performance",
    "Baffling mouse charging method"
  ],
  "article": [
    "When Apple rolled out the original iMac nearly 20 years ago in August 1998, Steve Jobs envisioned it as the Apple computer for the every-person – with a design that does take itself seriously and is free from any floppy disks or CD trays. Finally, the iMac 2017 is closer than ever to the Steve Jobs’ original vision.",
    "While we would not describe the iMac 2017 as a ‘cheap device’, that doesn’t stop it from being one of the best Macs from a pure value perspective – and it’ll stay that way, since the iMac 2019 starts at a premium price. You won’t find any CD drives either, but you will still contend with a mechanical hard drive. However, recently Apple seems to be ditching hard drives in favor of SSDs, so that makes us hopeful for the future.",
    "Of course, you can’t really talk about the iMac without covering its peripherals. The Magic Keyboard and Magic Mouse 2 seamlessly sync with the iMac. It really is the archetypal all-in-one PC, which in and of itself makes it one of the most compelling computers on the market right now.",
    "So, while the new iMac doesn’t radically change the formula, there’s little to complain about, even with the Apple iMac 21.5-inch (2019) hitting the streets. The pure simplicity of the iMac’s design language will take you far, especially when paired with the 7th-generation Intel Kaby Lake desktop processors.",
    "The iMac’s price starts at a mere $1,099 (£1,049, AU$1,699), which will include both the Magic Mouse 2 and Magic Keyboard in the box. That’s $178 (£178, AU$248) for the accessories alone.",
    "Of course, you’re getting a 21.5-inch iMac with a Full HD (1,920 x 1,080) display and Intel Iris Plus 640 graphics, which is integrated into the 7th-generation, dual-core 2.3GHZ Intel Core i5 processor, but it’s a respectable value all the same.",
    "As you can see from the spec sheet, the iMac we were sent for review is a step up from the entry-level model in every regard, except for the hard drive, a configuration that will set you back another $200 at $1,299 (£1,249, AU$1,999).",
    "From there, you can configure the iMac however you want, making it as affordable or as powerful as your heart desires. Do you need to live out your creative aspirations through discrete graphics? You may do so with AMD RAdeon Pro 560 graphics. Do you require more RAM to run professional applications and more than 3 Chrome tabs? Have at it, with up to 32GB of RAM.",
    "You can also bump the display up, and opt for an iMac 27-inch with virtually the same components as the iMac we reviewed here, but with Radeon Pro 570 graphics for $1,799 (£1,749, AU$2,799).",
    "If that’s not enough, then the iMac Pro, which comes in at $4,999 (£4,899, AU$7,299), might be a more fitting option for you. It’s an extravagant purchase for most people, but the prospect of up to 18 cores of raw power should be very appealing to the creative professionals or power users out there.",
    "The iMac’s price falls in line with other high-end all-in-one PCs out there, namely the iMac’s chief competitor in the original Surface Studio – though it’s been replaced by the pricier Surface Studio 2 at $3,499 (£3,549, AU$5,499). You should be able to find more affordable all-in-one desktops out there, but they won’t be as well-built or include components as powerful as the iMac’s.",
    "If you’re looking for an even more budget-friendly option, and you already have a monitor, keyboard and mouse lying around, you could go with the Mac Mini at $799 (£799, AU$1,249) for similar power to the entry-level iMac. However, it doesn’t include any of the accessories that the iMac has.",
    "You’ll be able to find all of the 2017 iMacs through Apple’s website itself, or third-party retailers like Amazon.",
    "The iMac doesn’t look or feel radically different compared to past iMac models. And, that’s not necessarily a bad thing, as this brushed aluminum all-in-one is something to see. However, after a few persisting design choices – not to mention its overall design in the face of new rivals – this gives us a bit of pause.",
    "That iMac silhouette is still iconic, however – there’s a reason that it’s become a staple of offices, home and otherwise, in TV and films for years. The iMac’s minimalist yet elegant appearance manages to be both appealing and compact so that it while it’s nice to look at, it also doesn’t get in the way of work.",
    "Then, of course, there’s the seemingly laws of physics defying thinness of the iMac, considering exactly how much is packed into the display section of the computer (i.e. literally everything).",
    "However, the iMac is competing with Microsoft’s Surface Studio lineup. We can’t, therefore, ignore just how much thinner and more impressive the iMac could be if Apple just leveraged what it’s learned from developing Mac Mini computers toward designing an iMac base that holds all the computer's guts and ports.",
    "Looking at the Surface Studio in the TechRadar office and then back at the latest iMac, it’s frankly baffling that Apple didn't beat Microsoft to that punch years ago.",
    "Despite this, Apple managed to cram all the ports you could ever want or need from an all-in-one computer into the back of this iMac, so we have to give them credit for that.",
    "Further to the point, Apple’s pursuit of absolute thinness despite cramming all of the iMac’s innards behind the display has only led to abysmal audio. A total of two stereo speakers rest within both sides of the iMac’s bottom-most edge, and while they boast impressive volume, as a result the narrow chambers, they also deliver highs and mids that aren’t any better than your average Ultrabook.",
    "That’s not cool for a device that takes up as much space as an all-in-one does – no matter how impossibly thin it is.",
    "We also need to talk about the Magic Mouse 2 – it needs a serious upgrade. It clicks and tracks amazingly, as you’d expect from the company that inspired everyone else to up their input game years ago. However, the fact that you can’t charge the mouse while using it, because of where the Lightning charging port is located, makes no sense.",
    "Fortunately, Apple includes the Magic Keyboard 2 in the box. It’s simply delightful to type on, and the days-long battery life of both input devices are a major plus – considering that you have no other choice but to buy older wired models, if you’re not into wireless peripherals.",
    "Because macOS Mojave isn‘t compatible with the majority of normal benchmarks that we run at TechRadar, it’s hard to measure the Apple iMac against the Windows 10-based all-in-one PCs we’ve reviewed, in a comprehensive way.",
    "That said, it’s obvious in the tests that this iMac benefits quite a bit from its 7th-generation Intel Core i5 processor over the Surface Studio’s antiquated 6th-generation chip.",
    "For example, the Apple iMac shows a more solid single-core performance than the Surface Studio as well as moderately higher multi-core performance in Geekbench. However, the Surface Studio does have a stronger GPU with more memory, which shows in the numbers – the Microsoft all-in-one scores 20fps faster in Cinebench than the iMac, despite the older chip.",
    "Nevertheless, we find the latest iMac to be a strong performer. It handles our everyday workload, which includes dozens of Google Chrome tabs and the Slack chat client – both RAM and processor-hungry apps, effortlessly, and could likely take on a bit more. While we did bear witness to the spinning beachball more times than we would have liked from a newly-opened Mac, it didn’t appear frequently enough to affect the seamlessness of our workflow. Besides, no matter how new your computer is, it’s hardly immune to the spinning wheel, regardless of color or shape.",
    "Our biggest takeaway from using the latest iMac is its downright dazzling display. Seriously, if you can swing it, spring for the mid-range 21.5-inch model, because that 4x jump in pixel density – and the better graphics tech behind it – is well worth it.",
    "Photos look stunning on the iMac’s panel and are expertly colored, thanks to its P3 color gamut. That’s an important point, because that enhanced color reproduction affects all ends of the system, regardless of the resolution of the content you’re viewing. Even videos at 1080p look drastically improved thanks to P3. Unfortunately, this has made going back to our usual 1080p screens with RGB color a sobering experience.",
    "The iMac 2017 is a refreshing update to Apple’s all-in-one computing platform. For the money – at least for the 21.5-inch model – you’re getting a striking machine that’s more than capable of handling every task you throw at it, whether its web browsing or photo editing.",
    "That said, nothing exists (for long) in a vacuum. We can’t disregard the fact that the iMac may have fallen behind the trends of modern all-in-one computers, namely those spearheaded by Microsoft’s Surface Studio. Additionally, we’re not fans of its audio quality and, while the Magic Mouse 2 is a wonderful mouse to use, the fact that it can’t be used while charging is a pain that’s hard to overlook.",
    "At any rate, those in the market for a 4K-ready – or even 1080p – all-in-one that’s as powerful as it is aesthetic will find their ideal computing match in the iMac 2017. A few minor issues and an arguably dated design aside, the average Mac fan (or would-be fan) will find plenty to love about yet another iconic Apple computer.",
    "Bill Thomas and Gabe Carey have also contributed to this review",
    "First reviewed September 2017",
    "Images Credit: TechRadar"
  ],
  "headers": {
    "4": "Price and availability",
    "13": "Design",
    "23": "Performance",
    "29": "Final verdict"
  },
  "links": {
    "best Macs": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "iMac 2019": "https://www.techradar.com/reviews/apple-imac-27-inch-2019-uae",
    "SSDs": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "Apple iMac 21.5-inch (2019)": "https://www.techradar.com/reviews/apple-imac-215-inch-2019-review",
    "Kaby Lake": "https://www.techradar.com/news/computing-components/processors/kaby-lake-intel-core-processor-7th-gen-cpu-news-rumors-and-release-date-1325782",
    "iMac Pro": "https://www.techradar.com/reviews/imac-pro",
    "Surface Studio": "https://www.techradar.com/reviews/surface-studio",
    "Surface Studio 2": "https://www.techradar.com/reviews/microsoft-surface-studio-2",
    "Mac Mini": "https://www.techradar.com/reviews/apple-mac-mini-review",
    "macOS Mojave": "https://www.techradar.com/news/macos-1014"
  }
}