{
  "source": "https://www.techradar.com/reviews/motorola-one-macro",
  "title": "Motorola One Macro review",
  "category": "phones",
  "updated": "2019-11-07T14:25:36Z",
  "author": "sean-cameron",
  "summary": "Can a focus on the little things lift this Moto above the rest?",
  "verdict": "The Moto One Macro has a great design, dependable battery, a good screen, nice software and a reasonable chipset. It is a very well thought-out device - but its main attraction, the macro camera, is a big let-down.",
  "pros": [
    "Good screen",
    "Dependable battery life",
    "Durable, fuss-free design"
  ],
  "cons": [
    "No NFC",
    "Bad cameras",
    "Rear is a fingerprint magnet"
  ],
  "article": [
    "In 2019, Motorola is fiercely fighting its corner in the budget smartphone bout to decide the next crowning champion. It hasn’t been forced to the ropes yet, however it needs energy and a good game plan to succeed.",
    "As such, the veteran manufacturer has released a flurry of new smartphones this year, each aimed at a different niche. Some of these have been expertly targeted, such as the Moto G7 Power (with a focus on battery life), while others have been a little more left-field and esoteric.",
    "It is in this latter category that the Motorola One Macro sits, its entire appeal arguably resting in its particular, peculiar photographic capabilities. But with many capable rivals, each of which arguably has a broader general appeal, is the potential of this device’s eccentricities enough to make it worthy of your attention?",
    "The Motorola One Macro is being sold at £179.99 / AU$299 (around $230), with no word on wider availability at the moment.",
    "It is being sold in ‘Space Blue’ and ‘Ultra Violet’ colors and comes with one storage/RAM combination, of 64GB/4GB.",
    "The clue is in the name, the appeal of the Motorola One Macro rests in one of its capabilities alone - that of getting as close as possible for the perfect shot.",
    "What this means is that it has a dedicated 2MP camera sensor which can focus from distances as little as 2cm. In photographic terms, normally this would require dedicated, expensive kit for a large-sensor camera to achieve, so being able to do the same with point-and-click simplicity is quite a time-saver.",
    "Whether you’ll put value in this will strongly depend on how ‘creative’ you like to get with your shots. Having it is definitely a nice extra, but whether it deserves to take top billing is something which will be confirmed later in this review.",
    "Aside from its extra camera spice, the One Macro is actually a very well-rounded budget device. It has a big 4,000mAh battery to keep the power flowing throughout the day, comes with a generous RAM and storage allowance, and has a very reasonable 720p+ screen.",
    "In the box you also get a 10W fast charger to make emergency top ups a little less frantic, and the device itself comes with a splash-resistant nano-coating which will mean a little less worry when whipping it out in unexpected rain.",
    "Even at the budget end of the market, the trend these days in smartphone design is for metal and glass to meet together in a ‘sandwich’. No matter the price point, you can usually expect to see aluminum somewhere.",
    "Not on the Motorola One Macro, for it is a plastic fantastic - not that this is in any way negative. Indeed, from some viewpoints it is a particularly robust positive. For although metal and glass certainly feel nicer in the hand, plastic has a number of advantages.",
    "First and foremost among these is durability, for plastic does not shatter like glass nor dent in the same way as metal. It also conducts heat more evenly, is lighter, and provokes less anxiety in general use.",
    "There are drawbacks of course, and in particular with the glossy plastic used by Motorola. This picks up fingerprints as though they are going out of style, and means the device is best used with the included case, or that it should be wiped down often.",
    "The handset is certainly well-balanced, and feels sturdy in general use. Not that this is usually a problem with modern handsets, but it displays minimal flex under pressure.",
    "It has a 6.2-inch 720 x 1520 screen, and weighs a fairly weighty 186g, a compromise given the size of the battery. Nonetheless, the screen is not as big as some and is therefore easier to use one-handed than the likes of the Realme X2 Pro with its gargantuan panel and portly heft.",
    "The port selection too is thankfully up-to-date, with a USB-C connector, and an increasingly rare (but never less than immensely convenient) 3.5mm headphone port. There is a downward firing speaker, and the screen itself sports a small teardrop notch.",
    "There is a rear-mounted fingerprint scanner, which works very well and acts as a nice center for the ‘M’ Moto livery, however this device comes without NFC. This means no contactless payments in shops, or for bus tickets, which is a shame at this price point.",
    "In all, the design of the Motorola One Macro is almost the definition of utilitarianism - beyond the trio of cameras on the rear it has almost no distinguishing features. That belies its essential comfort in regular use however, and the thought which has clearly gone into its curves.",
    "When many devices have become almost impossible to use for fear that they may slip or break when used in one hand, the One Macro feels like a pleasant step in a more ergonomic direction for phone design.",
    "The Motorola One Macro comes sporting a 6.2-inch panel with a resolution of 720 x 1520 - and all encumbered by only a very minute notch. The company makes a great deal of the screen stretching from corner to corner, and indeed this is true, at least for the top corners. There's a sizeable bezel at the bottom, but in day-to-day use, the One Macro certainly looks and feels like a modern handset.",
    "The resolution isn’t the highest you might expect, even for the price, but this aside, the screen is anything other than bad - it has been said for years but a screen is more than the pixels packed into it.",
    "Those staring hard from an inch away will be able to see issues with poorly rendered text, but in most situations, the vast majority of users will be able to see no difference between this and something more expensive.",
    "That said, there are a few issues with the white balance. As is common with cheap LCD panels these veer towards the blue end of the spectrum. There isn’t any way to change this white point, but again it isn’t an issue in any normal situation one might encounter.",
    "Brightness is mostly good, certainly we found that it proved to be sufficient for any indoor situation, and was mostly able to battle against outdoor autumnal sunlight with success.",
    "The panel on the Motorola One Macro isn’t an all-singing, all-dancing entry like that on the OnePlus 7T Pro, however it more than holds its own at the budget end of the market where it sits, and for that it must be commended."
  ],
  "headers": {
    "3": "Motorola One Macro price and availability",
    "5": "Key features",
    "10": "Design",
    "20": "Display"
  },
  "links": {
    "Moto G7 Power": "https://www.techradar.com/reviews/moto-g7-power-review",
    "Realme X2 Pro": "https://www.techradar.com/reviews/realme-x2-pro",
    "OnePlus 7T Pro": "https://www.techradar.com/reviews/oneplus-7t-pro-review"
  }
}