{
  "source": "https://www.techradar.com/reviews/prime-suite",
  "title": "Prime Suite review",
  "category": "computing",
  "updated": "2020-01-25T15:22:31Z",
  "author": "jonas-p-demuro",
  "summary": "Putting possibility into practice",
  "verdict": "While Prime Suite is an easy to use EHR with plenty of pros including their dedicated patient app, factoring in the higher pricing and lack of fax integration puts this otherwise attractive offering to mid-pack.",
  "pros": [
    "Support for all major platforms",
    "US based support",
    "mHealth patient engagement app"
  ],
  "cons": [
    "Opaque pricing",
    "No free trial"
  ],
  "article": [
    "Greenway Health is hardly a newcomer, and can trace its origins back to 1989, although it started under the name Medical Manager. In 2013, Greenway Health was formed when three companies, Vitera Healthcare Solutions, SuccessEHS, and Greenway Medical Technologies combined through an acquisition by Vista Equity Partners. The company has offices throughout the US.",
    "Prime Suite focuses its efforts for the ambulatory healthcare practices. Rather than adopting the ‘One size fits all’ approach, it is specialty specific with customizable templates that are approximately 4,000 strong. The template library is also specialty specific, so that users do not need to build every template from scratch, and there’s a good chance there is already an appropriate note in their library, and of course it can be further customized as needed.",
    "This focus also comes through on how it addresses workflow issues for the busy clinician, as it includes speech-to-text to make inputting clinical data via electronic dictation quite simple.",
    "Patient engagement is another key aspect for Prime Suite. This starts with a powerful Patient Portal, that covers the expected basics of appointment scheduling, and prescription refills, both essential tasks that serve to free up the front office staff. However, it also goes beyond the basics, with advanced functions such as easy access to lab results, and even discharge summaries.",
    "Moving even further than the web based Patient Portal, there is mHealth, a “patient mobile health app,” allowing patients to connect to the practice via a smartphone or tablet. There is also Automated Messaging to allow physicians to connect to their patients and share tools for health management to keep patients engaged between their visits. This also provides reminders via the automated system to encourage attending appointments with the goal of decreasing the frustrating ‘No-shows,’ and ‘Lost to followups.”",
    "Another powerful function is the ability to perform practice analytics. Prime Suite can take the data from the practice, perform the analysis, and provide intelligent information that then will improve the efficiency of the practice, and also increase revenue. More specifically, raw data can get processed, to increase practice profitability by optimizing the performance on the level of each provider, as well as on the level of the practice. Also, alerts can be configured to provide real time notifications if and when there is a dip in the key performance indicators.",
    "The analysis is further flexible, as it can provide insights into the health of the practice on a population health level, financial data to optimize the billing and cash flow, and also to satisfy the pesky reporting requirements for value-based incentive programs. Prime Suite provides complete financial reporting with easy to read dashboards and available customizable reports. Taking this information, such as payer denials, billing procedures can be adjusted to have less denials, and to enhance cash flow.",
    "Prime Suite is designed to satisfy the requirements for governmental regulations, including 2015 ONC Health IT certification, the Medicare Access and CHIP Reauthorization Act of 2015 (MACRA), and MIPS.",
    "Each EHR has its weaknesses, and Prime Suite is no exception to having some flaws.",
    "For example, while the direct messaging function is good, it is not all encompassing. There is certainly an attraction to having an automated letter sent out to a referring clinician when a consult or followup is done, but there are some weaknesses. The first is that the letters are too templated, and clinicians are resorting to simply dictating a letter outside of the system. The other is that some less digitally connected practices still rely heavily on fax machines to communicate and receive correspondence, and Prime Suite does not integrate an eFaxing feature, again putting this correspondence outside of the system.",
    "Other complaints focus on the billing invoices that Prime Suite generates. Rather than a simple, and easy to understand bill, the system spits out a bill that is less than logical, with a single charge appearing multiple times on a single bill. As a result, the office staff has to spend additional time preparing, and reviewing each bill.",
    "Finally, while it is not reported to be frequent, Prime Health does have some bugs. This does result in the occasional crash, and furthermore users complain that there are delays in getting fixes implemented allowing the bugs to persist for longer than they would like.",
    "Unlike some competitors, Prime Suite is supported by all the major platforms. For the desktop that includes Windows, Mac and Linux, and on the mobile side that includes both iOS and Android. Unfortunately, the only language supported is English.",
    "Support is provided via a variety of methods, including phone, email, and live support for training for initial setup. Another important plus is that this support is not foreign outsourced, and 100% US based to avoid the frustrations of language difficulties. There are also available webinars.",
    "Like so many other EHR providers, contact with the company is required to obtain pricing via a custom quote. While specific information about the practice can be important to determine a price, such as the volume of the practice, and the number of providers, we still wish it was easier to get an idea of the prices to make it simpler to cross shop these solutions. Finally, there are some reports that this solution has a higher cost than some other competing solutions.",
    "In addition, there is no free trial offered.",
    "Prime Suite aspires to be the clinician focused, and easy to use EHR solution. Highlights range from customizable, and specialty specific note templates, integrated voice-to-text support, and a powerful Patient Portal with a dedicated mHealth app. The drawbacks include opaque pricing that is higher than competitors, lack of fax support, and confusing billing invoices. Balancing all of this, Prime Suite is an intriguing solution, especially for specialty, ambulatory practices."
  ],
  "headers": {
    "1": "Features",
    "8": "Drawbacks",
    "12": "Support",
    "14": "Pricing",
    "16": "Final verdict"
  },
  "links": {
    "Greenway Health": "https://www.greenwayhealth.com/prime-suite",
    "Prime Suite": "https://www.greenwayhealth.com/prime-suite",
    "EHR": "https://www.techradar.com/best/best-electronic-health-record-ehr-software"
  }
}