{
  "source": "https://www.techradar.com/reviews/plugable-thunderbolt-3-2tb-nvme-ssd",
  "title": "Plugable Thunderbolt 3 2TB NVMe SSD review",
  "category": "computing",
  "updated": "2020-02-10T14:14:58Z",
  "author": "mark-pickavance",
  "summary": "We feel the need, the need for speed",
  "verdict": "With amazing performance comes an eye-watering cost, though to truly exploit it requires a port that many computers won’t have and can’t add. If you can afford this device, then backing up and restoring data will take much less time.",
  "pros": [
    "Terrific speeds",
    "Ample capacity",
    "Solid construction"
  ],
  "cons": [
    "Undersized carry pouch",
    "Needs Thunderbolt 3 port for best speeds"
  ],
  "article": [
    "If you’ve ever watched the clock tick away to the time when a train or a plane is departing while you wait for a piece of technology to complete its cycle, then you’d be interested in the Plugable Thunderbolt 3 2TB NVME SSD.",
    "Where other external drives claim to be fast by quoting the theoretical speed of the connection technologies used, this one is quick even by internally mounted NVMe drive speeds.",
    "But what are the catches associated with having external drives that can read at more than 2,800MB/s?",
    "I some ways the design of this drive fits what we’ve come to expect from external flash storage, and in other details, it takes a distinctly radical departure.",
    "At 6.5cm wide, 10.8cm long and 1.5cm thick the TB3 SSD is very similar in scale to a 2.5” SSD, if a good bit thicker.",
    "The case is milled from a solid piece of aluminium and has fins cut into the sides to aid with heat dissipation. As you might expect from what was once solid metal, it feels heavy, virtually indestructible and extremely able to take significant abuse.",
    "The first slightly odd thing we noticed about this drive is that the short 18cm cable is permanently mounted, and therefore can’t be replaced should it ever become damaged.",
    "That lack of redundancy would normally count against an external drive, but in this instance why Plugable made this choice is patently obvious.",
    "As a Thunderbolt 3 drive designed to be connected using the full 40Gbit/s bandwidth available to that interface the length of the cable is critical, and also the integrity of the connection.",
    "A detachable cable might have worked fine, but the only way to guarantee that it would deliver all that this drive can do is a wired cable.",
    "What’s on the outside of this drive is a little bit interesting, but pails into comparison with the more impressive technology inside it.",
    "This drive comes pre-formated in exFAT, meaning that it should be ready to use irrespective of the computer OS on your system.",
    "There isn’t anything special about how this drive is treated by the system; it’s external storage connected via Thunderbolt 3 and works as you might expect any USB external drive to operate.",
    "Because of the connection technology, it is possible to attach this to a Thunderbolt 3 docking station to backup your laptop when you are in the office.",
    "The only caveat to doing that is that the bandwidth of that interface is shared between multiple devices, and if you use display outputs through the docking station it won’t leave enough for the very best speeds on this hardware.",
    "One minor annoyance is that the provided carry pouch is big enough for the drive but doesn’t have the extra room needed for the thick cable.",
    "Why nobody noticed this we’re unsure, but it needs a bigger pouch or a redesign that allows for the cable to be stowed for transportation.",
    "Currently finding the 2TB version of this drive outside the USA isn’t easy, although the 480GB and 1TB models can be found in most regions.",
    "The prices are $200, $419 and $499 for the 480GB, 1TB and 2TB models respectively, although we found the 1TB drive for $299 on Amazon.com.",
    "For those thinking that $499 is steep for 2TB storage, the Samsung X5 Portable SSD 2TB has an MSRP of $849.99 and a typical retail price of $799.99 for the same capacity and similar performance.",
    "With so few external drives of this speed available, the Plugable Thunderbolt 3 2TB NVMe SSD looks like a bargain.",
    "This device is promoted for its raw speed, and it doesn’t disappoint.",
    "We’re recently reviewed the Crucial X8 SSD and CalDigit Tuff Nano SSD that both offer sub-1,000MB/s speeds using USB 3.1 interfaces, but the Plugable TB3 leverages the additional bandwidth in the Thunderbolt 3 interface to truly deliver the full remit of NVMe PCIe 3.0 performance.",
    "We typically saw read speeds over 2,800MB/s and write performance above 2,000MB/s on a range of tests. However, to achieve this on a Windows 10 PC did require some tweaking of the system.",
    "Specifically write caching, disabled on removable drives by default, must be activated or the write performance will be closer to 550MB/s writing.",
    "Those that do this must be very careful that they properly remove the device using ‘Eject’ as unwritten data might still be in the cache if you unceremoniously yank it out.",
    "The need for this change and the lower write performance shown by AS SSD tests indicate that the M.2 SSD inside the Plugable TB3 has the same problem sustaining write performance as most retail NVMe drives. Because once the write cache is saturated the speed drops the best the NAND modules can offer, significantly less than the cache.",
    "This limitation isn’t an issue unless you write very large files that exceed the capacity of the cache, and it is something that, with the possible exception of Intel Optane memory, challenges all NAND storage devices.",
    "It might well be possible to make a faster external SSD using multiple USB or Thunderbolt channels or an NVMe PCIe 4.0 drive, but at the point of writing this review, Plugable certainly offers one of the quickest available, and very close to the performance of the Samsung X5 portable SSD.",
    "There are many superlatives we could use to describe what Plugable has created, but it is, without doubt, one of the fastest external drives ever created that didn’t use RAID or some other technical trickery.",
    "The design ambition to create external storage without compromising its speed has been successful if you are willing to accept a few important limitations when using it.",
    "One prerequisite is a Thunderbolt 3 port with 40Gbit/s of bandwidth available to transport the data stream, and while it will work with a 20Gbit connection and USB 3.2, not using Thunderbolt 3 will impact on the peak maximum transfer speeds.",
    "Because of the amount of power that running Thunderbolt and an NVMe drive at this speed requires, any laptops should be connected to mains power when working with the drive, as it will drain the battery more rapidly than most external drives would.",
    "And finally, the host computer must have a very high-performance NVMe SSD installed. Because using anything slower would be a bottleneck for any data movements between it and the Plugable TB3 2TB.",
    "If you can get all those ducks in a row and spending $499 on a 2TB drive doesn’t require senior staff approval, then you could experience the remarkable speeds on offer here.",
    "For the more budget-conscious, this device hints at what everyone is likely to experience in the future when USB offers 40Gbit/s, or Thunderbolt becomes more popular."
  ],
  "headers": {
    "3": "Design",
    "11": "In use",
    "17": "Competition",
    "21": "Performance",
    "29": "Final verdict"
  },
  "links": {}
}