{
  "source": "https://www.techradar.com/reviews/pilot-era-8k-360-degree-vr-camera",
  "title": "Pilot Era 8K 360-degree VR Camera review",
  "category": "computing",
  "updated": "2019-07-29T18:15:24Z",
  "author": "steve-paris",
  "summary": "Could this be the 360-degree camera you’ve been looking for?",
  "verdict": "Pilot Era has some annoying flaws – which seem to just mysteriously disappear by themselves in some cases – and these glitches mar an otherwise excellent product which produces photos and videos of great quality.",
  "pros": [
    "Easy to use",
    "Produces great photos and videos"
  ],
  "cons": [
    "Odd, occasional, non-repeatable glitches",
    "Can get very hot",
    "Best to shut it down between uses"
  ],
  "article": [
    "Check out this device's website, and you’ll see that Pilot Era is a VR camera which can record 360-degree photos or videos in up to 8K, or livestream in 4K without needing to be connected to a computer. The hardware sports 512GB of storage, gyroscope stabilization, a powerful 7,200mAh battery, wireless connectivity, and it’s even compatible with Google’s Street View.",
    "In order to perform its recording feats, Pilot Era comes with four fish-eye cameras, one on each side of its large rectangular body.",
    "This device is powered by Android-based software, with the review model running the latest version at the time: 4.8.0.",
    "The device is controlled via a small touchscreen. If you know how to use a mobile phone, you’ll have no problem getting to grips with this camera. But you’ll need sharp eyes or a magnifying glass to read some of the text labels in Camera mode (thankfully you can guess their functions by their icons, anyway), and precise finger control to move sliders.",
    "When you start up the device, you’re graced with four large icons: you can access the Camera to take new shots, tap on the Gallery to see previously shot images, whereas Live lets you stream to social media (as long as you’re connected to a network, of course, either via Wi-Fi, 4G or Ethernet), and Settings is where all your preferences are stored.",
    "The Camera section offers you multiple options:",
    "These options are pretty much self-explanatory going by their titles. By default, Timelapse records at 20x but you can change that in the settings from 10x to 10,000x, and you can choose the resolution from 2K to 8K (default is 8K).",
    "Unstitched video resolution ranges from 4K at 30 fps to 8K at 24 fps, whereas stitched video resolution differs, and ranges from 2K at 30 fps to 8K at 7 fps.",
    "The idea of unstitched video is that the device can use better but slower algorithms to connect the videos together, later on.",
    "Live enables you to broadcast live, without needing to connect the camera to a computer. You can connect directly to several social media sites such as Facebook, YouTube, Weibo, Pi Live, or a self-built RTMP server.",
    "All video options have a PilotSteady feature which, when turned on, helps stabilize your shot and minimize motion when moving the camera around.",
    "Finally, the Google Street View setting allows you to choose the frame-rate from 1 fps to 7 fps, and have footage you can upload to Google to strengthen its Street View feature… as long as you don’t mind working for one of the richest companies in the world for nothing.",
    "Every one of these camera options has a ‘Pro’ button, lower left of the screen, which you can use to control the ISO and exposure. By default, they’re both set to ‘auto’. This is also where you can alter the Stitching Focus: you can improve the seamless effect through this slider – towards infinity for outdoors, and down to 2m for indoors.",
    "To cycle between the various view modes (Little Planet, Equirectangular, Fisheye, Rectilinear), just double-tap on the screen or tap on the icon top right of the interface.",
    "Taking a photo or video is completely straightforward: you can either press the large red button on the screen, or the physical shutter button on one of the sides (the one on the right side of the screen).",
    "The stitched shots can be previewed immediately in the Gallery. The unstitched ones will need some processing time before you can do that.",
    "As with all 360-degree footage, it is quite fun to be able to move the viewing angle as the video is playing. This of course works just as well for photos.",
    "In that respect, this camera does exactly what it says on the tin.",
    "One cool feature is the ability to control your Pilot Era with your phone. You can do this from either an iPhone or Android device.",
    "As long as you’re on the same Wi-Fi network, the connection is pretty much automatic: just select the Pilot Era you see on your phone’s screen and you’re good to go.",
    "Don’t be alarmed by the poor quality of the preview: this may seem off-putting, but doesn’t reflect the quality of the footage you’ll be taking – and at least you’ll be able to control your Pilot Era without being anywhere near it. You can also check the footage you’ve shot on a display that’s bigger than the tiny screen on the device. Do note though that most phones can only handle video resolution up to 4K.",
    "You can control the footage either by moving your phone (the gyroscope detects motion) or by dragging your finger on the screen. Both methods work remarkably well.",
    "You can also transfer files to your phone in this manner, so you don’t have to physically connect the Pilot Era to it.",
    "However, a physical connection is always better and faster, and it is possible to hook up Pilot Era to any computer via USB. Mac users will need to get the free Android File Transfer app in order to do this.",
    "Once on your computer, you’ll then be free to edit the footage in your favorite video editing app that’s compatible with 360-degree video files.",
    "The level of quality achieved will obviously depend on the resolution you’ve chosen in the camera’s settings, but overall, aside from the inevitable fish-eyed distortion effect you’ll see – especially if you handled the camera, meaning you’ll end up with freakishly long and thin-looking arms – the results are excellent.",
    "Because of this, it’s best to work with a tripod. The promo video shows people walking around with cameras sticking out of their backpacks on a special rod. However, that rod isn’t included with the hardware, so we used a regular stationary tripod instead in some of our tests.",
    "During our testing, we did encounter some inconsistencies and issues with the device. Our problems began with the interface becoming very unresponsive: we’d be able to shoot one video but after stopping the recording, the screen wouldn’t respond to our touch until the device was restarted.",
    "Then this glitch disappeared, but we noticed an obvious artefact at the join between two of the four cameras. It was as if one camera was more zoomed in than the other leading to an obvious seam between the two. This happened numerous times, and we witnessed evidence of this both while shooting and when playing the footage back… until this glitch just stopped, and everything became seamless, as it should.",
    "We also noticed that Pilot Era gets quite hot during use. On one occasion, we didn’t shut it down during transport, and instead placed it back into its box having pressed the button just long enough to only power down the screen. A few minutes later we reopened the case and the device was really hot. In an age when all our devices are put to sleep rather than shut down, it feels odd to advise that you should shut down this piece of hardware in between uses.",
    "This will also help prevent battery drain: our Pilot Era was fully charged last thing at night. We put it to sleep (not shut down), and by the time we woke it the following late morning, the battery charge level was down to 57%.",
    "Pilot Era has some annoying flaws – which seem to just mysteriously disappear by themselves in some cases – and these glitches mar an otherwise excellent product which produces photos and videos of great quality."
  ],
  "headers": {
    "2": "Software and interface",
    "5": "Shooting options",
    "14": "Take the shot",
    "18": "Remote control",
    "25": "Quality and issues",
    "31": "Final verdict"
  },
  "links": {
    "device's website": "https://www.pisofttech.com/"
  }
}