{
  "source": "https://www.techradar.com/reviews/ilife-w400-floor-washing-robot-review",
  "title": "iLife W400 Floor Washing Robot review",
  "category": "appliances",
  "updated": "2019-08-02T13:55:18Z",
  "author": "nick-rego",
  "summary": "Delegate the mopping to iLife",
  "verdict": "If you loathe the very idea of having to mop your floors, then then iLife W400 will do the job for you in a pinch. It’s decent at scrubbing out stubborn floor stains, though it depends whether you’re satisfied with just using water to wash your floors.",
  "pros": [
    "Good scrubbing action",
    "Large water tanks"
  ],
  "cons": [
    "Can’t be used with detergents",
    "Won’t fit under some furniture"
  ],
  "article": [
    "Household chores like vacuuming are a lot easier to do these days, thanks to robot vacuum cleaners and cordless hoovers like the Dyson V10. Mopping your floors, too, has got the high-tech treatment, thanks to floor mopping robots such as the iLife W400 Floor Washing Robot.",
    "It’s certainly a useful gadget to have for high-traffic areas or even for places that you don’t particularly feel like mopping yourself, such as the bathroom. We decided to put the W400 through some serious tests to see if it really could be your next big gadget purchase.",
    "The iLife W400 retails for $249.99 (around £200, AUD$355) and is available via Amazon. That’s quite a bit cheaper than say the iRobot Braava Jet M6, which retails for around $499.99 (around £400, AUD$711).",
    "If you're ordering outside the US, you'll want to go through AliExpress, which ships from various suppliers in the EU and Asia (you'll want to ship from Spain for UK delivery). The Amazon UK listing is around double the price at £419.",
    "While the iLife W400 forgoes things like app support and automatic charging, it does prove its worth in being an easy to use device with one-button operation. If you just need a no-frills mopping robot that does what it’s supposed to, then the iLife W400 is a straightforward choice.",
    "The iLife W400 doesn’t stray far from traditional robot vacuum cleaner designs – it’s black and round, though with some serious height to it. That height is both a blessing and a curse – it’s a necessity in order to house the two large tanks for clean and dirty water, but the increased height means that the W400 may have some issues with fitting under certain kitchen cabinets or in tight spaces in a bathroom such as near a toilet.",
    "At the top you’ve got a handy carry handle for picking up the W400 and positioning it where you want it to start cleaning. There’s also a small indicator for the water and battery levels, and a button to change the W400’s cleaning mode.",
    "Underneath you’ll find the washable fiber roller, which can be removed and washed by hand after a cleaning cycle. iLife ships two in each box, so while one roller is drying, you can equip another one to clean. You also get a few cleaning tools to help clean the tank and dislodge debris in the roller or any other parts of the unit.",
    "The W400 will obviously need charging before you start using it, and iLife says that a full charge will let you clean for about 80 minutes or so. Charging is a manual affair, rather than something it does automatically: simply pick up the W400 and set it snugly on the charging dock.",
    "The W400 consists of two parts – one part is the actual mechanics of the robot, and the other is the removable water tank that can be disconnected from the main unit body with a simple push of a button. The tank itself is split into two parts, one for clean water which can hold 0.85l, and another 0.9l tank that holds the dirty water that's sucked up during cleaning.",
    "You can choose between four cleaning modes before the W400 goes on its merry way.",
    "Path mode is the best by default, sending the W400 in a systematic path forward to clean a large area. The Area mode puts an invisible wall behind the W400, so it only cleans the area in front of it. Spot mode is good for cleaning up a specific area quickly by using a circular motion, while Edge mode will – as the name suggests – only follow and clean along edges. There’s also a bundled remote should you want to position the W400 manually before setting it off on a cleaning spree.",
    "Helpful voice prompts often pop up on the W400, which indicate when the device is done charging, or when the water tank needs changing. You’ll be able to clean a full 35 square meters on a full tank of water, and you can change the water tank half-way through a cleaning cycle if the W400 prompts you to do so.",
    "Path-finding for the W400 is an interesting affair. While more complex vacuum cleaners uses mapping and scanning technologies to create and track the areas being cleaned, the W400 relies on bumping gently against items to maneuver, as well as a slightly tricky internal system to ‘map’ out where it’s been and where it started from. It’s a system that works fairly well, though in some of our test runs we found the W400 doubling back on itself by accident to clean an area that it had already passed through.",
    "The W400 is ideal for tiled, wooden, or composite floors, and uses a four-step system to clean as it moves. First, it sprays down water on the floor, after which the fiber roller scrubs away to remove dirt and stains. A powerful vacuum then sucks up the dirty water off the floor, after which a squeegee scrapes away any residual water.",
    "While we were skeptical at first of the W400’s cleaning capabilities with just using water, our doubts were soon put to rest once it started cleaning. Dried up ketchup stains, spilled coffee, and even dog slobber from a canine visitor earlier in the week were all easy to tackle by the W400. The device really does do a good job of actually getting the muck off your floors in a single pass.",
    "As mentioned before, a full water tank will let you clean about 35 square meters of space. You can proceed to clean another space on the same battery charge, but the W400 will prompt you to clean out the tanks first before doing so.",
    "Cleaning the tank is simple: just open the discharge spout to pour out the dirty water, rinse both tanks with clean water, and you can fill it up again for another cleaning cycle.",
    "The W400 isn’t something you’d want to turn on and walk away from, though. At one point during testing it tried to go under a kitchen storage unit and got stuck, and in other instance it bumped into a laundry stand and got one of its wheels stuck. Because there’s no app support, you won’t get alerts if the W400 runs into an issue with cleaning if you’ve set it off as you leave your house, so it’s best to quickly run this when you’ve got a spare bit of time on the weekend.",
    "Overall the W400 cleans quite quietly, with just a gentle humming noise that’s easy to drown out with a pair of headphones or even just the sound coming from your TV.",
    "The only sticking point with the W400 – which runs true to most floor mopping robots – is that you can’t use detergent with the water tanks. iLife strongly advises against adding any kind of cleaner to the water tanks, as this can build up residue inside and damage the water outlets.",
    "It’s a real shame, because for most of us, mopping the floors involves using some sort of floor cleaner or anti-bacterial agent. Mopping your floors with water may clean them up, but they certainly won’t be free from bacteria. A suggestion might be to spray a mild floor cleaner or anti-bacterial solution on the floors prior to letting the W400 mop it all up, but again we’re not sure what this might do to the W400’s internals.",
    "The other point to note is the W400’s size – it might not be able to get under certain kitchen cabinets, and definitely can’t manoeuvre the tight spaces near a toilet, so you’re still going to top up these areas manually with a mop. Another area to address is that the W400 doesn’t properly hit corners when cleaning, so again if you find dirt accumulating here, you’re going to have to bust out the mop.",
    "The lack of any kind of app support also means that you can’t let the W400 run around in mixed spaces that have carpet for example. You’re again going to have to manually mop these areas yourself or remember to move everything out of the way before the W400 starts cleaning.",
    "Watching the iLIfe W400 Floor Washing Robot furiously scrubbing away at our floors was certainly enjoyable, and at the end of the day we were left with clean floors and a surprisingly dirty tank of water. It’s a good solution for a quick and effective clean of your kitchen or high-footfall areas rather than your entire home.",
    "The downside is that the W400 might not be able to clean all areas of your home, due to its simple pathfinding and obstacle avoidance skills, so you shouldn’t throw out your mop just yet. The inability to use any kind of floor cleaner is also an important point, since there are plenty of households who wouldn’t want to mop their floors with just water.",
    "If you’re after a no-frills robot floor cleaner that’s good for large open spaces, then the iLife W400 will be more than happy to mop up all of your messes."
  ],
  "headers": {
    "2": "Price and availability",
    "5": "Design",
    "9": "Features",
    "14": "Cleaning",
    "24": "Final verdict"
  },
  "links": {
    "robot vacuum cleaners": "https://www.techradar.com/news/best-robot-vacuums",
    "cordless hoovers": "https://www.techradar.com/news/best-cordless-vacuum-cleaner",
    "Dyson V10": "https://www.techradar.com/reviews/dyson-cyclone-v10",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FILIFE-W400-Cleaning-Assistance-Bathroom%2Fdp%2FB07P5F3G2V%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1273657377686285300-20",
    "AliExpress": "https://www.awin1.com/awclick.php?awinmid=6378&awinaffid=103504&clickref=trd-us-1277425429178388700&p=https%3A%2F%2Fwww.aliexpress.com%2Fitem%2F32929055606.html"
  }
}