{
  "source": "https://www.techradar.com/reviews/google-home-max",
  "title": "Google Home Max review",
  "category": "audio-visual",
  "updated": "2019-12-04T11:54:33Z",
  "author": "cameron-faulkner",
  "summary": "A big speaker that nails the small touches",
  "verdict": "If your space is in need of some more sound, there are plenty of speakers that could fit the bill. But Google’s latest creation is among the smartest around for the price and its clever design lifts it above the competition.",
  "pros": [
    "Sounds incredible",
    "Works with Google Cast products",
    "Bluetooth-compatible"
  ],
  "cons": [
    "Google Home app isn’t always responsive",
    "Quite heavy"
  ],
  "article": [
    "If you've been waiting for a high-end smart speaker to come along that has built-in Google Assistant support, and you're against the low-sonic prowess of the Google Home, Google Home Mini or Chromecast Audio, then the Google Home Max could be your next best friend.",
    "The $399 / £399 / AU$549 plus-sized speaker comes bearing Google’s minimalist aesthetic and delivers a resounding punch to your wallet – though the premium sound on offer is just what you'd hope for the price.",
    "It's not clear at first who the Google Home Max would be best suited to. It might not tempt true audiophiles, given you can load up on a high-quality receiver and some bookshelf speakers for near the same cost, but Google’s commitment to excellent sound delivery and support for high-fidelity file types – FLAC, LPCM, and HE-AAC, among others – is second-to-none.",
    "As always, it all falls back to the source to dictate how the end result will sound. But even with music streaming over Google Play Music, the Google Home Max sounds luscious enough to justify its cost.",
    "The Max debuted in the US on December 11 2017 for $399 / AU$549 (around £300) and as of 16 May 2018, it has finally made its way to Canada. Australia was the next stop on the Google Max world tour, launching a few months later on August 9, before hitting the UK on August 30.",
    "It was a similar story when the original Google Home was first announced. Like the Max, the speaker was originally exclusive to North America, before making its way to other territories after around six months.",
    "The Home Max is a product that looks like it comes straight from Libratone or Bang & Olufsen’s catalogue. In a few words, it’s massive and nondescript. But between the muted mesh grille and off-white chassis, the almost total absence of style here, oddly enough, makes it super stylish.",
    "Sitting next to the Google Home and Home Mini, the Max is massive. At 11.6 pounds (5.3kg) and coming in at the size of, well, a big speaker, you can tell that the Home Max is clearly the biggest, most powerful speaker in the family.",
    "It can stand vertically oriented or horizontally without fear of scuffing your furniture thanks to the included magnetic resting pad, a fantastic idea that brings surprising versatility to the Max should you need to shift it around your living room.",
    "Cleverly, the speaker’s touch controls adapt to the orientation that you’ve selected. Sitting horizontally, moving your finger left to right increases the volume. But if it’s sitting upright, it flips the motion so that moving your finger down toward the surface will quiet it.",
    "Like the other Google Home products, the Max contains an array of lights that shows when you utter “Hey Google” or “OK Google”.",
    "If you’re looking for other showy design elements, you won’t find them, except for the six far-field microphones planted around the Max, as well as its rear-facing ports – the latter of which you can find in spades.",
    "Around the back, you’ll find a switch to toggle the microphone and a spare USB-C port for charging, say, your Pixel 2 or any other compatible device.",
    "As we saw at Google’s October 2017 event, the Home Max can use a USB-C to Ethernet dongle to put together a more reliable wired connection. There’s also a trusty 3.5mm jack to satisfy those who have analog devices to hook up.",
    "Google has seemingly satisfied the audio-hungry masses with its Home (capable of surprisingly good audio throughput) and Home Mini (decent, but fits in best alongside other Cast-enabled speakers), but with a name like “Max” it’s new speaker is gunning for a particular crowd of music lovers.",
    "In order for the Max to be worth it, it must not only be able to deliver the same Google Assistant that we know and (mostly) love, but it then has to get loud as heck while sounding good in the process.",
    "The good news it that, as long as you have the physical space and budget for it, this speaker passes with flying colors - sound comes through with a rich, layered quality from the moment that it’s plugged in.",
    "But what about those of us who live in smaller apartments? Is the Max too powerful for us? Small spaces are actually the perfect place to try out Smart Sound, Google’s algorithm that allows the speaker to automatically tweak equalizer settings to push out the best sound depending strictly on what the layout allows for, as picked up by its internal microphones.",
    "If this sounds familiar, it’s because it’s reminiscent of what Apple talked up with its Apple HomePod. Though, it’s worth mentioning that there’s no audio chime to let you know when the speaker has been calibrated, so how does one tell if and when Smart Sound has triggered?",
    "We haven’t figured it out, but so long as the tunes are sounding right, it seems to have done its job.",
    "Both at quiet and loud volumes, it’s expertly tuned in such a way that the highs and lows in the mix never trip over each other.",
    "The sound fills the room, especially if you have other Google Cast-enabled speakers to help out. But even by itself, it’s plenty strong enough to bring the party – even if it’s not capable of 360-degree sound like the Apple HomePod.",
    "Using the Home Max requires your voice to call up the tunes, or you can do things strictly on your iPhone, Android device or tablet by tapping the Cast button in your favorite streaming app.",
    "Thankfully, with it being a Google Assistant-driven product, we’ve had success issuing commands to the Max at normal speaking volumes while it’s piping loudly.",
    "Can you ever overdo Google Home devices, even if your home is very small? The Google Home Max has proved that the answer is now.",
    "Although massive, the Max makes for a surprisingly versatile addition to a space of any size, thanks to its balanced, awesome sound delivery and Smart Sound function, which helps it adjust to any environment you set it up in.",
    "In fact, Google’s big speaker is much more elegant than it has any right to be, what with clever touches like the moveable resting pad and orientation-friendly touch functions. It’s also appreciated that its looks stand out if you choose to notice it, but blend into the scene during everyday use.",
    "The main point working against the Max is its price. At $399 / £399 / AU$549 many will be better off purchasing a Google Home and supplementing it with a soundbar equipped with a Google Chromecast Audio or Chromecast Built-in.",
    "Then again, if you’re serious about audio, you’re already aware that price isn’t anywhere near the high ceiling set by audiophile-grade equipment."
  ],
  "headers": {
    "4": "Google Home Max price and release date",
    "6": "Design",
    "14": "Performance",
    "24": "Verdict"
  },
  "links": {
    "Google Home": "https://www.techradar.com/reviews/google-home",
    "Google Home Mini": "https://www.techradar.com/reviews/google-home-mini",
    "Chromecast Audio": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-audio-1305396/review",
    "Apple HomePod": "https://www.techradar.com/reviews/apple-homepod-review"
  }
}