{
  "source": "https://www.techradar.com/reviews/amazon-fire-tv-2017-review",
  "title": "Amazon Fire TV (2017) review",
  "category": "audio-visual",
  "updated": "2019-03-14T12:14:47Z",
  "author": "matt-hanson",
  "summary": "A tiny 4K and HDR streaming box",
  "verdict": "The Amazon Fire TV (2017) is the latest version of Amazon’s streaming box, and comes with a fantastic new redesign, plus support for 4K HDR content and Dolby Atmos soundtracks.",
  "pros": [
    "Great design",
    "HDR support",
    "Future proof with Dolby Atmos",
    "Good price"
  ],
  "cons": [
    "Lack of Dolby Atmos content",
    "Volume control missing from remote",
    "Not as much 4K content as Apple TV"
  ],
  "article": [
    "Update: The 2017 Amazon Fire TV is no longer on sale from Amazon. The closest match is the new Amazon Fire TV Stick 4K, or its cheaper HD alternative, the Amazon Fire TV Stick. Or, for a Fire TV device that can stream video AND act as the centre of your smart home, you'll want the Amazon Fire TV Cube (currently only available in the US).",
    "Otherwise read on for our 2017 review of the Amazon Fire TV...",
    "If you haven't jumped onto the smart TV bandwagon just yet, and you'd still like to access quality content from streaming platforms, Amazon Fire TV could be the perfect solution.",
    "While the Fire had been lacking 4K and HDR content in the past, the 2017 refresh has made the Fire TV an all-singing, all dancing 4K TV HDR streamer.",
    "Earlier Amazon Fire TV devices have been an incredibly popular way of streaming content to people’s TVs thanks to their plug-and-play simplicity, as well as broad support for various channels and media platforms.",
    "Its popularity compared to the competing Google Chromecast could be due to the fact that Google denies its users access to the Amazon Prime Video service, with the Amazon Fire TV is far more generous with allowing access to competing services, including Netflix, Spotify and more.",
    "The Amazon Fire TV (2017) comes in a completely redesigned body that’s compact enough to hide behind your TV, ditching the bulkier designs of previous models. This makes the Amazon Fire TV (2017) a discrete box of media tricks that can sit unobtrusively in your home while it entertains the family.",
    "[Update: Prime members can get an exclusive discount on the Amazon Fire TV, which is reduced to $39.99, representing a saving of $30. There are also savings to be made on the Amazon Kindle, Kindle Paperwhite, Fire 7 Tablet, and more.]",
    "The Amazon Fire TV (2017) retails for a price of $69.99 (£69.99 / AU$69).",
    "This is over twice the price of the latest version of the Google Chromecast, which costs £30/$30/AU$55, although the Chromecast does not come with a remote control, cannot access Amazon Prime Video and does not support 4K or HDR. This is the device you should maybe consider if you only have a 1080p TV, and don’t subscribe to Amazon Prime Video.",
    "The new Chromecast Ultra is more comparable feature-wise, though it still does not include a remote or access to Amazon Prime content. It does support 4K and HDR though, and costs £69/$69/around AU$90, which makes the Amazon Fire TV (2017) price seem much more reasonable.",
    "In fact, due to the cheaper price, similar compact design, 4K and HDR support and additional services and remote control – not to mention an easy-to-navigate user interface – the Amazon Fire TV (2017) does an incredibly good job of challenging the Google Chromecast Ultra to justify its price tag. Looking at the devices side-by-side, it’s not much of a competition, with the Amazon Fire TV (2017) easily beating the Chromecast Ultra.",
    "The design of the Amazon Fire TV (2017) is what really sets it apart from the earlier model. It’s been redesigned as a dongle that plugs directly into your TV’s HDMI port, and hangs from it.",
    "The previous version was a bit of a chunky black box that you’d need to place near the TV. While it wasn’t exactly an eye sore, the new version can be tucked away completely, so you wouldn’t really know it was there.",
    "Unlike the Fire TV Stick, Amazon’s smaller (and less feature-rich) dongle, the Amazon Fire TV (2017) requires a separate power connection, which does mean you’ll have an additional cable hanging from your TV. Unfortunate, but not the end of the world, and understandable considering the power required to display 4K HDR content.",
    "At 65.0 mm x 65.0 mm x 15.0 mm, the compact design of the Amazon Fire TV (2017) is subtle enough that it doesn’t stick out, even if it is on the display. Weighing just 87.1g also means it can hang from a HDMI port without putting pressure on the physical port. The attached HDMI connector is a flat, bendable, wire that gives you a bit more flexibility when plugging the Fire TV into a TV, especially one that's pushed back against a wall.",
    "The 802.11ac Wi-Fi antennae is contained inside the body, so there’s no ugly protrusions, and as long as you have a decent dual-band router with wireless AC support, that should be good enough for streaming 4K and HDR content. If you have a weak wireless signal, or an older router, you can buy an additional Ethernet adaptor for a wired connection.",
    "The design of the included remote control hasn’t changed, but to be honest it didn’t really need to, as it has an elegantly simple design that lets you scroll through the interface with ease – something that the Chromecast doesn’t offer.",
    "You can also use a free app to use your phone as a remote, or use Alexa voice commands to control playback. This is a big plus for anyone who has welcomed Amazon’s virtual assistant via the Amazon Echo range of smart speakers.",
    "Overall we were very impressed with the new design of the Amazon Fire TV (2017), rivalling the Chromecast in the petite size and looks department, while offering more power and features.",
    "Amazon has done a great job shrinking the size of the Amazon Fire TV (2017) without sacrificing power or features, and they should be commended for it.",
    "The interface is clear and easy to use, and thanks to the boosted hardware inside the Fire TV (2017), it feels smooth when in use as well.",
    "Everything is laid out clearly, and having a user interface marks it above the Chromecast, which needs you to launch apps from your phone.",
    "The interface works in a similar way to the Apple TV, which is much more expensive. The Amazon Fire TV (2017) offers content from a range of services in a clear and attractive manner.",
    "[Update: The Amazon Fire TV Stick now comes with a brand new Alexa-powered voice remote.]"
  ],
  "headers": {
    "7": "Price and release date",
    "12": "Design",
    "21": "Interface"
  },
  "links": {
    "new Amazon Fire TV Stick 4K": "https://www.techradar.com/news/amazon-fire-tv-stick-4k-packs-dolby-vision-and-hdr10-in-the-same-device",
    "Amazon Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "Amazon Fire TV Cube": "https://www.techradar.com/reviews/amazon-fire-tv-cube-2nd-generation",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "Google Chromecast": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-1305399/review",
    "Netflix": "https://www.techradar.com/best/best-netflix-shows",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Chromecast Ultra": "https://www.techradar.com/reviews/chromecast-ultra",
    "Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "Amazon Echo": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review",
    "Apple TV": "https://www.techradar.com/reviews/apple-tv-4k/2",
    "Alexa-powered voice remote": "https://www.techradar.com/news/amazon-fire-tv-stick-is-bundling-in-a-brand-new-alexa-voice-remote"
  }
}