{
  "source": "https://www.techradar.com/reviews/asus-rog-zephyrus-s-gx502",
  "title": "Hands on: Asus ROG Zephyrus S GX502 review",
  "category": "computing",
  "updated": "2019-04-23T13:00:25Z",
  "author": "joe-osborne",
  "summary": "Asus’s flagship gaming laptop (almost) goes back to basics",
  "verdict": "Asus’s new, back-to-basics design for its flagship gaming laptop is much appreciated, rising in power level without compromising much on thinness and weight. However, cutting the integrated webcam is sure to annoy many fans, us included. All told, the Zephyrus S GX501 takes the smartest innovations of the first model and hones them into a truly formidable mobile gaming PC.",
  "pros": [
    "Much more palatable design",
    "Excellent performance",
    "Fast display refresh and response"
  ],
  "cons": [
    "No integrated webcam",
    "Could use more USB-C ports"
  ],
  "article": [
    "Asus has gone and granted its flagship gaming laptop with a hearty revision, transforming its daring if flawed design into something much more familiar and no less powerful than before. This is the Asus ROG Zephyrus S GX502, an impressive device leading the pack of fresh Asus laptops for gaming in 2019.",
    "The laptop takes on a much more palatable design – that of a standard keyboard and mouse orientation – while only increasing in power, thanks to some innovative design elements that made the cut into this generation. Namely, Asus’s “Active Aerodynamic System,” a kickstand in the base that reveals a cooling vent underneath, gives the brand new Nvidia and Intel parts all the room they need for maximum possible performance.",
    "However, know that this year’s design will be quite pricey, a price that doesn’t include an integrated webcam (but one optionally included in the box) for the sake of thin screen bezels. But, before you make a snap decision on whether to buy this thing, see exactly what that price does get you.",
    "Unfortunately, we still know very little about what this ROG Zephyrus S GX502 will come with in its starting configuration much less its pricing writ large. However, we do know that the laptop will be available starting in June, like to coincide with availability of Intel’s 9th-generation mobile processors.",
    "With that, all we know is that all Zephyrus S GX502 configurations will include the Intel Core i7-9750H processor and up to Nvidia GeForce RTX 2070 graphics. That will be paired with as much as 32GB of 2,666MHz of DDR4 SDRAM and up to 1TB of M.2, NVMe PCIe 3.0x2 storage space.",
    "All of these parts will be accessed through a 15.6-inch, Full HD (1,920 x 1,080) IPS display with a refresh rate of up to 240Hz, a 3ms response time and 100% coverage of the sRGB color gamut that’s Pantone validated. Finally, the display will come with Nvidia’s anti-stutter G-Sync technology.",
    "As a follow-up to Asus’s ROG Zephyrus GX501 of 2017, the GX502 is quite different from its predecessor in terms of look and feel. While the metallic lid with the distinct ROG logo remain, the design is more subdued and in a deep black.",
    "Likewise, the keyboard deck is now dressed in a soft-touch paint over the magnesium alloy chassis, which helps repel fingerprints. Of course, the most glaring change is that this version looks like a standard laptop.",
    "Asus has moved the keyboard back to its original position rather than right up against the laptop’s front-most edge, with the touchpad tucked to its right. Of course, this means that the complimentary palm rest is gone, too, but the touchpad is back in its proper position.",
    "This, of course, makes the laptop 10 centimeters thicker than before, at 1.89cm, to make room for the Nvidia RTX graphics inside. That said, this version is actually lighter than the previous model by a hair, at 2.0kg even to the GX501’s 2.2kg – you can thank the magnesium alloy for that.",
    "Asus naturally included the kickstand beneath the base that automatically lifts the laptop up when opened, creating more room for air flow and thus stronger cooling to support these new, more powerful parts inside.",
    "With the keyboard and touchpad back to their normal positions and therefore much more comfortable, we’ll take a slight increase in thickness with no complaints. Speaking of which, we find the keyboard to be suitable for gaming and even ideal for typing, with punchy feedback for a set of laptop keys and a surprising amount of travel given the laptop’s short height. Likewise, the touchpad is smooth and accurate.",
    "This design leaves room for plenty of ports, still: three USB 3.1 ports, one USB-C 3.1 port, HDMI, Ethernet and two audio jacks. But, couldn’t just one more of those USB 3.1 ports been a USB-C part?",
    "We also enjoy the Zephyrus S GX502 display quite a bit – especially while gaming. Again, the 15.6-inch panel comes clocked with a refresh rate of up to 240MHz at 1080p resolution, and it supports Nvidia’s G-Sync anti-frame-stuttering technology as well as a 3-millisecond response time.",
    "This is a fine display for gaming, especially for high-speed games such as battle royale shooters and racing games – and it will help videos look that much smoother at 60 frames per second, which YouTube has supported for years.",
    "However, you might have already noticed that the Zephyrus GX502 strangely has no webcam. Asus has done this before in its gaming laptops, like the Zephyrus GX701, including an attachable webcam in the box as an option. This will no doubt be a divisive move, as many expect a webcam as a core part of the laptop experience, while others will welcome it as an option for the sake of a smaller laptop overall. If you ask us, we’d rather Asus just work around an included webcam.",
    "As for how we expect this laptop to perform in real-world use, we can say that the laptop will be able to handle all the latest games at high to ‘Ultra’ settings without much impact to frame rate smoothness while at 1080p resolution. In fact, Asus isn’t even offering a higher resolution on this laptop.",
    "We were able to briefly play some Battlefield V on the laptop during a press preview event, and the game run without a hitch at the maximum settings with ray tracing activated. This gives us confidence that the GX502 will last gamers for about as long as it took Asus to release this model after the GX501 debut, though you’ll probably be able to push it a bit further before an upgrade.",
    "Again, all versions of the Zephyrus GX502 will come with the new Intel Core i7-9750H processor, which is a hexa-core part with capacity for limited overclocking. That should give gamers a bit more of an edge in physics-heavy games.",
    "However, we did notice that the GX502 gets mighty loud while playing games, with the fan(s) whirring at a volume high enough to be noticed over the din of the press preview event. Imagine that level of fan noise in your quiet home – not exactly exciting.",
    "Asus hasn’t mentioned any battery life figures, but lists the laptop’s battery capacity as 76 Watt-hours, and that it’s rechargeable via USB-C as well as the included AC adapter.",
    "We deeply appreciate the new design direction for Asus’s flagship 15-inch gaming laptop. Bringing the keyboard and touchpad back to a normal orientation in the name of gaining a few centimeters in thickness was a smart move, and barely detracts from the thin-and-light gaming laptop experience made possible by Nvidia’s Max-Q graphics chip designs.",
    "This makes for an almost infinitely more comfortable gaming and typing experience without much, if any, compromise. However, we are put off by the lack of an integrated webcam, as it’s an undeniable element of laptops the world over that doesn’t need to be challenged.",
    "Otherwise, we’re looking at the next logical evolution of Asus’s premiere gaming laptop, taking the smartest innovations of the first and honing them into a truly formidable mobile gaming PC. Of course, that’s something you’ll pay dearly for, which we’ll judge the value of in a full review."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "16": "Performance",
    "21": "Early verdict"
  },
  "links": {
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Asus laptops": "https://www.techradar.com/news/best-asus-laptops",
    "ROG Zephyrus GX501": "https://www.techradar.com/reviews/asus-rog-zephyrus",
    "Zephyrus GX701": "https://www.techradar.com/reviews/asus-rog-zephyrus-s-gx701"
  }
}