{
  "source": "https://www.techradar.com/reviews/funcl-w1-true-wireless-earbuds-review",
  "title": "Funcl W1 true wireless earbuds review",
  "category": "audio-visual",
  "updated": "2019-05-13T16:00:24Z",
  "author": "henry-st-leger",
  "summary": "Great earbuds at an unbelievably cheap price",
  "verdict": "The Funcl W1 earbuds are easily the best earbuds you can get for the money, with impressive sound and easy-to-use touch controls. Seriously, how are these so cheap?",
  "pros": [
    "Dirt cheap",
    "Very light",
    "Responsive touch controls"
  ],
  "cons": [
    "Some connectivity issues",
    "Basic design",
    "Short charging cable"
  ],
  "article": [
    "Funcl first came on our radar with the launch of the Funcl A1s: true wireless earbuds that offered the features and sound quality of a product twice the price. Somehow, Funcl has managed to repeat the trick with the Funcl W1 earbuds, which cost even less but retain the same sound quality and impressive roster of features.",
    "The design is slightly different from the previous model, but you’re still getting a fantastic deal for the cost. So what makes the Funcl W1s so good, and why might you consider them over last year’s A1s?",
    "The Funcl W1 earbuds retail at $49 (around £50 / AU$70) and ship globally from funcl.com. That’s a decent amount below the Funcl A1s, which cost $79 (around £60 / AU$110). Both models are available in either black or white finishes.",
    "The Funcl W1 earbuds aim squarely at simplicity. The bold ‘f’ logo from the A1s is barely visible here, needing to catch the light to show off the branding. You’re not buying these earbuds for their looks, but the design is also inoffensive enough that it’s hard to complain much about their appearance.",
    "Out of the box you get a white plastic charging case with a USB-C port and compatible charging cable; we also got an incompatible micro USB cable in our box, though this isn’t officially listed. The buds themselves click into place via magnetic charging points, and the design is such that both buds can fit into either slot, saving you any potential confusion.",
    "The buds are also impossibly light, which makes for a highly comfortable fit. Unlike some other true wireless earbuds out there, the W1s are at little risk of falling out, and don’t need wing tips or a cable to keep them in place.",
    "The design of the A1s is closer to that of the Apple AirPods, with a ‘stick’ that hangs over the lower part of the ear. The W1s ditch that for a more generic look, but it means the earbuds are less conspicuous and take up less space – if that’s what you’re after.",
    "The main difference between the A1s and W1s is in the battery life. Whereas the A1s deliver six hours of use from a single charge, the W1s only give you 4.5 hours. It’s not a huge difference, and the charging case adds triple that number for a total of 18 hours when you’re out and about, although you will have to spend some time charging them between uses.",
    "We found that was more than enough for light daily use on our commute, although we were disappointed by the short USB charging cable, which only measures a couple of inches, resulting in some awkward dangling of the case from the side of our PC.",
    "The Funcl W1s offer the latest Bluetooth standard (5.0) and automatic pairing for quick listening out of the case. The sound quality is also surprisingly good for the price.",
    "These earbuds don’t match the aptX audio format of the A1s, which are better for higher-resolution audio, but the audio is still very clear – and our session listening to Billie Ailish packed in a surprising amount of bass and reverb. Very high frequencies can sound a bit thin, though, and voice calls are flat-out tinny (your handset speaker is probably better).",
    "While there’s a finite amount of audio detail, the Funcl W1s somehow manage to keep the detail that matters: tracks still sound faithfully reproduced, even if they’re missing some of the nuance you’d get with more premium drivers.",
    "The touch controls are also brilliantly responsive, requiring only a light tap. Just tap the right earbud once to play / pause, twice to skip forward, and thrice to skip back. For picking up or ending calls, tap once on the left, or tap twice to talk to your source device’s smart assistant.",
    "Funcl keeps things simple by delegating the volume controls to your smartphone / source device, giving you fewer inputs to fiddle with on the earbuds themselves. We found we rarely had to alter the volume between tracks, or in the middle of a podcast, and reaching for our phone when we did need to wasn’t much of an inconvenience.",
    "When we reviewed the Sennheiser Momentum True Wireless earbuds last year, changing the volume through the earbud was one of its most frustrating – and uncomfortable – features, requiring you to prod the earbud into your ear and guess how long you needed to hold your finger down; Funcl’s design choice makes for a far more enjoyable experience.",
    "We do still have some mild concerns over connectivity. The W1s connect first via the left earbud, which then connects to the right, and we experienced occasional dropouts during the few days we spent in testing. At one point we stopped being able to connect to the right earbud altogether, though a factory reset managed to solve the issue quickly enough.",
    "The Funcl W1 earbuds are brilliantly cheap, without skimping on sound or the features on offer. You’d be hard pressed to find a better deal, and if the small difference in battery life isn’t an issue for you the W1s seem an even better deal than the A1s that brought Funcl to our attention last year.",
    "Connectivity isn’t as reliable as on some more expensive true wireless models out there, and the Apple AirPods or RHA True Connects are probably your best bet if you have more cash to spare. At this price point though, it’s very hard not to recommend the Funcl W1s.",
    "All image credits: TechRadar"
  ],
  "headers": {
    "2": "Price and availability",
    "3": "Design",
    "9": "Performance",
    "16": "Verdict"
  },
  "links": {
    "Funcl A1": "https://www.techradar.com/reviews/funcl-ai-true-wireless-headphones-review",
    "funcl.com": "http://funcl.com/",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "higher-resolution audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Sennheiser Momentum True Wireless": "https://www.techradar.com/reviews/sennheiser-momentum-true-wireless-review",
    "RHA True Connects": "https://www.techradar.com/reviews/rha-trueconnect"
  }
}