{
  "source": "https://www.techradar.com/reviews/huawei-mediapad-m5-pro",
  "title": "Huawei MediaPad M5 Pro review",
  "category": "tablets",
  "updated": "2019-01-07T02:03:08Z",
  "author": "basil-kronfli",
  "summary": "Should you go pro?",
  "verdict": "The Huawei MediaPad M5 Pro breathes much needed life into the premium Android tablet world, toting a pen in the process. It’s also a good tablet, despite imperfect software in places and a reliance on a keyboard case for it to be a true productivity tool.",
  "pros": [
    "Premium design",
    "Excellent speakers",
    "Good value"
  ],
  "cons": [
    "EMUI is heavy",
    "Half-baked software in places",
    "Mediocre camera performance"
  ],
  "article": [
    "Update: After Google suspended Huawei's future access to Android Play Store and security updates, there are serious question marks over the future of Huawei and Honor phones.",
    "While Google and Huawei have promised to support phones currently on the market, it's not clear how long they'll receive Android updates or access to the Google Play Store, which would severely curtail their usefulness compared to the competition.",
    "Huawei’s 2018 tablet range has a lot going for it on paper. The Huawei MediaPad M5 8.4 and 10.8 are metal-bodied multimedia powerhouses that undercut Apple’s iPads, while the MediaPad M5 Pro features a pen capable of taking advantage of up to 4,096 levels of screen sensitivity.",
    "And when paired with a keyboard, the interface can transform into a desktop UI for a better multitasking experience.",
    "As a result, it’s safe to call the M5 Pro a flagship tablet. It has a metal body, light-catching diamond cut edges and antenna strips normally associated with premium smartphones. There’s also 64GB of storage and it comes in a 4G version too.",
    "In the box, you get the tablet, a quick charger and a USB-C to 3.5mm adaptor, as well as the pen. That said, you don’t get the keyboard folio case, an accessory you will definitely want to pick up if you’re thinking about using this tablet as a productivity tool.",
    "If you’re looking to pick an M5 Pro up, the tablet’s price starts at €499 for the 64GB storage option or €549 for 128GB. For added LTE connectivity, there’s a €50 premium on each, so the 64GB version will set you back €549 while the 128GB version will set you back €599.",
    "We’re speaking in euros because the Huawei MediaPad M5 Pro hasn’t officially launched in the UK, US or Australia, though in the former it can be found in some stores, from around £400 (roughly $510 / AU$700).",
    "We’ve had less luck finding it on sale in the US or Australia and in all cases the standard Huawei MediaPad M5 8.4 and M5 10.8 are more widely available.",
    "Putting that price into context, the Samsung Galaxy Tab S3 can be found from around $470 / £400 / AU$600 for the Wi-Fi variant with 32GB of storage - half the storage of the base model M5 Pro, while the iPad Pro 10.5 costs £619 / $649 / AU$979 for the 64GB Wi-Fi variant.",
    "Of course, you’ll pay even more for the newer Samsung Galaxy Tab S4 and iPad Pro 11, but arguably the Huawei MediaPad M5 Pro isn’t competing with those quite so directly.",
    "So from the start, we know the MediaPad M5 Pro is well priced for a flagship tablet, despite not being cheap - but is it good enough to be a serious contender to Apple and Samsung’s slates?",
    "With a 10.8-inch screen, the MediaPad M5 Pro gives you more canvas than most of the 10-inch competition. It sports a traditional tablet form factor with minimal distraction - just the screen, a small selfie camera - only really noticeable on the white variant, a Huawei logo and a fingerprint scanner.",
    "Far from being bezel-free, the tab has a good centimeter of framing around the display. This would be obscene were the M5 Pro a phone, but in the world of tablets, that isn’t bad going at all - 76.1% screen-to-body ratio, compared to 78.3% on the iPad Pro 10.5 and 72.7% on the Galaxy Tab S3.",
    "In addition, the 2.5D glass elegantly rounds off into the metal body, making for a pretty sensational in hand experience when your thumb brushes from glass to metal and back to glass. Huawei is flexing its smartphone design muscles with the MediaPad M5 series to great effect.",
    "As for physical highlights, a USB-C port and all the buttons sit towards the rear of the right hand side. On the one hand, this makes them invisible when looking at the tab head on - diverting no attention away from the screen.",
    "On the other, even after a week of using the M5 Pro, fumbling your way around the back of the side of the tab to find the buttons can be an awkward affair.",
    "The protruding camera bump on the back of the tab looks commanding, suggesting this tab has an excellent camera, while also preventing it from sitting flush on a surface when on its back.",
    "Grilles dotted around the rear of the M5 Pro showcase the speakers - no less than four at play here - while the gold metal connectors on the lower part of the tab’s back are for the optional keyboard folio case.",
    "In hand, the tablet is well weighted. It isn’t light at around 500g, but neither is it a beast, weighing in only marginally heavier than its competition, so generally speaking, from a design perspective at least, the 7.3mm thick M5 Pro is a rich, premium offering that keeps up with the competition.",
    "The Huawei Media Pad M5 Pro’s screen has a 2K resolution of 2560 x 1600. With the display measuring 10.8 inches the results are nice and sharp, with a pixel density of 280 pixels per inch.",
    "The screen is an IPS panel that offers good viewing angles and brightness levels. It’s very usable, even in bright conditions, with a good amount of punch given it isn’t an OLED display. White balance is fair and there are also a range of color balance options in the settings, so you can tune the screen to suit your own preference.",
    "If you look very, very closely, a slight patterning can be made out on the display. This could be the Wacom digitizer that enables pen input, or it could be the touch sensor. Irrespective, this is invisible to the naked eye unless closely inspecting the glass and doesn’t negatively impact regular us when the tablet is in-hand or on a lap.",
    "Night mode is also available for some added eye protection, and you can drop the screen’s resolution to save a little battery too.",
    "When it comes to tablets, we haven’t seen much progress from a screen point of view in the last few years, and the MediaPad M5 Pro doesn’t change that. What it does do though is the basics well, which should be enough for all but the most demanding tablet user. If that’s you, consider the Super AMOLED Galaxy Tab S4."
  ],
  "headers": {
    "6": "Huawei MediaPad M5 Pro price and availability",
    "12": "Design",
    "20": "Screen"
  },
  "links": {
    "Google suspended Huawei's future access to Android Play Store": "https://www.techradar.com/news/huawei-ban",
    "Huawei MediaPad M5": "https://www.techradar.com/reviews/huawei-mediapad-m5-84-review",
    "Samsung Galaxy Tab S3": "https://www.techradar.com/reviews/samsung-galaxy-tab-s3",
    "iPad Pro 10.5": "https://www.techradar.com/reviews/ipad-pro-105",
    "Samsung Galaxy Tab S4": "https://www.techradar.com/reviews/samsung-galaxy-tab-s4-review",
    "iPad Pro 11": "https://www.techradar.com/reviews/ipad-pro-11"
  }
}