{
  "source": "https://www.techradar.com/reviews/nikon-z6-review",
  "title": "Nikon Z6 review",
  "category": "cameras",
  "updated": "2019-10-11T04:09:46Z",
  "author": "phil-hall",
  "summary": "Sony's Alpha A7 III has some serious competition",
  "verdict": "Nikon certainly hasn't held back with the Z6, and any worries that it would miss the mark are dispelled as soon as you pick it up. Until now we'd have had little hesitation in recommending Sony's Alpha A7 III if you were in the market for a well-specced full-frame camera at around the $2,000 / £2,000 price point, but the Nikon Z6 is in many ways the more compelling option.",
  "pros": [
    "High-resolution EVF",
    "12fps burst shooting",
    "Familiar and refined handling",
    "Touchscreen interface",
    "4K video capture",
    "5-axis IS system"
  ],
  "cons": [
    "XQD card format has limited support",
    "Limited dedicated lens range (for now)",
    "Limited buffer depth"
  ],
  "article": [
    "We had to wait a little longer for the Nikon Z6 to arrive than the Nikon Z7, but it's this camera that perhaps has the broader appeal of Nikon's two full-frame mirrorless models, particularly among enthusiast photographers.",
    "Nikon is adopting a two-pronged strategy similar to that employed by Sony when it launched the original Alpha A7R and A7, with the Nikon Z6 and Z7 sharing the same design and a pretty much identical spec sheet, but with three notable differences: resolution, autofocus and burst shooting speed.",
    "While the Z7, with its densely populated 45.7MP sensor, is Nikon's high-resolution offering, the Z6 is marketed as more of an all-round camera. However, with Sony already stealing a march with the brilliant Alpha A7 III, has Nikon turned up to the party a little late?",
    "[Update: Nikon released a firmware update for both the Z6 and the Z7 in May, adding a number of improvements. The most important was the addition of Eye AF focusing which now allows the camera to automatically detect a subject's eyes to make attaining critical focus easier.]",
    "As we've just touched on, while the Z7 has a 45.7MP resolution the Nikon Z6 features a back-illuminated 24.5MP full-frame sensor, which, while not offering quite the staggering resolving power of its sibling, delivers a pixel count that should satisfy most users. It also means the native ISO range is that bit broader, running from ISO100 to 51,200 (the Z7's native ISO range is 64-25,600); this can be expanded to 50-204,800, matching the Alpha A7 III.",
    "Like the Z7, the Z6 features Nikon's new Z lens mount, with Nikon having dropped its long-established F mount for its new full-frame mirrorless cameras. The mount opening is 11mm wider than the F mount at 55mm, while the flange focal distance (the distance between the rear lens element and the sensor) is a very short 16mm.",
    "Nikon believes the larger design and short flange distance will enable its lens engineers to design optics that surpass current F mount designs and make the most of the full-frame sensor, allowing light to easily reach the extreme corners of the sensor to ensure even brightness across the frame.",
    "Launching with the Z6 and Z7 are the first three lenses in Nikon's new S-Line range: a 24-70mm f/4 standard zoom, a 35mm f/1.8 wide-angle prime and a 50mm f/1.8 standard prime. The new mount diameter also allows for lenses with maximum apertures as fast as f/0.95, with a high-end manual-focus 58mm f/0.95 S Noct prime lens expected next year.",
    "For existing Nikon DSLR users who are looking to make the switch to the new mirrorless cameras, or who want to shoot with one alongside their current Nikon DSLR kit, there's a new FTZ mount adapter that will be compatible with approximately 360 Nikon lenses, 90 of which which will support the Z6's full AF speed.",
    "The Nikon Z6 features a 0.5-inch 3.6 million dot Quad-VGA electronic viewfinder (EVF) with an impressive magnification of 0.80x, which edges out the Sony Alpha A7 III's 2.36-million dot and 0.78x display. The Z6 also uses Nikon's own optics, which are claimed to deliver even greater clarity, while the EVF has a fast display rate of up to 60p.",
    "Supplementing this is a large 3.2-inch tilt-angle touchscreen with a 2,100,000-dot resolution, while the Z6 also benefits from a compact top plate LCD displaying key shooting information.",
    "While Nikon's DSLRs use lens-based image stabilization (which Nikon calls Vibration Reduction), for its new mirrorless cameras it's opted for an in-camera system, with the Z6 featuring a 5-axis system (roll, pitch, yaw and X and Y shift) that's said to be effective for up to five stops. For those wanting to use their F-mount VR lenses on the Z6 via the mount FTZ adapter, the camera's built-in VR system will adjust itself to support the lens-based system.",
    "There's also an electronic Vibration Reduction system (known as E-VR) that's designed to reduce the impact of camera shake when shooting movies handheld. Speaking of movies, the Nikon Z6 can shoot 4K UHD video up to 30p, while there's also the option to shoot Full HD video in 60p and 120p slow-motion footage in HD format.",
    "Like other recent Nikon cameras, the Z6 features the company's fairly clunky SnapBridge image transfer system. This uses a low-energy Bluetooth connection between the camera and your smart device (via the free app), with images downscaled to 2MP and transferred from camera to device as you shoot. If you'd rather get your hands on the high-res images, you can individually select them in-camera, with a Wi-Fi connection established if you opt for this method. Alternatively, the Z6 will offer an open Wi-Fi connection if you want to bypass SnapBridge.",
    "While you might expect to find a couple of SD card slots on the Z6, Nikon has instead opted for a single XQD slot. This is quite a brave move, considering the limited availability of XQD cards, with only Sony versions currently available. The performance advantages are clear though, and Nikon's hope is that once CFExpress cards (essentially an update to the XQD format, with the same physical connections, and with more manufacturer support) become more widely available, this will be the more future-proof solution.",
    "The Nikon Z6 gets a new rechargeable Li-ion battery, the EN-EL15b, but the camera is also compatible with the EN-EL15a battery used in the likes of the D850; however unlike the older unit the EN-EL15b supports USB charging, and unlike the Z7, the Z6 won't be supplied with an AC adapter, and will rely solely on USB charging. Disappointingly, Nikon only quotes a 310-shot battery life for the camera, which is 400 shots down on the Alpha A7 III's 710. However, the Z7 is quoted for 330 shots, but we've found that in real-world use we were more likely to get around 600 shots, so we'd expect it to be a similar story here."
  ],
  "headers": {
    "4": "Nikon Z6: features"
  },
  "links": {
    "Nikon Z7": "https://www.techradar.com/reviews/nikon-z7-review",
    "Alpha A7R": "https://www.techradar.com/reviews/sony-alpha-a7r-iii-review",
    "A7": "https://www.techradar.com/reviews/sony-alpha-a7-iii-review",
    "Alpha A7 III": "https://www.techradar.com/reviews/sony-alpha-a7-iii-review"
  }
}