{
  "source": "https://www.techradar.com/reviews/lenovo-yoga-c930",
  "title": "Lenovo Yoga C930 review",
  "category": "computing",
  "updated": "2019-04-23T19:00:09Z",
  "author": "jeremy-laird",
  "summary": "A 2-in-1 laptop experience with little to no compromise",
  "verdict": "Lenovo’s latest premium 2-in-1 14-inch portable comes with little to no compromises, sporting great battery life, a strong build and a robust feature set. However, upgrade options at checkout tend to be pricey.",
  "pros": [
    "Strong build quality",
    "Robust feature set",
    "Excellent battery life"
  ],
  "cons": [
    "Weak graphics performance",
    "Pricey upgrade options"
  ],
  "article": [
    "No longer is it enough to merely be a good laptop – some kind of additional sell is required. Maybe that’s a super slim chassis or virtually invisible bezels. It could be intergalactic battery life. But, something special is required to stand out.",
    "Handily, the new Lenovo Yoga C930 doesn’t just have one stand-out feature – it has several. For starters, it’s a 2-in-1 laptop with a 360- degree hinge allowing for both conventional laptop and tablet-style operation. Then there’s the Dolby Atmos sound system that cleverly turns the hinge into a speaker, not to mention an integrated stylus. The claimed 14.5 hours of battery life and dual Thunderbolt-enabled USB-C ports don’t hurt, either.",
    "Elsewhere, the C930 is more conventional, not that this a bad thing when convention includes a powerful, quad-core Intel processor and a fast SSD for storage, among other highlights. As for the competition, this latest Yoga makes for an interesting alternative to Microsoft’s Surface Pro 6. The Surface, of course, is more a pure tablet with a keyboard cover to the Yoga’s convertible approach.",
    "More direct competition comes from the likes of the Dell XPS 2-in-1, though Dell offers that in 13- and- 15-inch models, leaving the Yoga sitting in between at 14 inches.",
    "At $1,599 (£1,354 AUS$2,549) as configured here, the Yoga C930 is priced in line with expectations for this type of device, namely a premium model with high build quality and a strong feature set. Our review example gets the base processor and memory configuration, but an upgrade from a 256GB SSD to 512GB.",
    "The cost of that upgrade varies by market. It’s around $200 in the US and £80 in the UK. A better value is the optional upgrade from the 1080p screen to 4K.",
    "Hybrid 2-in-1 laptops have struggled for simple aesthetic and physical appeal in the past. There’s so much adaptability to squeeze in that the end result can feel a bit cheap and clunky – not the new Lenovo Yoga C930. It’s a very slick machine that’s desirable as a pure laptop, let alone also taking into account its ability to switch into tablet mode.",
    "The alloy chassis feels compact and high quality, with little flex, and the 360-degree hinge is robust. The screen has pretty slim bezels on three sides, too, which helps minimize overall proportions. One obvious exception is the fairly hefty ‘chin’ below the display. This slightly dates the design compared to the latest laptops that feel like they’re ‘all screen’ as soon as you flip the lid.",
    "Overall, the Yoga C930 is a very portable device, though pure laptops designed primarily for portability are significantly smaller and lighter. Think 13-inch MacBook Pro rather than new MacBook Air, and you’ll have a decent idea of the portability proposition the Yoga offers.",
    "As for the capabilities of that screen, it’s a 1080p panel (1,920 x 1,080 pixels) courtesy of high quality IPS technology and with touchscreen functionality. Speaking of which, that extends to stylus support, and indeed Lenovo has bundled a stylus that slots neatly home when not in use and charges while it’s there, nice.",
    "Of course, being a 2-in-1, the marquee feature is the 360-degree hinge, allowing the system to fold around on itself and convert into a tablet. It’s an even more important feature here, thanks to the Dolby Atmos speaker system that’s been cleverly built into that hinge.",
    "The Lenovo Yoga C930 has a lovely screen. It’s punchy and pleasing, if not searingly bright, with deep colors and strong contrast. Granted, the fonts on this 1080p model could be sharper (4K is an option), but the relatively modest resolution does mean that running at 100% scaling is an option while retaining font legibility.",
    "The touchscreen functionality works well, too, with the stylus a particular highlight. It’s slick, accurate and responsive in use and completely discreet when stowed away. Certainly, it adds to the appeal and utility of the Yoga when in tablet mode.",
    "The quality of the chassis likewise makes for a pleasant keyboard experience with a solid base. The hinged, buttonless trackpad is decent too, albeit not quite as satisfying as Apple’s haptic trackpads.",
    "Another highlight is the Dolby Atmos soundbar. It produces impressive volume with sharp clarity and even a hint of dynamic range. Bona fide bass isn’t on offer, but the sound isn’t thin and mean.",
    "Finally, a nice little flourish is the privacy shutter over the 720p webcam. Being able to completely disable the camera in hardware terms, without sticking some ugly tape over the top, will be welcome for anyone with serious security concerns."
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Design",
    "11": "Display, keyboard and trackpad"
  },
  "links": {
    "good laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "2-in-1 laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "Surface Pro 6": "https://www.techradar.com/reviews/microsoft-surface-pro-6"
  }
}