{
  "source": "https://www.techradar.com/reviews/under-armour-true-wireless-flash",
  "title": "Under Armour True Wireless Flash review",
  "category": "audio-visual",
  "updated": "2021-07-15T15:34:44Z",
  "author": "henry-st-leger",
  "summary": "Fantastic earbuds for exercise",
  "verdict": "The Under Armour True Wireless Flash earbuds are a solid entry into the true wireless market, with strong audio, ergonomic design, and a hefty battery life to really make your purchase last throughout the week.",
  "pros": [
    "Strong overall sound",
    "Snug fit",
    "Lots of battery life"
  ],
  "cons": [
    "No speed charge",
    "Bluetooth can be patchy",
    "Hefty carry case"
  ],
  "article": [
    "It’s a packed market for true wireless headphones these days, as all sorts of audio manufacturers look on jump on the cable-free trend. But the upside is that there are plenty of options to choose from at a variety of price points, and the Under Armour True Wireless Flash are a great choice for mid-range wireless earbuds.",
    "With strong water and sweat resistance, a firm fit, and a partnership with Dwayne ‘The Rock’ Johnson – with some fancier features to make sure you can keep track of you surroundings too – it’s obvious that the UA True Wireless Flash earbuds are designed for serious workouts.",
    "Sure, you’re paying a bit of a premium for the true wireless technology – an equivalent cabled pair of headphones would no doubt be cheaper – but the sound smarts of JBL and sporting expertise of Under Armour should mean that they’re worth the price. So how did they fare when we put them to the test?",
    "These JBL and Under Armour branded earbuds are retailing for $165 (£159, AU$249), and are available through JBL, Under Armor or Amazon. You can also opt for a pair of Project Rock Edition earbuds, with gold detailing and a bull’s head taking the place of the Under Armour logo – for the same price – but the stock tends to shift fast.",
    "The Flash earbuds don’t diverge from what you’d expect from a true wireless model. There’s no cable here, meaning both earbuds are untethered, with silicon ear tips and a rounded casing to keep them closely fitting inside your ear. As is par for the course with earbuds, you’ll get three sizes of ear tips included in the box, though we found the default sizing perfect for our (admittedly small) ears.",
    "The earbuds are a matte black color, both with red detailing and a protruding silver logo that also acts as an action button for pausing, playing, powering on, answering calls, and the like.",
    "What makes these earbuds really suited to exercise is the IPX7 water resistance. The UA True Wireless Flash can survive immersion in water (up to 1m) for thirty minutes, making it great for all-weather running – and more than capable of dealing with the sweat running off your head.",
    "The aluminium charging case is immediately eye-catching for its sheer size. It will fit easily in one hand, but is around twice the size of the equivalent carry case for the Apple AirPods, which means it’s not that easy to fit into a pocket – especially during exercise. If you’re leaving the case in a locker or rucksack during your workout, you’ll be fine, but be aware that the case isn’t anywhere near as compact as the earbuds themselves.",
    "The flipside of this is that Under Armour packs in a lot of battery life in that space. The earbuds last for around five hours of use, with four additional full charges through the case – making for a sizeable 25 hours total on the go, more than you’d need for a full day’s use or a week’s worth of workouts. The four LEDs on the outside of the case also clearly show the amount of charges left, meaning you don’t have to guess based on flashes or LEDs slowly turning red.",
    "It only takes two hours to charge the case fully, though there is no speed charge feature – like with the Jaybird Tarah Pro, which can cram in a workout’s worth of battery in only a few minutes.",
    "The UA True Wireless Flash earbuds manage to cram in some great internal specs in a small form factor. Courtesy of audio brand JBL, each earbud has a 5.8mm driver that packs a punch. Bass is strong without being overpowering, and you get a wide soundstage and a full range of 20Hz-22KHZ frequencies to boot.",
    "We’d hope for sound of this quality at this price tag, but it’s still reassuring that UA’s earbuds prioritise audio as well as suitability for exercise. (Being sweat-proof won’t matter if you can’t bear to listen to a pair of headphones’ patchy audio.)",
    "The Under Armour True Wireless feature Bluetooth 4.2 rather than the latest Bluetooth 5.0 standard, and there are occasions when the connection feels a bit patchy – though we never found it cut out entirely.",
    "The Under Armour True Wireless Flash earbuds really distinguish themselves with how they block out – or let in – the outside world. Sound isolation is brilliant, due to the rigid fit of the earbuds, allowing you to hear the audio relatively clearly without outside interruption. But, for when you need to keep track of your surroundings – say, when someone’s swinging a dumbbell, or when you’re running beside a busy road – there are a number of workarounds.",
    "Tapping the left earbud once will enable UA’s Talk-Thru technology, which quietens the audio and optimizes your earbuds' microphones for speech, making it easier to hold a conversation while listening to music. Pressing the left earbud twice, meanwhile, will turn on Ambient Aware, which sticks to regular volume but recreates outside noise alongside the music in your ears. The modes feel distinctly different and both very effective, giving you a range of options for how isolated you want to be from the world when you have your headphones in.",
    "You’ll get some basic smart features here, with Siri or Google Assistant answering your queries – depending on your source device – when you press down on the left earbud. UA has made the smart decision not to include volume controls on the earbuds themselves, limiting how much you need to prod your own ear.",
    "The Sennheiser Momentum True Wireless earbuds, by comparison, probably have superior audio, but include difficult and imprecise touch controls, when it would have been simpler to remove some from the equation.",
    "One key feature for budding runners will be the integration with the MapMyRun app. It's a subscription-based app to help track your workout routine and feed fitness tips straight into your ear, though you'll get a free 12-month subscription when purchasing your headphones.",
    "The Under Armour True Wireless Flash earbuds are a solid entry into the true wireless market, with strong audio, ergonomic design, and a hefty battery life to really make your purchase last throughout the week.",
    "UA has gone for stamina rather than convenience, though, and the charging case can feel like a bit of a brick to carry around – especially during exercise. You also won’t get any speed charging features here, meaning you shouldn’t wait until five minutes before a workout to plug the case into the wall.",
    "But for the sporty among you, the pros should certainly outweigh the cons."
  ],
  "headers": {
    "3": "Price and availability",
    "4": "Design",
    "10": "Performance",
    "18": "Our Verdict"
  },
  "links": {
    "true wireless headphones": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "partnership with Dwayne ‘The Rock’ Johnson": "https://www.techradar.com/news/the-rocks-new-under-armour-sports-headphones-sell-out-in-72-hours",
    "JBL": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1280372118042773000&xs=1&url=https%3A%2F%2Fwww.jbl.com%2Fwireless-headphones%2FUA%2BTRUE%2BWIRELESS%2BFLASH.html%3Fdwvar_UA%2520TRUE%2520WIRELESS%2520FLASH_color%3DBlack-USA-Current&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Funder-armour-true-wireless-flash",
    "Under Armor": "https://www.awin1.com/awclick.php?awinmid=15431&awinaffid=103504&clickref=trd-us-4334700214405296000&p=https%3A%2F%2Fwww.underarmour.com%2Fen-us%2Fua-true-wireless-flash-headphones%2Fpid1350762",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FArmour-Wireless-Headphones-Engineered-JBL%2Fdp%2FB07MBZTLVJ%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1245075570884047600-20",
    "Project Rock Edition": "https://www.awin1.com/awclick.php?awinmid=3279&awinaffid=103504&clickref=trd-us-5358916421921477000&p=https%3A%2F%2Fwww.underarmour.co.uk%2Fen-gb%2Fua-true-wireless-flash-project-rock-edition-headphones%2F1356423.html",
    "Jaybird Tarah Pro": "https://www.techradar.com/reviews/jaybird-tarah-pro-review",
    "Sennheiser Momentum True Wireless": "https://www.techradar.com/reviews/sennheiser-momentum-true-wireless-review",
    "MapMyRun": "https://www.mapmyrun.com/app"
  }
}