{
  "source": "https://www.techradar.com/reviews/mini-pc-proart-pa90",
  "title": "Asus Mini PC ProArt PA90 workstation review",
  "category": "computing",
  "updated": "2019-04-22T09:48:14Z",
  "author": "nick-rego",
  "summary": "Tower of power",
  "verdict": "There’s no denying that the Asus Mini PC ProArt PA90 can swallow anything you throw at it, but it comes at an exceptionally high price. It’s also not the easiest to upgrade, which doesn’t bode well for those looking to swap components in the future.",
  "pros": [
    "Strong specifications",
    "Sleek design"
  ],
  "cons": [
    "Challenging to upgrade",
    "High price tag",
    "Dual power bricks"
  ],
  "article": [
    "The Asus Mini PC ProArt PA90 is a peculiar thing. It’s got workstation-grade internals, yet Asus insists on slapping on the ‘Mini PC’ moniker. This PC may be sleek enough to hide away in a small space, but there’s nothing mini about what this beast can do.",
    "Asus is squarely targeting the creative types with the PA90, especially for those working with CAD software or manipulating 4K video footage. It’s a PC that’s more than capable of handling demanding workloads, but that sort of immense power comes at a rather steep price tag and some limited upgrade paths.",
    "The PA90 comes in a variety of configurations, all powered by either an Intel Core i9-9900K or i7-9700K processor, and up to 64GB of DDR4 RAM. You’ll also get the power of an Nvidia Quadro P2000 or P4000 graphics card to handle GPU-intensive applications.",
    "In the UK, prices start from £2,499.99 ($3,249, AU$4,550) for an i7, Quadro P2000 configuration, going up to £3,199.99 ($4,157.74, AU$5,822) for an i9 configuration with a Quadro P4000.",
    "In North America, two configurations will be available – an i9, Quadro P4000 model for $3,299 (£2,538.28, AU$4,619.26) and an i7, Quadro P4000 model at $2,999 (£2,307.46, AU$4,199.20).",
    "For Middle East users similar configurations will be available, though our review unit was specifically configured for end-users and retails at a staggering AED 15,599 ($4,246.96, £3,267.91, AU$5,947.27) for an i9 processor, Quadro P4000, and 64GB of RAM. Asus has also confirmed a 32GB variant will be available in the region.",
    "It’s easy to draw pricing and design similarities to the likes of Apple’s Mac Pro, which starts at $2,999 (£2,307.75, AU$4,198.90) and instead comes with an Intel Xeon processor and dual AMD graphics processors.",
    "The cylindrical shape of the PA90 gives it a much smaller footprint than a normal tower PC, so you’ll be able to place the PA90 alongside your monitor rather than trying to hide it under your desk.",
    "A unique element to the PA90 is its top cover. Once you boot up the PC, it raises upwards to allow air to flow in and cool the device. The cover automatically adjusts its height to let in up to 38% more airflow in automatically, depending on what core temperatures are running at. Also keeping the PA90 cool is a liquid CPU cooler with a fairly large heatsink, so even under demanding workloads the PC doesn’t get alarmingly hot.",
    "Three-quarters of the PA90 is surrounded by a metal grille, which lets air flow freely in each direction. Even under heavy workloads, the PA90 remains fairly quiet, but airflow around the side near the heatsink definitely heats up as the system works had to keep everything in check.",
    "The majority of the PA90’s ports are located in the rear of the device, including the four DisplayPort connections. You won’t find any HDMI connections here, which is probably for the best as DisplayPort connections tend to give better refresh rates and color accuracy for design programs. There are also two USB 3.0 Type A ports, as well as two USB Type-C ports for newer devices. There are also two more USB 3.0 Type A ports in the front which brings the total to four ports, but personally speaking we would have liked at least six USB Type-A ports just to ensure that peripherals such as graphic tablets and other USB devices have enough free ports to connect to.",
    "Probably the most bizarre thing about the PA90 is the fact that it requires two power bricks to run – one that powers the CPU and one that powers the GPU (each 230W and 180W). This makes cable management a bit of a challenge, as you have to secure the power cables as well as the bricks themselves, depending on how you set up the PA90.",
    "While most tower PCs are easy to get into to upgrade components, things can get a bit challenging when tackling upgrades in the PA90.",
    "Other manufacturers now offer tool-less access to the innards of their PCs, the PA90 needs a fair bit of elbow grease to get into. First you have to unscrew not just four standard Philips screws, but four Torx screws as well. This should already be your first indication that Asus doesn’t want users fiddling around inside the PA90 themselves.",
    "Once you’ve got the screws off, the metal grille slides upwards, revealing the core components on each side. On one side you have a small metal box which houses a 2.5” storage drive (either SSD or HDD). This can be upgraded by removing a total of eight screws, which isn’t too much of a hassle. There’s also a spare M.2 slot at the bottom of the board for additional storage, or for utilizing Intel Optane memory.",
    "On the other side you’ll see the graphics card – in our case the Quadro P4000 – which is further protected by another four screws and a piece of plastic. The card itself looks straightforward enough to try and swap out, however on closer inspection there’s a different story to tell, with the card being held in place by even more screws at the back, and a section of the top was covered in black tape.",
    "We were weary of trying to dive any further lest we permanently damage something, but it’s clear that whatever card you configure the PA90 with, you’re going to be stuck with it. There’s no chance you’ll be able to swap in any kind of newer card in the future, just because of the chassis design and power distribution.",
    "Our review unit came with 64GB of RAM, and accessing the memory slots proved to be another challenge. They’re located directly under the CPU heatsink, so only after you’ve safely unscrewed the heatsink can you access the two memory slots. We did spend an absurd amount of time trying to see if there were other memory slots as well, but again we didn’t want to break anything in our search – all you need to know is that you can comfortably slot in a total of 64GB of RAM, which turns the PA90 into an absolute powerhouse."
  ],
  "headers": {
    "2": "Price and availability",
    "7": "Design",
    "12": "Upgradability"
  },
  "links": {
    "workstation-grade internals": "https://www.techradar.com/best/best-workstations",
    "Apple’s Mac Pro": "https://www.techradar.com/reviews/pc-mac/pc-mac-desktops/apple-mac-pro-1191682/review"
  }
}