{
  "source": "https://www.techradar.com/reviews/philips-hue-play-hdmi-sync-box",
  "title": "Philips Hue Play HDMI Sync Box review",
  "category": "televisions",
  "updated": "2019-12-17T20:33:29.773Z",
  "author": "tyler-hayes",
  "summary": "Amp up your movie nights with this HDMI-powered light show",
  "verdict": "The Hue Play HDMI Sync Box makes Hue lights explode from behind your TV and shouldn't fail to pull you into most movies and shows. It comes at a steep price, but those looking to create a unique and truly impressive entertainment space won't be disappointed with the purchase.",
  "pros": [
    "Immersive watching experience",
    "Sleek and discrete hardware box",
    "Four HDMI ports with 4K support"
  ],
  "cons": [
    "Pricey",
    "Needs Philips Hue Bridge to work",
    "Requires some furniture rejigging"
  ],
  "article": [
    "The Hue Play HDMI Sync Box from Philips leverages the company's Hue light technology to create an immersive entertainment experience by adding lighting effects to your favorite shows and movies.",
    "If you weren't aware, Hue lights matching what's on a screen has been capable for a long time, just not for people's TVs. Hue Sync has been available for desktop computers for over a year and it was a bit confusing why this functionality wasn't available for the main place this would make sense.",
    "But, if the time was needed to make sure the Hue Play Sync Box was stable and accommodated the various complexities in the TV arena, then the wait was worth it. It's a fantastic product for those who want it and will make those who don't think they need it reconsider once they've seen it in action.",
    "The Hue Play HDMI Sync Box launched on October 15 2019 in the US and UK.",
    "With the questions of potential complexity and frivolity, the steep price — $229.99 (£229, around AU$335) — might make you ask yourself if this is all worth it to have your lights ebb and flow, reflecting the colors displayed on screen. Thankfully despite being a premium device, both in price and function, it's an easy recommendation for the people it's made for — cinephiles and smart home enthusiasts.",
    "Setting up the Hue Play Sync Box is straightforward, but will likely require re-doing you TV's entertainment area in some form.",
    "To get Hue lights to mimic whatever content is showing on your TV screen, you'll need to connect a source device, like an Apple TV, into the Sync Box. (It is essentially a fancy splitter that connects to Hue lights.) The content passing through is analyzed and translated to flashes of color on any connected Hue lights.",
    "If you want your Hue lights to match what's on the screen from your cable box, Apple TV, and Xbox, then each of those has to be plugged into the Sync Box.",
    "There are four HDMI inputs to accommodate an adequate number of sources, but be warned that may be a limiting factor for some people. While you don't need to plug everything into the Sync Box — just the items you want to match with the light colors — having inputs flowing through various inputs may affect how you control your TV or attached devices.",
    "The Sync Box uses the same power adapter that the Play Bar Lights use so, for example, if you have two Play Bar Lights and a Sync Box, they can all be plugged into the same power adapter.",
    "Once the Sync Box is powered on and connected to the TV, the device uses a separate Hue app called Hue Sync, which uses the lights set up in the main app's \"Entertainment\" area, to control the Sync Box and start and stop syncing.",
    "The setup process went smoothly for us and only took about 15 minutes (including a firmware update to the Sync Box) to get everything functioning from start to finish. But if you're coming into this fresh without any prior experience, the setup and installation process will likely be more complicated needing to set up a bridge, lights, and then the Hue Play Sync Box.",
    "Also, you should be aware that because TV areas can be a mess of wires, it may take some time to get everything unhooked and reconnected. People familiar with Hue and its apps shouldn't have much difficulty adding the Sync Box to their setups, but anyone else should plan to have some free time available.",
    "The Hue Play Sync Box performs as advertised and the actual hardware performance has been rock solid. After a few weeks and dozens of movies we didn't see any hiccups or issues with the hardware box or effects it produced.",
    "The Sync Box creates bursts of color during explosions and dramatic ambiance during tense scenes is unlike other things people do to enhance the movie watching experience. Adding pricey rear speakers, a sub, or other things to a TV area might not even be as worthwhile as adding a Sync Box would.",
    "Marvel movies are good examples of how color can add to the viewing experience. The best movie we found was Into The Spider-verse, which was a magical experience when synced to the Hue HDMI Box.",
    "That said, the constant glow on every show, movie, or onscreen content could be distracting depending on if you keep the lighting effect on all the time.",
    "There are settings in the Sync app to start syncing your lights on power-on or you can manually enable syncing when you're ready. We used both and this setting will be a personal preference. There were times we forgot to enable the lights if they didn't start automatically, and there were times the lights were more distracting than helpful — like an episode of The Office where there was less color and mundane backdrops.",
    "The biggest downside to the Sync Box is some of its technical specs: It will output 4K, but is limited to 60Hz and HDR10. (Its HDMI spec is listed as 2.0b with HDCP 2.2.)",
    "The double edge sword here is that for people most likely to invest in Hue Play Bar Lights and the Sync Box to enhance their entertainment area, are probably the same ones investing in the highest quality TVs and movie watching. The device's specs aren't embarrassing or even bad, but it should be a consideration. There's a chance you might not even notice the 60Hz refresh rate or the lack of Dolby Vision HDR.",
    "Streaming content from Netflix and other services from an Apple TV 4K on a 50-inch 4K LG worked well and we had no complaints around picture quality.",
    "The effect the Hue Play Box creates is stunning and makes certain movies and shows really fun to watch. It will engage you in a way that should delight most people. The setup was simple enough for anyone who already owns Hue lights and feels comfortable unplugging an HDMI cable or two. This box draws no attention to itself and is all about the presentation it creates.",
    "That said, hardware specs could become outdated and a limiting factor for some people, but the biggest dislike is simply the price: at $230 (£229, around AU$335), the device is targeted at a narrow market segment and won't make it into as many homes as a result.",
    "If the price were to drop at some point, there would be very little to dislike about the actual Hue Play Sync Box beyond some very minor nitpicks about needing multiple Hue apps and how the lights aren't necessary on every single piece of content displayed on the TV."
  ],
  "headers": {
    "3": "Price analysis and release date",
    "5": "Setup and design",
    "13": "Performance",
    "21": "Final verdict"
  },
  "links": {}
}