{
  "source": "https://www.techradar.com/reviews/hp-omen-x-emperium",
  "title": "Hands on: HP Omen X Emperium review",
  "category": "components",
  "updated": "2019-01-06T18:01:38Z",
  "author": "joe-osborne",
  "summary": "Redefining the term ‘gaming monitor’",
  "verdict": "We’re wowed by the HP Omen X Emperium gaming monitor, from its super bright, detailed and smooth 4K visuals to its absolutely packed feature set. However, at a whopping $4,999, it’s tough to say whether it’s worth the cost for such a niche.",
  "pros": [
    "High resolution and refresh rate",
    "Built-in soundbar",
    "Quantum Dot, HDR panel",
    "Nvidia Shield built-in"
  ],
  "cons": [
    "Extremely pricey",
    "Somewhat slow response time"
  ],
  "article": [
    "Nvidia’s “Big F**king Gaming Display” (BFGD) project kicked off at CES 2018, and now we know partner HP has been working on one with the debut of the Omen X Emperium. And, at 65 inches and with a soundbar built-in, this screen definitely lives up to Nvidia’s vulgar project name.",
    "With Nvidia’s G-Sync HDR technology, the Emperium can actively sync its 144Hz refresh rate with the frame rate of your PC’s Nvidia graphics card powering the graphics. This creates a tear-free visual without any stuttering that even the best graphics cards can’t get around without such a feature.",
    "HP spared no expense with this absolutely ‘extra’ gaming monitor, but don’t worry – you’re footing the bill, and it’s massive.",
    "HP wants an insane $4,999 (about £3,929, AU$7,000) for what amounts to a living room PC gaming package, considering the included soundbar and built-in Nvidia Shield TV, when it launches in February 2019 in the US.",
    "HP has not yet shared UK and Australia availability for this product, which should give you folks some more time to save up to get yours on day one.",
    "This exorbitant price includes one DisplayPort 1.4 and three HDMI 2.0 ports both supporting the HDCP protocol, two USB 3.0 ports and two USB charging ports. As for audio, you get line out, one S-PDIF out and an HDMI ARC port.",
    "With the size of this screen and the price it calls for, we would have appreciated another HDMI port or two, especially since we’d expect the Emperium to become a gamer’s hub for customers’ consoles as well.",
    "The Omen X Emperium takes on a very similar design identity as other products within HP’s PC gaming line, wrapped in a deep black shell punctuated by red chrome accents throughout. The Omen logo shines on its back panel in chrome, not that you’ll ever see it.",
    "Being a massive, Quantum Dot display, the Emperium rests on four legs, but it can also be mounted to a wall using the VESA system along with the soundbar.",
    "We appreciate the versatility of the Emperium in terms of orientation and setup, which only makes some of the more nice-to-have features that much more appealing given the price. For instance, an LED strip with a sensor detects your hand and automatically lights up the port selection, so you can easily locate the right one.",
    "The screen itself is simply gorgeous, with incredible brightness (up to 1,000 nits) and a deep contrast ratio (4,000:1). Both do wonders for the monitor’s DCI-P3 color gamut of 95%, creating a crisp, clear image that’s brimming with detail even at this immense size.",
    "We noticed no issues in smoothness of play when we witnessed the Emperium at work during a press briefing, a testament to Nvidia’s G-Sync technology working with the screen’s speedy 144Hz refresh rate. However, the 4-millisecond response time tells us this display won’t fare too well for esports players especially in shooting and fighting games.",
    "The soundbar, on the other hand, absolutely filled the demonstration area with the screams and gunfire of Battlefield 5 at 120 watts. In fact, our demonstrator was asked by a coworker across the room to turn it down.",
    "Finally, the full inclusion of an Nvidia Shield set-top streaming box inside the monitor will offer up a practical ton of entertainment options out of the box, including streaming games from your Nvidia-powered PC to the display.",
    "We’re totally wowed by the HP Omen X Emperium gaming monitor, from its capability for super bright, detailed and smooth 4K visuals to its absolutely packed feature set. It’s tough to say whether such a complete, luxurious package is worth the five grand, however.",
    "This is one of those awfully niche products for the well-to-do PC gamer that would rather play from their couch than their desk. If you’ve got the cash on hand and want to massively upgrade your living room or den-based PC gaming setup, this looks like a fine way to spend that money.",
    "Of course, stay tuned for a full review to see whether the nitty gritty details affect the overall value, as you could easily buy an entire living room PC gaming setup for this price – high-end PC included.",
    "Want more CES 2019 highlights? TechRadar is hands-on with 8K TVs and foldable, rollable displays, along with new laptops and Alexa-enabled smart gadgets. Check out everything we've seen, live from Las Vegas!"
  ],
  "headers": {
    "3": "Price and availability",
    "7": "Design and display",
    "14": "Early verdict"
  },
  "links": {
    "Big F**king Gaming Display": "https://www.techradar.com/news/nvidia-gets-into-the-tv-business-with-bfgd-screens-designed-for-pc-gaming",
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Nvidia Shield": "https://www.techradar.com/reviews/gaming/games-consoles/nvidia-shield-1287106/review",
    "CES 2019": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets"
  }
}