{
  "source": "https://www.techradar.com/reviews/intel-core-i7-9700k",
  "title": "Intel Core i7-9700K review",
  "category": "computing",
  "updated": "2019-11-18T18:01:27Z",
  "author": "bill-thomas",
  "summary": "Intel's almost-flagship processor",
  "verdict": "The Intel Core i7-9700K is an interesting processor. It's the first time in years that a Core i7 chip doesn't have hyper-threading, but the amazing single-core performance means it's still an excellent choice for gamers.",
  "pros": [
    "Excellent performance",
    "Strong thermals"
  ],
  "cons": [
    "No hyper-threading",
    "Falls behind in multi-threaded loads"
  ],
  "article": [
    "The Core i9-9900KS might be Intel’s new flagship processor (CPU) for its mainstream lineup of CPUs, but the Intel Core i7-9700K is the more interesting chip. For one thing, the Intel Core i7-9700K drops hyper-threading, which is definitely a controversial decision, as its rivals have no problem putting hyper-threading in its processors – looking at you, Ryzen 7 2700X.",
    "Now, Intel has definitely done this before, but only on lower-end processors – think the Core i5 and i3 processors – but the Core i7 CPUs are typically meant for more high-end audiences. But, after running this chunk of silicon through our testing lab, we're surprised by how much it's actually capable of.",
    "Intel has dropped hyper-threading on its lower-end, budget processors before, but this is a high-end processor meant for gamers and creatives. Despite our reservations, this Coffee Lake Refresh processor has surprised as a well-performing CPU.",
    "The Intel Core i7-9700K sadly comes doesn’t come in at the same $359 (£389, AU$524) price the Intel Core i7-8700K did. Instead, this new high-end Coffee Lake processor runs for a noticeably higher $374 (about £290, AU$530) price. However, now that time has passed and AMD has released a noticeably more powerful processor in the Ryzen 7 3700X, you can find the 9700K for much cheaper, especially now that Black Friday and Cyber Monday are approaching.",
    "This chip's direct competitor, the AMD Ryzen 7 2700X also runs at a noticeably lower $329 (£299, AU$469) price, though because it's now a last-generation processor, the price has dropped significantly.",
    "Equipped with 8-cores and 8-threads, the Intel Core i7-9700K is a bit of an oddity compared to its predecessor. Next to 2017's Intel Core i7-8700K, this new chip has two more cores but four fewer threads.",
    "The Intel Core i7-9700K is also rated with a base clock of 3.6GHz and can boost one its processor cores all the way to 4.9GHz. Comparatively, the Intel Core i7-8700K starts at a tick higher 3.7GHz base frequency, but can’t go nearly as fast with its maximum 4.7GHz boost clock.",
    "For its latest 9th Generation chips, Intel is going with a soldered integrated heat spreader (IHS) – which we haven’t seen since 2nd Generation Sandy Bridge Core processors – to support greater overclocking capabilities.",
    "For the last few generations of chips, Intel has gone with a Thermal Interface Material (TIM – aka thermal paste) to transfer heat between the processor dies and the IHS. Unfortunately, this change in manufacturing process seemingly resulted in hotter running processors, which infuriated many enthusiast users and overclockers.",
    "In theory, this purported gold-plated solder replacing the TIM will be a much more efficient heat transfer medium. However, in our experience, the temperatures are pretty similar to what we got with the 8700K, though with higher power consumption and performance, we guess that means the soldered TIM does its job here.",
    "Even though the Intel Core i7-9700K drops hyper-threading, it still manages to beat the 8700K, thanks to a higher TDP , or Thermal Design Power, and boosted single-thread performance. However, it fails to hold a candle to AMD's offerings in most multi-threaded workloads.",
    "For instance, in Cinebench R15, the 9700K managed to score 203 points in the single-core test, compared to the 8700K's 193. This translates over to gaming performance, too, with the 9700K scoring 125 frames per second (fps) in Middle Earth Shadow of War at 1080p to the 8700K's 121. That's not a massive bump in gaming performance, but it's a bump nonetheless.",
    "Gaming performance jumps are more substantial when we compare the 9700K to the AMD Ryzen 7 2700X. In that same Shadow of War test, AMD's processor only manages to hit 117 fps. Now, this is still very good performance, and no one is going to complain when they're hitting nearly 120 fps, but it's clear that Intel is still the king of gaming performance.",
    "However, if you're doing media creation, AMD is still the way to go. In the Cinebench multi-threaded test, the 9700K manages a score of 1,463 points to the 2700X's 1,798. However, in Handbrake, Intel slightly pulls ahead with 66 fps to AMD's 61.",
    "So, while some people might have panicked when seeing Intel dropping hyper-threading, it doesn't mean a lack of performance. And, if you're playing the best PC games, the Intel Core i7-9700K is one of the best processors out there.",
    "Despite being just another iteration of Intel's 14-nanometer process, the Core i7-9700K is still kind of a behemoth of a processor. In gaming, the single-threaded performance is going to be more than enough for years to come, and the processor will last you for years.",
    "And, while Intel has dropped hyper-threading support on the 9700K, the multi-threaded performance is more than good enough for most people. Only folks that absolutely need it for content creation are going to feel the burn, but the Intel Core i9-9900K can pick up the slack there with no issue."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Features and chipset",
    "10": "Performance",
    "15": "Final verdict"
  },
  "links": {
    "Core i9-9900KS": "https://www.techradar.com/reviews/intel-core-i9-9900ks",
    "Ryzen 7 2700X": "https://www.techradar.com/reviews/amd-ryzen-7-2700x",
    "Coffee Lake Refresh": "https://www.techradar.com/news/intel-coffee-lake-refresh",
    "Intel Core i7-8700K": "https://www.techradar.com/reviews/intel-core-i7-8700k",
    "Ryzen 7 3700X": "https://www.techradar.com/reviews/amd-ryzen-7-3700x",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "AMD Ryzen 7 2700X": "https://www.techradar.com/reviews/amd-ryzen-7-2700x",
    "best processors": "https://www.techradar.com/news/best-processors"
  }
}