{
  "source": "https://www.techradar.com/reviews/amazon-fire-hd-10-kids-edition",
  "title": "Amazon Fire HD 10 Kids Edition (2017) review",
  "category": "tablets",
  "updated": "2019-07-01T15:03:42Z",
  "author": "marc-chacksfield",
  "summary": "It's okay to let your kids play with Fire",
  "verdict": "The tablet itself doesn't do much to stand out, but Amazon has made sure this is a safe, fun place for children. It's packed with things to do, is really durable and simple to use.",
  "pros": [
    "Kid-friendly design",
    "Kid-friendly UI",
    "Superb perks"
  ],
  "cons": [
    "Some features are subscription only",
    "Quite heavy for smaller children",
    "Screen could be brighter"
  ],
  "article": [
    "The Amazon Fire HD 10 Kids Edition is a Fire HD tablet in children’s clothing. It’s the same slate that’s available for adults but it’s been given a massive rubber bumper to protect it from the inevitable knocks it will get while in small hands, and a whole host of child-friendly software additions and cut-price subscription-based goodies.",
    "If this makes it sound like you're paying extra money for a slate with a massive protective case, that's accurate – but you'll be paying less of that money as Amazon Prime Day rolls around each year, and brings with it a host of discounts on tech products. As an Amazon device, the Amazon Fire HD 10 Kids Edition is available with a great saving at the moment.",
    "Amazon is well versed in creating products for children. This is its third Kids Edition tablet, the previous two were Amazon Fire 7 Kids Edition and - you can sense a pattern here - the Amazon Fire HD 8 Kids Edition.",
    "The idea behind these tablets is that they are safe for little ‘uns to enjoy, while offering peace of mind to parents. The tablet allows parents to monitor their kids’ media usage from close-up or afar. They are also nice and durable, which we found out in our tests…",
    "This tablet is available now - price-wise, it currently retails for £199/$199. For this, you get a year’s subscription to Amazon’s Kids Unlimited / FreeTime Unlimited service, which offers over 50,000 bits of children’s content.",
    "Also in the box is a great two-year warranty. If the thing breaks at any time then it gets replaced for free, no matter what happened to it. So, even if it’s smashed and it’s completely your child’s fault, another one will be in the post.",
    "During the yearly Amazon Prime Day deals bonanza you'll be able to save some money compared to its standard retail cost though, so check out the deals if you want to get the Amazon Fire HD 10 Kids Edition for a reduced price.",
    "The original Fire HD 10 is a pretty plain device, but this is something you don’t have to worry about with the Kids Edition as the thick plastic body is covered with a big rubber bumper.",
    "The bumpers you can choose from are an unimaginative blue and pink. While Amazon hasn’t revealed why it has chosen these colors, it’s pretty obvious (and a little tiresome) that it has gone down the boys and girls route. The rubber bumpers are nice and durable, though, and protect the tablet that’s inside well.",
    "Amazon is quite clear that, despite the kid-safe exterior, the Amazon Fire HD 10 Kids Edition isn’t actually a toy - and it has the specs to prove it.",
    "Again, this is the Amazon Fire HD 10 so you get the same specs. They include a: 10.1-inch 1080p Full HD display, 32GB of internal storage, and up to 10 hours of battery life, although this obviously varies depending on what you are doing with it. There is also a microSD card slot for up to 256GB of expandable storage.",
    "What a child would want to do with all that memory is beyond us, but it’s there if you want to preload a load of movies for a long trip, or download a bunch of games that need a chunk of storage.",
    "The tablet weighs in at 660g, which is a little on the heavy side for smaller children.",
    "Other features include a camera on the back. Usually we get ridiculously irate at the mere thought of someone using a tablet as a camera (especially outside, in a crowd) but it’s endearing on this tablet, with Amazon making the controls cutesy enough that taking photos with the device is actually rather ‘fun’.",
    "This is all thanks to the post editing, which has loads of stickers, the ability to add text and shapes to the picture.",
    "Buttons on the device include a power on/off and a volume rocker, and there’s a 3.5mm jack and microUSB charging on board. All of these things are protected by the bumper so you have to reach quite far in to use them - it’s obvious this is by design but it is a little fiddly."
  ],
  "headers": {
    "4": "Amazon Fire HD 10 Kids Edition price and availability",
    "7": "Amazon Fire HD 10 Kids Edition: design and features"
  },
  "links": {
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Amazon Fire 7 Kids Edition": "https://www.techradar.com/reviews/amazon-fire-7-kids-edition",
    "Amazon Fire HD 8 Kids Edition": "https://www.techradar.com/reviews/amazon-fire-hd-8-kids-edition",
    "Amazon Prime Day deals bonanza": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Amazon Fire HD 10": "https://www.techradar.com/reviews/amazon-fire-hd-10-2017-review"
  }
}