{
  "source": "https://www.techradar.com/reviews/toshiba-portege-x30t-e-13h",
  "title": "Toshiba Portégé X30T-E-13H review",
  "category": "computing",
  "updated": "2019-01-23T19:00:21Z",
  "author": "mark-pickavance",
  "summary": "Toshiba apes Microsoft's 2-in-1...",
  "verdict": "An excellent but decidedly niche machine that panders to those people who think a Windows tablet is a good idea. For everyone else, there are cheaper ways to get a powerful platform with the Portégé brand name on it.",
  "pros": [
    "Superbly engineered",
    "Decent specification",
    "Excellent battery life"
  ],
  "cons": [
    "Tablet mode reduces battery capacity",
    "Expensive"
  ],
  "article": [
    "The business Ultrabook market is highly lucrative for laptop makers, so they like to keep these designs as fresh and innovative as possible.",
    "Toshiba has a wide selection of business orientated hardware on offer, with its Portégé series being especially popular.",
    "Following up on the generally well-received Portégé X20W-D, the X30T-E-13H takes the 2-in-1 concept to a new level, by allowing the machine to detach the keyboard entirely.",
    "That functionality makes the X30T-E-13H a true tablet, but achieving this trick didn’t come without a few technical sacrifices.",
    "The review machine is available through numerous online outlets as the PT17CE-01U00GEN model number, and it retails at £1,899 plus VAT. This is an EU SKU, and therefore not available outside Europe.",
    "However, a fully customisable Portégé X30T-E BTO is available in the US and set to the same spec it costs roughly $2,874. Both these options come with the Keyboard Dock and Multi-Protocol Digital Ink Pen as standard, but the Travel keyboard is an extra £109 + VAT ($140).",
    "For those that are operating on a tighter budget, Toshiba makes the X30T-E-112 that has a Core i5 CPU, 8GB of RAM and a smaller 256GB drive for the more affordable price of £1,199 + VAT ($1,545).",
    "As Ultrabook’s go, Toshiba has an enviable track record for making classy looking hardware that works well and reliably. And, the Portégé X30T-E doesn’t break with that tradition.",
    "It is a 2-in-1 design where the screen portion of the laptop can undock from the keyboard to enable it to become a tablet, should the need arise.",
    "When detached the tablet has a kick-stand enabling it to remain upright without being supported, and it also senses the change and can morph Windows 10 into a touch orientated tablet mode.",
    "The technology that connects the two parts is USB 3.0, and Toshiba also wisely chose this as the means by which the machine is also charged.",
    "That might seem a minor thing, but the number of laptop makers still using proprietary power connections is disturbing.",
    "And, the designers went the extra mile with their USB implementation, because connecting the charger to either part will charge the other section, as they each has a battery.",
    "There are caveats to this choice that we’ll discuss later on, but it does focus almost all the computing platform in the tablet, while leaving most of the connectivity in the Keyboard Dock.",
    "Oddly, some things you’d expect would be on the keyboard also end up on the tablet part, because they’re part of the TPM 2.0 security model. That includes the fingerprint reader, that ends up on the outer lid side, making it much less convenient to access when the X30T-E is in laptop mode.",
    "Thankfully the design also included a thermal camera with Windows Hello and Intel Authenticate, so you don’t need to use fingerprint authentication if you don’t want to.",
    "The headline act of any machine that has tablet aspiration is the screen, and the 13.3” touch panel that was undoubtedly chosen for it is clarity and brightness.",
    "The natural resolution of 1080p might seem low by comparison with some laptops, but it fits well with the physical size and this machine not having a discrete GPU.",
    "The latest 8th generation Intel mobile platform is at the heart of this Portégé, and the review model sported almost the quickest in this series, the voracious Intel Core i7-8550U processor.",
    "This computing engine with 16GB of RAM and a 1TB NVMe SSD makes for a potent combination, and for most office applications the computing power available is a distinct overmatch.",
    "If a weakness exists, it's on the video side of this equation. The Intel HD 620 integrated into the processor doesn’t have enough grunt to handle 4K output and it struggles with 3D modelling beyond a certain complexity.",
    "We’re unused why Toshiba gave this design a VGA port alongside HDMI and DisplayPort (via USB 3). Because hooking up a monitor with only that technology would seem odd for such a modern computer.",
    "There also isn’t any obvious way inside the machine for user-upgrades or fixes other than dismantling it with screwdrivers, sadly.",
    "Another slight disappointment is that the X30T-E does not include a SIM card slot for LTE, a capability that an ultraportable of this type could make good use.",
    "As a machine this is a high-end solution with plenty of power on tap. However, it wasn’t meant to be enhanced with a larger drive, better WiFi or more memory at a later stage in its life.",
    "It might be possible to do all those things, but Toshiba won’t encourage you to try."
  ],
  "headers": {
    "7": "Design",
    "18": "Specifications"
  },
  "links": {
    "Ultrabook": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "X30T-E-13H": "http://www.toshiba.co.uk/laptops/portege/portege-x30t-e/portege-x30t-e-13h/",
    "2-in-1": "https://www.techradar.com/news/should-you-buy-a-2-in-1-laptop"
  }
}