{
  "source": "https://www.techradar.com/reviews/asus-rog-strix-fusion-700",
  "title": "Asus ROG Strix Fusion 700 review",
  "category": "computing",
  "updated": "2019-02-01T16:39:55Z",
  "author": "matt-hanson",
  "summary": "Asus’ high-end gaming headset offers 7.1 surround sound and more",
  "verdict": "The Asus ROG Strix Fusion 700 is a very good gaming headset that does a great job of immersing you in your games.",
  "pros": [
    "Very good sound quality",
    "Nice design",
    "Wireless via Bluetooth",
    "Compatible with PC, PS4 and Nintendo Switch"
  ],
  "cons": [
    "No headphone jack",
    "Expensive",
    "Bass on the weak side"
  ],
  "article": [
    "The Asus ROG Strix Fusion 700 is a high-end gaming headset from Asus’ Republic of Gamers brand. This is a brand that’s proved time and again that it understands what gamers want and need, so we have high hopes for these cans.",
    "The Strix Fusion 700 is primarily designed to be wired up to a PC, PlayStation 4 or Nintendo Switch via USB for immersive gaming. It also has built-in Bluetooth 4.2, which means you can use it wirelessly with any device that supports it, including smartphones.",
    "It also brings some nice touches, like virtual 7.1 surround sound that can be turned on with a button press, along with an ESS DAC and amp to provide punchy sound, all wrapped up in Asus’ recognizable ROG design language.",
    "It’s also pricey, costing $215 / £219.99 / AU$449, which puts it in the range of the SteelSeries Arctis Pro Wireless, which is a feature-rich wireless headset with dual batteries, and the wired SteelSeries Arctis Pro.",
    "And taking a glance at our best PC gaming headset guide, our current top pick, the HyperX Cloud Revolver S, is almost half the price, and offers similar features, including 7.1 surround sound.",
    "The Asus ROG Strix Fusion 700 will need to pull out all the stops to justify its asking price, then – so how does it fare?",
    "The Asus ROG Strix Fusion 700 is a good-looking gaming headset with a premium design that will appeal to many gamers, without being too garish. You can also use it for non-gaming applications, like listening to music on your smartphone, without it standing out too much.",
    "The Asus ROG Strix Fusion 700 has a similar design to other ROG Strix headsets, and features design elements we’ve come to expect from Asus’ ROG products. So, you get a set of headphones that are clearly gaming-orientated, without being over the top.",
    "The ROG logo is confined to a small detail above each can, while a fabric tag on the inside bears the Strixs branding. On extending the cups (to fit larger heads) you can see the metallic band that features markings reminiscent of a circuit board – a design theme we’ve seen on other ROG Strix products.",
    "A subtle ‘Republic of Gamers’ is inscribed at the top of the band, and there’s also LED lighting that’s controlled by Asus’ Aura Sync RGB software. If you’ve got other Asus products with Aura RGB lighting, you can sync up the lighting and effects with the headset – we had compatible RGB RAM sticks installed in the PC we tested the Asus ROG Strix Fusion 700 with, and syncing those up to the headset produced a rather pleasant effect, if you like that sort of thing – of course, you can always turn off the lighting if it isn’t to your taste.",
    "The microphone is located beside the left-hand can, and you pull it down to activate it. There are also two buttons on the back of the left-hand can, one for turning the 7.1 surround sound effect on and off, and one for toggling Bluetooth.",
    "The ability to turn the 7.1 surround effect on and off with a button press is a nice feature, as it saves you having to mess around with software. As with previous Strix Fusion headsets, the Asus ROG Strix Fusion 700 also features a touch-sensitive plate over the left-hand can which allows you to pause and play music, skip tracks and adjust volume (and synchronize the RGB lighting) using touch gestures.",
    "Unfortunately, we found this a bit confusing to use, an issue that wasn't helped by the fact that sometimes it would work and sometimes it wouldn't. Occasionally, we picked up the headphones only to find music already playing through them, as we must have accidentally brushed the touch interface while handling the headset.",
    "The Asus ROG Strix Fusion 700 is comfortable to wear, thanks to its adjustable band. It also comes with a second set of ear cushions, which you can swap for the ones that are on the earpieces out of the box for a better fit. It’s not too heavy either, so if you’re planning on a long play session it shouldn’t feel too uncomfortable.",
    "There is one glaring omission, however: the Asus ROG Strix Fusion 700 connects to a PC, PS4 or Switch via a USB cable. There’s no audio jack, which limits the amount of devices you can connect it to – for example, it looks like Xbox One gamers will be out of luck.",
    "At least the Asus ROG Strix Fusion 700 features Bluetooth for connecting to smartphones, tablets and games consoles. It’s nice to have the option to use the Asus ROG Strix 700 wirelessly, and the built-in 900mAh battery should last around eight hours if you use the RGB lighting, rising to 17 hours with the lighting turned off.",
    "Unlike the SteelSeries Arctis Pro Wireless, you can’t swap out the batteries, so when the Asus ROG Strix 700 runs out of juice you’ll need to plug it in to charge, which takes about three hours – not the end of the world, perhaps, but it does mean you’ll want to keep a charging cable with you so your gaming isn’t interrupted. Thankfully, the Asus ROG Strix 700 uses a standard USB to micro USB cable.",
    "Considering the price Asus is asking for the ROG Strix Fusion 700, it needs to offer seriously impressive audio quality – and on paper it certainly looks like Asus has put a lot of thought and effort into making sure this headset sounds good.",
    "It features an airtight chamber which Asus claims has been fine-tuned by its audio engineers to create a large area around the drivers to help deliver clear and natural-sounding audio.",
    "The drivers themselves offer a wide frequency response of 20-40kHz, which should provide strong bass without washing out details.",
    "The ROG Strix Fusion 700 also features an ESS 9018 DAC (digital to analogue converter) that offers Hi-Res lossless music playback at 24-bit/96kHz. There’s also a built-in ESS 9601 amplifier for more dynamic bass.",
    "So it should be set up to pump out some impressive audio, and in our time with it we were indeed impressed. Music sounded clear and vibrant, and while the bass wasn’t quite as punchy as we’d been led to expect, the clarity and detail on offer were impressive.",
    "Connecting via Bluetooth was also simple, and didn’t have any noticeable impact on sound quality. We listened to Spotify using the headset via a smartphone, and music continued to sound good, while calls made using the headset were crisp and clear.",
    "As for gaming, which is most likely what you'd be buying this headset for, the ROG Strix Fusion 700 performs very well, with the audio detail in particular impressing us in the range of titles we played while wearing it. Again, though, the bass isn’t that prominent, which means you’re not getting the skull-shaking impacts you sometimes get with gaming headsets.",
    "However, the Asus ROG Strix Fusion 700 excels at atmospherics, really bringing out sounds that can often be overlooked or lost in the mix with more bombastic headsets, such as footsteps and falling bullet casings.",
    "This aspect of its performance is especially apparent when you put the Asus ROG Strix Fusion 700 into 7.1 virtual surround sound mode. Asus promises that the ROG Strix Fusion 700’s virtual surround, developed in conjunction with audio specialists Bongiovi Acoustics, will be a step above that of its rivals.",
    "We’ve yet to be really impressed with virtual surround sound, and so far nothing has come close to replicating the setup of a physical surround sound system. The Asus ROG Strix Fusion 700 is sadly no exception, but there are some nice aspects that can add to your enjoyment. Using the headphones in 7.1 mode, you can certainly hear a difference. In stereo mode the sounds seem to be confined to a horizontal plane, but with 7.1 turned on you're also able to distinguish sounds in the vertical plane; so if a noise is supposed to be above you – a passing aircraft for example – it will sound like it is.",
    "It doesn’t quite feel like sounds are coming from behind you or around you, so we wouldn’t say that the 7.1 mode will give you any competitive advantage when playing games, as you won’t be able to pinpoint where footsteps or gunfire are coming from, other than from your left or right.",
    "What this mode does well is further enhance atmospherics. While bullets don’t seem to whizz overhead, large, cavernous buildings feel even larger, and ambient noises help make your games even more immersive.",
    "The 7.1 mode also works with music, and with certain genres this again adds a nice effect. So it won’t replace a physical 7.1 setup, but it’s definitely worth gaming with the mode switched on.",
    "Speaking of which, having the 7.1 system built into the headphones without the need of a dongle is a nice touch, as is the dedicated 7.1 button for switching it on and off while you play.",
    "The Asus ROG Strix Fusion 700 is a pricey gaming headset, but its build quality, features and performance just about justify the high price. This is a premium-looking bit of kit, and if you have other Aura-compatible peripherals and components then you’re really going to like how this syncs up with your other kit.",
    "While its looks will appeal to gamers, the design isn’t over the top or garish, and the same goes for the performance – this is a headset that’s better at atmospherics than it is at bombast. The bass isn’t that strong, but where the ROG Strix Fusion 700 really excels is in picking up the small details.",
    "It really does sound very impressive, and while the 7.1 surround sound isn’t that convincing, it brings a breadth to ambient sounds that can be really quite immersive."
  ],
  "headers": {
    "6": "Design",
    "17": "Performance",
    "25": "7.1 surround",
    "31": "Verdict"
  },
  "links": {
    "PlayStation 4": "https://www.techradar.com/reviews/gaming/games-consoles/original-2013-ps4-review-1131803/review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "SteelSeries Arctis Pro Wireless": "https://www.techradar.com/reviews/steelseries-arctis-pro-wireless-headset",
    "SteelSeries Arctis Pro": "https://www.techradar.com/reviews/steelseries-arctis-pro-headset",
    "best PC gaming headset guide": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675",
    "HyperX Cloud Revolver S": "https://www.techradar.com/reviews/hyperx-cloud-revolver-s"
  }
}