{
  "source": "https://www.techradar.com/reviews/asus-zenscreen-mb16a-portable-monitor",
  "title": "Asus ZenScreen MB16A Portable Monitor review",
  "category": "computing",
  "updated": "2021-07-22T06:51:57.041Z",
  "author": "matt-hanson",
  "summary": "Get more screen real estate on the go",
  "verdict": "The Asus ZenScreen MB16A Portable Monitor is one of the nicest-looking USB monitors we’ve seen, and it comes with a number of features and design considerations that make it an incredibly handy device, although one that comes at a price.",
  "pros": [
    "Lovely design",
    "Portable",
    "USB-C connection",
    "Good image quality",
    "Cover doubles as a stand"
  ],
  "cons": [
    "Expensive",
    "Low brightness"
  ],
  "article": [
    "As far as secondary monitors go, you cannot go wrong with the Asus ZenScreen MB16A Portable Monitor. A stylish USB-powered monitor designed specifically as a secondary display for laptop users, this nifty laptop accessory won’t just make your workflow seamless and save you time; it’s also portable and stylish for on-the-go use.",
    "Having a secondary screen to extend your desktop is a great way to improve productivity, but for laptop owners, who might benefit the most from extra screen space, that aren’t a lot of options. Portability of such displays – or the lack thereof – is always an issue. As is attractiveness – you wouldn’t want to sit at a cafe utilizing a secondary screen up in full display if it looks like it belongs in a 1950s nuclear testing command center.",
    "That’s where the Asus MB168B+ comes in handy. With it, Asus has built an appealing device that’s easy to carry, simple to use and blends in well, whether you’re at a coffee shop or at your work desk.",
    "However, at £234.99 ($279, about AU$382), it’s probably going to me the most expensive laptop accessory you’ll ever own. But, with Black Friday and Cyber Monday deals starting to pop up, it’s possible that Asus might just drop its price a tad to make it more affordable.",
    "Still, the question remains: is the Asus MB168B+ good enough to warrant that steep price tag?",
    "The ‘Zen’ part of the ZenScreen MB16A's name makes it clear that Asus sees this device as a companion to its stylish ZenBook range of premium laptops. ZenBooks are well known for their slim and attractive designs that utilize metallic silver, gray and black colors, and the ZenScreen MB16A clearly takes its design cues from those devices.",
    "The MB16A’s dimensions are 14.16 x 8.91 x 0.31 inches (36 x 22.6 x 0.8cm), making it just a bit bigger than an iPad Pro. If this sounds a bit on the big side, remember that this is still far more portable than a standard monitor, and with a weight of 800g it's also much more comfortable to carry. And the slim bezels at the sides and top of the screen mean the majority of the body can be occupied by the 15.6-inch screen.",
    "The bottom bezel is wider, and contains three buttons – two for navigating the on-screen menu and adjusting the blue light level of the backlight, plus a power button. The design of these buttons continues the Zen design ethos, and again helps to make the ZenScreen look very nice indeed. On the left-hand side of the body is the ZenScreen MB16A’s only input, a USB Type-C port.",
    "This single port helps to keep the design of the Asus ZenScreen MB16A clean and simple, and it’s versatile enough to provide power to the monitor while also displaying 1080p images. A USB-C-to-standard USB adaptor is included if the machine you’re plugging the MB16A into doesn’t have a USB-C port, which is a nice touch.",
    "The ZenScreen MB16A comes with a magnetic screen protector that can also be folded into a stand, in a similar fashion to the iPad’s Magic Cover. It’s another nice touch, and combining screen protection and stand in one thin device helps to make this an easy accessory to carry around.",
    "However, the process of turning cover into stand is a bit fiddly, and it would have been nice to have some clearer instructions – although if you’re accomplished at origami you shouldn’t have too much of a problem.",
    "The back of the ZenScreen MB16A will look familiar to anyone who’s used a ZenBook laptop – it has a smart metal design with the Asus logo etched in. Overall, this is a very nicely designed screen, and reminds us that Asus has a real flair for creating attractive devices.",
    "If you have a ZenBook laptop this screen will be a lovely compliment to it, although of course it's compatible with any other laptop or desktop, and will look equally good alongside those.",
    "As the Asus ZenScreen MB16A is a mobile monitor that derives both its power supply and video feed via USB, we’re not expecting image quality that rivals expensive standard monitors – but at the high price Asus is asking for, we’d still want to see very good image quality that makes the monitor comfortable to use.",
    "The good news is that, on the whole, the ZenScreen MB16A performs admirably, with the IPS panel rendering 1080p content well. However, we did need to make a few tweaks before we were happy with how the display looked.",
    "We first used it with a PC without a USB-C port, so we needed to use the adaptor, and download the necessary drivers from the Asus website. This wasn’t a problem, although once Windows 10 had installed the drivers and we turned on the screen, Windows 10 set the scaling to 120%.",
    "This makes texts, icons and windows larger, which can make things easier to use, but in our view it looks a bit ugly. Setting the scaling to 100% (done easily through Windows 10’s settings) made things look much nicer.",
    "We also found the brightness to be quite dark initially, so we upped it to 100%. We’d usually never have to go anywhere near 100% on standard monitors – and doing so would blow out the colors, and quite possibly our eyes – but even at 100% the ZenScreen MB16A's screen was still quite dim.",
    "Of course, if you're running this second screen from a laptop that's powered by a battery, its lower brightness levels will help prolong the battery life of your machine; however we'd have liked the option to make it a little brighter.",
    "Using the on-screen menu is pretty simple thanks to the front-facing buttons on the bottom bezel. There a number of presets you can choose from (you can also save a configuration to easily revert to later on), as well as other features such as a blue light filter (for using at night), and an auto-rotate setting that can be easily enabled.",
    "Viewing angles on the Asus ZenScreen MB16A are good, which is handy for a relatively small screen size, although the glass screen does reflect light quite easily. It's also worth noting that while the ZenScreen MB16A looks like a tablet, it’s not a touchscreen.",
    "On the whole, performance is good. We wouldn’t recommend this screen for gaming or watching media on, but that isn’t what it’s designed for. As a second screen for displaying additional windows and applications it does a fine job, although you may find you need to tweak a few settings to get an picture quality that you’re happy with.",
    "If you’re regularly working on the road and need a second screen that's easy to carry and looks nice and stylish, the Asus ZenScreen MB16A Portable Monitor is an excellent accompaniment. Its light and slim design makes it easy to transport, and the screen protector that doubles as a stand is a great touch.",
    "If you use an Asus ZenBook then this is an even more compelling purchase, as it’s a great companion device that utilizes the same design language.",
    "However, it is an expensive monitor, so if pure portability isn’t your primary concern you’d be better off looking at less costly monitors that will also offer better picture quality."
  ],
  "headers": {
    "5": "Design",
    "13": "Performance",
    "22": "Verdict"
  },
  "links": {
    "Portable Monitor": "https://www.techradar.com/news/best-portable-monitor",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}