{
  "source": "https://www.techradar.com/reviews/netgear-nighthawk-xr700",
  "title": "Netgear Nighthawk XR700 review",
  "category": "computing",
  "updated": "2019-04-29T14:01:54Z",
  "author": "jeremy-laird",
  "summary": "A features and performance monster of a gaming router",
  "verdict": "The Netgear Nighthawk XR700 is the mother of wireless gaming routers, a features and performance monster and also easy to use. Of course, both the router itself and its price tag are rather oversized.",
  "pros": [
    "Epic feature set",
    "User friendly",
    "Great performance"
  ],
  "cons": [
    "Very expensive",
    "Absolutely huge"
  ],
  "article": [
    "In a world where hyper high-end smartphones seemingly appear every 30 seconds, it’s a tough task for superficially more mundane and functional items like wireless routers to stand out. So, it says something that Netgear’s latest gaming-centric router is a serious head turner.",
    "For starters, the Netgear Nighthawk XR700 is massive and looks like something Kylo Ren would keep in his private First Order quarters. More importantly, it’s positively rammed with features and promises epic performance and configurability, highlights of which include three radios, a plethora of ports and some very trick software.",
    "For $499 or £450, of course, it needs to be something special. That’s the kind of money that will buy a half decent laptop or desktop PC. It’s an awful lot of coin for a router. If you’re wondering about the competition, Netgear’s own Nighthawk X10 features much of the same ultra-fast networking features, including an 802.11ad radio and a 10GbE port for about three quarters of the price, albeit without some of the more gaming-centric frills.",
    "Even cheaper is the Linksys EA9500 Max-Stream, though it’s not as powerful and feature filled as the Nighthawk XR700. Time to find out, then, if Netgear can justify the hefty entry fee for its latest flagship router.",
    "There’s no point pretending this router isn’t megabucks. At $499 (£450, about AU$724), it’s the price of a half decent PC.",
    "But if you want the very best features and performance, you’re going to have to pay for it. So, the value proposition here depends on just how critical router performance and configurability is to you.",
    "The Netgear Nighthawk XR700’s stellar specification kicks off with its triple wireless standards, encompassing 2.4GHz 802.11n, 5GHz 802.11ac, and 60GHz 802.11ad. More specifically, you get quad-stream 802.11ac via dual 5GHz radios rated at 1,733Mbits/sec apiece. The 2.4GHz channel is good for a claimed 800Mbits/sec 2.4GHz, while superfast short-range connections are supported by a 802.11ad radio, delivering up to 4,600Mbits/sec – phew.",
    "Physical connectivity includes six gigabit ethernet ports, a single 10GbE port and two USB ports, all out back. The latter enable media server and print server support, along with file sharing features. Powering all that is a 1.7GHz quad-core processor (CPU).",
    "It’s the CPU that enables the Nighthawk’s fancy software features to do their thing. Underpinning all that is the gaming-optimised DumaOS. Highlights start with a quality of service (QoS) app. That’s all about making sure your gaming PC gets all the bandwidth it needs while maintaining low latency. The details involve ensuring other devices on the network don’t hog bandwidth via user-configurable settings that can prioritize traffic to specific applications, most importantly games. Or, you can choose to let the router manage things for you with its smart load-balancing algorithms.",
    "Another neat feature is the geo-filter. The idea here is to block connections based on physical proximity. The further away a server is, the greater the latency, which is the bane of every serious online gamer. Even better, it works on a per-device basis, so you can choose to run geo-filtering for your gaming PC but allow everything else operate normally.",
    "Next up, the VPN module enables fine tuning of traffic types over an OpenVPN-compatible service. So you can, for instance, use a VPN to fake a location for gaming while allowing the rest of the traffic to go direct to your ISP, or channel web traffic from a particular device over a VPN. You can also track and log in detail all the different traffic types and data rates by device. It’s quite comprehensive stuff.",
    "As for the Netgear Nighthawk XR700’s physical deportment, it’s an absolute beast. The main chassis is well over a foot across, to which you can add a few more inches courtesy of two of the massive four-strong array of antennae, each one illuminated by integrated LED lighting, natch. Also evident under a large mesh cover is some serious looking cooling for that quad-core CPU. If you’re looking for something compact and discreet, this isn’t the router for you, that’s for sure.",
    "Of course, one thing that the Netgear Nighthawk XR700 doesn’t have is its own built-in modem. So you’ll need to connect via ethernet to another device for an external internet connection.",
    "Initial setup of the Netgear Nighthawk XR700 couldn’t be simpler. Just plug-in your modem, power up and connect a wireless device. That will immediately throw up a browser-based interface that guides you through a handful of steps to achieve a basic, functioning setup.",
    "From there, you can choose to hop into the DumaOS and get busy with all the powerful features and settings. That’s a pretty nice combination – the initial ease of getting up and running for those who just want something very fast but don’t want to get their hands dirty, plus a plethora of tools for more hands-on enthusiasts.",
    "For example, with a single click you can choose to give whatever clients, ports and protocols heightened privileges. It’s also very easy to see what connected devices are doing, the types of traffic they’re generating, like gaming, peer-to-peer, streaming or social media. All of which means you can fine tune your network to your heart’s content.",
    "As for performance, the Nighthawk XR700 simply doesn’t miss a beat. Those huge antennas ensured that we got the maximum from our BT Infinity fiber connection from close and medium to long range. There was no difference in performance from a few feet with direct line of sight and at a distance from a different floor. It ain’t cheap, the Nighthawk XR700, but it definitely performs.",
    "Can the Netgear Nighthawk XR700’s hefty price tag be justified? That depends on your priorities. For most people, most of the time, a generic wireless router gets the job done. But if you want total control over your network, then you’re going to have to spend more.",
    "For sure, the Nighthawk XR700 is nothing if not fully featured. What’s more, for serious gamers, one of the core advantages of the Nighthawk XR700 is the sense that you’re leaving absolutely nothing on the table. For some, that will be worth the elevated entry fee.",
    "That Netgear has packaged all that with user friendly setup and a very slick interface just sweetens the deal. So, let’s put it this way: if you are up for spending this kind of money on a wireless router, we doubt you’ll be disappointed."
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Design and features",
    "13": "Performance",
    "17": "Final verdict"
  },
  "links": {
    "gaming-centric router": "https://www.techradar.com/news/the-best-gaming-routers"
  }
}