{
  "source": "https://www.techradar.com/reviews/michael-kors-access-lexington-2",
  "title": "Michael Kors Access Lexington 2 review",
  "category": "wearables",
  "updated": "2019-12-21T12:00:19Z",
  "author": "jennifer-allen",
  "summary": "A great-looking watch that's bad for exercise",
  "verdict": "The Michael Kors Access Lexington 2 would make a stylish addition to your collection, but expect to pay the price for such good looks. At heart, this is a fairly standard Wear OS smartwatch, with a designer label-style price attached to it.",
  "pros": [
    "Looks great",
    "Built-in speaker",
    "Genuinely unisex design"
  ],
  "cons": [
    "Strap adjustments are fiddly",
    "Expensive for what it is",
    "Speaker isn't great"
  ],
  "article": [
    "The Michael Kors Access Lexington 2 is far from Michael Kors' first dive into the smartwatch world, but it is the most refined smartwatch from the fashion company so far.",
    "It looks gorgeous if a little gaudy for certain tastes, and it feels as expensive as it actually is.",
    "Deep down, though, it's basically just a Fossil Gen 5 with a different design, which makes it a fairly expensive proposition for anyone other than those hooked on having the 'right' label on their arm.",
    "The Michael Kors Access Lexington 2 differs in price depending on your color and design preference. In the UK, the most inexpensive option comes in at a recommended retail price of £339.",
    "For that amount, you can choose from a Silver-Tone, Gold-Tone, or Tri-Tone watch. Bump your budget up to £389 and you can pick out the Pavé Two-Tone smartwatch, which is extraordinarily glitzy.",
    "Discounts are relatively few and far between so far, but expect to save £10-20 if you shop around and keep an eye on Amazon discounts.",
    "In the US prices start at $350, rising to $425, though as with the UK there are sometimes slight discounts to be found. While in Australia you'll pay either AU$599 or AU$649 depending on finish.",
    "The Michael Kors Access Lexington 2 is glitzy whichever color scheme you go with. We had the Silver-Tone model at our disposal and it looks distinctive, expensive, and stylish. Place it on your wrist and it stands out far more so than something like an Apple Watch or standard Fossil Gen 5 smartwatch.",
    "It has the typical design of two side buttons and a rotating crown with the MK logo adorned on it. A raised bezel around the 44mm case is suitably weighty and eye-catching.",
    "Having said that, it doesn't feel too oversized, even on a slender wrist. The display itself is a 1.28-inch AMOLED with 328 pixels per inch, so it looks suitably decent.",
    "Behind the strap on the clasp there's another Michael Kors logo for those keen to show off their branding. Such labeling is subtle enough that the general style feels classy rather than garish, though.",
    "Speaking of the strap, bear in mind that you'll need to remove some of the links either with a specialist tool or via a professional (most watch shops will be able to help) to get just the right fit for your wrist.",
    "The Michael Kors Access Lexington 2 sticks with the hardware used by the Fossil Gen 5 along with a few other higher-end Wear OS smartwatches. That means it has a Qualcomm Snapdragon Wear 3100 chipset, 8GB of storage, and 1GB of RAM.",
    "In terms of speed, you're going to get the speediest performance you can out of a Wear OS watch, but as we know by now, that doesn't mean it's perfect. Scrolling through the list of apps was reasonably speedy most of the time, but every once in a while it will suffer the odd stutter.",
    "This isn't the kind of Wear OS experience that's exclusive to this watch - we've yet to come across one that never misses a beat. But the newer chipset certainly means that slowdown is less frequent or serious than on older wearables.",
    "Elsewhere, there's Google Pay support, built-in GPS, heart rate monitoring, and water resistance. There's also a built-in speaker for those rare times you might want to take a call through your wrist rather than your tethered phone.",
    "Michael Kors has also included an exclusive app in the form of Michael Kors Access. This allows you to easily change watch faces and looks in a more convenient manner than the standard Wear OS way.",
    "You can also set up calendar reminders here with a countdown clock for special occasions such as a party or anniversary. It's lightweight stuff but it's certainly likeable.",
    "In theory, the Michael Kors Access Lexington 2's built-in GPS should mean you don't have to take your phone with you on a run. In practice, it's pretty flaky and benefits massively from having a phone to connect to. We wouldn't trust it as your only option.",
    "Having said that, the Michael Kors Access Lexington 2 is far from ideal as a fitness watch. It's too bulky and the wrong kind of build for wearing while you run or exercise.",
    "While it's water resistant up to 30 meters, we wouldn't recommend actually using it in the pool unless you want to sink a bit. Still, it's nice to know you don't have to worry about the device when strolling in the rain.",
    "On the plus side, heart rate monitoring was fairly consistent and accurate. It was only out by a couple of beats, and that's not bad at all for a wrist-based monitor.",
    "The Michael Kors Lexington 2 uses the same chipset as a lot of recent high-end Wear OS smartwatches - the Qualcomm Snapdragon Wear 3100 processor, which means it also has lots of battery-tweaking options.",
    "As standard, Michael Kors reckons the battery will last about 36 hours. We found a more realistic figure to be about just over a full day, assuming you're walking around and using various features on the watch.",
    "Tweak the battery mode settings however, and the life can be extended to a more reasonable figure and you can stretch to a couple of days without losing out too much on features.",
    "Cutting back on features isn't an ideal solution, but while Wear OS watches continue to be a bit flaky with battery life, it's a decent enough compromise.",
    "First reviewed: December 2019"
  ],
  "headers": {
    "3": "Michael Kors Access Lexington 2 release date and price",
    "7": "Design and display",
    "12": "Specs and features",
    "18": "Fitness",
    "22": "Battery life",
    "26": "Don't buy it if..."
  },
  "links": {
    "Fossil Gen 5": "https://www.techradar.com/reviews/fossil-gen-5-smartwatch",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch"
  }
}