{
  "source": "https://www.techradar.com/reviews/sony-lspx-s2-glass-sound-speaker",
  "title": "Hands on: Sony LSPX-S2 Glass Sound Speaker review",
  "category": "audio-visual",
  "updated": "2019-01-10T19:25:06Z",
  "author": "jamie-carter",
  "summary": "Vibrating tubes have never sounded so romantic",
  "verdict": "As a space-saving two-in-one, Sony’s LSPX-S2 glass Bluetooth speaker seems a crazy proposition but, delightfully designed, it’s a robust piece of anti-tech that also manages to look, feel and sound cutting-edge.",
  "pros": [
    "360 audio",
    "Hi-Res Audio",
    "Warm sound",
    "Subtle lighting",
    "Spotify Connect"
  ],
  "cons": [
    "Lacks versatility",
    "High price",
    "No voice control",
    "No Apple AirPlay"
  ],
  "article": [
    "Sony’s LSPX-S2 glass Bluetooth speaker seems a crazy proposition: it's a digital candle that doubles as a speaker. Yet up close this nicely crafted slab of bleeding-edge tech has something incredibly alluring about it.",
    "Maybe it’s that flickering LED candles (32 levels, in fact, adjustable via an app), or the fact that its protruding 10-inch glass tube is really only at its best with soft jazz (cue a relaxing demo), but maybe also because the LSPX-S2 swims firmly against the tech tide. After all, the conventional wisdom at CES is that hardware is dead, and that all innovation is now only in software and services.",
    "But looking great and sounding better, the LSPX-S2 paints a very different picture both for the convention and the future of technology as a whole.",
    "The LSPX-S2 reminds us of another long forgotten masterpiece, Sony’s 10-inch XEL-1 OLED TV for desktops from way back in 2008. Like the LSPX-S2, that one-off TV had the very latest tech inside a delicious form factor.",
    "But the successor to the bulkier LSPX-S1 won’t appeal to everyone, and much depends on the environment it’s placed in: in bright light, for example, the LSPX-S2 looks a little like a clumsy combination of an uninspiring portable speaker and a test tube. However, dim the lights and the flickering LED light at the base of the glass tube changes its aesthetic completely.",
    "The base of the LSPX-S2 is actually the lowlight, design-wise. Sculpted from machined aluminium, it looks merely like a high-end version the kind of ‘fun’ Bluetooth speaker you might take in a shower, or to the beach. For starters, this one adds NFC, and supports both Spotify Connect and Hi-Res Audio.",
    "A soft material wrapped around its hull houses a USB-C slot for recharging it (it lasts eight hours per charge), a 3.5mm audio input for attaching any audio device (though naturally it has both Bluetooth and WiFi), hidden volume up and down buttons, a similarly covered mode and standby controls.",
    "Happily, although it’s small, at 1.1kg it’s not particularly lightweight. In fact, it’s something of a paperweight, and stays grounded even if it’s knocked or bumped. That’s key because our first thought upon seeing the LSPX-S2 was that a cat/child/flailing arm could easily knock it off a table. It’s too heavy for that.",
    "It’s what protrudes from the LSPX-S2’s top that’s the story, but to call it glass is stretching the truth. It’s effectively a transparent tweeter that uses organic glass, a kind of acrylic resin also found in sunglasses and windows. Touch that glass and you can feel it gently vibrating during music playback.",
    "Sony describes the tech as its Advanced Vertical Drive, and what happens when music is played is that that glass gently vibrates when touched by a circular actuator at its base. That glass is tapped all around, sending the sound vertically in 360 degrees. It’s also got a lot more surface area that the average tweeter, hence the detail and the volume.",
    "The LSPX-S2’s performance depends on what it plays, and where. Fed a diet of soft jazz and dreamy female vocals and it absolutely excels, delivering warm mid-range tones. The use of the glass tube, while aesthetically rather shocking, turns out to be a pure way of ensuring 360 degree audio is exactly that, and for once not an algorithm-powered compromise.",
    "That said, for two people sat opposite each other, or on any round table, the LSPX-S2 makes a lot of sense; it gives everyone the same audio performance and the same illumination. It would also work well on a bedside table, partly because of its built-in sleep timer.",
    "Of course, the speaker doesn't need to live only on a kitchen table set for two - Sony also showed it to us in a home office setting, with a couple of LSPX-S2s left on a desk. The light given off by one of them isn’t enough for close work, but it seems OK for reading.",
    "Surprisingly, the LSPX-S2 supports both Spotify Connect and Hi-Res Audio, but given its price – £550 (around $700, AU$975) when it launches in May – we're glad it does. Plus, not only can the LSPX-S2 be paired with a second unit (the norm for wireless speakers of this price) it works with other Sony Bluetooth speakers, too.",
    "The LSPX-S2 is classic Sony: delightfully designed, it’s a robustly piece of anti-tech that also manages to look, feel and sound cutting-edge. However, it’s not particularly versatile, doesn’t offer Apple AirPlay, and despite the march of immersive 360-degree music that’s happening right now, the limited musical scope and high price probably means that the LSPX-S2 is probably little more than a passing novelty.",
    "While we hope it doesn't fade out like a candle in the wind, we're just glad we gave it a listen - it was one of the standout experiences of CES this year."
  ],
  "headers": {
    "3": "Design",
    "10": "Performance",
    "14": "Early verdict"
  },
  "links": {
    "XEL-1 OLED TV": "https://www.techradar.com/reviews/audio-visual/televisions/plasma-and-lcd-tvs/sony-xel-1-440032/review",
    "LSPX-S1": "https://www.sony.com/electronics/wireless-speakers/lspx-s1"
  }
}