{
  "source": "https://www.techradar.com/reviews/microsoft-hololens-2",
  "title": "Hands on: Microsoft HoloLens 2 mixed reality headset review",
  "category": "wearables",
  "updated": "2019-06-26T14:28:32Z",
  "author": "james-peckham",
  "summary": "Lighter, with a better view",
  "verdict": "Microsoft's HoloLens 2 may look like it's designed for a very specific purpose, but the possibilities are endless with this mixed reality headset. The HoloLens 2 looks to improve upon the first-generation device in lots of ways, but whether you'll need to buy one right away is still uncertain.",
  "pros": [
    "Lighter than first-gen",
    "Larger field of view",
    "Clever new interface"
  ],
  "cons": [
    "Not bright enough",
    "Very expensive"
  ],
  "article": [
    "Can the Microsoft HoloLens 2 succeed where the original struggled? Microsoft’s HoloLens venture is now a little more than four years old, and while it initially launched with what we thought would be a consumer angle (as well as its application in the business world), it seems now Microsoft believes that this headset is only for enterprise users.",
    "In the past few years, HoloLens has grown into a tool that can be genuinely useful for a wide range of businesses.",
    "Whether it’s training a particularly difficult skill or to do a job more efficiently, mixed reality is a great way to do that, and the HoloLens has been the leader.",
    "That’s why HoloLens 2 – announced during MWC 2019 – has been unveiled as a purely business tool. Microsoft is doubling down on its enterprise venture, and it's even allowing third-party developers to create apps and tools for the service soon as well.",
    "We stopped by the Microsoft booth at MWC 2019 to see demonstrations of the new headset first hand. With time enough only for one of four demos, medical tech firm Pearson gave us a look at how HoloLens can be used to train medical students in the skill of diagnosing patients.",
    "[Update: We've had more time with HoloLens 2 during Microsoft's Build 2019 developers conference in May 2019. See our updated impressions of the HoloLens 2 interface below.]",
    "HoloLens 2 isn’t going to be a device you’ll buy on a whim. As it’s an enterprise-led product, it’s not as hard to stomach its high price, but it’s definitely not cheap in anyone’s book, least of all a typical consumer. However, Microsoft offers packages with the price starting at $125 (about £93, AU$175) a month, or you can buy one outright for $3,500 (about £2,600, AU$4,900).",
    "Those prices for the UK and Australia aren’t exact, but we’ll update this piece when we have the specific prices for the headset in these regions. You can pre-order the HoloLens 2 now to be shipped out later this year, but we don’t currently have an exact date for when it'll hit the shelves.",
    "However, we now know that a Development Edition of the headset will arrive alongside the traditional package sometime later in 2019. This will include $500 worth of Azure cloud service credits, as well as a three-month trial of Unity Pro and the Unity PiXYZ plugin for developers to sink their teeth into.",
    "HoloLens was a well-designed mixed reality headset, but since it was a first-gen product, it was clear some improvements needed to be made in the future. The main complaints were comfort, especially since it’s a device some professionals may be required to use for a few hours each day.",
    "That's one of the big improvements the Microsoft HoloLens 2 received, with the design being both smaller and lighter. We immediately noticed the weight difference when we put it on, and it's down to the company's new carbon fiber build.",
    "Despite being lightweight, the Microsoft HoloLens 2 still feels premium. It's comfortable and easy to adjust, with a wheel at the back of the headset to either tighten or loosen the edges around your head.",
    "There's padding all the way around, and we found it to sit securely on the head, too, so we weren't constantly worried it may fall off. This is a very expensive piece of kit to drop and break in your first five minutes of use.",
    "Overall, if you’ve used the first-gen headset, you’ll be hard-pressed not to notice the difference here. If you haven’t, just know that this won’t feel as uncomfortably heavy on your head as other virtual reality headsets can.",
    "One issue is you constantly feel like you want to pull the Microsoft HoloLens 2 up so you can focus on the task at hand. Having it on you is likely something you get used to over time, but during our short time with the headset, we found our hands drifting toward the headset to try and get a clearer view of what we were looking at.",
    "While we’re on the subject, that view is one of the big upgrades the Microsoft HoloLens 2 got, with Microsoft employing a 2K MEMS (or microelectromechanical systems) display.",
    "It may sound obvious, but the display is transparent, so you can see the augmented reality elements overlaying on top of real world objects. For example, our demo had a patient sitting on the edge of a bed waiting for our diagnosis.",
    "The patient was entirely augmented reality elements, but the bed in the room was real.",
    "We found the view through the headset to be clear, but under some harsh lighting at our MWC demo, we found it difficult to spot individual elements. Moving to worse-lit areas improved the display, but it's a shame the headset's brightness struggled under the light.",
    "That's either a quirk of the headset we were using or the lighting itself, but considering this is a device that’s being touted to work in a clinical setting, we’re surprised it struggled in this scenario.",
    "We can say that, in the softer light of a regular demo room at Build 2019, these visuals were much easier to pick up under standard fluorescent lighting.",
    "The field of view on this headset is now 52-degrees, beating the original’s 34-degree option. It’s also no longer in a 16:9 aspect ratio, allowing your augmented reality view to be taller.",
    "That may not sound like much on paper, but in practice, it means the augmented reality elements are right in front of your eyes, and that's enough. You also don't feel enclosed in, allowing you to move around the real world space without having to worry about knocking items off or – much worse – stubbing a toe.",
    "That larger field of view is one of the Microsoft HoloLens 2’s biggest upgrades, and that essentially means that you’re going to see a lot more in whatever app you’re using on the headset.",
    "Our time with the original HoloLens has been brief, but it was noticeable as soon as we placed the new headset on our head that the display technology is better.",
    "Additionally, there are many minor functionality upgrades you’ll want to know about.",
    "For example, there’s eye tracking software in the Microsoft HoloLens 2 that developers can build into their apps. You’ll have to calibrate this with a 30-second eye tracking demo, but it isn’t too much hassle to navigate around certain interface elements using your eyes.",
    "During our demo, a particularly good use case scenario was simply reading text. A small boxout within the user interface appeared, and when we finished reading a paragraph, the text began to scroll down slowly at the correct speed for what we were reading at.",
    "We sped up and slowed down our reading speeds, and after a few seconds the eye tracking technology caught up to what we were doing.",
    "Hand tracking tech here was a little temperamental within our demo. Pressing the buttons in the virtual interface would usually produce an immediate response, but there were times when we were left without anything.",
    "That might have been down to this headset not running the final software, but it may also be a quirk that will appear in the final version of the headset, as well.",
    "The headset also comes with a microphone onboard, so you can interact through speech with certain apps.",
    "In our demo, we were asked to speak to a virtual assistant who was helping us to diagnose a patient, but there’s a variety of different use cases for this tech in the new headset.",
    "Back to hand tracking – and it’s worthwhile mentioning one of the big upgrades here – the Microsoft HoloLens 2 can track your exact finger positions, so you can navigate easier and do more minute or dexterous tasks within the interface itself.",
    "We didn’t get much time to play around with this improvement at MWC 2019, but part of the calibration was with a hummingbird coming to sit on the palm of our hand. We found that if you had a singular finger up, within a second or so, the bird would know to fly down onto the tip of that finger.",
    "It’s one of those small, simple things that makes the whole experience that much more impressive, and we can’t wait to get our hands on one of these headsets for longer to know exactly how this tech holds up.",
    "Supporting this is a new development in the HoloLens 2 interface seen at Build 2019: conjuring the system-level Start menu is now achieved by lifting the inside of your wrist into the cameras' field of view. This makes a Windows logo appear on your wrist, and tapping that logo is what makes your Start options appear.",
    "This is a massive improvement over the previous method of pinching all of your fingers together and opening them like a blooming flower. However, there is a bit of a learning curve regarding exactly where to position your wrist for the logo to appear. This is still early days for the software, but this new approach is much more logical and promising for the headset's future.",
    "One element we didn’t get to test is the fact the Microsoft HoloLens 2 is designed to get used to your hands and their movements over time. We’re not currently sure how this will impact daily use of the headset, but it’s sure to be something that developers for the platform can embrace and expand on.",
    "The Microsoft HoloLens 2 looks to improve the experience of mixed reality, and once again seems to be a market-leading product in its own right. Whether these improvements will be worthwhile for the average HoloLens user is unclear, especially considering that hefty price tag.",
    "Microsoft's Greg Sullivan, chief of communications for the HoloLens division, tells us that Microsoft HoloLens 2 will continue to be a commercial device for years to come. Simply put, it's still simply too expensive to develop the product at a price that would be palatable to consumers.",
    "That said, this is a big step forward for the company, with the field of view improvements proving one of the most important elements to keep the mixed reality space moving."
  ],
  "headers": {
    "6": "Microsoft HoloLens 2 release date and price",
    "9": "Design and display",
    "23": "Functionality",
    "39": "Early verdict"
  },
  "links": {
    "MWC 2019": "https://www.techradar.com/news/mwc-2019-what-to-expect-from-the-biggest-mobile-show-of-the-year",
    "Development Edition of the headset": "https://www.techradar.com/news/hololens-2-developer-edition-revealed"
  }
}