{
  "source": "https://www.techradar.com/reviews/sony-mdr-1000xm2-wireless-headphones",
  "title": "Sony WH-1000XM2 Wireless Headphones review",
  "category": "audio-visual",
  "updated": "2020-01-07T16:49:49.472Z",
  "author": "nick-pino",
  "summary": "Crystal clear noise-canceling headphones that beat Bose",
  "verdict": "The Sony WH-1000XM2 improves upon the original flagship headphones. They sound great, deftly wield noise cancelation technology and cost just as much as a pair of Bose QC35s. They might have a slightly shorter battery life than the QC35, but the WH-1000XM2 outclass them in terms of performance and feature-set.",
  "pros": [
    "Superb noise-canceling",
    "Great-sounding audio",
    "30-hour battery life"
  ],
  "cons": [
    "Hinges are fragile",
    "Touch controls"
  ],
  "article": [
    "TechRadar’s review summary gives you all the key information you need for quick buying advice in 30 seconds - our usual full, in-depth review follows.",
    "Sony’s 2016 flagship headphones, the Sony MDR-1000X, didn't go unappreciated – they were lavished with awards from critics and best-of lists, offering serious competition to the Bose QuietComfort 25, which had long reigned as the best noise-cancelling headphones.",
    "And it was, until the Sony WH-1000XM2 came along.",
    "These Sony headphones made their debut during IFA 2017, and were received just as well as the ones that came before. They too won awards in spades and swiftly became our choice for the top noise-canceling headphone in 2018 for their excellent noise isolation, myriad features and dedication to Hi-Res Audio playback over Bluetooth.",
    "Of course since their release Sony has lifted the lid on the Sony WH-1000XM3 headphones. A whole year later at IFA 2018, the M3's launched and were compounded with subtle tweaks in comparison to the M2's, like a more comfortable pad along the bridge of the headphone, lighter design and a comparable price.",
    "Well OK, to be totally honest, buying a pair of the Sony WH-1000XM2 for everyday listening would be a bit overkill. Like its predecessor, these are premium, travel-grade headphones – the kind that are best used on flights or long commutes to block out noise.",
    "There are three neat tricks here that might make you pick the Sonys over the competitors: firstly an ambient noise mode that only lets in mid-to-high frequency tones (loudspeaker announcements maybe), and secondly a Quick Attention mode that allows you to let in all outside noise without taking off the headphones.",
    "Quick Attention is perfect when giving a drink order on a plane or speaking to a coworker for a brief moment before diving back into your work, for example.",
    "Thirdly, there's the LDAC codec. Alongside the widely adopted aptX HD standard, LDAC enables Hi-Res Audio playback using the 1000XM2... as long as the player you're using also supports that standard.",
    "If your player doesn't support aptX HD or LDAC – you're an iPhone user perhaps – then you aren't completely left out in the standard-resolution cold. The WH-1000XM2 also supports DSEE HX and S-Master HX, two Sony-specific technologies that take lossy audio from any source and up-convert it to near high-resolution.",
    "In short, these are active noise canceling headphones that not only keep sound out really well, but make the audio coming through them sound even better.",
    "When Sony briefed us on the WH-1000XM2 wireless headphones they made a few points exceptionally clear. The first was that these headphones are Sony's flagship headphones – that means they're feature-rich, as noted in the section above, and will sound like a premium pair of headphones should.",
    "The second was that, for the headphones to completely outshine the Bose QuietComfort 35, they'd need to bring down the cost. For that reason, the Sony WH-1000XM2 are available for $349 (£330, AU$499).",
    "By a lot of people's standards that's not necessarily cheap – so what is it that keeps the price of the Sony WH-1000XM2 headphones relatively high. A few reasons.",
    "For a start, Sony put a lot of hardware inside these headphones, not to mention the four microphones that are located inside the headphone and on the outer earcups.",
    "Noise cancellation of this caliber also requires a lot of software running, which means the WH-1000XM2 has a processing chip inside that's running calculations in real time. Add to that a touch-capacitive earcup that reacts to your touch and the price begins make a bit of sense.",
    "As for release date, the Sony WH-1000XM2 went on sale in June 2017.",
    "The Sony WH-1000XM2 wireless headphones, perhaps unsurprisingly, are very well-built. They have a metal bridge with a padded bottom that embraces the top of the head, while the faux-leather earcups are comfortable and cool, even after extended use. They have a bit of heft to them, but can be worn without causing neck strain.",
    "They are, almost uniformly, minimalist – which I think really appeals to the business-class customer Sony is targeting. The headphones come in only two colors as well – all black or all white – and beyond an engraved Sony logo above each earcup, are totally nondescript.",
    "Around the left earcup, you'll find the only two buttons on the headset: one for Power/Bluetooth and another to cycle the noise cancellation between its three settings (on, ambient, off). Down below the buttons is an auxiliary jack, which is mirrored on the other earcup by a microUSB port used to charge the device.",
    "While the overall design is really noteworthy, there are a few problem points to point out. One is that while the bridge is made of metal, the arms of the headphone (the strips of material that connect the earcups to the bridge) are made of plastic, as are the hinges that connect the earcups to the arms.",
    "Likely this won't cause any problems, but it does feel like this is a potential weak point in the design, and could be broken without much force.",
    "The other problem – which is more of a personal gripe rather than an objective imperfection – is that the WH-1000XM2 uses touch controls, exclusively. To skip forward, you swipe right on the right earcup or swipe left to go back. Pausing is done by double-tapping, and resuming is then done the same way.",
    "In a similar way, turning the volume down requires you to swipe down on the right earcup, and turning it up is done by swiping up.",
    "This will all make sense if you've used touch-capacitive headphones in the past, but hand these headphones off to someone who's unfamiliar with touch controls and they'll be utterly confused.",
    "To make matters worse, the touch controls don't work when the included 3.5mm cable is used, which means pulling out your phone when you want to change the music. This could've been avoided with a more traditional control scheme like an in-line microphone.",
    "Besides the 3.5mm cable, the Sony WH-1000XM2 comes with a hardshell case and a microUSB cable.",
    "Noise canceling headphones, by their very nature, usually don't sound very good. It's hard to articulate why exactly that is, but because there needs to be so much hardware crammed into such a tiny space, the end result isn't always great.",
    "We're pleased to report that the Sony WH-1000XM2 is the exception to the rule.",
    "We found their flat(ish) EQ to be listenable to for long periods of time without causing fatigue. Mids are straightforward and highs come through crystal clear – although they can become a bit much especially when the headphones are cranked up to higher volumes in quiet environments. The bass is nice and weighty and can have some real slam to it, but you won’t find that same bloated level of bass here like you would in other manufacturers.",
    "The WH-1000XM2 wireless headphones will sound a bit better while using an Android device that supports the aptX HD standard, but even on an iPhone they're surprisingly great. They’ll sound even better if you can find yourself a device that supports the LDAC codec (standard on every Android device from Oreo onwards).",
    "That said, you're unlikely to be buying noise canceling headphones to replace your hi-fi cans – you want them to cut out the noise. To that end, the Sony WH-1000XM2 are a formidable sound-silencing pair of cans.",
    "Not having the good fortune of having a flight to test them out on, we resorted to more pedestrian forms of transportation (trains and car rides), crowded locales and simulated test environments (a jet-engine noise played over our home speaker system) to test these out.",
    "In each case, the WH-1000XM2 wireless headphones performed admirably, often reducing noise from a disturbingly loud hum to a more manageable buzz – and sometimes eliminating exterior noise entirely.",
    "Perhaps even more impressive than the reduction or complete elimination of noise is the WH-1000XM2's ability to selectively allow some noises into the headphones. With Ambient Noise mode selected, announcements made over train station PA systems could be heard, giving us time to switch to Quick Attention mode to hear what's being said.",
    "In and of itself, Quick Attention mode is the star of the show here – allowing you to quickly pipe in external audio without taking off the headphones by reducing the volume of the music and using the two microphones located on the outside of each earcup. It's a feature you won’t find a Bose-branded pair of headphones and it really helps set Sony apart from the crowd.",
    "The last point worth covering is battery life. Sony claims the WH-1000XM2 headset has around 30 hours of battery life – a claim that seemed to hold true throughout the testing process. Over a period of four days while the headphones were being tested, they only needed to be recharged once – which would make logical sense if each day had around eight hours of listening time.",
    "For comparison that's about 10 hours more than the Bose QuietComfort 35 when used wirelessly and 10 hours less than the Bose used in wired mode. However you slice it, it's still more than enough juice to get you across the Atlantic and back if you're coming from the West Coast of the United States.",
    "The last neat feature to mention with the WH-1000XM2 wireless headphones is quick-charge, which pumps about 75 minutes worth of playback into the headphones with just a short 10-minute charge. It's handy for the days you forgot to charge your headphones in advance and need to run out the door.",
    "The wireless Sony WH-1000XM2 are an excellent revision of an already great pair of headphones. They sound great, deftly wield noise cancellation technology and cost just as much as a pair of Bose QC35s. They might have a slightly shorter battery life than Bose's flagship over-ear headphones, but Sony's WH-1000XM2 outclass the QC35 in terms of performance and feature-set.",
    "There's not much to complain about with the WH-1000XM2, which means the one or two small problems it does have stick out like a sore thumb.",
    "Our biggest gripe is that the hinges on the headphones are a bit fragile – especially for the price tag. Also, the control scheme, while innovative, has a bit of a learning curve to it. Worse, the touch-capacitive pad on the right earcup won't work when the headphones are wired.",
    "There's no two ways about it, the Sony WH-1000XM2 are exceptional business-grade noise-canceling headphones. They're perfect for long flights or train rides, and not only do they keep sound out extremely well, but they'll make incoming audio sound fantastic as well.",
    "They're a good pick for most everyone – but Sony/Android owners will get the best bang for their buck in terms of audio performance.",
    "If you want to stay bang up-to-date, we recommend the newer Sony WH-1000XM3 headphones, which offer outstanding noise cancellation and a 30-hour battery life.",
    "Correction October 24, 2017: This article originally referred to the headphones as the MDR-1000XM2 – an amalgamation of last year's and this year's product name – but has since been corrected to WH-1000XM2."
  ],
  "headers": {
    "0": "The Essential Review",
    "5": "Who's it for, and should you buy it?",
    "11": "Sony WH-1000XM2 price and release date",
    "17": "Sony WH-1000XM2 business-class design",
    "27": "Sony WH-1000XM2: first-class performance",
    "36": "Sony WH-1000XM2: battery life",
    "39": "We liked",
    "40": "We disliked",
    "42": "Final verdict"
  },
  "links": {
    "Sony MDR-1000X": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/sony-mdr-1000x-wireless-headphones-1327770/review",
    "Bose QuietComfort 25": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/bose-quietcomfort-25-1271292/review",
    "best noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Sony headphones": "https://www.techradar.com/best/sony-headphones",
    "IFA 2017": "https://www.techradar.com/news/ifa-2017",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Sony WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review"
  }
}