{
  "source": "https://www.techradar.com/reviews/honor-band-5-review",
  "title": "Honor Band 5 review",
  "category": "wearables",
  "updated": "2020-02-17T12:27:03Z",
  "author": "tom-bedford",
  "summary": "An affordable fitness tracker",
  "verdict": "The Honor Band 5 is a small, but steady, step up from the Honor Band 4 in many regards. It’s got it’s problems, for sure, but as one of the most affordable fitness trackers on the market right now, it’s easy to forgive these issues.",
  "pros": [
    "Affordable price tag",
    "Improved sleep tracking",
    "Expanded exercise roster"
  ],
  "cons": [
    "Screen sometimes unresponsive",
    "Must be plugged in to power on",
    "Notifications temperamental"
  ],
  "article": [
    "The cheap fitness tracker market is a competitive one, with devices from the likes of Honor, Xiaomi, Samsung and Huawei scrapping for a place on your wrist (and aspiring to join Fitbit as household names for fitness tracking). The Honor Band 5 is one of the latest offerings from Huawei’s burgeoning sub-brand to hit the market.",
    "It’s a bare-bones device, with only a few key features and functions, and it certainly won’t appeal to those who use their tracker to monitor every aspect of their health and fitness. If, however, you just want the highlights, such as step count and sleep time, it may suit you just fine – and its limitations are reflected in its price, as it’s one of the most affordable fitness trackers on the market.",
    "For the Honor Band 5, Honor has thrown some premium-feeling features into the mix, including an improved screen, but it’s essentially a wearable that corrects some of the problems of the Honor Band 4. If this isn't for you, there's always the slightly more fitness-focused Honor Band 5 Sport to look at too.",
    "You can pick up the Honor Band 5 for $36.99 / £29.99 / AED 110 (roughly AU$55). That’s a lot cheaper than the Honor Band 4 launched for – it cost $59.99 / £59.99 (around AU$85). That means that if you’re looking for a new fitness tracker there’s no reason to consider older models of the Honor Band, especially as the Band 5 brings several improvements.",
    "That said, getting hold of the Honor Band 5 might be easier said than done. At the time of writing you can only pick up the wearable from third-party retailers via Amazon in the US, while in the UK and the UAE, you can pick it up from a range of retailers.",
    "The Honor Band 5 consists of a small body, which houses the screen, and also removable straps (that are actually pretty hard to remove).",
    "The Honor Band 5 is a slim fitness tracker – it looks very similar to the Honor Band 4, and you’re certainly not getting a hugely redesigned device. It’s slim, similar to the Xiaomi Mi Band 4’s, with not much width or thickness, and the body is as wide as the strap, although it’s a little thicker.",
    "This strap is made of silicone, which is a fairly standard material for fitness tracker straps, but if you’ve got a skin condition you may want to watch out for irritation. It’s a long strap, with plenty of lugs, so you’ll easily be able to get it to fit your wrist.",
    "The Honor Band 5’s body is fairly thick relative to its width, so it stands out from your wrist some way, but it’s not as noticeable as some other wearables. At 22.7g, the Honor Band 5 isn’t exactly a heavy device, and we found it pretty easy to ignore while wearing it.",
    "On the body, there’s the screen (which we’ll get into below), and also a round button, which functions like a sort of home button. We found this feature a little confusing – it’s not always clear if you should press this button, or the main screen, to toggle a function like turning off an alarm or closing a notification.",
    "Other than that, it’s a pretty barebones device, with no physical buttons or complications. If you’re not paying much for your fitness tracker you can’t expect it to have a busy design, and you possibly don’t want it to.",
    "You can choose from three colors for the strap – black, navy, and pink – but the body is only available in black.",
    "The Honor Band 5 display is an AMOLED screen, which is one of the standout new features of the fitness tracker, as the Band 4 only had an OLED display.",
    "AMOLED screens offer better brightness and more vivid colors, and here the difference is noticeable. The watch face designs look a lot more vibrant, and the different menu logos look a lot less ‘flat’ than on the Band 4, and on some other trackers.",
    "Speaking of faces, there were only three to choose from on the Band 4, but now there are lots, with nine included on the device out of the box, and more available through the app, giving you plenty of options for customizing your device.",
    "The screen is the same size as the one on the Band 4 at 0.95 inches, so you’re not getting loads of information on the screen at once, which can be good for simplicity but annoying for notifications or detailed exercise information. In fact, it sometimes felt like a slightly larger screen would be useful for swipe commands, as swiping right or left was sometimes a little hard if you didn’t start near the edge of the screen.",
    "The display seems pretty robust, which is good news if you tend to bump your wrist on things a lot – over the course of our review we knocked the screen a few times against various surfaces, but left no visible scratches or dents."
  ],
  "headers": {
    "3": "Honor Band 5 price and availability",
    "5": "Design",
    "12": "Screen"
  },
  "links": {
    "Honor Band 4": "https://www.techradar.com/reviews/honor-band-4-review",
    "Honor Band 5 Sport": "https://www.techradar.com/reviews/honor-band-5-sport",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FDocooler-Intelligent-Real-Time-Monitoring-Waterproof%2Fdp%2FB07VL8NWYZ%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1194232282244680200-20",
    "Xiaomi Mi Band 4": "https://www.techradar.com/reviews/xiaomi-mi-band-4-review",
    "skin condition you may want to watch out for irritation": "https://www.techradar.com/news/should-you-use-a-smartwatch-or-fitness-tracker-if-you-have-a-skin-condition"
  }
}