{
  "source": "https://www.techradar.com/reviews/samsung-nu7300-series-un55nu7300-ue55nu7300",
  "title": "Samsung NU7300 Series (UN55NU7300, UE55NU7300) review",
  "category": "televisions",
  "updated": "2019-01-23T23:08:24Z",
  "author": "john-archer",
  "summary": "Curved TV is too ambitious for its own good",
  "verdict": "If you like the idea of a curved screen, this 55-inch 4K model from the world’s number one TV brand might sound nigh irresistible. However, while there are certainly aspects of the UE55NU7300’s features and performance that live up to the Samsung name, it falls short in a couple of key areas that leave the door open for one or two other, even cheaper rivals.",
  "pros": [
    "Aggressive price",
    "Good smart platform",
    "Pictures look good",
    "Attractive curved design"
  ],
  "cons": [
    "Not very bright",
    "Curved screen seems pointless",
    "Some backlight distractions",
    "No Youview/Freeview Play"
  ],
  "article": [
    "If you still carry a torch for curved TV screens, the Samsung NU7300 is one of a dwindling number of TVs that could prompt you to upgrade your flatscreen - its features and performance live up to the Samsung name and it's capable of playing high dynamic range (HDR) content from Netflix and others.",
    "While curved TVs might not have the clout they once carried, this screen serves up one of Samsung’s customarily strong mid-range picture quality performance in a surprisingly affordable curved form, and will surely find plenty of admirers.",
    "While the curved shape won’t really enhance your viewing experience on a 55-inch TV unless you sit unusually close to the screen, it does enhance the NU7300’s design. There’s just something elegant and even strangely calming about the curved shape - especially as here it rests cutely on a pair of slender, gleaming metallic feet.",
    "If you don't want to set your screen on an entertainment center, you can wall-mount the NU7300 series as well... just be aware that the curved design can look quite cumbersome and chunky if you hang it on your wall.",
    "The set’s finish is a touch plasticky, but is saved by a welcome metallic trim to its outer edges.",
    "Unlike higher-end Samsung TVs, the NU7300 carries all of its connections on its rear, rather than on an external connections box. On the 55-inch version of the TV these connections include three HDMIs, a pair of USBs, and both Ethernet and built-in Wi-Fi network options. A fourth HDMI might have been nice, but in truth three will likely suffice for most households.",
    "Design TL;DR: The NU7300’s build quality isn’t anything special, but its frame is attractive, and its curved shape guarantees that it stands out from the crowd.",
    "Samsung’s Eden interface is now one of the best smart systems around: Its menus are compact and well organised, as well as being easy to customise so that your favourite apps, inputs and channels appear first on the horizontally scrolling bar of content icons.",
    "The Apple TV-style second tier of contextual icons that opens up when you highlight apps on the bottom row works well, and Samsung has a vast collection of apps at its disposal that includes all the key video streaming options.",
    "That said, Netflix, Amazon Prime Video, YouTube and Rakuten apps are all on-board and all support the services’ 4K and HDR capabilities, too.",
    "Similarly, while Samsung has managed to onboard all the catch up apps of the UK’s main terrestrial broadcasters, it hasn’t yet joined most other big TV brands in the UK by including support for either the helpful YouView or Freeview Play catch-up TV ‘wrappers’.",
    "Elsewhere on the platform, Samsung’s voice recognition and control system is excellent, too, in terms of how accurately it recognises your words, how simple your commands can be (often a single word is enough) and how far the voice control extends into the TV’s deepest features and adjustments.",
    "Our only complaint about the NU7300’s smart system is that the plain white backdrop behind the icons makes the menus look a little dated - but that's not a dealbreaker by any means.",
    "Smart TV TL;DR: Packed with content and easy to use and customise, Samsung’s smart TV system is now one of the best.",
    "To our great surprise, the NU7300 is at its best with HD, standard dynamic range content rather than high dynamic range stuff.",
    "For starters, it does a terrific job for its money of upscaling HD TV shows and films to its native 4K resolution. These upscaled pictures look more detailed, more pixel-rich and more sharp without looking noisier or processed than we usually see on such affordable TVs. Edges are enhanced, too, without the accompaniment of ghosting or stressing, and colours retain their natural tones - as well as getting more refined blends.",
    "The upscaling processing is fast enough, too, to enhance the resolution without suffering lag or blurring when there’s a lot of motion to handle.",
    "The NU7300 has enough contrast, brightness and colour range to remind you of just how much subtlety, precision and artistry can go into a high quality SDR picture.",
    "You can, if you like, call in Samsung’s HDR+ feature, which converts SDR pictures into HDR. However, this doesn’t work as effectively as it does on Samsung’s more high-end TVs. Colours don’t look quite as believable, and black levels don’t look as convincing (for reasons discussed in the next section of the review).",
    "Stick to the TV’s ‘native’ SDR modes, though, and you’ve got a HD/SDR performance that few if any other TVs in the same price bracket can match.",
    "HD/SDR Performance TL;DR: You seriously struggle to find another 4K TV for the same money that handles ‘legacy’ content better than the NU7300.",
    "While the NU7300 is unusually talented for its money at handling HD/SDR content, it has been designed with 4K HDR playback in mind. So it’s not surprising to find it handling the 4K part of this equation, at least, with aplomb.",
    "There’s a clear increase in detail and clarity when you switch from upscaled HD to native 4K content. What’s more, the sense of 4K clarity remains pretty intact even when the TV has to cope with motion. In this latter respect, in particular, the NU7300 sets itself comfortably above and beyond the 4K performance of the vast majority of rival budget 4K TVs.",
    "Samsung’s set has the colour refinement, too, to keep up with its 4K pixel count. In other words, the sense of 4K clarity isn’t reduced by colour ‘clumping’ or excessive smoothness. Similarly, skin tones look refined and realistic rather than plasticky and mannequin-like.",
    "You do need to keep the TV’s sharpness down to around its 30% level if you don’t want native 4K pictures to start looking a little noisy around edges and over areas of very fine detail. But provided you do that, you’ll be happy you took the 4K plunge.",
    "The NU7300’s HDR performance, though, is more… complicated.",
    "For starters, surprisingly for a Samsung TV, it’s not very bright. We measured 300 nits on a 10% white HDR window - way down on the 700 nits and (sometimes much) more typically found on Samsung’s more premium TVs. This is not enough brightness to really do HDR justice.",
    "This limited brightness obviously limits the impact of HDR’s expanded brightness range. You do see some sense of extra punch and dynamism when switching from SDR to HDR, but don’t think for a minute that the NU7300 is giving you anything like a full-blooded HDR experience.",
    "While this is disappointing given Samsung’s usual ability to deliver more brightness on mid-range TVs than other brands, though, there is one bit of good HDR news to report. Namely that the TV does a pretty good job by budget HDR TV standards of ‘mapping’ HDR content’s characteristics to the screen’s more limited capabilities. By which we mean that colours still look believable rather than unbalanced or forced, while the brightest parts of HDR pictures don’t clip (lose detail and tonal finesse) as much as they typically do with TVs that have such limited brightness to work with.",
    "Their lack of brightness, though, isn’t the only issue with the UE55NU7300’s HDR pictures. Black levels are also troublesome, too.",
    "If you turn off the TV’s dynamic contrast features with HDR, black levels don’t look great. Worse than those of some rival budget 4K TVs, in fact (we’ll come back to this later). Turning the dynamic contrast feature on increases the black levels depths the NU7300 can reach considerably - to a point, in fact, where they actually become good by very affordable TV standards.",
    "However, there’s a price to pay for these much improved black levels (and greatly improved general contrast). Which is that dark areas of the picture tend to look quite unstable thanks to the aggressiveness with which the TV’s adaptive dimming engine has to work to try and suppress greyness where there should be blackness.",
    "To be fair to Samsung, you could argue that this is a result of the TV trying too hard. A relatively honorable trait that also has an upside in that it makes bright HDR scenes look slightly bolder than they don many budget rivals. However, in the end trading a little brightness for more black level stability may ultimately have resulted in a more consistent and therefore immersive HDR performance.",
    "One other general problem with the NU7300’s pictures is their limited viewing angle, as black levels and colour saturation takes a hit from anything more than around 30 degrees off axis. Worse, the edges of the curved screen can start to distort the image shape once you get beyond around 35 degrees off axis.",
    "4K/HDR Performance TL;DR: While the UE55NU7300 gives a great account of itself with 4K sources, its edge lighting system causes some distracting backlight issues with HDR.",
    "Sound performance is a strong point for the NU7300 - it can go loud enough to create an immersively large soundstage without sounding brittle or strained. Voices sound well rounded and clear, while bass levels don’t suffer with distortions or cause the TV frame to crackle or rattle (even though they don’t get particularly deep).",
    "The mid-range has just enough dynamic range to its name to enable it to shift up a gear or two to handle a mounting action scene.",
    "Our main complaint about the 55-inch NU7300’s sound is that the lack of any forward-facing speakers means that the occasional sound, particularly male dialogue, can appear like it’s coming from behind the TV, rather than from the onscreen action.",
    "Sound Performance TL;DR: The 55NU7300 produces a much more involving and powerful sound performance than the vast majority of budget 4K TVs.",
    "It’s fair to say that budget 55-inch 4K, HDR-supporting TVs aren’t exactly a dime a dozen. There are a couple of significant rivals for the 55-inch NU7300, though. Albeit only models with flat rather than curved screens.",
    "The best all-round competitor is the Philips 55PUS6753. This gorgeous looking TV combines a silver metallic body with Philips’ unique Ambilight technology to deliver a truly stand-out design, while its pictures enjoy deeper, more consistent black levels. Especially with HDR. It does colours very well too, and also makes 4K look exceptionally sharp.",
    "It’s not quite as bright as the NU7300, so it’s HDR impact is even less pronounced than it is on the Samsung. But overall its pictures are more consistent. And this from a set that currently costs just £480.",
    "If you're in the US, we'd point you toward the TCL 6-Series. At $650 for a 55-inch screen, it's around the same cost as the NU7300 plus it supports both the standard version of HDR as well as the more advanced Dolby Vision.",
    "Although it’s not as bright as we might have hoped given that it’s a Samsung HDR TV, the NU7300 still delivers crisp, detailed, colourful pictures with HDR and SDR pictures alike. It sounds decent too, and its smart features are impressive for the money.",
    "However, some distracting backlight issues undermine its HDR performance a little too much for comfort and, unfortunately, the curvature of its 55-inch screen arguably does more harm than good."
  ],
  "headers": {
    "2": "Design",
    "7": "Smart TV (Eden)",
    "14": "HD/SDR Performance",
    "21": "4K/HDR Performance",
    "35": "Sound",
    "39": "Other panels to ponder",
    "43": "Final verdict"
  },
  "links": {
    "Philips 55PUS6753": "https://www.techradar.com/reviews/philips-55pus675312-4k-tv",
    "TCL 6-Series": "https://www.techradar.com/reviews/tcl-6-series-r615-r617"
  }
}