{
  "source": "https://www.techradar.com/reviews/metro-exodus-review",
  "title": "Metro Exodus review",
  "category": "gaming",
  "updated": "2019-02-13T15:00:49Z",
  "author": "vic-hood",
  "summary": "Radioactive roaming",
  "verdict": "Metro Exodus is a much-needed gritty and dynamic take on the post-apocalyptic genre, but is let down by bugs and glitches.",
  "pros": [
    "Darker than other post-apocalyptic titles",
    "Autonomy over playstyle",
    "Balances linear with sandbox",
    "Dynamic gun modification system"
  ],
  "cons": [
    "A lot of bugs and glitches",
    "Long loading times",
    "Can feel like early-generation title",
    "Often clichéd"
  ],
  "article": [
    "“How would you survive the apocalypse?” It’s the question that separates the wheat from the chaff and the strong from the weak. You’ve probably had the conversation at least once, rhyming off the rehearsed action plan you have for the end of the world and arguing why your strategy is definitely better than your friends. Maybe you’ve got a go-to location in mind, are in peak physical shape, or simply have an acquaintance with questionable arms experience.",
    "Regardless, your interpretation of the apocalypse is probably quite rose-colored (and in your mind’s eye, you’re probably a much better shot). We can thank the likes of Fallout, Rage, The Walking Dead and young adult fiction for this misconception of a sexy armageddon. The reality of radioactive fallout is much darker: poisonous dust and ash, mutations and desperation.",
    "Metro Exodus does not shy away from this gritty, rust-coated truth, instead embracing the macabre, misery, and fear of the end of the world – while adding a touch of (sometimes clichéd) madcap embellishment.",
    "For those who may not know much about the Metro series, let me break it down for you. The Metro universe encompasses both books and videogames, and is built around the post-apocalyptic novels of Russian author Dmitry Glukhovsky. The series follows a group of survivors who have hidden themselves in the Moscow Metro following a nuclear holocaust.",
    "Metro Exodus carries on from the events of the Metro 2033 and Metro Last Light games. However, Exodus doesn’t follow directly on from these games, with the Metro 2035 novel serving as a foreword instead. If, like myself, you hadn’t played any of the other games in the Metro series and are wondering if it’s critical to do so: no, it isn’t. You can essentially make sense of what’s happening without any prior knowledge.",
    "But, for those who are familiar with the Metro series, Exodus will prove a literal breath of fresh (if not irradiated) air. Having learned that humanity was not entirely destroyed by the holocaust, protagonist Artyom and his fellow survivors finally escape the dingy confines of the underground on a hijacked train dubbed the ‘Aurora’ and travel East across the desolate ruins of Mother Russia to find somewhere safe to settle.",
    "The journey follows the survivors over the course of one in-game year, spanning the various nuclear-impacted seasons. While there aren’t a huge number of locations to visit, each stop on the Aurora express has its own unique environment and obstacles.",
    "Volga sees you traversing the frost-kissed landscape surrounding the Volga river, fending off mutated dog-like creatures, giant woodlouse monsters and a cult of electricity-hating individuals who would put Jonestown to shame. Later there’s a situation which sees you land in what can only be described as a dinner party at Ed Gein’s shack. While Caspian sees you trek through the sandy dunes of the former Caspian Sea - complete with rusted boats and decaying lighthouses – as you gun down mutant humanimals, punch bandits in the face and try to avoid being snatched like a lamb by a flying demon.",
    "The break through the surface opens up Metro in a whole new way. The story remains quite linear, but there are sandbox pockets which almost make it feel like an open-world. However, there are often times when you’re harshly reminded of the confines of the game world you're operating in.",
    "Walking bang-smack into an invisible boundary, the inability to climb on anything you wish, getting caught on bushes – it all brings you harshly back to frustrated reality. Despite this, sandbox areas generally allow you control over how you play, as well as the overall outcome of the story.",
    "This is particularly evident in the bandit camp challenges. While optional, your map marks where you can infiltrate a camp, take down its immoral inhabitants and scavenge the loot. It’s not stealing if it’s from a thief, right? It’s often best to approach this with a sneaky approach, avoiding the light and making minimal mess. But, that’s not mandatory.",
    "You can go in guns blazing if you want. Just be aware that it may affect the story, and there may be an innocent, horrified prisoner who serves as collateral damage. Often the prisoners have useful information on loot or an item to make life easier for you later – it’s a welcome respite from the main storyline, and they don’t take up much of your time.",
    "It's also important to scavenge anything you can: crafting is a huge part of Exodus and is often the key to your survival. While workbenches allow for more technical crafting and the attachment of shiny, new weapon mods, crafting on-the-go is your bread and butter.",
    "Artyom can throw together medkits, throwing knives, gas mask filters and a small selection of other items while exploring the wasteland, simply at the touch of a button. However, prioritising what items should be crafted and how these resources should be spent can prove infuriating, especially as the game progresses and the Aurora crew begin to snaffle what little you have left.",
    "Despite this, crafting just feels fun. It feels like you’re putting effort into surviving while on the battlefield, using your wits to work out the best ways to conserve resources and altering your play style to suit. But where Metro really shines is in gun modification.",
    "Metro’s gun modification system is a dynamic marvel. While you can only hold three guns at a time, you’re not restricted to choosing one of each particular weapon out of necessity. For example, typically in shooters we’ll tend to pack one pistol, one assault rifle and one sniper rifle to cover a series of situations. That’s not necessary in Exodus and it’s a very welcome change. Instead, you can add any of the mods you’ve picked up or scavenged from other weapons to mostly any of the guns in your arsenal. Scope on a pistol? Sure. Suppressor on a shotgun? Irrelevant, but sure.",
    "It’s a feature we didn’t truly appreciate until becoming stuck in a tricky situation in Caspian. Having used all the sniper ammo and medkits at our disposal, we hid in a small tent to avoid the flurry of gunfire coming from a thug camped on a high platform outside (and the flying demon swooping over our head).",
    "There was no way the assault rifle was hitting him. After some frustration and multiple deaths, we remembered that we could simply take the 6x scope off the other weapon and stick it on the assault rifle. Voilà!",
    "While Metro Exodus does so much to shake up the tiresome post-apocalyptic genre, technically there are some glaring issues. During our playthrough on PlayStation 4, we encountered countless bugs and glitches which sucked the joy from the game at times. Instances include: screen tearing, ragdoll AIs who twitch incessantly upon death or melt into their surroundings, floating enemies and – perhaps the most frustrating of all – cutscenes which didn’t trigger, resulting in having to reload checkpoints to proceed.",
    "These are issues you rarely think will happen in modern games, and while it may be something which occurred with previous games in the series, games as a medium are now held to a different standard. In addition, heinously long loading times and extreme fall damage (maybe it’s the irradiated bones?) put the nail in the coffin and greatly impacted our enjoyment of Metro.",
    "Metro Exodus is a great game in so many respects, but its technical obstacles are impossible to overlook. While Exodus gives you autonomy over playstyle, is versatile in its ability to remain linear and offer sandbox sections, and has a gun modification system unlike other games we’ve seen in the genre; it feels like an earlier generation title in so many respects.",
    "Clunky controls, bugs and awkward voice-acting are factors which should have been ironed out and while, for some, they may be entertaining in themselves, there’s little place for it in modern gaming."
  ],
  "headers": {
    "3": "Plains, trains and automatic rifles",
    "8": "From Russia, with dust",
    "18": "Squashing radioactive bugs",
    "20": "Verdict"
  },
  "links": {}
}