{
  "source": "https://www.techradar.com/reviews/canon-powershot-g5-x-mark-ii-review",
  "title": "Canon PowerShot G5 X Mark II review",
  "category": "cameras",
  "updated": "2020-05-12T12:00:34Z",
  "author": "matt-golowczynski",
  "summary": "The perfect enthusiast camera?",
  "verdict": "The Canon PowerShot G5 X II manages to blend its capable core with some useful features, great handing, a fine build and a strong level of control. It's an enjoyable camera to use, but it can't be said to stand out against key competitors. Should its price fall, however, it will be far more appealing for the enthusiast looking to travel light.",
  "pros": [
    "Very good image quality overall",
    "High-quality build and attention to detail",
    "Good handling for such a small body",
    "EVF is nice and clear"
  ],
  "cons": [
    "Lens is soft at wider apertures",
    "4K videos good but not too competitive",
    "Battery life could be better",
    "Somewhat pricey next to rivals"
  ],
  "article": [
    "This is TechRadar’s review summary that gives you all the key information you need if you’re looking for quick buying advice – our usual full, in-depth review follows.",
    "The Canon PowerShot G5 X Mark II isn't the conventional Mark II update that we normally see with this kind of compact camera. Sure, it arrives with a handful of improvements to the spec sheet that we may have expected, but its completely different design signals different intentions – and with it, potentially a different kind of use too.",
    "Things have moved on inside the camera too. Canon has made a handful of changes to the imaging pipeline, fitting the model with a new 20.1MP stacked 1-inch CMOS sensor, and with the company's latest DIGIC 8 processing engine driving things. This also allows for 4K video recording, and Canon notes that this happens without any crop factor – a common complaint on cameras of all classes that record 4K video.",
    "This, in turn, means the wide-angle view of the lens can be maintained during video recording. The lens itself is a new optic, one that offers a focal range equivalent to 24-120mm in 35mm terms, and a respectably wide maximum aperture of f/1.8-2.8, together with lens-based image stabilization that claims a four-stop compensatory effect.",
    "The body has been fitted with a 2.36 million-dot EVF and a 3-inch LCD screen that can be tilted downwards and upwards, and all the way around to face the front when necessary. An eye sensor positioned just above the LCD also means that the camera can automatically switch the feed between the two as it detects you looking from one to the other.",
    "Other new features include a 30fps raw burst mode, which sits alongside a 20fps regular burst mode, while a 31-point contrast-detect AF system, Wi-Fi, Bluetooth and USB charging have also all been thrown into the mix.",
    "Design-wise, gone is the G5 X's DSLR-like styling, and in steps a more streamlined body, one that still offers a defined grip and physical controls, but with its concealed EVF keeping it as portable as possible when not in use. This apes the design of previous Sony RX100 models, and makes the camera far easier to squeeze into a pocket, although the grip does give it an advantage over the RX100 lines, as it feels far more secure in the hands.",
    "With a DIGIC 8 processor on board, the camera is sprightly in use. The rear command dial/menu pad enables you to zip through the EOS-style menus very quickly, although you can use the responsive touchscreen for speedy option selection too. The screen responds just as well when used to set the focus point, with just a slight delay when swiping through captured images.",
    "Focusing is generally nice and brisk, and the focus tracking system does well to adhere to subjects. Face detection is also fast, and does well to spot smaller subjects, while the image stabilization system is also clearly effective, helping to deliver crisper images and a more stable feed as you're composing images.",
    "Image quality is generally very good too, with reliable exposures, and the ability to choose from Canon's established Picture Styles helps you to get the results you want with minimal fuss. The lens can be a little soft at its wider focal lengths and wider apertures, however, and this also gives 4K videos some softness; when you zoom in and close down the aperture, things look considerably better. Noise is also well controlled, although it's a good idea to either deactivate noise reduction or switch to the lowest setting, as the default Standard option is a little aggressive.",
    "Overall, the G5 X Mark II is a lovely camera to handle and use, and its well-rounded feature set means it can handle a wide range of scenes without much trouble. Its price is too steep right now, though, particularly when you consider the strong performance of some of the camera's rivals.",
    "The Canon PowerShot G5 X Mark II is aimed at the kind of photographer who expects a standard of image quality beyond the norm for a compact camera, much closer to what you'd expect from a DSLR or mirrorless model. With a pop-up viewfinder, physical dials and a control ring around the lens, it's perfect for those who want to have maximum manual control over their picture-taking, rather than relying on touchscreens and auto settings.",
    "The PowerShot G5 X Mark II mirrors the previous PowerShot G5 X in offering a 20MP 1-inch sensor, although the one here is new. We know this because it has a stacked design, much like the ones inside more recent generations of Sony RX10 and RX100 cameras.",
    "The lens is also new, covering a focal range of 24-120mm (in 35mm terms) and with a respectable f/1.8-2.8 maximum aperture, while lens-based image stabilization to the tune of four stops is also on hand. This DIGIC 8 engine also brings with it Canon's CR3 raw format, a more efficient alternative to the full-fat raw format that's also provided here.",
    "While previous PowerShot G5 X was only capable of capturing videos in Full HD, the G5 X Mark II arrives with 4K shooting up to 30p. Outside of the 16:9 aspect ratio used for capturing 4K UHD footage, there's no crop factor here, which means you retain the same angle of view as when shooting stills. Unlike on the new PowerShot G7 X Mark III, however, you can't hook an external microphone to the camera in any way.",
    "Other video-based features include 4K timelapse shooting, and a built-in ND filter to help control exposure when shooting in brighter light (or for long exposures). You also have the ability to capture footage at 120fps in Full HD for slow-motion output.",
    "The camera's focusing system may seem a little dated, being a contrast-detect AF system with only 31 points when left to its own devices, although you can touch the screen to have the camera focus on that point in the scene. Face detection, focus bracketing and focus peaking are also all on hand.",
    "As in the PowerShot G5 X, Wi-fi is on board, and this is now joined by Bluetooth. There's a single card slot at the base of the camera which accepts SDHC and SDXC cards to the UHS-1 standard, and a USB-C port and micro HDMI-out on the side of the camera.",
    "Battery life is fairly modest at around 230 shots per charge, and just 180 when using the EVF, although as with all cameras, what you can achieve in real-world use will be higher than the figures suggest due to the way they're calculated. Canon reckons that with the Eco mode enabled you'll be able to enjoy battery life closer to 320 frames.",
    "The PowerShot G5 X Mark II's build quality feels great overall, with plenty of attention to detail around all the controls, and enough rubber used on the front plate and rear to give a secure hold.",
    "The only thing that lets the camera down here is the feel of the control ring around the lens, which is nice and deep but very coarse in its increments, with a somewhat hollow feel when turned; it's not a deal-breaker, though, and the fact that it's clicked means you get good feedback when turning it.",
    "The 2.36 million-dot EVF is stowed in the top plate when not in use, and you release this via a catch at the side. You also have to pull it back before use, and push it forwards before stowing it again, which is a slight inconvenience but no more.",
    "It would have been understandable for such an EVF to come at the expense of a built-in flash, as is often the case, but Canon has impressively managed to squeeze both into the body here.",
    "The EVF itself is perfectly good for a camera of this level; it's not as impressive nor as large as those on the recent breed of mirrorless cameras, but it's reasonably clear and detailed. It even does well in brighter conditions, where you might expect to have to cup your hand around it.",
    "The LCD underneath the EVF is a 3-inch touchscreen with 1.04 million dots, and, as we'd expect, it's fully sensitive to touch. Its profile is nice and slim, and its degree of movement is great; having it mounted on such a long bracket not only allows you to pull it up to face the front, but also down sufficiently to enable the camera to be used well above head height.",
    "An eye sensor just above the LCD tells the camera when to switch between the LCD and EVF, and there's very little delay here.",
    "Focusing is generally nice and speedy, even in darker conditions. It's not quite instant, but, as is often the case, not so slow that it makes any difference in practice.",
    "The G5 X Mark II also does well to keep a lock on subjects as they move around the scene, while face detection also works well, quickly picking up subjects and sticking to them as they move.",
    "The camera can capture images at very respectable 20fps when shooting conventionally, and while you don't get the luxury of autofocus as this happens, the buffer depth of around 45-49 raw and JPEG frames is perfectly respectable. These take around 15 seconds to be flushed away to the fastest SDHC card we could get our hands on, which is understandable.",
    "With the benefit of EOS-style control and in-camera raw processing, it's possible to take a great deal of control over image capture and output from the PowerShot G5 X Mark II.",
    "The metering system appears to behave predictably, giving most scenes the right balance between shadows, highlights and midtones. In some high-contrast scenes though, such as those with darker foreground details and clouds overhead, you'll need to either active Highlight Tone Priority or use exposure compensation to prevent brighter details from being lost.",
    "The lens can be a little soft at its widest apertures, particularly at the wide-angle end and at the edges of the frame, but things improve markedly when you zoom in and/or close down the aperture.",
    "Distortions are generally well controlled, although lateral chromatic aberration, which shows up as color fringing along the edges of details towards the edges of the frame, is quite clear in raw files – this can be easily rectified, though.",
    "Noise performance is generally as we'd expect from a camera with a 1-inch sensor – that is, very good in the three-figure ISO range, and with usable results in the lower reaches of the four-figure settings. Some may find the default level of noise reduction to be a little heavy handed in some scenes, so you may want to knock this down to the Low setting, or process noise out of raw images.",
    "The quality of 4K videos is generally good – not quite as crisp as it could be, but perfectly respectable for a camera of this kind. There are minimal artifacts present in footage, and while there's some rolling shutter as you move around the scene, with moderate movement at wider focal lengths it's not an issue.",
    "Focus can be pulled very smoothly between two points in the scene when using the touchscreen, while the ability to call on an ND filter is also very useful when shooting in bright light, as you're otherwise forced to use too fast a shutter speed to keep motion looking natural.",
    "The Canon Powershot G5 X II is a radical departure from what we saw in the G5 X. It's slimmed down, concealed its viewfinder and gained some useful new tech on the inside, with the new processor allowing for everything from 30fps raw shooting to 4K video. Battery life could be better, but then the penalty here is somewhat expected when you consider the presence of an EVF, mechanical image stabilization, and the effort to make the camera this compact (hence a physically smaller battery).",
    "Build quality is generally very good, and handling is just as impressive when you consider just how petite the camera is. The G5 X II responds very well to inputs, and doesn't lag in any significant areas, and it's great to have so much of the control that we're used to from Canon's EOS cameras in such a compact model. There's also little to gripe about with the viewfinder or LCD screen, with both very much befitting a camera of this kind in terms of their specs and performance.",
    "Performance in other areas is, broadly speaking, very good too, even if the camera falls a little short of delivering class-leading results. The focusing system generally does well, even if it's perhaps a little less polished than what we're seeing elsewhere. Similarly, you'll probably be perfectly happy with the 4K videos for vlogging or casual use, although Sony and Panasonic have set the bar very high on their rival models, and the G5 X II struggles to match them here.",
    "Image quality is good too, although the lens can be soft at times. Most other things can be polished up quite simply, either in camera or through post-processing; this really is one of those cameras that requires you to get to know it in order to get the best out of it.",
    "And then there's the price. With such strong competition, most notably from Sony's RX100 models, the PowerShot G5 X Mark II will have to drop some way from its lofty RRP in order to be competitive.",
    "If the PowerShot G5 X Mark II isn’t for you, we’ve picked three excellent alternatives for you to consider."
  ],
  "headers": {
    "0": "The Essential Review",
    "11": "Who’s it for and should I buy it?",
    "12": "New sensor and lens, and fresh processing power",
    "19": "Revamped design with integrated EVF",
    "29": "Image quality",
    "36": "Verdict",
    "41": "Not convinced? Try these..."
  },
  "links": {
    "PowerShot G5 X": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/compact-cameras/canon-powershot-g5-x-1306534/review",
    "PowerShot G7 X Mark III": "https://www.techradar.com/news/canon-powershot-g7-x-mark-iii-is-a-4k-shooting-vloggers-delight"
  }
}