{
  "source": "https://www.techradar.com/reviews/acer-chromebook-13-2018",
  "title": "Acer Chromebook 13 (2018) review",
  "category": "computing",
  "updated": "2019-03-06T18:20:03Z",
  "author": "bill-thomas",
  "summary": "A Chromebook out of time",
  "verdict": "The Acer Chromebook 13 is a powerful Chromebook, packed with the latest hardware. But, it’s more expensive than comparable Windows laptops and lacks a touchscreen. This is a fine Chromebook for travelers, but – at this price – most would-be customers will want to stay away.",
  "pros": [
    "Robust build",
    "Powerful",
    "Beautiful display"
  ],
  "cons": [
    "Too expensive",
    "Lackluster speakers",
    "No touchscreen"
  ],
  "article": [
    "Chromebooks have been around for a while, and while they still haven’t found a home among more premium laptops – with the Google Pixelbook being an obvious exception – they have found their niche. The best Chromebooks are value-oriented devices, aimed primarily at students and anyone that needs a cheap laptop to browse the web with.",
    "This is precisely why the Acer Chromebook 13 isn’t as compelling as it could be.",
    "While it is a powerful device, capable of beating the Pixelbook in performance, it’s nearly as expensive, without featuring the 2-in-1 capabilities or even a touch display. That makes Android apps a pain to use, though they are supported here.",
    "The Acer Chromebook 13 is an odd device, to be sure, but its strong performance, durable aluminum chassis and fantastic keyboard might make up for it, if you’re dead set on both Chrome OS and a premium device – a rare cross section. So, does the Acer Chromebook 13 justify its high asking price?",
    "The Acer Chromebook 13 is expensive for a Chromebook, even if it does rock full, Ultrabook-class hardware. There are two models on offer, both with 13.5-inch QHD (2,256 x 1,504) displays. However, the Acer Chromebook 13 is only available in the US at the time of writing.",
    "The entry-level option will set you back $699 (about £520, AU$980) to start. That price will net you an Intel Core i3-8130U CPU, 8GB of RAM and 32GB of flash storage. You can bump that price up another hundred bucks to $799 (about £600, AU$1,120) to get an Intel Core i5-8250U and 64GB of storage.",
    "Now, it could be argued that this hardware is both a little overpowered for Chrome OS, and a bit expensive. These are not only Windows laptop prices, but you can also get bigger and faster SSDs for similar prices from said Windows laptops.",
    "For example, you can pick up the Acer Swift 3 laptop with the same processor and RAM as the higher end Chromebook 13, but with a 256GB SSD for $699 (about £535, AU$975) in the US. Plus, it comes with a fingerprint sensor for more secure login.",
    "When you compare it to other premium Chromebooks, like the Google Pixelbook, it pales in comparison. The Pixelbook is more expensive, at $999 (£999, about AU$1,400) for older hardware. But, the Pixelbook features a 2-in-1 design, a fantastic, pixel-dense touch display and support for the Pixelbook Pen. Plus, the Pixelbook is one gorgeous piece of hardware.",
    "While the Acer Chromebook 13 is a powerful device, and has rigid build quality, the price is a bit steep for what it ultimately offers. If you can find it for a good 200 bucks or quid off, we’d say go for it. But, until then it might be best to wait.",
    "While the Acer Chromebook 13 isn’t exactly the most aesthetic laptop we’ve ever used, it is robustly built, and gets some things right.",
    "First, this laptop is absolutely packed with ports for a Chromebook, including two for USB-C 3.1 as well as a legacy USB port and a microSD card slot.",
    "The Chromebook 13 is 0.7 inches (17.78mm) thick and weighs 3.09 pounds (1.4kg), which isn’t exactly what we’d call “thin and light” by today’s standards, but you should be able to carry it around without much issue.",
    "The entire chassis is metal, though, which means that it’s not going to flex unless you really go out of your way to do so. The keyboard deck is especially rigid, and helps to make typing a comfortable experience. And, the lid of the Acer Chromebook 13 is extended past the back of the chassis, so opening it tilts the keyboard up – great for ergonomics.",
    "The keyboard in general, actually, is fantastic. Keys have plenty of travel and tactile feedback that we wish our new MacBook Pro had. The backlighting is also a welcome touch.",
    "However, there is a lot of empty space on the bottom half of the laptop’s keyboard deck. The keyboard itself takes up about half of the space here, which means that the Acer Chromebook 13 could use either a larger touchpad at the bottom or some top-firing speakers up top – or both.",
    "This Chromebook really would have benefitted from a larger touchpad, too. Because it doesn’t have a touchscreen, you have to interact with this device solely through the Gorilla Glass-coated trackpad, and it’s tiny and way too sensitive. Not only do we not have enough room on the trackpad, but our cursor feels like it is jumping around willy-nilly.",
    "However, we can’t help but feel like Acer could have shaved off some chassis space by slimming down the bezels. This is an expensive device, and these bezels are straight out of 2015. Placing it next to our new 13-inch MacBook Pro was jarring.",
    "Thankfully, the display itself is pretty great. The Acer Chromebook 13 features a QHD (2,256 x 1,504) display, which for a Chromebook, is fantastic. Text is clearly visible and photos and videos look rich and colorful. And, because that’s a 3:2 aspect ratio, it’s fantastic for getting some work done – though you will have to deal with extra black bars in most video content.",
    "Where the display falls flat, however, is the lack of touch compatibility. The Acer Chromebook 13 will let you install Android apps but, without a touchscreen, most of these apps are just a pain to use. For instance, you can just forget about playing any games on it. For a Chromebook that costs as much as the Acer Chromebook 13, it makes no sense to omit a touch display.",
    "The same goes for the speakers, honestly. This Chromebook has these little speakers built into the bottom of the chassis – they’re quiet, tinny and are awful for pretty much any kind of content. We tested the speakers out by playing “The Best” by Self Esteem at max volume. And, this punchy, percussive pop gem is washed out and bland when played on these speakers. What’s worse, when turned down to half volume, the song is nearly inaudible, and at 25% we might as well have muted it.",
    "These speakers will get the job done, but we’re not sure how long they will last if you have to blast them at full volume just to hear the content you’re consuming."
  ],
  "headers": {
    "4": "Price and availability",
    "10": "Design",
    "18": "Display and speakers"
  },
  "links": {
    "Google Pixelbook": "https://www.techradar.com/reviews/google-pixelbook",
    "best Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "Acer Swift 3": "https://www.techradar.com/reviews/acer-swift-3-2020",
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro",
    "“The Best” by Self Esteem": "https://youtu.be/ZF5GSshWU3w"
  }
}