{
  "source": "https://www.techradar.com/reviews/hisense-h8f-55h8f-4k-hdr-tv",
  "title": "Hisense H8F (55H8F) 4K HDR TV review",
  "category": "televisions",
  "updated": "2021-02-04T09:59:07Z",
  "author": "christian-de-looper",
  "summary": "The Hisense H8F has some pretty fancy image tech, but is it just smoke and mirrors?",
  "verdict": "Despite some issues with its audio performance, the new Hisense H8F offers the best image quality in its price range.",
  "pros": [
    "Excellent image quality",
    "Great value for the money",
    "Android TV is pretty smart",
    "Voice-controlled remote"
  ],
  "cons": [
    "Lackluster audio"
  ],
  "article": [
    "Hisense's H8 Series has long offered high quality at a very reasonable price, but these days it's getting harder and harder to make waves in the budget TV market - Samsung and LG now offer plenty of great 4K HDR TVs well under the $1,000 mark, while TCL has been making headlines with its $600 TCL 6-Series.",
    "But the H8F is a little different than previous-gen H8 series TVs. It's the company's best value TV yet and offers both Android TV and the company's proprietary ULED TV tech that it claims offers better contrast and performance than rival LED TVs.",
    "How do those claims hold up when you bring the TV into your living room? We’ve been using the Hisense H8F for a few weeks now to find out.",
    "The Hisense H8F is a great-looking TV, despite being a little basic. The screen comes in three sizes: a 55-inch (reviewed here), a 50-inch and a 65-inc hmodel, which are all available in the U.S., though the 50-inch model may not be for a few weeks.",
    "Whichever model you go with, the screen is surrounded by relatively thin bezels around the top and sides, and a slightly larger bezel at the bottom. It’s got nicely curved black legs too - which we like more than the silver legs on some other TVs in this price range.",
    "On the back, there’s a nice selection of ports, including four HDMI ports - three of which are on the left-hand side of the TV, and one of which is rear facing. You’ll also get two USB port for powering devices, a composite input, and an optical audio output for devices like a soundbar. It’s a nice selection of ports, and should be more than enough for the vast majority of people.",
    "The remote is also relatively well-designed, though again, it’s not necessarily all that exciting. You’ll get basic controls for channels and playback, along with a directional pad and, perhaps the coolest feature, a trigger button for Google Assistant - i.e. you can use the remote to control things like your smart home, launch apps, and more. It’s a handy feature, especially for those that already use Google smart home devices and have an ecosystem of smart home products set up. Also on the remote, you’ll get some quick launch buttons for Netflix, YouTube, Google Play, and Vudu.",
    "Design TL;DR: Generally speaking, the design of the TV isn’t all that exciting, but we did like the fact that the side and top bezels are pretty slim and that there’s decent connectivity options.",
    "While last year's Hisense H8E had a bespoke smart platform, Hisense has thankfully adopted Android TV for the H8F. That’s great news as Android TV is far more stable, easy to use, and more convenient for those of us that live within Google’s ecosystem of products.",
    "Along those lines, setting up Android TV initially was relatively easy: You’ll need to log in to your Google account, then enable features like Google Assistant. Once everything is up and running, you may be prompted to install an update.",
    "Immediately after the update we were a little concerned - Android TV seemed to be running extremely slowly, and we weren’t sure exactly why. The next day, however, that had changed, and everything seemed to be responsive and quick.",
    "That said, however, the Hisense H8F is clearly not an ultra high-performance TV when it comes to raw CPU power. We don’t recommend getting this TV for those who want to play a ton of games on Android TV - if that’s you, then it’s worth getting the Nvidia Shield TV instead, but for basic use, the TV is more than capable.",
    "If you’ve used Android TV before, you’ll know what to expect. You can install apps like Netflix and Hulu, play music from your Google Play Music subscription, and more. It’s relatively easy to navigate, plus Google updates Android TV pretty regularly - though, of course, updates here are likely handled by Hisense rather than Google. You’ll also get extra features like Chromecast Built-in, which is very handy.",
    "If Google Assistant isn't your speed, the TV is also compatible with Alexa via an Alexa skill, which is another handy feature. With Alexa, you can control volume and change the channel with your voice if you prefer Amazon's assistant over Google's.",
    "Not sold on Android TV? The company has told us during a briefing that it will be launching a Roku TV later in the year which could offer the same picture performance with a slightly more robust and slightly faster UI.",
    "Smart TV TL;DR: Hisense made the right move by upgrading to Android TV.",
    "HD performance is pretty good too, though you won’t get an image quite as crisp or detailed as you will when you watch 4K content, of course.",
    "That said, the Hisense H8F offers upscaling for HD content, and we found that for the most part it looked pretty good: Details were still relatively crisp, and while you will notice a difference when watching HD content, the fact is that there’s tons of 4K content out there these days, so you’re likely to run into that issue less and less.",
    "Contrast, we found, was also pretty decent in SDR. Again, you obviously won’t quite get the same high-quality picture as HDR content, but the ULED technology does really help to improve contrast on SDR content, which is always helpful.",
    "HD/SDR Performance TL;DR: We definitely feel that the contrast on this TV is far better than most other TVs in the price range, even with SDR content.",
    "The Hisense H8F has Hisense’s new ULED technology, rather than the standard LED tech that we saw on previous H8 TVs. What does this mean? Well, we know that a ULED TV uses LEDs combined with a proprietary image processing technology.",
    "According to Hisense, ULED is currently defined as having at least a 700 nit peak brightness level, full-array local dimming, and a wide color gamut of at least 90% DCI-P3. The H8F series has up to 60 dimming zones, and a 60Hz refresh rate. Hisense also, however, offers Premium ULED on some other TVs, and that tech offers up to 132 dimming zones, 1000 nit peak brightness, and very near 100% DCI-P3.",
    "While Hisense doesn't give out direct comparisons to its competitors, we feel ULED offers far deeper blacks and more vivid colors than you would on a standard LED TV. In fact, we would argue that the picture is much closer to an OLED TV than it is an LED TV, but at a far more affordable price.",
    "That said, the tech may be a little hard to comprehend, but the results speak for themselves: Colors on David Attenborough’s Our Planet were beautifully crisp and vivid, while black levels were deep and thick. If you’re used to watching on an HD LED TV, you’ll immediately notice the difference in picture quality. With the 4K resolution, there’s a ton of detail and clarity too, which is great news.",
    "There are a solid number of picture modes too, though the picture modes available to you will change depending on your source. We started with Dolby Vision, which offers three modes - Dolby Vision Bright, Dark, or Custom. We preferred bright for our viewing, but it’s worth playing around a little.",
    "But without Dobly Vision content, you’ll get far more options - Vivid, Standard, Energy Saving, Theater Day, Game, Sport, and Theater Night. It’s a solid selection, and while most probably won’t change modes depending on what they’re watching, it’s still handy to have the options available. (We liked the bright colors of the Vivid mode best, but it's a YMMV situation.)",
    "There are some good motion smoothing options too - though if you’re concerned about things looking overly smoothed, we would recommend experimenting with the different motion smoothing modes. You can also customize smoothing, editing the “Judder Reduction” and “Blur Reduction” yourself, which is a nice touch.",
    "We did experience a few clashes between apps like Netflix and the 4K resolution. Netflix’s interface was clearly not in 4K - but video played from Netflix was. It’s not a huge deal - after all it’s much more important that the actual content is in 4K, and it is - but still something to note.",
    "4K/HDR Performance TL;DR: While it doesn't have the same brightness output as other LED/LCD screens, the H8F offers close-to-OLED performance at a great price.",
    "Unfortunately, one area that the TV is a bit of letdown with is with its audio performance - to match the high image quality, we recommend getting a decent soundbar or even a more advanced sound system. The speakers get pretty loud, to be sure, but the frequency response is pretty lackluster.",
    "One of the biggest factors against the sound quality here is that the low end on the speakers is almost non-existent. There’s little oomph to speak of, and that will suck the life out of the explosions in your favorite action movie.",
    "Listening to music, you’ll find that kick drums are cut off, offering almost no way to decently cut through a mix. The mid range is a little interestingly tuned too. Low mids don’t have much power to them, while there’s a clear high-mid boost that makes the TV sound a little like an AM radio. The high end is cut off too - though not to the same extent as the bass.",
    "The good news? Well, the speakers can get pretty loud, if that’s important to you.",
    "Sound TL;DR: We would strongly recommend finding better speakers for the TV, but if image is more important to you than sound, then the built-in speakers will be fine.",
    "When it comes to raw picture quality, the Hisense H8F is simply the best TV in this price range. At $500, the TV offers a stellar image quality, with beautifully deep black-levels and crisp colors - all in a manageable 55-inch package.",
    "Sure, the audio leaves a lot to be desired, and you may or may not like Android TV, but you can always buy a Roku streaming stick or Apple TV, and use the TV with a stereo surround system or other speakers - leaving the Hisense H8F to do what it’s best at: display a great image.",
    "If you’re looking for the best image quality, there are better options - like any of LG’s OLED range of TVs. But at thousands of dollars, not everyone can afford them, and that’s exactly where the Hisense H8F comes in. If you want something bigger, there’s the 65-inch model, too - so don’t feel stuck at 55 inches."
  ],
  "headers": {
    "3": "Design",
    "8": "Smart TV (Android TV)",
    "16": "HD/SDR Performance",
    "20": "4K/HDR Performance",
    "29": "Sound",
    "34": "Final verdict"
  },
  "links": {
    "TCL 6-Series": "https://www.techradar.com/reviews/tcl-6-series-r615-r617",
    "smart platform": "https://www.techradar.com/news/best-tv",
    "Nvidia Shield TV": "https://www.techradar.com/reviews/gaming/games-consoles/nvidia-shield-1287106/review"
  }
}