{
  "source": "https://www.techradar.com/reviews/pc-mac/tablets/microsoft-surface-pro-4-1290285/review",
  "title": "Microsoft Surface Pro 4 review",
  "category": "tablets",
  "updated": "2019-06-01T00:14:33Z",
  "author": "joe-osborne",
  "summary": "The Surface Pro 4 is iterative in the best sense of the word",
  "verdict": "Has Microsoft at last designed a tablet that can realistically, without much compromise, replace your laptop? Short of going back to the drawing board on the battery, this looks as close as it's going to get. The Surface Pro 4 is still worth your time, even years after its release. Read our Surface Pro 4 review to find out why it’s a top-notch tablet that must be on your list of devices to consider as laptop alternatives.",
  "pros": [
    "Larger, sharper screen within same dimensions",
    "Vastly improved Type Cover",
    "Even better Surface Pen"
  ],
  "cons": [
    "Type Cover still sold separately",
    "Intel Core m3 at entry level",
    "Battery life hasn't improved much"
  ],
  "article": [
    "Did you know the Surface Pro 4 isn’t Microsoft’s latest flagship tablet? No, that honor goes to the new Microsoft Surface Pro 6 – now, read our hands on impressions of the Surface Pro 6!",
    "Our ‘essential review’ of the Surface Pro 4 covers all of the highlights (and lowlights) of Microsoft’s 2015 Windows 10 tablet. It’s intended as a more digestible summary of our full-length review, in that it shouldn’t take more than half a minute to read.",
    "The Surface Pro 4 has been followed up twice now – first by the Surface Pro 2017, then the Surface Pro 6. However, it’s still worth your consideration. This is because, back when it was released nearly four years ago, the Surface Pro 4 was heralded as the natural progression of the Surface Pro reign. And, today, it’s easy to see the influence it had on the subsequent Surface devices.",
    "Unlike the Surface Pro 3, which ran on Windows 8.1, the Surface Pro 4 runs on Windows 10 out of the box. This is a massive win for the Surface Pro 4, and a big part of why it’s still such an excellent device four years later.",
    "It’s easy to see all the effort Microsoft put into refining this tablet, rather than drastically changing the formula. It keeps the same general design as the Surface Pro 3, only fine-tuned and improved. Particularly, there’s a new chrome-laden Microsoft Logo and more than half a millimeter shaved from the chassis.",
    "It’s more than just a snappy design, however. The Surface Pro 4 was released with a new Surface Pen that swaggers with more levels of pressure sensitivity than previous models, alongside added hardware buttons. In addition, the Type Cover is heavier and more satisfying to the touch, and the screen is of higher resolution coming in at 2,736 x 1,824 – a 216 ppi display.",
    "If you’re not into the enormous size, not to mention price, of the Surface Book 2, the Surface Pro 4 isn’t just a worthy alternative, but also a brilliant first choice for creative professionals on the go. It also costs considerably less than the Surface Pro 6 if you buy it refurbished or used – not that you’d be able to find it new these days.",
    "Admittedly, the Surface Pro 4 has its limitations, particularly when it comes to battery life. However, it still holds up as a product that we can safely recommend for Windows tablet newcomers and veterans alike. As a ‘Pro’ device, the Surface Pro 4, of course, ships with Windows 10 Pro pre-installed (a $199/£219/AU$339 value).",
    "And, that’s without mentioning the Surface Pro 4 display, which is crystal clear when pitted against its predecessor. While the Type Cover is sadly sold separately, it does feel comfortable typing on.",
    "The battery life, as we mentioned earlier, only lasts 3 hours and 15 minutes in PCMark. It isn’t, obviously, the best, but the fast components go a long way in making up for the need to constantly recharge.",
    "In addition, because of its dramatically lower pricing, the Surface Pro 4 is bound to keep a loyal audience well into the future.",
    "The Surface Pro 4 is remarkably cheaper and better than similar ARM-based tablets. Take a look at HP’s Envy x2, for example – you may have expected it to be more affordable than Microsoft’s own tablets because of the use of Qualcomm Snapdragon 835 chips found in many Android devices. Unfortunately, that isn’t the case. In fact, the Envy x2 is far pricier.",
    "For now, you’re better off picking up the Asus NovaGo if LTE functionality at a low price is what you’re looking for. On the other hand, the Surface Pro 4 costs $50 less than the NovaGo, and boasts twice the storage and more powerful innards.",
    "Just like last time, the same all-magnesium, unibody casing is still here, though the 'Surface' logo has been swapped in for Microsoft's new logo in chrome.",
    "Microsoft increased the Surface Pro 4’s display size by a few hairs, from 12 inches to 12.3 inches, doing so without compromising on the device’s footprint. On the contrary, the company shaved more than half a millimeter off of its thickness, from 9.1mm to 8.4mm – all while fitting it with full-fat mobile U-series chips.",
    "As for how this was achieved, the device bid the capacitive Windows button goodbye, which accounts for the extra room and that three-tenths of an inch in the display.",
    "Microsoft also brought the screen's optical stack – the series of sensors, diodes and pixels underneath the glass – even closer to the glass now, a key point of Microsoft's trademarked PixelSense screen technology.",
    "The display is exceptionally responsive to touch, and the further sensitivity it brings to the stylus experience is massive. Alongside the enhanced Surface Pen, the screen senses 1,024 levels of pressure, even during a single stroke.",
    "Now, let’s take a look at that resolution. Microsoft increased the Surface Pro 4’s resolution from 2,160 x 1,440 (216 ppi, or pixels per inch) to 2,736 x 1,824. That makes for a whopping 267 ppi for the Surface Pro 4, which blows the MacBook Air 2017 (128 ppi for the 13-inch) away completely, and just barely beats out the first-generation iPad Pro 12.9-inch at 264 ppi.",
    "More notably, the new screen proves to be way more luminous and more color accurate than the Surface Pro 3 display at all brightness levels. This is understandably going to be a pretty big deal for any designers or artists who want to upgrade from the Wacom tablet and calibrated monitor combo.",
    "As for the rest of us, this means more realistic-looking movies, as well as more vibrant photos and games. That's despite even thicker black bars sandwiching your favorite films in 16:9 – and even more so for those in 21:9, or widescreen format, thanks to the 3:2 aspect ratio it’s kept from the previous generation.",
    "It's a fair concern for folks who watch plenty of movies and TV on a tablet. Fear not, however, workers, as you're the very reason Microsoft made this move. The 3:2 aspect ratio is a middle ground between 16:9 and 4:3 that is perfect for both photo and design or drafting work, wherein 3:2 is much more common, as well as getting computational work done, given the extra vertical space.",
    "In addition to the aforementioned 1,024 levels of pressure sensitivity, the new-and-included Surface Pen has been redesigned to feel more like a pencil. The stylus now has one flat side, as if a Number 2 pencil had all but two of its angles rounded off.",
    "This novel design makes the Surface Pen even more comfortable to use than the last as a result – your index finger rests just above the main function button on the flat end. Secondly, the left side of the frame is coated with thin, powerful strip magnets, which lets it to cling onto the tablet's left side. The age of stylus loops is coming to an end.",
    "When the Surface Pen is paired with Microsoft’s PixelSense display, the combination results in the best stylus experience we’ve had on a tablet for as little as we’re likely to actually use it. While we’re neither artists nor designers, the screen’s superb palm detection, paired with the accuracy and nuance of the Pen tracking, gives us the confidence to say that the Surface Pro 4 is Microsoft’s best shot at luring in that crowd yet.",
    "However, these enhancements do pale in comparison with Microsoft's new-though-still-not-included Type Cover. This time around, Microsoft adopted the chiclet-style design, which makes keeping track of which keys your fingers are on by feel much easier and allows the keys to be individually back lit.",
    "The new Type Cover is also thicker and far more rigid than before, allowing for deeper key travel and punchier feedback – not to mention a sturdier, quieter surface to type on – that brings it so much closer to a true laptop keyboard. In addition, Microsoft widened the touchpad and coated it in glass rather than plastic.",
    "Finally, Microsoft has a version of the Type Cover with a biometric Fingerprint ID for $159 (£149, AU$249). The new keyboard cover, though only available in black, uses Windows Hello to login to the Surface with a fingertip press. The scanner can also authorize app purchases from the Windows Store, and because the keyboard is backwards compatible, it can be utilized with the Surface Pro 3 as well.",
    "All the performance scores, except for PCMark 8 Home, shows a minor increase from the first unit we tested. It’s a good sign that the Surface Pro 4 was already operating at its peak, except for a battery that needed fixing.",
    "The Surface Pro 4 beat out the 2015 HP Spectre x360 in nearly every test by about 25%. As for the 13-inch MacBook Air, its multi-core Geekbench 3 (which tests processors primarily) score is way short of what the Surface Pro 4 reached.",
    "If you’re curious, the Surface Pro 4 runs Hearthstone (our de facto tablet game) at the highest settings without breaking a sweat – even at an automatically adapted resolution. Plus, the color-calibrated display makes every part of Hearthstone’s play area that much more distracting.",
    "At the end of the day, there isn’t a massive difference between the Surface Pro 4 and its competitors when it comes to everyday performance, even though the MacBook Air has a bigger battery. If anything, you get slightly better gaming performance on the Surface Pro 4 than the 2015 Spectre x360, though neither one is a gaming device.",
    "Tested on pre-production hardware, which we were assured has been scrubbed of its battery woes, the Surface Pro 4 delivered much improved battery life results than at the onset. Sadly, they're still well below Microsoft's own claims ­– not to mention, what its choice rivals are able to offer.",
    "To be fair, the most intensive battery test in our lineup, PCMark 8 Home Battery, saw the Pro 4 last 3 hours and 15 minutes – a marked 50% improvement from before. Still, the Spectre x360 held out in that test for 4 hours and 38 minutes.",
    "Microsoft's tablet performed much better on our video playback test, lasting 5 hours and 15 minutes. That's enough to last you on most coast-to-coast US flights.",
    "In a similar test, the MacBook Air was able to stream 1080p video over Wi-Fi for a whopping 13 hours and 24 minutes. Although, that's thanks to a far lower-resolution display and likely a larger battery.",
    "Nevertheless, Microsoft promises up to 9 hours of video playback, and these numbers doesn’t even come close. Sure, these figures are far better than last year's Surface Pro 3, despite the serious screen resolution bump, which should not be ignored. However, they still can't hold a candle to Apple's leading laptop or its top tablet – much less, equivalent Windows hybrids.",
    "It battery life is then about the only thing holding the Surface Pro 4 back from truly and honestly being a terrific replacement for your laptop – or at least, your MacBook Air specifically. Otherwise, the machine offers somewhat below-average lasting power.",
    "Bill Thomas and Gabe Carey have also contributed to this review",
    "First reviewed: October 2015",
    "Images Credit: TechRadar",
    "Samsung Galaxy Book: With an incredible display, long battery life and all of the essential accessories in the box, this tablet all but requires you to make liberal use of Samsung’s phone-exclusive syncing and biometric login features via Samsung Flow, its key selling points. Just mind the lack of Windows Hello.",
    "Lenovo Miix 510: A great price, USB-C and USB 3.0, and an included keyboard cover make the Miix 510 an appealing option. While there are a couple of reasons (battery, screen) why you’d go for the Surface Pro 4 instead, but the Miix 510 offers an awful lot for the price. But, again, what's counting against it is considerable.",
    "HP Spectre x2: Its unique kickstand, even sharper IPS screen and hardier included keyboard cover help the Spectre x2 stand out. You'll stay for the impressive spec sheet and premium. That said, it's too bad that the stylus doesn't come included with this device, unlike its rivals. This is likely the biggest rival to the Surface line today."
  ],
  "headers": {
    "1": "Microsoft Surface Pro 4: The Essential Review",
    "6": "Microsoft Surface Pro 4: Who's it for? Should I buy it?",
    "13": "Design and display",
    "22": "Surface Pen and Type Cover",
    "28": "Performance",
    "32": "Battery life",
    "41": "Not convinced? Try these:"
  },
  "links": {
    "Surface Pro 6!": "https://www.techradar.com/reviews/microsoft-surface-pro-6",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Surface Pro 2017": "https://www.techradar.com/reviews/microsoft-surface-pro",
    "Surface Pro 6": "https://www.techradar.com/reviews/microsoft-surface-pro-6",
    "Surface Pro 3": "https://www.techradar.com/reviews/pc-mac/tablets/microsoft-surface-pro-3-1249750/review",
    "Windows 8.1": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-8-1-1161745/review",
    "Surface Book 2": "https://www.techradar.com/reviews/microsoft-surface-book-2",
    "Windows tablet": "https://www.techradar.com/news/mobile-computing/tablets/windows-8-tablets-release-date-specs-and-prices-916134",
    "HP’s Envy x2": "https://www.techradar.com/news/hp-envy-x2-up-for-pre-order-but-arm-based-tablet-costs-more-than-surface-pro",
    "Asus NovaGo": "https://www.techradar.com/reviews/asus-novago",
    "MacBook Air 2017": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/macbook-air-1300233/review",
    "iPad Pro": "https://www.techradar.com/reviews/pc-mac/tablets/ipad-pro-12-9-1269255/review",
    "Windows Hello": "https://www.techradar.com/how-to/software/how-to-use-windows-hello-1301455",
    "Samsung Galaxy Book": "https://www.techradar.com/reviews/samsung-galaxy-book",
    "Lenovo Miix 510": "https://www.techradar.com/reviews/lenovo-miix-510-review",
    "HP Spectre x2": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/hp-spectre-x2-1306171/review"
  }
}