{
  "source": "https://www.techradar.com/reviews/steelseries-arctis-9x",
  "title": "SteelSeries Arctis 9X review",
  "category": "gaming",
  "updated": "2019-06-13T13:12:25Z",
  "author": "bill-thomas",
  "summary": "A great Xbox One headset – but Windows?",
  "verdict": "The SteelSeries Arctis 9X is genuinely an awesome headset for Xbox One. It has great sound and build quality, with good looks to boot. PC gamers might want to look elsewhere, though.",
  "pros": [
    "Sound quality",
    "Robust build quality",
    "Nice aesthetics"
  ],
  "cons": [
    "Windows 10 support isn't ideal",
    "Green accents on the headband may be divisive"
  ],
  "article": [
    "More and more, gaming headsets like the SteelSeries Arctis 9X are coming out, targeting multiple platforms. This time its the Xbox One and Windows 10, but there are plenty of other headsets that target both PS4 and Windows or the Nintendo Switch – and anything with a 3.5mm audio jack.",
    "The point is that most gaming headsets need to play nice with Windows 10 these days. And, while the SteelSeries Arctis 9X is genuinely one of the best headsets for Xbox One X, the strange choice of connection options stops it from entering the upper echelons of PC gaming peripherals.",
    "And, at $199 (£179, about AU$290), the SteelSeries Arctis 9X enters in a highly competitive price range with the likes of the Razer Nari Ultimate at $199 (£199, AU$349), not to mention SteelSeries's own $179 (£179, AU$399) Arctis Pro – though, the latter is not a wireless headset.",
    "So, should you pick the SteelSeries Arcitis 9X up for yourself? Well, if you play games primarily on Xbox One, it might be a great pick. If you're looking for a companion for the best PC games, however, you might want to look elsewhere.",
    "One thing we'll never be able to take away from SteelSeries is its knack for peripheral design. The SteelSeries Arctis 9X has some design choices that we personally aren't into, like the green accents in the headband – but on the whole, this headset is just another entry in a long line of pristine peripherals.",
    "From the steel headband to the \"premium woven ski goggle fabric\" – which can be used to adjust the fit – to the extremely comfortable ear cups, the SteelSeries Arctis 9X feels premium from top to bottom.",
    "Of course, that seamlessly transitions into comfort. We have to admit, upon pulling the SteelSeries Arctis 9X out of its packaging, and noticing you can only adjust the fit through a fabric band, we're skeptical. But, sitting down with this headset on our head for hours at a time is a dream come true. Take it from us – no matter how long your epic gaming binge goes, you're not going to get uncomfortable.",
    "The SteelSeries Arctis 9X also looks impressive. Beyond the odd green accents on the fabric headband, the understated black design on the ear cups is an aesthetic that won't make you hide them in shame whenever people come over.",
    "Most of the buttons, dials and ports are located on the right side, where you get a Bluetooth pairing button, a power button that will also pair the headset with an Xbox One, a mic mute button, volume controls and a USB charging port. There's also a 3.5mm audio in. Over on the left side, you'll find a single dial that controls game and chat balance, and a retractable mic.",
    "On the whole, most of the features we need out of a gaming headset in this price range are represented, but we would have loved the ability to use that USB charging port to connect to our PC, for reasons we'll dive into shortly.",
    "At the end of the day, the SteelSeries Arctis 9X is yet another example of fantastic design from SteelSeries. It's a robust gaming headset that will likely last you for years and look good while doing it. Plus, it's quite comfortable, too.",
    "Right off of the bat, the combination of Xbox wireless connectivity and Bluetooth means that you can listen to music off of your phone while still hearing your in-game audio. And, well, that's exactly where the SteelSeries Arctis 9X shines.",
    "Playing through the familiar Halo 2 campaign while blasting \"Got You\" by Amyl and the Sniffers through our headset at the same time is a lovely experience that we recommend to pretty much anyone. This will particularly shine for anyone that's still playing Destiny 2, as you can get some grinding done while listening to music, without fiddling through some obtuse menus.",
    "SteelSeries claims that the Arctis 9X has 20 hours of battery life. While we didn't put the headset through rigorous battery life testing, it definitely seems to live up to that number.",
    "Sound quality is also excellent on the SteelSeries Arctis 9X – at least on the Xbox One. Halo 2 sounds as rich and compelling as ever, and all the details come to life. The bass is deep enough, too, that when explosions go off it feels close to the real thing.",
    "For the most part, this continues when we connect it to our phone to listen to music. Music is clear enough to be passable, especially for a gaming headset, so we don't have any massive complaints here.",
    "The microphone, too, does its job effectively. Our voice comes through nice and clear, and we didn't hear any complaints from anyone on the other end. It features active noise cancellation, too, but we weren't able to test it out in any particularly noisy locations.",
    "However, the second we connect this headset to our PC to play some Division 2, things start to go awry. Bluetooth support in Windows 10 is already not the greatest, and the fact that you can't connect via USB means that audio drops happen more than they should.",
    "It's hard to tell whether this one is on SteelSeries or Microsoft, but it's a problem that could have been circumvented with a USB connection.",
    "Regardless, Windows 10 audio is also relatively quiet. Even at maximum volume, we can hear our gaming keyboard and even the (admittedly loud) fans on our PC. The SteelSeries Arctis 9X is marketed as a headset for both Xbox One and Windows 10, so it's a shame that the Windows 10 experience isn't as amazing as it is on Xbox One.",
    "Basically, if you're on the market for an Xbox One headset, you're in for a wonderful experience. But, any prospective PC gamers might want to look elsewhere. We'd suggest the SteelSeries Arctis Pro, as you don't really need wireless peripherals when you're playing at your desk anyway.",
    "The SteelSeries Arctis 9X is a fantastic gaming headset if you're an Xbox One player. Sound quality is top notch, and the headset is genuinely built like a tank, with a subdued style that we're seriously impressed with.",
    "But, the second you try to use it to play some PC games, it becomes harder to recommend. Sound quality and reliability just aren't at the same level on a gaming PC.",
    "Still, the SteelSeries Arctis 9X might be one of the best Xbox One headsets, and if that's enough for you, this headset is certainly worth your time and money.",
    "Images Credit: TechRadar"
  ],
  "headers": {
    "4": "Design",
    "11": "Performance",
    "21": "Final verdict"
  },
  "links": {
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "gaming headsets": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675",
    "Xbox One X": "https://www.techradar.com/reviews/xbox-one-x",
    "Razer Nari Ultimate": "https://www.techradar.com/reviews/razer-nari-ultimate",
    "Arctis Pro": "https://www.techradar.com/reviews/steelseries-arctis-pro-headset",
    "best PC games": "https://www.techradar.com/news/best-pc-games",
    "PC games": "https://www.techradar.com/news/best-pc-games"
  }
}