{
  "source": "https://www.techradar.com/reviews/dragon-medical-one",
  "title": "Dragon Medical One review",
  "category": "computing",
  "updated": "2019-12-17T19:00:50Z",
  "author": "jonas-p-demuro",
  "summary": "The world's best-selling speech recognition solution",
  "verdict": "Nuance's Dragon Medical One combines high uptime, with conversational AI to create an industry leading medical transcription solution.",
  "pros": [
    "Choice of support options",
    "Conversational AI",
    "Uptime maximized",
    "Cloud architecture"
  ],
  "cons": [
    "Opaque pricing",
    "Extended voice learning process",
    "User complaints of transcription errors",
    "No live transcribers"
  ],
  "article": [
    "The household name in computer dictation software is Dragon Naturally Speaking, and the reason is that it predates most other solutions. It goes all the way back to 1975, with Dr James Baker developing a “Speech understanding system,” that he and his wife brought to market in 1982 under Dragon Systems. The company changed hands a few times through the decades, and eventually ended up under the Nuance brand. While the Dragon speech recognition products are an important component of the Nuance portfolio, the company also has products in other areas, including the AI, and biometric security areas.",
    "Worldwide, Nuance can boast that approximately 10,000 healthcare organizations use Dragon Medical One and also of note they have 80% of radiologists in the US market. Using Dragon technology are such notable healthcare organizations such as Banner Health, the Cleveland Clinic, and the University of Rochester Medical Center.",
    "Physicians did not go to medical school and advanced residency training to sit and stare at computer monitors all day. However, the harsh reality of mountains of paperwork got replaced now with the constant documentation of the EHR for most clinicians. Some have turned to scribes to take the burden off, and spend more time with patients, but this is a costly and less than ideal solution as unlicensed individuals try to keep up with the doctor, who in the end hopes things are entered as he or she said them- leading astute clinicians to other choices.",
    "Nuance Dragon offers a number of solutions for medical transcription, and a popular one is Medical One, which is cloud based, designed for both security, and completing documentation in the EHR. It is powered by what is termed ‘Conversational AI,’ which allows the clinician to maintain their natural workflow. In other words, the software adapts to how the clinician works, rather than vice versa.",
    "Dragon Medical One integrates plenty of features to increase physician satisfaction, and avoid frustration. This includes the ability to create personalized vocabularies, and templates, and then to be able to not only use them, but also share them with your colleagues across a wide range of devices.",
    "A cloud based system has its advantages, such as the end user not needing to perform the updates and no complicated software installs, but it is only as good as the backend that it is built on. Dragon Medical One claims a high 99.5% uptime, being powered by Microsoft Azure servers that are geographically dispersed to maximize uptime, and security of the data. The system is fully HIPAA compliant, with HITRUST CSF certified hosting infrastructure.",
    "Dragon Medical One goes the extra mile for high accuracy in their transcription process, with a claimed 99% accuracy, right out of the gate without any training. From there, a voice profile gets built for the clinician, and is stored in their cloud. The accuracy will even improve from there, via an automatic process that includes microphone calibration, and accent adjustments, with the goal of higher accuracy, with a lower word error rate.",
    "While Dragon may be the most senior of the voice recognition software choices, this does not mean it has achieved perfection. Reported user issues focus around the quality of the transcription, with reports ranging from a lengthy interval for the initial learning of a user’s voice. Also there are complaints that despite the name, ‘Naturally speaking,’ users need to speak less than naturally to enhance the voice recognition, or else there are too many errors. While these errors are more expected with users with heavy accents, it also has been reported with American born speakers, which is somewhat surprising.",
    "However, we should take into account that Dragon Medical One is doing this all via a computer driven process (albeit a robust one), without any live transcription input. The difficulties then make sense in maintaining a high degree of accuracy on the more challenging transcriptions, where a good going over by a professional transcriptionist can produce a higher quality result than a pure voice recognition via computer algorithm approach.",
    "We appreciate the multiple support options for the Dragon platform. Nuance offers support via an online support portal, a chat with a live agent, and via a toll free support line.",
    "The supported platforms include a “Wide range of Windows, devices,” which leaves out the popular mobile platforms like iOS and Android that clinicians have with them at all times in their pockets, and also the Mac and Linux desktop platforms.",
    "There is also the option to connect with Nuance’s PowerMic Mobile, which allows this EHR to be used via a smartphone platform, but requires additional cost and complexity rather than just being integrated in.",
    "Nuance Dragon does not provide any pricing on their site, and rather requires company contact to build a package for custom pricing. We were able to glean that the software is acquired via subscription based pricing, which has advantages of a smaller upfront investment for organizations, and to keep the recurring expenses to a predictable basis.",
    "Nuance Dragon Medical One enjoys high popularity for good reason. The multiple advantages include maximized uptime, cloud based architecture for upgrades and maintenance on the backend, and Conversational AI to work better with clinicians. Be sure to factor into the decision the drawbacks of opaque pricing, a steep learning curve for voice recognition, lack of mobile apps without the addition of PowerMic, and some users having issues with the accuracy of their transcription due to no live transcriptionist working with the voice file. At the end of the day, with its speed and efficiency, we can see why Nuance Dragon has such a dominant market position."
  ],
  "headers": {
    "2": "Features",
    "7": "Drawbacks",
    "9": "Support",
    "12": "Pricing",
    "13": "Final verdict"
  },
  "links": {
    "Dragon Medical One": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6718713895449778000&xs=1&url=https%3A%2F%2Fwww.nuance.com%2Fhealthcare%2Fprovider-solutions%2Fspeech-recognition%2Fdragon-medical-one.html&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fdragon-medical-one",
    "EHR": "https://www.techradar.com/best/best-electronic-health-record-ehr-software"
  }
}