{
  "source": "https://www.techradar.com/reviews/lg-g7-thinq-review",
  "title": "LG G7 ThinQ review",
  "category": "phones",
  "updated": "2019-06-21T01:10:07Z",
  "author": "matt-swider",
  "summary": "Still a reasonable smartphone that's been surpassed",
  "verdict": "The LG G7 ThinQ is a completely unsurprising, risk-averse smartphone that's meant to be smart, not flashy, unlike the LG V40 that just launched. It has an AI-powered camera, loud 'Boombox' speaker, and a bright 6.1-inch display. It's a reasonable, but not monumental upgrade over the LG G6.",
  "pros": [
    "Large display can get very bright",
    "Camera takes wide-angle photos",
    "Boombox speaker gets loud"
  ],
  "cons": [
    "Far too expensive in the US",
    "Smaller battery capacity",
    "Few revolutionary features"
  ],
  "article": [
    "Update: The LG G7 is no longer the newest phone from the company now that the LG G8 is out, but it still has decent specs and retailers have likely dropped its price accordingly. Here's our updated review.",
    "The LG G7 ThinQ touts a Super Bright LCD that's viewable in direct sunlight, which is ironic because the rest of it has a hard time standing out.",
    "It's a reasonable, but not significant upgrade over last year's LG G6 with a larger 6.1-inch all-screen display, AI-enhanced cameras, a loud 'Boombox Speaker', a faster chipset, and at long last, an update to Android 9 Pie.",
    "But even though it's been surpassed by the LG G8, It's also likely cheaper - which is better value so long as you're fine forgoing the newer phone's more powerful chipset and fancy new gesture-recognition tech.",
    "You may not immediately be wowed by any of the LG G7 specs in comparison. It doesn't have a curved OLED screen like the Samsung Galaxy S10 line, the quad-lens rear camera of the Huawei P30 Pro, or the undeniable value of the OnePlus 6T. And despite its controversial notch cutout at the top, it doesn't have Apple's fancy 3D TrueDepth camera, as seen on the iPhone XS or iPhone X.",
    "LG is emphasizing that this is a smart, not flashy, phone. As the 'ThinQ' part of the name suggests, the company is determined to push AI onto all of its smart devices no matter how awkward the moniker sounds.",
    "The execution on this new ThinQ phone is, thankfully, a little more practical than the nomenclature.",
    "Watch our hands-on LG G7 ThinQ video below to see the phone in action",
    "There's a dedicated AI button on the left side of the phone, and LG isn't forcing its own virtual assistant homebrew into your daily life like Samsung does with Bixby.",
    "No, this button leads to the familiar Google Assistant, and uses far-field voice recognition to better understand commands. In short, it's better than the Bixby button.",
    "Its dual-lens AI camera emphasizes ThinQ, too, with its ability to categorize subjects and automatically tune its settings to snap better photos via machine learning. It can also recognize low-light situations, and employ Super Bright Mode to make photos and video four times as bright as on the G6, albeit – at a reduced resolution.",
    "We tested LG G7 for several weeks, and noticed an uptick in photo quality next to the G6, just like we saw on the LG V30S ThinQ, the first LG phone with its AI camera and Bright Mode.",
    "It's not better than the Google Pixel 2, Google Pixel 2 XL, or Samsung Galaxy S9 and S9 Plus – most due to LG's smaller camera sensor size – but it's still a step up for LG, and this is one of the only phones with a wide-angle camera.",
    "The wide-angle rear camera was able to capture more of what we saw in front of us, and LG’s robust cinematic video tools make it easier to record 4K video with a lot of style.",
    "On the front of the G7, LG finally upgraded its front-facing camera to 8MP. That's where we see the biggest improvement among the cameras, if only because LG has been holding back with a 5MP on previous handsets.",
    "Machine learning is just one way to aid in capturing superior photos, but like the megapixel count, what matters more are how the pictures look after everything is processed. We have a full gallery of photos later in the review.",
    "The LG G7 wins on completeness, even if it doesn't have many standout features. It doesn't take big chances on design or battery life, but it looks stylish in most colors and lasts long enough with all-day longevity.",
    "It's biggest weakness is the price, specifically in the US, next to its competitors that are do things a little bit better in almost every department.",
    "Depending on where you live, it's either a good deal for a phone without much pizzazz (like in the UK), or overpriced and will have you counting down the days to the inevitable LG V40 (like in the US). LG G7 is this year's smartphone sleeper hit no matter where you live.",
    "The LG G7 ThinQ was announced on May 2, 2018 and its available in the UK, US, Australia and a number of other markets around the world",
    "In the US, the LG G7 is available from all carriers apart from AT&T, which instead has opted to exclusivly stock the LG V35 instead.",
    "The LG G7 price is more expensive than we had hoped: $749 in the US through Verizon and T-Mobile, with the latter selling the Raspberry Rose color exclusively. Verizon, meanwhile, is slashing the price by $100 if you buy it on a device payment plan ($31.25 a month for 24 months) – essentially making it $650, and 100% more confusing. Let's go 110% more confusing and cite that Sprint will have it for even more: $792. Ouch.",
    "It's £599 SIM free in the UK, making it significantly cheaper than the Samsung Galaxy S9 launch price in the UK, even though the LG G7 is more expensive than the S9 in the US.",
    "It's AU$1,099 in Australia at stores JB Hi-Fi and Mobileciti, that's cheaper than the S9.",
    "Where you are in the world really determines whether or not the G7 is a good value.",
    "The LG G7's design puts an emphasis on its 6.1-inch LCD screen, which takes up nearly the entire front of the device, save for a notch at the top and a small chin bezel at the bottom.",
    "Its clean-looking unibody glass and all-screen aesthetic are a big upgrade over the fractured metal LG G5 look two years ago, even if this means you have to forgo a replaceable battery.",
    "LG calls the top screen space to the left and right of the notch its ‘New Second Screen’ – it’s not. At least not like it was on the LG V10 and LG V20 second screen which showed detailed notifications. This is simply where the time, battery life percentage, and small notification icons live.",
    "The notch is also LG’s way of expanding the screen to a 19.5:9 aspect ratio – there’s a smidgen more space to fit all of those status icons. And, hey, if you don’t like the controversial notch look, you can always ‘hide' it by masking the screen corners.",
    "Or, if you really want to highlight this Apple-esque design trait, you can change up the color and even add gradients (the middle notch will always be black, though).",
    "You can see the blacked-out LCD sides surrounding the notch, but only with a discriminating eye in certain light. However, after several months of using the LG G7 we grew to accept the notch, and we now hardly notice it.",
    "The LCD also carriers an always-on display, despite the fact that this is more of an OLED-benefiting technology.",
    "Why LCD? LG likes to boast that its entire display can get very bright – maxing out at 1,000 nits. This makes it ideal for outdoor use when a normal smartphone peaks at 500 or maybe 600 nits. LG calls this its Super Bright Display, and says it's 30% more energy efficient in this mode versus the LG G6 screen.",
    "The Super Bright Display mode lasts for three minutes, a cap meant to save your battery and not overheat the device. That was just enough time to read messages our phone screen while walking outdoors in direct sunlight in our preliminary testing.",
    "The problem is that the Samsung Galaxy S9 Plus we were carrying also showed a peak brightness of more than 1,000 nits. It’s one of the few phones that can do this besides the G7, but it’s also LG’s chief smartphone rival. It some cases, the G7 looked brighter without distorting the images on-screen, but not always.",
    "The LG G7 ThinQ has an easy-to-reach fingerprint sensor on back, just below a vertically stacked dual-lens rear camera. Only this sensor pad doesn’t click in to double as a sleep/wake button, like on other recent LG devices.",
    "LG’s design team has returned the power to the right side of the phone – where it belongs – after much feedback. They've clearly gotten our letters.",
    "Remember when LG used to put both the sleep/wake button and volume buttons on the back of its phones, circa LG G4? Yes, it provided cleaner sides, and it was easier to grasp the device without accidentally pressing these buttons, but the design always felt too unconventional. The LG G7 feels like a mainstream, immediately familiar smartphone, and that’s pleasing.",
    "There is one extra button, too: the new dedicated AI button that sits on left side of the metal frame. More than a few times, we mispressed this Google Assistant shortcut, mistaking it for the volume down key on the left side. It’s the same problem we have with Samsung’s Bixby button.",
    "Luckily, you can turn off LG’s AI button, and the company is contemplating letting users remap it to another action in the future. LG could have avoided this issue though by adding a textured finish to the AI button, making it easier to recognize under thumb.",
    "LG’s AI button is better than Samsung’s, however. A single press launches Google Assistant, a double press launches you straight into Google Lens, and a long press on the key takes you straight into voice commands with Assistant. It’s a far more intuitive system than Samsung’s, and one we can see ourselves using.",
    "The LG G7 has a clean, albeit plainer look than the curved Samsung Galaxy S9 and Apple’s completely chin-less all-screen OLED. It feels premium in the hand, and at 162g is has a good weight without being too overbearing. Those with smaller palms will still likely find the LG G7 too big to use one-handed though.",
    "One thing to note though, the glass rear of the LG G7 is a real fingerprint magnet, so if you're not planning on putting a case on the phone be prepared to give it regular wipes.",
    "You can opt for a variety of colors to spice things up: Raspberry Rose, New Moroccan Blue, New Aurora Black, and New Platinum Gray.",
    "Not all LG G7 colors will be available in all countries. In the US, you'll find Raspberry Rose on T-Mobile. New Moroccan Blue is exclusive to the UK via O2."
  ],
  "headers": {
    "19": "Price and release date",
    "25": "Super Bright LCD and glass design"
  },
  "links": {
    "LG G8": "https://www.techradar.com/reviews/lg-g8-review",
    "LG G6": "https://www.techradar.com/reviews/lg-g6",
    "update": "https://www.androidpolice.com/2019/06/05/lg-g7-thinq-is-finally-getting-its-android-9-pie-update/",
    "Samsung Galaxy S10 line": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Huawei P30 Pro": "https://www.techradar.com/reviews/huawei-p30-pro",
    "OnePlus 6T": "https://www.techradar.com/reviews/oneplus-6t-review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "iPhone X": "https://www.techradar.com/reviews/iphone-x-review",
    "LG V30S ThinQ": "https://www.techradar.com/reviews/lg-v30s-thinq",
    "Google Pixel 2": "https://www.techradar.com/reviews/google-pixel-2-review",
    "Google Pixel 2 XL": "https://www.techradar.com/reviews/google-pixel-2-xl-review",
    "Samsung Galaxy S9": "https://www.techradar.com/reviews/samsung-galaxy-s9-review",
    "S9 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s9-plus-review",
    "LG V40": "https://www.techradar.com/reviews/lg-v40-thinq",
    "LG V35": "https://www.techradar.com/reviews/lg-v35-thinq",
    "LG G5": "https://www.techradar.com/reviews/phones/mobile-phones/lg-g5-1315187/review",
    "LG V10": "https://www.techradar.com/reviews/phones/mobile-phones/lg-v10-1305854/review",
    "LG V20": "https://www.techradar.com/reviews/phones/mobile-phones/lg-v20-1328026/review",
    "Samsung Galaxy S9 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s9-plus-review",
    "LG G4": "https://www.techradar.com/reviews/phones/mobile-phones/lg-g4-1292304/review"
  }
}