{
  "source": "https://www.techradar.com/reviews/dji-osmo-action-review",
  "title": "DJI Osmo Action review",
  "category": "cameras",
  "updated": "2019-10-08T06:33:48Z",
  "author": "basil-kronfli",
  "summary": "More than just a GoPro clone",
  "verdict": "The DJI Osmo Action is a fantastic little number that runs circles around (other) GoPro copycats. It also gives the Hero7 Black a serious run for its money and still manages to hold its own now that the Hero8-series has arrived, with its great image quality, plenty of shooting modes and that selfie screen. If you vlog a lot, need steady video and don’t want to pay GoPro prices, the DJI Osmo Action is a great alternative.",
  "pros": [
    "Very good stabilization",
    "Handy front display",
    "Competitive video quality"
  ],
  "cons": [
    "Display lag when RockSteady is active",
    "Mounting requires housing (unlike Hero8)",
    "No 4:3 60fps capture"
  ],
  "article": [
    "Ready for Action? DJI certainly is now that it’s got a suite of gimbals, drones and even a robotic build-it-yourself toy that all capture high-impact footage. Its action camera, the aptly named DJI Osmo Action, is a GoPro-a-like cube with two screens, very impressive image stabilization and a lower price than either the GoPro Hero7 Black or Hero8 Black; but can a company new to the space really take on GoPro, or should you be holding out for a Hero8 Black instead of picking up a DJI Osmo Action?",
    "The DJI Osmo Action was announced in May 2019 with an RRP of $379 / £329 / AU$499, though it is selling for $329/£279 at the time of this review. To compare, you can pick up a GoPro Hero7 Black for $329 / £319 / AU $529. As for the latest, greatest GoPro, the Hero8 Black will set you back $399.99 / $379.99 / AU $599.95.",
    "We were reviewing the DJI Osmo Action in a park, when a friend said - ‘Oh cool, a GoPro!” - it gave us that sinking feeling we get when someone calls our Android tablet an iPad, but that’s what you get when a product dominates a category. It also hits the point home – DJI has taken more than a few design cues from GoPro.",
    "The Osmo Action has a similar big-lens rear-screen style and uses very similar housing to the entire Hero7 line, and the same mounting system too. Having said that, the DJI Osmo Action is definitely not a GoPro..",
    "First off, it’s two-tone grey body looks very DJI, especially alongside the Osmo Mobile 3 – they look like a part of the same family. The Action isn’t matte with a rubbery finish either, instead sporting a solid metal body with a textured, grippy band that seamlessly wraps around its frame on its left, right and top-side.",
    "On the front is a 1.4-inch screen that gets nice and bright for great outdoor viewability – up to 750 nits, with a pixel density of 300PPI. To the right of it is a giant lens, shielded by a screw-on lens protector.",
    "A USB-C port and a microSD card slot sit under a flap to the right of the Osmo Action. At the base is where you’ll find a couple of latches that release the battery, while on the back is the touch display. Power, record and quick switch buttons are dotted around the top and right side, and while they’re a bit spongy, they also deliver decent click-feedback.",
    "Its screen is a quarter of an inch larger than that of the GoPro Heroes at 2.25 inches, and that extra size is welcome, as is its 16:9 aspect ratio, making it feel much, much larger when shooting in that aspect ratio than the 4:3 GoPro display.",
    "Touch sensitivity is on-point and is helped along by an intuitive menu system. The primary display gets just as bright as the front one - 750 nits but it is a bit crisper at 325PPI.",
    "We don’t love the Osmo Action’s color scheme but, ergonomically, it feels solid and the buttons and interaction, in general, come together very well. Its battery is easy to swap out (when it isn’t in a case) and it’s hardier than the GoPros, submergible up to 11m without waterproof housing as opposed to 10m."
  ],
  "headers": {
    "2": "Design and display(s)"
  },
  "links": {
    "robotic build-it-yourself toy": "https://www.techradar.com/news/dji-introduces-is-first-ground-based-drone-with-the-robomaster-s1",
    "GoPro Hero7 Black": "https://www.techradar.com/reviews/gopro-hero7-black-review",
    "Hero8 Black": "https://www.techradar.com/reviews/gopro-hero-8-black",
    "Osmo Mobile 3": "https://www.techradar.com/reviews/dji-osmo-mobile-3-review"
  }
}