{
  "source": "https://www.techradar.com/reviews/honor-20-lite-review",
  "title": "Honor 20 Lite review",
  "category": "phones",
  "updated": "2019-05-10T14:02:20Z",
  "author": "jon-mundy",
  "summary": "Honor presents a triple threat to the budget phone category",
  "verdict": "Honor has crafted another fine-all-round budget contender in the Honor 20 Lite, with a camera that’s capable of good things. However, it hasn’t advanced much beyond the Honor 10 Lite, and you can find better value elsewhere.",
  "pros": [
    "Strong screen for the price",
    "Good-looking design",
    "Camera capable of quality pictures"
  ],
  "cons": [
    "Worse value than Honor 10 Lite",
    "Wide-angle camera isn’t great",
    "EMUI continues to underwhelm"
  ],
  "article": [
    "Update: After Google suspended Huawei's future access to Android Play Store and security updates, there are serious question marks over the future of Huawei and Honor phones.",
    "While Google and Huawei have promised to support phones currently on the market, it's not clear how long they'll receive Android updates or access to the Google Play Store, which would severely curtail their usefulness compared to the competition.",
    "With the Pixel 3a, Google has built a phone around the twin pillars of value for money and photographic excellence. The Honor 20 Lite adopts a similar philosophy, but with an even more wallet-friendly price tag.",
    "This isn’t a new approach from Huawei’s youthful sub-brand – the Honor 10 Lite and Honor 9 Lite both packed eye-catching camera tech into a sub-£200 (roughly $260/AU$370) smartphone body.",
    "However, the Honor 20 Lite takes things to the next level, with the kind of triple camera setup you might expect to see in a flagship phone. As the first phone of the entire Honor 20 series, and therefore consumers' introduction to the range, it’s up to the Honor 20 Lite to set a positive tone.",
    "It’s not much of a spoiler to say that the Honor 20 Lite is a better phone than the Honor 10 Lite before it – but with a starting price tag that’s 25% higher than its predecessor’s, does the Honor 20 Lite hit the same value sweet spot?",
    "The Honor 20 Lite hits UK retailers on May 15 at a price of £249.99 (around $335 / AU$480) SIM-free. As we’ve already mentioned, this marks a sizeable increase from the £199 (roughly $260/AU$370) starting price of the Honor 10 Lite and Honor 9 Lite before it.",
    "At this price, the Honor 10 Lite comes up against the likes of the Oppo RX17 Neo, the Moto G7 Plus, and indeed the Honor 10 and Huawei Mate 20 Lite from its own stable.",
    "It will be available initially from Carphone Warehouse, John Lewis, Amazon, Argos, AO.com and Very, with more retail partners set to follow.",
    "Like its immediate predecessors, the Honor 20 Lite is designed to offer the basic look, feel, and feature set of a modern flagship phone in a budget-friendly package.",
    "To that end you get a large, front-filling display with hardly any side bezels and only a modest notch. You also get a shiny rear surface, and a speedy fingerprint scanner embedded within.",
    "Most prominently of all, you get an AI-assisted triple-camera system that, on paper, will have you double checking the phone’s price tag.",
    "But it’s not the price tag that needs closer inspection here. Or at least, not for the reason you might be thinking. If you want to see how the Honor 20 Lite offers such a feature set for so cheap, you only need look at each constituent component in a little more detail.",
    "That big display has a lowly LCD panel rather than the OLED offerings of the flagships, while the body of the phone is made of plastic rather than metal. The fingerprint scanner isn’t one of those newfangled in-display sensors that the latest flagship phones are adopting, either.",
    "Elsewhere you’ll find recycled and entry-level components in place of the very latest tech, as well as out-of-date connectivity options. That triple-camera system, too, doesn’t actually feature three full-on cameras, nor is it the premium flagship-troubling unit that the Pixel 3a promises to be.",
    "None of this is a criticism, as such, merely a reality check. Indeed, the way in which the Honor 20 Lite nails the gist of a modern flagship phone is worthy of praise. It’s an obvious impersonation, but a good one nonetheless.",
    "The design of the Honor 20 Lite hasn’t changed much since last year’s Honor 10 Lite. It’s another attractive, shiny, well-proportioned phone with minimal bezels and a ‘teardrop’ notch. There’s a strong whiff of the Huawei P30 Lite to the phone, too.",
    "Ours is the more eye-catching Phantom Blue model, which shifts from blue to purple as you move from the top of the phone near the camera to the bottom. You can also get it in Midnight Black, though only Carphone Warehouse will carry this for the first six months.",
    "It’s almost identically proportioned to its predecessor, with a weight of around 164g and a thickness of just under 8mm. With the same chrome-effect plastic rim and shiny glass-effect (but again decidedly plastic) back, it feels similarly nice in the hand too.",
    "Some may find the fingerprint sensor a little higher on the back than they’re used to, but it doesn’t take long to adjust. We actually found the volume key to be a little trickier to negotiate – it’s just a little too high on the right edge, particularly when it comes to reaching the ‘up’ button.",
    "The bottom edge of the phone is a case of two bad, one good. On the plus side, you get a headphone socket, but on the negative side, Honor has gone with the dated micro USB charging standard rather than USB-C. The downward-facing speaker is also a little too easy to cover with your finger in landscape view, but we’re mainly disappointed with that crusty old USB standard.",
    "We did find that the presence of a teardrop notch and a slightly larger chin left the phone feeling slightly lopsided at first, but it didn’t take long to grow accustomed to the Honor 20 Lite’s asymmetrical quirks.",
    "Indeed, things are largely positive on the business side of the Honor 20 Lite. Its 6.21-inch LCD screen is big, plenty bright enough, and well-balanced.",
    "A Full HD+ (1080 x 2340) resolution offers ample pixels for all but mobile VR applications (and who still uses those?), while it also stretches out into the corners to the tune of a 90% screen-to-body ratio.",
    "Here’s another ratio: 19.5:9. More specifically, that’s the aspect ratio for this very long (but not unusually so) display. You’ll still have to put up with landscape video content leaving chunky black borders to either side, but then so do iPhone XS and Galaxy S10 owners.",
    "Speaking of which, this isn’t the kind of display that’s going to trouble the OLED giants for color fidelity or contrast levels, but the picture it outputs is crisp and accurate. You can even tinker with the picture calibration in the settings menu if you so wish."
  ],
  "headers": {
    "6": "Honor 20 Lite price and availability",
    "9": "Upwardly mobile",
    "16": "Design and display"
  },
  "links": {
    "Google suspended Huawei's future access to Android Play Store": "https://www.techradar.com/news/huawei-ban",
    "Pixel 3a": "https://www.techradar.com/reviews/google-pixel-3a-review",
    "Honor 10 Lite": "https://www.techradar.com/reviews/honor-10-lite-review",
    "Honor 9 Lite": "https://www.techradar.com/reviews/honor-9-lite-review",
    "Honor 20": "https://www.techradar.com/reviews/honor-20-review",
    "Moto G7 Plus": "https://www.techradar.com/reviews/moto-g7-plus",
    "Honor 10": "https://www.techradar.com/reviews/honor-10-review",
    "Huawei Mate 20 Lite": "https://www.techradar.com/reviews/huawei-mate-20-lite-review",
    "Huawei P30 Lite": "https://www.techradar.com/reviews/huawei-p30-lite-review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10"
  }
}