{
  "source": "https://www.techradar.com/reviews/dji-osmo-mobile-3-review",
  "title": "DJI Osmo Mobile 3 review",
  "category": "cameras",
  "updated": "2020-01-15T17:02:06Z",
  "author": "basil-kronfli",
  "summary": "Phones aren’t the only things folding in 2019",
  "verdict": "The Osmo Mobile 3 undercuts the competition while still being portable and functional. Thanks to cool features within the DJI Mimo app, its face tracking is excellent, and while it takes some getting used to when using it as a traditional gimbal, its stabilization is fantastic. Put simply, it's the easiest smartphone gimbal to recommend out now, for novices and pros alike.",
  "pros": [
    "Incredibly portable",
    "Competitively priced",
    "Excellent face tracking"
  ],
  "cons": [
    "Mediocre object tracking (not faces)",
    "Android app inconsistencies",
    "Takes a bit of getting used to"
  ],
  "article": [
    "Huawei may have used the slogan ‘Rewrite the Rules’ for its P30 series of smartphones, but that phrase seriously springs to mind when looking at the DJI Osmo Mobile 3.",
    "The popular drone company's third stab at stabilizing smartphone cameras has done for gimbals what Microsoft’s Surface tablets did for kickstands all those years ago: it’s made them cool.",
    "By ditching convention and making the cumbersome gimbal collapsible, the Osmo Mobile 3 is the most portable smartphone gimbal we’ve ever seen. It also combines smart design with a unified app – DJI Mimo – that opens you up to a world of smart subject tracking and panoramic pictures, as well as a new Story feature that lets you create bite-sized clips set to music for maximum shareability.",
    "DJI is also continuing its trend of undercutting its own products. The Osmo Mobile launched at $229, the Osmo Mobile 2 launched for $129, and the new Osmo Mobile 3 starts at $119 / £99 / $AU159 / AED 399 for the standard version. If you want a few accessories bundled in, you can get it with the Osmo Grip Tripod, the Osmo Carrying Case and a pouch for $139 / £119 / $AU189 / AED 479.",
    "DJI’s Mimo app now controls the Osmo experience – and with it comes a host of refinements and new features.",
    "Available for iOS and Android, the app engages with your smartphone’s camera to give you more control from the gimbal’s buttons, so you can start recording, take a photo or zoom in without having to touch your phone’s screen. The Mimo app also gives you access to advanced options like timelapse, hyperlapse and panorama, in addition to a new Story mode.",
    "Story mode is really fun, quickly turning a handful of guided shots into a montage that’s set to music. While pro filmmakers may not take advantage of this, it’s a great marriage of hardware and software smarts, and creates really simple and engaging nuggets of joy (such as the example below).",
    "A double-tap of the M button will effortlessly switch you between portrait and landscape orientation, while three taps switches the Osmo Mobile 3’s arm between its starting and stowing positions. When the gimbal is off, a single tap of the M button lights up the four LEDs above the joystick, giving you a battery reading.",
    "As for the trigger, you just hold it to lock the direction of your phone and make the gimbal ultra-fluid. This is perfect for pans and creating crane-like swoops, as well as for tracking fast-moving objects manually. Double-tap the trigger, and you reset the gimbal’s positioning so your phone faces forward.",
    "The DJI Osmo Mobile 3 is primarily made of plastic, and while it’s light by gimbal standards, the part you grip feels solid and nicely weighted.",
    "At the base is a tripod thread, which is handy as the oddly shaped Osmo doesn't stand up on its own. There's a joystick for manual control over the phone's direction, as well as power and record buttons to the right of it, and LED battery indicators above.",
    "On the right side of the unit is a slider that controls your phone's zoom in the DJI Mimo app, while a trigger to straighten your phone out when the gimbal’s fired up is found at the front.",
    "A new addition to the Osmo Mobile series is a USB-C port for charging – a welcome bump up from the Mobile 2’s micro USB port. There’s also a full-sized USB-A port that will charge your smartphone from the Osmo’s 2450mAh battery.",
    "Unfurling the gimbal is fiddly at first, but once you get the hang of it it's incredibly satisfying. Everything clicks into place and locks nicely, and there are no wobbly bits when it's stowed, as is the case with many larger gimbals. While the Osmo Mobile 3's plastic frame does feel more toy-like than bulkier, older options, its portability and utility make it a dream to use.",
    "The Osmo Mobile 3’s clamp that holds your phone in place is also inspired, working with phones as small as an iPhone XS, and as big as the monstrous Huawei Mate 20 X. It’s cleverly shaped, and doesn't compress the sides of a phone like other options; this means it won’t press your phone’s power button when it clasps it, which makes it ideal for phones with camera buttons like the Sony Xperia 5.",
    "As for its grey color scheme, it's two-tone and plasticky, definitely adding to the Osmo Mobile 3’s toy factor, and arguably less premium than if it were black. That said, the fact that it looks less intimidating than traditional black mechanized arms of old arguably makes it more accessible – and that may be exactly what DJI is going for, especially given its mainstream advertising campaign that’s been flooding Instagram since the gimbal launched.",
    "In short, from a design point of view DJI has (sort of) reinvented the gimbal – and it’s worked.",
    "Using the Sony Xperia 1, complete with its Cinema Pro app that has stabilization turned off by default, we were able to isolate the stabilization the DJI Osmo Mobile 3 offers, and it’s impressive; the gimbal can make even heavy steps feel like light, floaty glides.",
    "Our main issue with footage captured is that the DJI Mimo App is inferior to native phone apps when it comes to video quality, especially on Android devices. As you can see from the sample video, it didn’t expose the shot for the face, thereby totally overexposing the selfie video, and focus stuttered pretty often. In challenging lighting we flipped to the phone’s camera app and it worked significantly better, although that results in no AI tracking.",
    "That said, in easy-to-handle lighting conditions the Mimo app is up to the task, especially when it can lock onto a face. It also comes complete with beauty modes to slim faces down, brighten eyes and teeth, and smooth out skin.",
    "Combined with AI tracking, the Osmo Mobile 3 is a fantastic tool for self-shooters. Give it a peace sign gesture to fire it up and it will lock onto you after a three-second countdown. Whether handheld or on a tripod, it does a great job of following your face about.",
    "AI tracking isn’t quite so hot with more challenging objects, like the tree we were tracking in the sample video, but after a couple of attempts we got it to work. To track objects that aren't faces you simply drag diagonally across your display, specifically across whatever you want to track, and the Mimo app will create a frame and stay locked onto whatever’s inside it.",
    "Practically speaking, the DJI Osmo Mobile 3 is handy to carry and has excellent battery life, just like the Osmo Mobile 2, with the same quoted on-time of 15 hours.",
    "As with its predecessor the battery isn't removable, but that shouldn’t phase you. We only charged the Osmo Mobile 3 twice in our week with it, using it both as a gimbal and as a very extravagant kickstand, watching entire TV shows with our phone angled perfectly while the gimbal was on its tripod base.",
    "If you know you’re going to be heavy ‘gimbaling’ for long durations, a full charge takes around two and a half hours, so factor in an overnight power-up if you can.",
    "Another point worth noting is that the Osmo Mobile 3’s clamp can creep into frame if you’re shooting with some ultra-wide cameras, such as the one on the Xperia 1, although this wasn't an issue with the Huawei P30 Pro’s ultra-wide shooter.",
    "This is an issue with a few smartphone gimbals, so if you like the idea of ultra-wide videography, and you have the opportunity to try before you buy, we'd recommend doing so to ensure the Osmo Mobile 3 works with all your phone’s cameras.",
    "If you’re coming from a more traditional gimbal, the DJI Osmo Mobile 3 may seem inferior at first use, as you may have to re-learn how to ‘gimbal’, given its shape. That said, after an hour, the rounded panning motions it forces you to embrace will feel more natural than horizontal and vertical pans – in fact, reviewing the Osmo Mobile 3 has ruined our traditional gimbal for us, at least until we relearn how to use that – something we definitely didn’t expect.",
    "So, between its incredibly light weight, compact size, great battery life, excellent face tracking and affordable price, the DJI Osmo Mobile 3 leapfrogs to the top of our recommended phone gimbal list."
  ],
  "headers": {
    "4": "Features",
    "9": "Design",
    "17": "Stabilization",
    "22": "Performance",
    "27": "Verdict"
  },
  "links": {
    "P30": "https://www.techradar.com/reviews/huawei-p30-review",
    "Osmo Mobile 2": "https://www.techradar.com/reviews/dji-osmo-mobile-2",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "Huawei Mate 20 X": "https://www.techradar.com/reviews/huawei-mate-x",
    "Sony Xperia 5": "https://www.techradar.com/reviews/sony-xperia-5-review"
  }
}