{
  "source": "https://www.techradar.com/reviews/vizio-v-series-v656-g4",
  "title": "Hands on: Vizio V-Series (V656-G4) review",
  "category": "televisions",
  "updated": "2019-06-01T00:43:12Z",
  "author": "linda-moskowitz",
  "summary": "An inexpensive TV with full array backlighting and some cutting-edge picture features",
  "verdict": "Vizio’s two new entry-level V-Series lines are recommended for those who are looking for an inexpensive TV with cutting-edge picture features like support for Dolby Vision.",
  "pros": [
    "Full Array Backlighting",
    "Local Dimming Zones (V6 Series)",
    "HDR10, Dolby Vision, HLG"
  ],
  "cons": [
    "Audio needs improvement",
    "Black levels could be better",
    "Limited viewing angle"
  ],
  "article": [
    "New for 2019, Vizio is introducing two new entry-level series of TVs - the V6 and V5 V-Series - to replace its longtime value D- and E-Series at the bottom of its lineup. But being low on the totem pole doesn’t mean they’ll be missing out on features - in fact, all of Vizio's 2019 models are 4K and have HDR10, HLG and Dolby Vision support for better content viewing, even the new V-Series.",
    "Pricing for the V-Series starts at just $259, with the V6-Series coming in sizes ranging from 43- to 65-inches and the V5-Series sizes ranging from 40- to 75-inches. At a preview event for the new screens held in New York City, we were able to go eyes-on with the new models, checking out the $630 65-inch V6-Series V656-G4.",
    "Here’s what we thought of it.",
    "The V-Series design is traditional, simple and similar to the 2018 D- and E-Series models, though its black bezel is wider than almost all of Vizio's other models.",
    "Speaking of things being a bit wider, the feet on either side of the TV will require a long piece of furniture - which is something you need to consider if your entertainment center is a bit narrower or shorter than the length of the TV.",
    "Turn the TV on and you’ll be met with Vizio’s SmartCast 3.0 smart TV platform which is now controllable via voice commands using Google Assistant and Amazon’s Alexa. According to Vizio, Apple AirPlay 2 and Home Kit will be added this summer, along with Siri controls. Out of the box Chromecast comes built-in.",
    "The TV's home page will also include popular apps such as Netflix, Prime Video, Hulu, Vudu and others, and SmartCast now includes “WatchFree,” a free streaming service that offers Pluto TV, CNN, Comedy Central Stand Up and more.",
    "One downside to SmartCast 3.0, however, is that it appears that YouTube has been removed. You can still access it from your mobile device and cast content to your TV but you won’t see an app for it on the screen.",
    "All Vizio Smart TVs will be backward-compatible through 2016 models.",
    "The V-Series has full array backlighting and up to 12 zones of local dimming with up to 400 nits of peak brightness on the 65” model we viewed. That’s a far-cry from the P-Series Quantum X that’s boasting 384 dimming zones and a peak brightness of up to 3,000 nits, but that’s why the V-Series is priced the way it is.",
    "What doesn’t change between the higher-tier and lower-tier models is support for HDR10, HLG and Dolby Vision HDR content. It’s available on every model this year, and will make HDR content look even better on this year’s screens.",
    "Also there to help is Clear Action 180 that aids in fast-moving scenes, and powerful image processing to help upscale 1080p content for a 4K screen.",
    "We’ll have to spend more time with the screen to make any final judgment, but there were a few issues with the performance that we noticed during our hands on time - including lackluster black levels, limited viewing angles and poor audio performance. But again, this is something we’ll have to test for ourselves when we get a review unit later this year.",
    "Overall, the features included in these models are uncommon in an entry-level display. It’s great to see Dolby Vision on a TV at this price point, and it promises to raise the bar for all value TVs. There were a few issues that could hold the V-Series back (see: black levels, limited viewing angles and poor audio performance) but we’ll reserve judgment for when we get a review unit.",
    "All that said, our only actionable piece of advice at this point is that if you’re thinking about an affordable $600 65-inch V5-series model, it is worth the extra $30 to upgrade to a V6-series model to get a better picture with Clear Action 180, Ultrabright 400 and local dimming zones inside.",
    "The V-Series V6 come in 43-, 55- and 65-inch models with prices ranging from $300 to $630 and the V5 models come in 40-, 43-, 50-, 55-, 60-, 65-, 70-, 75-inch models and the prices range from $260 to $1,200."
  ],
  "headers": {
    "3": "Design",
    "9": "Performance",
    "13": "Early verdict"
  },
  "links": {
    "P-Series Quantum X": "https://www.techradar.com/reviews/vizio-p-series-quantum-x-px65-g1"
  }
}