{
  "source": "https://www.techradar.com/reviews/crock-pot-csc024-56l-digital-slow-and-multi-cooker",
  "title": "Crock-Pot CSC024 5.6L Digital Slow and Multi Cooker review",
  "category": "appliances",
  "updated": "2019-11-12T16:43:06Z",
  "author": "ava-szajna-hopgood",
  "summary": "A versatile new look for the classic slow cooker",
  "verdict": "It’s a spruced-up take on a vintage model, and great for catering for a crowd.",
  "pros": [
    "High temperature",
    "Easy to use",
    "Adjustable temperature and timing"
  ],
  "cons": [
    "Can’t pressure cook",
    "Non-stick pot",
    "Quite similar to regular oven"
  ],
  "article": [
    "The Crock-Pot brand is one of the best-known slow cookers out there, so much so it is often used interchangeably to describe all appliances that decelerate the cooking process.",
    "With the influx of Instant Pots and a huge array of multi-cookers, we wanted to see how Crock-Pot’s digital model stands up against the young pretenders on the market.",
    "Does the veritable brand hold its own against the upstarts? Or is Crock-Pot starting to show its age? Here's our Crock-Pot CSC024 5.6L Digital Slow and Multi Cooker full review.",
    "It's at the pricier end of the scale, the Crock-Pot CSC024 5.6L Digital Slow and Multi Cooker. With a price tag of £119.99 ($155 / AU$225).",
    "And certainly, its stainless steel exterior finish gives it a traditional, high-end look to accompany your top-end kitchenware. However, it's performance doesn't quite match the price, and potential issues with its non-stick surfaces rise eyebrows over its premium placement.",
    "We loved the handles on either side of the Crock-Pot, which means it can be lifted out and taken to the table or used to serve straight out at parties. At 5.6 litres (5.9 quarts), this Crock-Pot is large enough for batch cooking or making big dishes for family gatherings, as well as fitting in a whole roast chicken.",
    "The rectangular dish means you can fit larger joints of meat or a whole chicken for roasting - often the circular or oval slow cookers don’t leave enough room for this. The shape also makes it easier to slot into a crowded kitchen surface.",
    "The Crock-Pot has five pre-programmed intelligent functions, which each have multiple settings. This bakes, roasts and steams but does not pressure cook.",
    "You can manually adjust temperature and timings, so it’s very customisable. Not all of the other machines we reviewed allow you to change the temperature, and as you become more familiar with the machine and the recipes you can achieve, it’s good to have the flexibility.",
    "With the Crock-Pot, the temperature ranges an impressive 65 to 230 centigrade. While a conventional oven can reach that high, it’s difficult to maintain in a larger space. Because the Crock-Pot is comparatively smaller, when a recipe calls for heat, you’ve got it with this.",
    "Compared against the Instant Pot, we loved that the Crock Pot allows a little more ‘hands on’ cooking. You can see the food as it works, adjust the temperatures and essentially make your own settings. If you’re the kind of cook that likes to tend to their dishes, you might be more at home with the Crock-Pot.",
    "Very easy to use, the Crock-Pot CSC024 5.6L Digital Slow and Multi Cooker cooks consistently and fast. Curries, soups, roasts, risottos and even pasta bakes were a breeze. It reaches high temperatures quickly, and you can also leave it up to 12 hours in the slow cook mode.",
    "Roast potatoes don’t need to be par-boiled, and they came out crispy on the outside, fluffy on the inside after just 40 minutes cooking time. The Crock-Pot came up to temperature so quickly for roasting, and it feels like a much safer option than having a tray of hot oil for roast potatoes. Instead, you just pop the potatoes in the pan and let the Crock-Pot do the hard work.",
    "The Crock Pot is essentially a scaled-down surface-top oven that will achieve high temperatures with relative ease, but if you already have an oven that works reasonably well, it’s difficult to see the stand-out benefits of the Crock Pot when considering its roasting capabilities.",
    "On the other hand, it cooks lentils and pulses beautifully, and it is an excellent slow cooker. We left this on before heading out to work, and each day came home to something nutritious to prepare for dinner (or dinner itself if we’d prepped a stew or casserole!). The ‘keep warm’ function automatically kicks in after the cooking process, too.",
    "What’s more, the pot and lid are dishwasher-proof, so you really do feel like you’re cutting down on washing up when there’s a crowd in tow.",
    "At £119.99, it’s one of the most expensive multi-cookers we reviewed. The brushed stainless steel exterior looks super stylish, it’s been designed with practicalities in mind and there’s a lot to play with here. However, while we didn’t find this to be an issue, plenty of other user reviews online have noted the non-stick pan coming away after prolonged use, and compared to the other slow cookers in this price range the pot certainly feels flimsier than a ceramic bowl or the Instant Pot.",
    "With everything takes place in one pot, we’re hard pressed to find any safety issues. In fact Sunday roasts feel a lot safer made in the Crock-Pot, as there’s no spitting oil trays needed to be removed from a normal oven, and thanks to the glass lid, you can still keep an eye on everything that’s cooking.",
    "The old-school Crock-Pot has come a long way, and this is a great update on the traditional family slow cooker. Although it doesn’t offer the pressure-cooking capabilities of its competitors, high temperatures and quick roasting are a good, practical bonus if you’re cooking for a busy family.",
    "The only thing it’s really missing for this price point is a delayed start timer. If you can work around that, the Crock-Pot does what it does very well."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "11": "Performance",
    "18": "Verdict"
  },
  "links": {
    "slow cookers": "https://www.techradar.com/news/best-instant-pot-pressure-cookers-slow-cookers",
    "Instant Pots": "https://www.techradar.com/reviews/instant-pot-duo-v2-7-in-1-electric-pressure-cooker-review"
  }
}