{
  "source": "https://www.techradar.com/reviews/paintshop-pro-2020",
  "title": "Paintshop Pro 2020 review",
  "category": "computing",
  "updated": "2019-10-28T16:00:22Z",
  "author": "steve-paris",
  "summary": "Can this update help Corel compete with Adobe? Does it even need to?",
  "verdict": "Paintshop Pro 2020 is a good update, offering many new tools and features, and which includes under-the-hood tweaks that make the experience more fluid and responsive.",
  "pros": [
    "Great new powerful tools",
    "Flexible interface",
    "Affordable"
  ],
  "cons": [
    "Windows Only",
    "Interface can be patella heavy by default",
    "Not all brushes and features are part of the initial price"
  ],
  "article": [
    "Paintshop Pro is Corel’s alternative to Adobe’s juggernaut, Photoshop. But in a way this isn’t a fair comparison, especially when you look at the price for each app. Photoshop can only be acquired on a subscription and the cheapest one (which includes Lightroom as well) will set you back $10 per month. Stop paying and you can no longer use the program. For that price, you also gain access to any updates to the software, even full version revisions.",
    "Paintshop Pro however is available as a perpetual licence, which means you pay a one-off fee and the app is yours forever. At the time of writing, this was $99. But of course, when Corel releases the next major update, you’ll have to choose whether to keep using your current version or pay for the next one - the upgrade cost is currently set at $79.",
    "So what does $99 get you and what new features have been introduced in the 2020 version?",
    "The first change you’ll notice right away is the ability to choose your workspace. You're offered three choices, Photography, Essentials and Complete.",
    "Photography is a truly bare bones interface. The buttons are big and chunky and very few options available, although most are centred around touching up photos and applying filters to them. If this is all you’re interested in, then the interface offers you exactly what you need, but experienced manipulators may well feel constrained by the limitations.",
    "The reason the buttons are so big and chunky is because the interface is touch aware. So if your computer screen is compatible, you would be able to forgo the keyboard, trackpad and mouse, and interact with your photo by touch, just as you would on a tablet or phone.",
    "If this was all PaintShop Pro had to offer, it definitely wouldn’t be worth the asking price. Thankfully, additional power resides in the other workspaces.",
    "Switching to Complete grants you access to every tool PaintShop Pro has to offer, and this is where the app feels most like Photoshop, or any other high end image manipulator for that mater. The only drawback to Complete is all the palettes it opens by default. If you’re working on a laptop, or on a small screen, you may well end up with more palettes than space available for the photo you’re trying to work on!",
    "The selection tools, especially the ‘Smart Selection Tool’, were already quite impressive, but Corel is now introducing ‘Refine Brush’ where you’re offered four different brushes (refine, feather, add, remove) to fine tune your selection until it is as precise as you need it to be. You can then further alter your selection with four sliders whose titles should be self-explanatory - Smooth, Feather, Border Width and Expand Border.",
    "We particularly liked the Output option. By default, when you apply your changes to your photo, the result appears as a traditional selection. However, you can also choose the output to be a mask, a new layer or a mask layer from the Output drop down menu. These little touches can help speed up your work depending on what your next step is going to be.",
    "The new Smart Clone tool offers a few advantages over the previous clone feature. Selecting an area to clone is easy: just click and drag and then click somewhere else to apply your selection. Paintshop Pro will then analyse the location you're cloning to to blend the existing colours with the feature you’re adding. This is even more pronounced when you select the ‘Blend’ option from the Mode menu. Selecting Black and White will mostly clone the texture and leave the surrounding colours unaltered.",
    "Even better, if you like the selection you're cloning, you can save it as a preset, to use on other photos. This makes it easy to apply textures to a photo and create interesting and unusual effects in seconds.",
    "These are the major changes to Paintshop Pro 2020, the showstoppers, if you will, but Corel didn’t stop there. They added support for 4K screens, for additional styluses and graphics tablets - including Windows Ink, and are now compatible with new RAW formats. We couldn't test all of those features, but keeping up with the latest technology is as crucial as any new feature they might add, and is very welcome indeed.",
    "Corel have also spent time making sure their software was as efficient as they could make it. For instance, they overhauled the app’s text tool to make it more responsive, and as long as your computer has enough power behind it, you’ll notice and appreciate this.",
    "We also liked the new feature in Layers, offering you the ability to replicate style settings between layers with a couple of click. This is a great way to duplicate effects and changes without having the reinvent the wheel each time.",
    "New brushes and palettes have also been introduced, but not all are bundled into the app by default - in order to get them, you need to access Corel’s online store (which you can do from Paintshop Pro’s welcome screen), and see everything that’s available - for a price. Sadly there are precious few add ons that are free, but the brushes are mostly cheap enough to give them a try. It’s just hard to swallow, having paid good money for an app, to be confronted with a pay wall to gain access to more content. This isn’t a complaint specific to Corel, but to any publisher who does this.",
    "All in all, Corel Paintshop Pro 2020 is a solid piece of software, which allows you to improve photographs and create complex composites with ease. It hasn’t got all the features that Photoshop enjoys, but then again, it doesn't cost nearly as much, and the tools it does have, especially the ones in this update are most impressive. We particularly liked the Refine Brush tool which made it incredibly easy to create complex selections."
  ],
  "headers": {
    "3": "Workspaces",
    "8": "Precision selection",
    "10": "Cloning around",
    "12": "Under the hood",
    "16": "Final verdict"
  },
  "links": {
    "Paintshop Pro": "https://www.paintshoppro.com/en/products/paintshop-pro/ultimate/",
    "Photoshop": "https://www.techradar.com/reviews/adobe-photoshop-cc-2019"
  }
}