{
  "source": "https://www.techradar.com/reviews/moto-g6-review",
  "title": "Moto G6 review",
  "category": "phones",
  "updated": "2019-07-15T13:16:06Z",
  "author": "james-peckham",
  "summary": "The Motorola G is one of the best budget phones",
  "verdict": "The Moto G6 may not feel or run like a flagship phone, but it’s not pretending to be one. The G6 offers a lot of solid features, plus extras including some fun camera features, fast charging and it all adds up to make one of the best budget handsets on the market.",
  "pros": [
    "Low price",
    "Premium design for the price",
    "Bright and clear display"
  ],
  "cons": [
    "Not waterproof",
    "Slow camera"
  ],
  "article": [
    "Motorola’s G series has gone from strength to strength, which is a real achievement considering the first phone in the line, from 2013, set a new standard for affordable phones, and racked up sales to match.",
    "The company's aim with the Moto G line is to bring those features you’d normally expect on high-end phones to a cheaper handset. It’s never going to be the same experience as buying a genuinely high-end phone, but it does allow you to get a taste of those top-end features without spending a fortune.",
    "To that end, Motorola has brought to the Moto G6 an 18:9 display ratio, similar to what we’ve seen on numerous higher-end phones recently from the Samsung Galaxy S9 to the iPhone XS, OnePlus 6T and beyond.",
    "It’s not the first company to bring such an aspect ratio to an affordable handset – Alcatel released a whole series of phones (headlined by the Alcatel 5) earlier in 2018 that even included a phone under £100 with an 18:9 display – but it’s the first time this feature has come to the Moto G, and that’s a big deal.",
    "And the display isn’t the only flagship-esque feature, with other firsts for the Moto G line including a dual-sensor camera on the rear, fast charging and more features you’d normally see on high-end phones.",
    "So is this the perfect handset for those who want something good-looking and feature-packed in their pocket but don’t want to spend lots of money? Let's take a closer look at the Motorola G6.",
    "Below you can watch our review video for the design and screen of the Moto G6",
    "The Moto G6 is available to buy worldwide, with a price tag at launch of $249.99 (£219, AU$399) SIM-free for the 3GB of RAM/32GB of storage model.",
    "Both Vodafone and EE in the UK are ranging the phone. There's also a higher-end version that’s exclusive to Amazon, with 64GB of storage and 4GB of RAM, that launched for £239 in the UK, and you may well think it's worth that extra £20 to double your storage.",
    "However, with the Motorola G6 getting on for being a year old, its price has taken a tumble in recent months and can now be picked up for a highly attractive $150/£160 SIM free on Amazon.",
    "Both the design and display have been dramatically improved over the Moto G5S from 2017. The Moto G6 comes with an 18:9 aspect ratio display, and that’s an IPS LCD at 5.7 inches.",
    "You get a Full HD+ resolution, so it’s slightly higher than Full HD phones because of the taller screen size. It doesn’t look as stunning as the displays on high-end handsets, but it looks great considering the price of the phone.",
    "The new aspect ratio isn’t just good for the look of the handset, it means there’s more screen packed into a smaller body; it's the optimum size for the phone's overall size (we found the G6 easier to hold than the Moto G6 Plus), and the screen is bright, with strong viewing angles too.",
    "We did find it a struggle to see the screen in bright sunlight, which can be a disadvantage of IPS LCD screens compared to AMOLED displays.",
    "The stretched out aspect ratio of the display does make the G6 feel like a notable upgrade over the Moto G phones of the past, as it allows the phone to have a slightly larger display without taking the dimensions of the phone itself into phablet territory.",
    "The G6 is made with 3D glass, so the back looks shiny and premium, although it does pick up fingerprints rather easily. That’s an issue with a lot of glass-backed phones though, and it only takes a moment to wipe down the back to get rid of marks.",
    "We’ve been using the black version of the Moto G6 for this review, but there are also Deep Indigo, Silver and Blush (another blue shade) color options.",
    "The rear edges of the G6 are curved, and that allows it to sit much more comfortably in the palm of your hand than previous models – if you've seen the Samsung Galaxy S7, it’s a similar curvature on the back. There’s an aluminum frame around the edges, which is perhaps the cheapest-feeling element of the phone.",
    "Motorola says the G6 is splash-proof, but it hasn't yet revealed the phone's IP rating, so you'll want to take care around water as it won’t survive being fully submerged.",
    "On the bottom of the phone you’ll find a USB-C slot in the middle and – thank you Motorola – a 3.5mm headphone jack, so you can use your wired headphones with this phone. We weren’t sure if Moto would keep the headphone jack for this phone, as it’s dropped it from its flagship products, so fans of wired headsets will be happy to see the feature retained here.",
    "Motorola has also kept the fingerprint sensor on the front of the phone, just below the display, but it doesn’t take up much space, so the bottom bezel is quite thin and looks good. The sensor is easy it hit, and we found that it worked efficiently."
  ],
  "headers": {
    "7": "Moto G6 release date and price",
    "10": "Moto G6 design and display"
  },
  "links": {
    "Samsung Galaxy S9": "https://www.techradar.com/reviews/samsung-galaxy-s9-review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "OnePlus 6T": "https://www.techradar.com/reviews/oneplus-6t-review",
    "Alcatel 5": "https://www.techradar.com/reviews/alcatel-5-review",
    "Moto G5S": "https://www.techradar.com/reviews/moto-g5s",
    "Samsung Galaxy S7": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s7-1315188/review"
  }
}