{
  "source": "https://www.techradar.com/reviews/lg-cinebeam-hu80ksw-4k-projector",
  "title": "LG CineBeam HU80KSW 4K projector review",
  "category": "audio-visual",
  "updated": "2020-02-27T16:29:29Z",
  "author": "andrew-murphy",
  "summary": "A one-box home cinema system you can set up in minutes",
  "verdict": "More than merely a portable projector, the CineBeam HU80KSW is an innovative home cinema system with scope to be built on over time.",
  "pros": [
    "A true one-box system",
    "4K HDR picture is more than capable",
    "Can build a more comprehensive system around it"
  ],
  "cons": [
    "Class-leading projectors better its detail and motion",
    "Still need speakers for optimum sound"
  ],
  "article": [
    "No longer is a home cinema strictly the preserve of the rich. For those who covet that big-screen experience from the comfort of their own sofa, the market is strewn with portable projectors available for around the cost of a takeaway dinner.",
    "At the other end of the spectrum, you could build a pretty decent entry-level system for a couple of grand. We’re talking AV amplifier, surround sound speakers, projector and a source in the kind of set-up that equates to your very own mini picture house.",
    "But what happens when you covet a true 4K HDR picture, with all the functionality of your smart TV and built-in speakers that won’t give you tinnitus, all without sacrificing the convenience of being able to pack it away in the broom cupboard after every film?",
    "Well, that’s where the LG CineBeam comes in. The HU80KSW will put up a fight against any dedicated projector at its price, but, more than that, it is a full home cinema system cannily distilled into one portable box you can carry like an elongated briefcase. Even the power cable is attached and wound into the base of the unit, so you really don’t have to plug anything into it if you don’t want to.",
    "The LG CineBeam HU80KSW 4K projector is available now, with prices hovering around the £2,000 mark (around $2,400 / AU$3,600), dependant on which LG home cinema stockist you purchase it from.",
    "Stock appears to be low however, with eBay sellers capitalising on this fact with inflated prices – though you can still get it from an official seller in the UK.",
    "The basic design of the CineBeam proves the power of simplicity. Lift the lens cap and on the underside of it you’ll find a mirror. By simply reflecting the image onto whatever surface you’ve cleared for your film – or shining the projector directly at it, of course – this means you can place the unit pretty much anywhere in the room you like.",
    "You can stand it alone in the middle of a room or on a coffee table, either tilting the mirror towards a wall or have it shining directly at the ceiling, put it on its side on a traditional AV rack or mount it permanently to the ceiling whichever way up you choose. It should recognise automatically how you’re using it, while the Auto Vertical Keystone will help align the picture if you haven’t the time or patience to do so manually.",
    "Focus and zoom are controlled by dials towards the top of the CineBeam, which allows for projection of an image anywhere between 66 and 150 inches. Much larger than any decent TV screen you could get for this kind of money, then.",
    "Brightness offered is an impressive 2,500 lumens, while LG claims a whopping 20,000-hour laser life. To put that into perspective, you could watch a two-hour film every day for 28 years before having to find a replacement. You don’t even get that kind of guarantee with your dearly beloved spouse.",
    "Nor are they likely to offer such wide-ranging entertainment. The CineBeam has a range of physical connections for tethering a traditional source such as a Blu-ray player, but it also comes with LG’s smart hub. From here you can download apps such as Netflix, Amazon Prime and YouTube, as well as those for catch-up TV from whichever territory you’re in. It can also mirror the screen from your smartphone, tablet or laptop without the use of cables, for playing any content you have stored on there.",
    "Regarding those physical connections, LG has fitted a pair of HDMI ports – ideal for the aforementioned Blu-ray player or wiring the CineBeam up to a home cinema amp – and two for USB (one 3.0, another 2.0) to access content from an external hard drive or USB stick. There is also an Ethernet connection for wired internet, which we’d always recommend using for greatest speeds and bandwidth when streaming from online.",
    "For this to be a true one-box system, however, focus has to be spread equally across audio as well. In that regard, LG has enlisted the aid of Harman Kardon to fit the CineBeam with a 7W-per-channel stereo speaker system that emits sound from either side of the unit.",
    "You can boost that as we’ve already mentioned by wiring it into a traditional AV set-up, or utilise the CineBeam’s on-board Bluetooth or physical audio outputs – namely 3.5mm aux, SPDIF and optical digital – to send sound seamlessly to any wireless speaker, soundbar or soundbase.",
    "While providing everything you absolutely need to start enjoying big-screen movie nights at home, LG has most importantly not boxed its customers in, offering numerous ways to upgrade and supplement what the CineBeam is capable of all by itself.",
    "Often with products such as these, the importance of a strong performance is matched by the necessity of something near that being achievable with very little tinkering or scrolling through menus. The CineBeam sets its stall out early, and that’s much of what we love about it.",
    "You’ll need to spend some time figuring out its ideal placement in your room, of course, but once the ‘screen’ is big enough, clearly focused and properly aligned – a little experimentation at first use will save you plenty of time next time you get it out – LG here offers a mightily impressive picture straight from the box.",
    "The CineBeam has a number of presets that’ll make wholesale changes to the picture, and it’s well worth giving each a try, but we’d suggest going for the User setting and just making a few tweaks depending on light and the surface onto which you’re projecting.",
    "Fundamentally, though, the picture is crisp and impressively detailed. Projectors of all prices can suffer when it comes to image depth, with a flat-looking image often leaving us rather underwhelmed, but LG here offers a lot in what is a commendably natural presentation.",
    "That natural feel extends to colors as well. It isn’t that the CineBeam doesn’t have the ability to really pop, and blacks do go relatively deep, but LG has evidently opted for a more neutral pallet that focuses on nailing aspects such as skin tone rather than blinding us with glaring lights. It ends up being a more engaging picture because of it, where sometimes an over-egging of more garish hues can leave a picture somewhat detached from reality.",
    "If you’re looking at the CineBeam purely as a projector, it doesn’t quite match class leaders at this price for absolute detail, especially in darker scenes, and perhaps offers a little roll off when it comes to contrast, but generally it holds its own.",
    "Our only real quibble is to do with motion processing. LG has used its TruMotion technology, designed to reduce and smooth the judder innate in projectors, especially at this sort of price, but it can feel a tad overdone. Fast-moving scenes and camera pans can feel somewhat artificial, regardless of the motion setting, but still this is a trifling caveat when it comes to what is a brilliant overall performance.",
    "Our expectations were more basic when it came to sound, but again the CineBeam has talent enough to impress.",
    "It is inherently limited by its form – you’d not be able to fit a projector with honking great drivers without it vibrating the whole unit, thus also the picture – so it is a predictably lean presentation, but it goes really rather loud.",
    "Placement will also affect the CineBeam’s sonic performance, given the speakers are lined along each side of the unit: you won’t hear everything evenly if you have it sat directly to your right or left, for example. Put it in some space, though, and even stereo imaging is impressive, all things considered, with certain sounds making definite moves across the soundfield.",
    "What ought be celebrated most, though, is how fast and dynamic it sounds. Despite this lighter presentation, dialogue is snappy and expressive, and action is dealt with punch even if it is not exactly a wallop.",
    "The reason we’re so enamoured by these elements is because they remain at play when using the CineBeam as an audio source, connecting first a wireless speaker and then a soundbar. That weight the built-in speakers lack obviously becomes less of a problem the larger the speaker you connect, but the presentation loses none of its dynamism or keen rhythmic sense.",
    "Adding an external speaker is by no means a necessity here, but the CineBeam offers maximum gains should you opt to do so. It makes for a fine boost to the system without having to go for a full surround package.",
    "There’s no doubt that for most of us the CineBeam is more than a frivolous purchase for those every-so-often film nights, but it performs all of its tasks admirably enough to be a solid and genuinely innovative home cinema system. Even better, as far as we’re concerned, is how LG has effectively future-proofed the unit by offering several means of upgrade and wider system building.",
    "If you’re after an immersive 4K projector you can set up at the drop of a hat, and perhaps add to in time, the LG CineBeam is well worth your attention."
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Design and features",
    "15": "Picture performance",
    "22": "Sound performance",
    "28": "Final verdict"
  },
  "links": {
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "smart TV": "https://www.techradar.com/news/best-tv"
  }
}