{
  "source": "https://www.techradar.com/reviews/fitbit-flex-2-review",
  "title": "Fitbit Flex 2 review",
  "category": "wearables",
  "updated": "2019-12-04T10:29:15.283Z",
  "author": "andrew-williams",
  "summary": "Fitbit's Flex is back for round two",
  "verdict": "The Fitbit Flex 2 is a solid choice for those after something simple, as well as those who are in need of a water-resistant tracker. It's smaller and sleeker than the original, but at the cost of battery life.",
  "pros": [
    "Comfortable and light",
    "Fun software",
    "Water resistant"
  ],
  "cons": [
    "Battery life not great",
    "Slow to charge",
    "Feature-light hardware"
  ],
  "article": [
    "The original Fitbit Flex has been around since 2013. It is a simple, reasonably small fitness tracker, not terribly expensive and not jam-packed with features.",
    "The Fitbit Flex 2, which arrived in late 2016, keeps that style, while adding more customization and full swim-ready water resistance (a first for Fitbit), all crammed into a smaller band.",
    "But not everything has been improved, with battery life proving a particular disappointment, and in the three years since the original Fitbit Flex a number of rivals have emerged - including some from Fitbit itself, so is the Fitbit Flex 2 enough of an update?",
    "Although Fitbit has pushed some major upgrades into the Flex 2, it originally costed around the same price as its predecessor too with a launch price of $99.95 (£79.99, AU$149.95).",
    "Since it launched back in 2016, we saw the price of the Fitbit Flex 2 drop down pretty low, but since it was discontinued the price has actually gone up a bit, thanks to it being rather hard to come by.",
    "The Fitbit Inspire is now the most affordable Fitbit fitness tracker available, and it's quite a bit more advanced than the Flex 2, but also bigger.",
    "The Fitbit Flex 2 is a skinny, slight, water resistant fitness tracker, small enough that you can wear a watch alongside it without looking like you’re wearing two timepieces.",
    "Its band is about a centimeter wide, and the width is more-or-less the same across the whole tracker. As Fitbit says, it’s about 30% smaller than the last Fitbit Flex.",
    "The make-up of the Fitbit Flex 2 is the same as before, though. Its brain is a little nugget of plastic that fits into the rubber strap, and can be popped out to charge.",
    "The main benefit of this style is that you can replace the band, and get versions that look a lot jazzier than the black rubbery one Fitbit sent us. Buy direct from Fitbit and you can pick from four colors: black, lavender, magenta and navy blue. Fitbit offers packs of other strap colors too.",
    "These rubbery straps have a low-key diagonal embossed pattern. If you’re after something a little more ostentatious, you can also get jewelry-like metal ‘bangles’, and pendants that turn the Flex 2 into a necklace.",
    "As these are made of higher-end materials they add a lot to the cost. The silver bangle is made of stainless steel and costs $89.95, £69.99, AU$149.95, the gold and pink ones are gold-plated steel and cost $99.95, £79.99, AU$169.95.",
    "You double the cost of the Flex 2 by buying one of these, but in return you get a tracker that looks like a piece of jewelry.",
    "Back to the rubbery one we actually have, the Fitbit Flex 2 uses the same style of button clasp as the old Flex. This has been a bit of a sore point for some Flex owners in the past, as it can be hard to seal, making you push with all your might against your wrist: not comfy.",
    "However, Fitbit does seem to have improved this, as we haven’t found it too hard to close the thing, although a decent push is still needed.",
    "The standard Fitbit Flex 2 comes with two sizes of strap, they’re the same width but there’s a longer one for people with chunkier wrists.",
    "Make sure the strap isn’t too tight and the Flex 2 becomes a fitness tracker you’ll completely forget you’re wearing. Keeping it on at night is no hardship at all: an important win for a low-key tracker like this."
  ],
  "headers": {
    "3": "Fitbit Flex 2 price and release date",
    "6": "Design"
  },
  "links": {
    "Fitbit Flex": "https://www.techradar.com/reviews/gadgets/fitbit-flex-1124344/review",
    "Fitbit Inspire": "https://www.techradar.com/reviews/fitbit-inspire-review"
  }
}