{
  "source": "https://www.techradar.com/reviews/asus-rog-strix-xg49vq",
  "title": "Asus ROG Strix XG49VQ review",
  "category": "computing",
  "updated": "2019-04-25T18:43:03Z",
  "author": "jeremy-laird",
  "summary": "Asus’s latest gaming monitor is a super-wide monster",
  "verdict": "Asus’s latest gaming panel is a super-wide, 49-inch monster of a monitor with a high refresh rate and HDR support. However, you’ll pay dearly for such a monitor without a USB-C port.",
  "pros": [
    "Huge panel size",
    "High refresh rate",
    "Great gaming features"
  ],
  "cons": [
    "Not exactly cheap",
    "Poor image quality for productivity",
    "No USB-C"
  ],
  "article": [
    "If bigger is better, then Asus’s latest uber monitor, the ROG Strix XG49VQ, is a very fine thing indeed. We’re talking 49 inches of premium curved LCD panel arranged in an outrageous 32:9 aspect ratio. This screen looks utterly spectacular.",
    "But, is it actually any good? On paper, it offers a strong feature set, especially given its gaming-centric remit. Just for starters, there’s FreeSync 2 HDR support, DisplayHDR 400 certification and a 144Hz refresh rate.",
    "On the other hand, the native resolution is relatively modest given the huge panel size. At 3,840 by 1,080 pixels, it’s significantly down compared to the Philips Brilliance 499P9H, another super-wide 49-inch monitor. But, then the Asus is aimed at a different demographic, namely gamers, for whom refresh rate is arguably more important than pixel count.",
    "At $899 in the US, the Asus ROG Strix XG49VQ is quite competitively priced for this class of gaming monitor. It looks a little less appealing for £999 in the UK and AU$2,025 down under.",
    "Moreover, if productivity is a major concern, the Philips Brilliance 499P9H is both superior for that remit and cheaper.",
    "For the most part, the ROG Strix XG49VQ adheres to Asus’s standard design vibe for its premium gaming monitors. This is to say it’s stylish and feels like a quality item throughout. The one obvious omission is Asus’s Aura ambient lighting, which doesn’t feature here.",
    "Still, you do get a slim bezel design and a sturdy stand with height, swivel and tilt adjustment support. Unsurprisingly, given the extreme panel proportions, there’s no facility for rotating into portrait mode. Speaking of that panel, aside from the aforementioned 3,840 by 1,080 resolution, FreeSync 2 HDR support, DisplayHDR 400 certification and 144Hz refresh rate, it’s rated at 450cd/m2 for brightness, 3,000:1 for static contrast ratio and offers an 1800R curvature.",
    "For the record, it’s also rated at 4ms for gray-to-gray response. That and the strong static contrast are both telltales of the panel tech used here, vertical alignment (VA), which usually bodes well for colors and all-around visual pop, but less so for response times and to a lesser extent viewing angles.",
    "Elsewhere, connectivity is generally strong, with a pair of HDMI 2.0 ports and a DisplayPort 1.2 socket. The panel’s native resolution works out at precisely half the number of pixels of a conventional 4K monitor, so supporting 144Hz refresh over those display interfaces is a non issue. That said, the absence of USB-C is a pity if for nothing else other than the consolidation of cables it enables, if less so in terms of connecting a laptop to this panel. As a gaming-centric model, it’s more likely to be hooked up to a powerful desktop rig.",
    "Further highlights include a picture-by-picture mode that splits the screen into up to three horizontal panels, each of which can be driven by a different source. So, you could have a games console in one, a Twitch stream in another and maybe a laptop running an email client in the third.",
    "Added to that are a number of gaming-friendly extras, including a persistent crosshair, an FPS counter, a timer and more.",
    "Given this is a gaming panel, let’s get the good news out of the way and confirm that the Asus ROG Strix XG49VQ is a truly staggering device to play games on . That isn’t to say it’s perfect, but the sheer visual spectacle is essentially unparalleled bar by other 49-inch monitors.",
    "For gaming, the relatively modest 3,840 by 1,080 native resolution is a good compromise. It allows for decent detail while not generating ridiculous levels of GPU load. That means, on the one hand, you can drive this panel with an upper-middle graphics card, like an Nvidia GeForce RTX 2060 or GTX 1070, and get decent frame rates. Or on the other, you can hook up something beefier, like an RTX 2080, and really make the most of that 144Hz refresh.",
    "Response wise, think decent rather than absolutely stellar, but the colors zing and the combination of the pure panel size and the wrap-around curvature make for a seriously immersive experience. If there is a catch, in a gaming context, it’s that the super-wide aspect ratio can be a little problematic from a field-of-view perspective.",
    "Most modern games have no problem filling the whole screen and arranging menus and tools in a sensible fashion. But, equally as many opt to stretch the image rather than offer an expanded field of view that really makes the most of the crazy wide aspect ratio. Some have in-game options for widening that view and yet more can be tweaked via configuration files. However, competitive online games tend not to offer this, since a wider field of view would make for an unfair advantage.",
    "If the gaming experience is mostly good-going-on-great, then the broader picture is less clear – we mean that literally. For starters, the native resolution is relatively low given the massive size, so the pixel density is modest. Making matters worse, Asus has implemented some image processing that further coarsens the image quality.",
    "The net result, not to put too fine a point on it, is that the image quality on the desktop is crap. Fonts look fairly rough and jagged, and there’s a general lack of clarity and sharpness. What’s more, with just 1,080 vertical pixels, the whole experience actually feels a little cramped and constrained.",
    "Indeed, despite the huge physical width, the relatively low resolution means that, if you attempt to run three browser windows in parallel, you probably won’t be able to view each page in its full-width format. Not exactly the end of the world, but from a productivity perspective, the likes of the Philips Brilliance 499P9H and its 5,120 by 1,440 resolution is preferable and by a very large margin indeed. It’s also worth noting that the Asus’s 32:9 aspect ratio isn’t great for watching video. Much of the screen goes unused.",
    "Ultimately, this is a monitor with a niche appeal. In productivity terms, we’d say steer well clear. The image quality is subpar and the pixel density poor. You’d be far better off in this part of the market with the likes of the Philips Brilliance 499P9H.",
    "However, the Asus ROG Strix XG49VQ’s chosen remit is gaming, and here it delivers much more convincingly. It’s both truly a spectacular experience and also a relatively accessible one, thanks to a native resolution that won’t bring a decent graphics card to its knees.",
    "At the same time, it’s arguably a pretty decent value at just under $900 in the US. It’s not cheap, but then again it’s a lot of screen. At £1,000 in the UK, the value proposition is a little more marginal, even for dedicated gamers.",
    "Images Credit: TechRadar"
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design and features",
    "11": "Performance",
    "18": "Final verdict"
  },
  "links": {
    "monitor": "https://www.techradar.com/news/computing-components/peripherals/best-monitor-9-reviewed-and-rated-1058662",
    "gaming monitor": "https://www.techradar.com/news/best-gaming-monitor",
    "Nvidia GeForce RTX 2060": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060",
    "GTX 1070": "https://www.techradar.com/reviews/pc-mac/pc-components/graphics-cards/msi-geforce-gtx-1070-gaming-x-1323106/review",
    "RTX 2080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080",
    "Philips Brilliance 499P9H": "https://www.techradar.com/reviews/philips-brilliance-499p9h"
  }
}