{
  "source": "https://www.techradar.com/reviews/fujifilm-x-a7",
  "title": "Fujifilm X-A7 review",
  "category": "cameras",
  "updated": "2019-11-21T22:44:10Z",
  "author": "sharmishta-sarkar",
  "summary": "Compact, light and almost perfect",
  "verdict": "The X-A7 has some pretty impressive specs for an entry-level camera, and has the performance to match, with a significant improvement to the camera’s autofocus performance over its predecessor. Image quality is exceptional and 4K video capabilities have also been upgraded, making this compact, lightweight snapper an ideal traveling companion.",
  "pros": [
    "Superb autofocus performance",
    "Excellent image quality",
    "Large, high-res LCD display",
    "Sleek and stylish design"
  ],
  "cons": [
    "Clunky touch interface",
    "No built-in stabilization",
    "No viewfinder"
  ],
  "article": [
    "There is something strangely appealing about the X-A7: it somehow manages to exude old-school charm while offering pretty much everything a modern phone photographer needs to wean away from the smartphone. It neatly picks up where the X-A5 left off, getting some physical tweaks to the camera body along with performance upgrades.",
    "Long story cut short: it’s a small, lightweight, entry-level mirrorless camera that performs marvelously well in the real world, although handling the little snapper can take some getting used to.",
    "To please its target audience, Fujifilm has overhauled the rear LCD display, which not only offers a more detailed view of the frame, but is now a vari-angle screen that’s great for shooting from different angles.",
    "As before, there's a plethora of creative modes to choose from that give the user many ways to express themselves, while also offering 4K video recording at 30fps (as opposed to the rather disappointing 15fps in the X-A5). And with better autofocus performance than its predecessor, there’s a lot to commend the X-A7 for, provided you don’t need to hold it in your hand all day long.",
    "From the front, the X-A7 looks identical to its predecessor, using the same X-mount on which you can attach either the bundled Fujinon XC 15-45mm f/3.5-5.6 OIS PZ kit lens (that same one that came with the X-A5) or use any of the better X-mount optics. Fujifilm didn’t send us the kit lens to test the new camera, so we used the XF 18-55mm f/2.8-4, which seems to have been a far better option than the bundled glass. Our colleagues over at Digital Camera World were able to test the full kit and found the XC lens to be disappointing.",
    "It’s the back of the camera, though, that will provide smartphone photographers a sense of comfort when they transition over. The rear display is now a 3.5-inch touchscreen with a 2,760k-dot resolution that’s fully articulating. It’s also wider with an aspect ratio of 16:9, meaning you get a bigger and sharper view of the world when compared to the X-A5’s 3-inch display that had a resolution of just 1,040K dots and an aspect ratio of 3:2.",
    "However, it’s the brand-new sensor under the hood of the X-A7 that makes the new camera worth the upgrade. It might share the same 24.5MP pixel count from earlier but the new Bayer-filter sensor, Fujifilm promises, has copper wiring that significantly reduces noise levels and offers faster readouts too.",
    "The sensor also has way more phase-detection autofocus pixels than before, giving users a very respectable 117 selectable AF points to choose from (compared to the 91 AF points on the X-A5), with an extended ISO range of 100-51000, both of which are excellent for an entry-level camera. Weirdly, though, the sensor defaults to a 16:9 aspect ratio, perhaps to match the rear display and emphasize the camera’s video capabilities, but the usual 3:2, 1:1 and 4:3 aspects are also available.",
    "Turning to video: 4K recording is, of course, the norm now, but thankfully it’s available at 30fps on the X-A7, as opposed to the rather disappointing 15fps on the X-A5. A microphone socket is available but, like the X-A5, it’s the non-standard 2.5mm type that will require an adaptor, but thankfully it ships with one.",
    "All the usual creative modes from the X-A5 have made their way to the successor model, along with the addition of a new Bright Mode (to capture HDR images with a single shot) found within the Advanced Scene Recognition Auto function and a Light Trails option available in the Scene Position mode.",
    "To make quick work of transferring files to a handheld device so images can be uploaded to social media, both Wi-Fi and Bluetooth are on board, with the latter now updated to the 4.2 standard. If wireless transfer isn’t your thing, there’s now a USB-C port that also doubles as the charging port for the camera. While that’s good news, battery life has taken a hit.",
    "The X-A7 has a CIPA rating of just 270 shots compared to the 450 for the X-A5. However, there is an ‘economy’ option available under Power Management > Performance within the camera setup option in the menu system (spanner icon) which can push the battery life to 440 shots. However, other than a very marginal reduction in screen brightness, we weren’t able to discern exactly what other functionality is disabled to increase battery life."
  ],
  "headers": {
    "4": "Key features"
  },
  "links": {
    "X-A5": "https://www.techradar.com/reviews/fujifilm-x-a5",
    "test the full kit": "https://www.digitalcameraworld.com/reviews/fujifilm-x-a7-review"
  }
}