{
  "source": "https://www.techradar.com/reviews/eurocom-tornado-f7w-mobile-workstation-laptop",
  "title": "Eurocom Tornado F7W mobile workstation laptop review",
  "category": "computing",
  "updated": "2019-07-04T05:26:03Z",
  "author": "desire-athow",
  "summary": "The foundation of the world’s most powerful notebook",
  "verdict": "The Eurocom Tornado F7W is a niche product in a niche market. It is far more expensive than expected but if you are happy with the compromises that it comes with and know what to expect, then by all means, this has to be on top of your list.",
  "pros": [
    "You won’t get a more powerful mobile workstation",
    "Unique hardware combination",
    "Expandable/Upgradable/Flexible"
  ],
  "cons": [
    "Very, very loud",
    "Expensive",
    "No onsite warranty",
    "Battery life is abysmal under load",
    "Older Wi-Fi component"
  ],
  "article": [
    "In an era where most laptops seem to come from the same mold, there’s a handful of manufacturers that provide with the base chassis to build some of the more versatile and outlandish laptops on the market. Clevo is one of them and counts Sager, Origin, XMG/Schenker and PC Specialist as some of its system integrators.",
    "Clevo and its resellers are minnows in an ecosystem where the giants bear the name of Lenovo, HP and Dell with smaller players like Dynabook (ex Toshiba), Acer, Microsoft, Huawei, Asus, MSI and Fujitsu are fighting for scraps. Being small has its advantages; it allows you to carve your own niche with your own set of USP.",
    "Eurocom, for example, specializes in highly bespoke, performance portable laptops. Think of them as extreme car tuners.",
    "They sent over the Tornado F7W mobile workstation laptop, the only 8-core laptop on the market that can accommodate 128GB of RAM. As expected, Eurocom’s behemoth carries a jaw-dropping price tag of more than $9300 at the time of writing although the starting price is about $3500.",
    "Despite similarities between Eurocom laptops and Clevo, the company's CEO told us that this is an \"Eurocom-made system\".",
    "Who is this laptop for? Mark, the CEO, argues that the Tornado F7 series \"is not designed for average user but for professionals and IT organizations that require 'superlaptop' capabilities to run their 'on the go‎' operations such as Engineering on The Go or Server on the Go.\" This, he added, is more technology investment so equipment capabilities are critical. \"Tornado F7 allows companies to be more productive and efficient, create new revenue streams by introducing new professional services on the go\".",
    "Have you ever handled a ream of A3 paper? This Tornado F7W is about as big, thick and heavy. Correction, at 428 x 314 and up to 51mm thick, it is actually bigger. It weighs 4.2Kg, to which you need to add an extra 1.9Kg for the 330W power supply unit from Liteon (which itself is about the size of a brick).",
    "The case is solid with no apparent flex; Eurocom/Clevo has not skimp on materials here. This chassis is built to last and take a few knocks in the process all thanks to a mixture of aluminum alloy and resins. A single central hinge ensures that the display is solidly attached to the base unit and there’s plenty of openings/holes in it to ensure maximum airflow.",
    "There’s plenty of connectivity options: the rear has a Gigabit Ethernet port, a mini DisplayPort, Thunderbolt 3, HDMI and a power port. Left side - looking at the display - houses a smart card reader, an SD card reader and two full size USB ports. The right side hosts another three USB ports and four audio connectors.",
    "One might even argue that the keyboard area aside, this chassis has more holes than material. Holes through which you can easily see the oversized copper-colored fins of the heat sinks. If you want to have a closer look, all it takes is to make good use of a standard screwdriver to access the easy-to-upgrade components.",
    "As expected the keyboard is fully backlit and you get a dedicated numeric keypad with some additional keys on the right including a GPU toggling and a turbofan one plus two custom keyboard shortcuts. The keys are smaller than what we’d expect and they have a mushy feel to them that some might dislike. The travel is generous given the size of this monster and so is the distance between the keys.",
    "The trackpad has an integrated fingerprint reader plus physical left and right mouse keys.",
    "The jewel in the crown, so to speak, is the Intel Core i9-9900K, a 95W desktop CPU with 8-core, 16-thread, 16MB cache and a staggering 5GHz max turbo frequency. This is not the fastest CPU Intel has to offer - the X-series packs more punch - but it is the speediest CPU one could fit in a laptop. Eurocom is the only vendor that managed to do this and choose a chassis that is widely used for gaming laptops (like this Sager).",
    "Other mainstream laptop manufacturers play it safe, usually opting for processors that have a lower TDP. That can only be achieved using fewer cores (usually 6-core), less cache (12MB or less), or a lower base frequency (3GHz or less) . At the time of writing, the 9900K is one of three Intel CPUs that offer at least eight cores at less than 100W TDP, with 16MB cache and a base frequency higher than 3.5GHz.",
    "Opting for a non-Xeon CPU means that this laptop doesn’t support ECC (Error Correction Code) RAM and while Intel says it only support dual memory channel, you can actually pair the 9900K with four 32GB memory modules (as Eurocom did). They used Samsung DDR4-2666 SODIMM parts. (Note that Xeon CPUs are an option and will support ECC)",
    "Nvidia provided the GPU and is by far the most expensive part of the workstation. The Quadro P5200 with its 16GB of GDDR5 memory is a monster by itself. More affordable options are available: the Quadro P4200 and P3200 as well as the GTX 1070 and 1060. These GPUs are modular featuring the MXM 3.1 spec which makes it easier to swap.",
    "Samsung was also chosen for the SSD; a trio of Samsung 970 Pro 512GB drives. Using V-NAND 2-bit MLC, the MZ-V7P512BW has sequential read speeds of up to 3.5GBps with sequential write speeds of 2.3GBps. You can also add two 2.5-inch SATA drives as secondary storage sub-system and given that Eurocom sells 8TB Micron SSD, you could potentially be looking at a data farm with a staggering 21TB (2 x 8TB and 3 x 2TB).",
    "The Wireless LAN component bundled is the Intel Wireless-AC 8265, which is puzzling given that it is perhaps the only non-cutting edge part of the F7W, dating from 2016. Other noteworthy parts include a 2-megapixel front facing camera, a 17.3-inch full HD matte display with a 120Hz refresh rate and a 98Whr 8-cell battery.",
    "Eurocom provides with a bewildering array of options down to the sort of thermal paste you want on your CPU and GPU (Grizzly Kryonaut for us please!) or the BIOS (unlocked). Great for tweakers and those who know what they want but not so much for those who don’t.",
    "There’s also the fact that Eurocom openly markets its mobile workstations as being upgrade-friendly. Their modular design means that parts can be easily swapped and upgraded without requiring proprietary tools. That includes the CPU and the GPU (Nvidia Quadro MXM parts).",
    "The Eurocom is the fastest mobile workstation we reviewed in a while: our benchmarks do not pay heed to this. The mind-boggling amount of system memory (128GB in all) means that you could try new, esoteric things like a RAM Disk which are even faster than SSD.",
    "The Eurocom is the fastest mobile workstation we reviewed in a while: our benchmarks do not pay heed to this. The mind-boggling amount of system memory (128GB in all) means that you could try new, esoteric things like a RAM Disk which are even faster than SSD.",
    "It’s not all good though; the 9900K doesn’t run as fast as we’d expect it to. On average, we saw drops of about 10% compared to the “desktop” version that we reviewed. That is still fast enough for most purposes and having eight cores running at 90% is still better than six cores running at 100%.",
    "Power management (e.g. throttling), firmware differences, different platforms might explain some or all of the above. Under load, the two fans and 10 copper pies show their full potential; we recorded a rather high 75dB with our sound meter placed just next to the left fan outlet.",
    "The RAID-0 performance - with three NVMe SSDs - is adequate at more than 3GBps on read and write speeds in CrystalDiskMark.",
    "It did last almost three hours on our standard YouTube video playback but only 102 minutes when running under load (basically running Sandra Software benchmark till it shut down); that was expected though given the nature of the beast.",
    "The 17.3-inch FHD display has a 120Hz refresh rate which is great for gamers and is another hint of the laptop’s gaming roots. Good viewing angles coupled with decent brightness and more than adequate contrast make of this panel a better-than-average all-rounder. Additional marks for the fact that it is matte and not glossy.",
    "The three big competitors have workstations that can compete with the Tornado F7W with a cheaper price tag but with a lower core count. Note all prices are correct at the time of writing and exclude delivery.",
    "HP sells the Zbook 17 G5 with an Intel Core i9-8950HK CPU and a similar hardware configuration without RAID-0 (three 512GB SSD) but with a spill-resistant keyboard, a slightly smaller 95.6Whr battery, three-year next business day onsite hardware response warranty and a host of options for $7024.",
    "The Lenovo Thinkstation P72 uses a Xeon CPU (E-2186M), two 1TB SSDs configured in RAID-0 and a bigger 99Whr battery. As for its HP rival, there’s a three-year next business day onsite Premier warranty plus accidental damage protection, all for a grand total of just under $6800. You don’t have the level of granularity compared to the Tornado F7W (e.g. you can’t disable the webcam).",
    "Last but not least, the Dell Precision 7730 uses the same non-Xeon CPU as the ZBook 17 G5 with two 1TB SSD in RAID-0, a 97Whr battery and 3-years ProSupport Plus with next business day onsite service. You have more control on what you can get - compared to the Lenovo - and the 7730 is the cheapest of the three at $6742 at the time of writing with code SAVE35.",
    "This is a no-compromise workstation if there was ever one. In reality though, even if money is not an issue, the perfect workstation still eludes us. The cost of being flexible and customizable is a bigger and noisier laptop altogether. Put it simply, if you want the most powerful laptop on the market, you have to endure and live with its shortcomings. The laws of physics, sadly, are immuable.",
    "That means a short battery life when under load and the sort of fan noise many will find incommodating.",
    "Then there’s the not so small issue of aftersales. Eurocom is not a multi-billion tech company and doesn’t therefore have the sort of global coverage you’d expect from the big three. They don’t for - a start - offer next business day, onsite warranty.",
    "Then, there’s the fact that you need to pay for the shipping on your defective laptop. Eurocom is responsible for return shipping to customers via ground service within Canada and the Continental United States.For shipping outside of Canada or Continental United States additional fees may apply. Last but not least, the battery only comes with six months warranty and some accessories/peripherals like the keyboard or the CPU fan, carry only one year warranty with no option for extending these.",
    "What it means it is that you could go days if not weeks without your main system unless you pay for a premium courier service; if keeping downtime as small as possible is vital but you still care about value-for-money, then Eurocom may not be your best choice."
  ],
  "headers": {
    "6": "Design",
    "12": "Hardware",
    "20": "Performance",
    "27": "The competition",
    "31": "Final verdict"
  },
  "links": {
    "Sager": "https://www.sagernotebook.com/Notebook-NP9176-G3.html",
    "reviewed": "https://www.techradar.com/reviews/intel-core-i9-9900k-review",
    "Zbook 17 G5": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-1117998996556310300&p=https%3A%2F%2Fstore.hp.com%2Fus%2Fen%2FConfigureView%3FcatalogId%3D10051%26langId%3D-1%26storeId%3D10151%26urlLangId%3D%26catEntryId%3D3074457345618920319%26quantity%3D1",
    "Lenovo Thinkstation P72": "https://lenovo.7eer.net/c/221109/218864/3808?subId1=trd-us-1099062853118868000&sharedId=trd-us&u=https%3A%2F%2Fwww.lenovo.com%2Fus%2Fen%2Flaptops%2Fthinkpad%2Fthinkpad-p%2FThinkPad-P72%2Fp%2F20MBCTO1WWENUS1%2Fcustomize%3F",
    "Dell Precision 7730": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2719155314038889500/https://www.dell.com/en-us/work/shop/cty/pdp/spd/precision-17-7730-laptop/xctop7730hwus4?selectionState=eyJJVVByaWNlIjoxMDM3Mi44NiwiT0MiOiJ4Y3RvcDc3MzBod3VzNCIsIlF0eSI6MSwiTW9kcyI6W3siSWQiOjMsIk9wdHMiOlt7IklkIjoiR1oxU0lDViJ9XX0seyJJZCI6NiwiT3B0cyI6W3siSWQiOiJHSExaRjlKIn1dfSx7IklkIjoxMSwiT3B0cyI6W3siSWQiOiJHV0k5ODZZIn1dfSx7IklkIjoxNDYsIk9wdHMiOlt7IklkIjoiR0NCV1pVMiJ9XX0seyJJZCI6MTQ5LCJPcHRzIjpbeyJJZCI6IkdNQUxHNlcifV19LHsiSWQiOjYzNywiT3B0cyI6W3siSWQiOiJHVEdPSjU4In1dfSx7IklkIjo3MDUsIk9wdHMiOlt7IklkIjoiRzZCVENFWiJ9XX0seyJJZCI6NzQ5LCJPcHRzIjpbeyJJZCI6Ikc4QlhXWUkifV19LHsiSWQiOjc2MCwiT3B0cyI6W3siSWQiOiJHUVBaTEY2In1dfSx7IklkIjoxMDA5LCJPcHRzIjpbeyJJZCI6IkdHVk0zVDUifV19XX0%3D&cartItemId=b0a3979a-f88a-4539-b46b-0dff754aa5ba&ref=cartconfigedit"
  }
}