{
  "source": "https://www.techradar.com/reviews/realme-x2-pro",
  "title": "Realme X2 Pro review",
  "category": "phones",
  "updated": "2019-11-13T10:58:59.892Z",
  "author": "sean-cameron",
  "summary": "Is this Realme really worth it?",
  "verdict": "With a versatile camera setup, flagship specifications and a high refresh rate screen, the Realme X2 Pro is a power user’s dream. However, cartoonish software and image quality issues hold it back from greatness.",
  "pros": [
    "OLED screen with 90Hz refresh",
    "Powerful speakers",
    "Reliable battery"
  ],
  "cons": [
    "Cartoonish software",
    "Image quality isn’t the best",
    "In-built gestures aren’t intuitive"
  ],
  "article": [
    "When Apple first approached the $1,000/£1,000 price mark with the iPhone X, it immediately fragmented the smartphone market. Shockwaves spread, and new segments appeared, the most hotly contested of which became known as the ‘premium mid-range’.",
    "That is to say, those handsets which set you back between 400-600 dollars/pounds, which offer a blend of premium features and price-friendly sacrifices. The X2 Pro is the Chinese brand Realme’s latest effort to gain further market share in the west, keenly designed and priced to be among the most ‘premium’ of the mid-range options available.",
    "It has a 1080p+ AMOLED 90Hz display, five cameras, surround sound speakers, a metal and glass design, a large battery and more - almost every specification a die-hard phone nerd could wish for, in other words, and all for a starting price of €399 (around $445 / £345 / AU$650). What’s not to love?",
    "A phone is more than a list of specifications however, and we have cast our exacting eye over this promising handset with a view to letting you know what it is like in everyday use. And with capable competition equally ravenous for some of that ever-elusive market share, the Realme X2 Pro has its work cut out in standing out from the ever bigger crowd. So does it have what it takes to succeed?",
    "The Realme X2 Pro is available in ‘Lunar White’ (reviewed) and ‘Neptune Blue’ colors with the choice of 6GB of RAM / 64GB of storage, 8GB/128GB and 12GB/256GB.",
    "Only European pricing is available at the moment, although the phone is available in the UK if you buy it through the official Realme website. The base model starts at €399 which makes for around £340 at the time of writing (around $445 / AU$650).",
    "The Realme X2 Pro is a device that is dressed to impress, with a serious assortment of specifications.",
    "Front and center among these is the display, which comes rammed with acronyms - HDR, 1080p+, 90Hz, AMOLED, they’re all here. Every hallmark of a handset normally costing well over $700/£700 is present and correct, though how it measures up in usage is another matter altogether.",
    "There is also the tangle of cameras to come to terms with. The main rear lens has 64MP to call its own, though in a Quad-Bayer arrangement meaning that the end results are 16MP, not full resolution.",
    "It is backed up by a 13MP f/2.5 3x telephoto lens, an 8MP wide-angle lens which supports very close focusing, and a 2MP sensor for depth sensing in portrait mode - a full bag of lenses in the hand of the user.",
    "The battery is large at 4,000mAh, and sports an advanced version of the VOOC charging pioneered by Oppo, offering 50W of power through the supplied power brick and cable. What this means in theory is a full charge in just 30 minutes, in optimal conditions, which is certainly faster than the 5W charger offered as standard with the iPhone 11.",
    "We also have the stereo surround sound speakers which support Dolby Atmos, the potential of 256GB of storage paired with 12GB of memory, a Qualcomm Snapdragon 855 Plus chipset, and a whole lot more.",
    "With each new device released by different manufacturers across the globe, it is becoming increasingly difficult to tell mobile phones apart. Some have notches, some don’t, almost all are metal and glass sandwiches.",
    "That's largely true here too, but our ‘white’ model which arrived for review is something a little different, and is quite attractive.",
    "It is called ‘Lunar White’, meaning it has a pearlescent effect which changes color just slightly in the light. It isn’t excessive like some of the ‘twilight’ models marketed by other manufacturers, and has a certain executive-chic about it.",
    "Along with the dark version, this is a model which will be just as happy in the boardroom as in the pocket and, superfluous as it may seem, feels like hardware designed for an adult (the software is a slightly different story, though more on this later).",
    "The metal sides and the glass on the front and back certainly feel solid enough, with little to no flex or give when pressure is applied. Balance too is quite good, if slightly weighted towards the top - with the overall slipperiness of the handset this means that one-handed usage without a case isn’t a good idea.",
    "Something slightly odd is the space where the glass meets the metal, where the edges are a little sharp, showing that there isn’t quite as much attention to detail as there may appear to be on the surface.",
    "And with a weight of 199g, should this fly towards the floor from a wayward hand, it will leave a dent. The weight is distributed well, but this device is something of a porker when compared to others on the market, even at a similar price point.",
    "The screen is 6.5 inches on the diagonal, and as this might suggest, in addition to the slipperiness, one-handed usage is best attempted by those without hobbit hands. The top of the screen houses a small teardrop notch that is easy to disregard, and a USB-C port is welcome and present on the bottom.",
    "Those looking to expand the storage will be out of luck, as the X2 Pro lacks a microSD card slot. At the higher storage configurations this will likely not matter, but for those with the 64GB version it is certainly an important consideration.",
    "In sum, though there isn’t much to distinguish the X2 Pro from the competition, neither is there any cause for concern. Certainly the included case should be slapped on immediately, however this is a necessity for any modern glass sandwich. For a first stab at ‘premium’, in the mid-range, this is a solid effort, and Realme should be commended for its work.",
    "It has been mentioned that the display of the Realme X2 Pro holds a great deal of promise, arriving with an array of acronyms to delight even the most hardened of screen obsessives.",
    "It is good then that the panel mostly lives up to the promise of said acronyms. To begin, the 90Hz refresh rate is certainly a pleasant addition, even if it is mostly noticeable when scrolling through text. Though it isn’t worth abandoning an ‘ancient’ 60Hz screen over, the improvement in fluidity is perceivable - if you are a regular user of Kindle on your device it will be a pleasant surprise.",
    "However, we did find that the color calibration of the screen was a little bit of an issue. That is to say, the screen has two presets, ‘Gentle’ and ‘Vivid’. Gentle may be sold by the UI as ‘pensioner mode’, however the ‘vivid’ mode tends to blow the socks off most images.",
    "The colors of this setting veer towards the Teletubbies, and should be avoided by those looking for accuracy in their images. This isn’t to say that the representation of colors is bad, but that this screen serves the unfortunate reputation for some AMOLED panels to have a cartoonish, unrealistic representation of scenes.",
    "The screen certainly gets bright enough, the marketing promises 1000 nits, and although we didn’t have the equipment to measure this, it certainly remains legible in bright, sharp autumnal sunlight.",
    "Another slight annoyance is the presence of a factory-applied screen protector. This is likely due to the presence of the under-screen fingerprint scanner, as user-applied screen protectors have an unfortunate tendency to render these useless. The protector obviously provides protection, however it is unpleasantly plastic and can make the feel of the device a little cheaper than the price tag might suggest it should be.",
    "If a screen is more than the sum of its specifications, and must be described as an experience, that of using the panel on the Realme X2 Pro is nothing short of a pleasure. It may not quite match up with the best in the industry (such as the Samsung Galaxy Note 10 Plus), but it certainly competes well with the competition at the price point, and that is more than enough."
  ],
  "headers": {
    "4": "Price and availability",
    "6": "Key features",
    "12": "Design",
    "22": "Screen"
  },
  "links": {
    "iPhone X": "https://www.techradar.com/reviews/iphone-x-review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "Teletubbies": "https://en.wikipedia.org/wiki/Teletubbies",
    "Samsung Galaxy Note 10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-note-10-plus-review-and-specs"
  }
}