{
  "source": "https://www.techradar.com/reviews/blackview-bv5900-rugged-smartphone",
  "title": "Blackview BV5900 rugged smartphone review",
  "category": "phones",
  "updated": "2019-09-24T22:38:04Z",
  "author": "desire-athow",
  "summary": "An affordable rugged smartphone but is it good enough?",
  "verdict": "The Blackview BV5900 is not a bad phone per se but it is a competitive market and there are rivals that are equally capable that cost almost half the price. So a very rare don’t buy from us.",
  "pros": [
    "Decently built",
    "Relatively big battery",
    "Audio port",
    "NFC"
  ],
  "cons": [
    "Average performance",
    "Horrendous value for money",
    "802.11n only"
  ],
  "article": [
    "Blackview is one of the more prominent rugged smartphone vendors online and has produced more than a dozen IP68-rated smartphones to date including a modular one, one with an infrared camera, one with a 13,000mAh battery, a good looking phablet and one that can be used as a walkie talkie (oh and there’s one with a projector).",
    "So we were reasonably enthused on hearing that Blackview had a budget smartphone they were keen to send over for a review. But what followed left us shocked.",
    "The BV5900 is a beast made of glass, metal and some bits of hard rubber - something usually seen on off-road vehicle tires - in line with what we’d expect to see from the Chinese company. Very much in line with the design playbook of Blackview.",
    "Its designers opted for a more rounded model, hiding “multiple rigid layers and silicone liner” (according to the marketing material), shunning the more traditional octogonal design with four smaller vertices. Also moving away from accepted consensus is the presence of a large, conspicuous teardrop shaped front facing camera on the top edge of the screen.",
    "There’s an audio connector and a Type-C one (both covered by flaps). A dedicated customizable button and a SIM tray can be found on the left with the power button, volume rocker and a fingerprint reader on the right.",
    "A lone speaker grill, two camera sensors and a LED flash are located at the rear of the BV5900. Overall, a very bland, conservative design from Blackview, proof perhaps that it wants to play it safe. It is also MIL-STD-810G, IP68 and IP69K certified.",
    "Blackview has some of the weakest hardware that we’ve seen over the past couple of years, matched only by the BV6100 that we reviewed recently. It uses the same processor as the latter (the Mediatek Helio A22) with 3GB of RAM and 32GB of onboard storage.",
    "The 5.7-inch display has a 1520 x 720 pixel resolution, covered with Corning Gorilla Glass 3 and it sports the same 5.58Ah battery has the BV6100. Same goes for two of the cameras (0.3-megapixel at the rear and 5 megapixel at the front).",
    "The additional 13-megapixel rear camera (a Sony IMX214) is one area where the BV5900 is superior to its bigger brother. The device comes with 802.11n and Bluetooth 4.2 connectivity and NFC. The phone supports facial recognition as well.",
    "Let’s cut to the chase: the BV5900 delivered some of the worst numbers we’ve ever seen on our benchmarks thanks to some shockingly weak hardware. It will definitely struggle with more recent games but anything else - Youtube and sending emails - should be OK.",
    "Write speeds on the device were one of the lowest we’ve recorded to date, something we don’t grasp given that the BV6100 scored far higher numbers using the same set of components.",
    "As expected the device comes with Android 9.0 with a slightly modified UI. All the usual Google Web Services apps are there as is a translator, a child and game mode app plus the usual BV family app (a catalog of Blackview products) and a tool bag containing an eclectic assortment of apps that are deemed useful to DIYers.",
    "Since this is a Mediatek-powered smartphone, you get a few extra features like DuraSpeed (which allows you to control apps running in the background and auto clean memory).",
    "Unfortunately for the BV5900, things take a turn for the worse when we look at the competition. The Cubot Quest Lite for example costs $110 (almost 42% cheaper) with a very similar set of features compared to the BV5900. It is also rather thin, partly because of the smaller battery (3,000mah)",
    "There’s three potential competitors between $180 and $190, all of which provide far better performance than the BV5900. The Cubot Quest, the Elephone Soldier (with its unique features), the BV6800 Pro and the Oukitel WP1. They all come with at least 4GB of RAM, better cameras, 64GB onboard storage and bigger batteries as well.",
    "Then there’s the Cubot King Kong 3, an affordable model with twice the memory and storage, a big battery, NFC and a $150 price tag that makes you wonder why Blackview priced itself out of the market so abruptly.",
    "We find it difficult to recommend the Blackview BV5900 for two reasons: It is not competitive with existing smartphones including Blackview’s very own BV6800 Pro and its components are likely to struggle under load as clearly indicated by our benchmark results.",
    "Save yourself from commiseration and choose something else, there’s plenty of other superior ruggedised smartphones out there. Blackview will have to drop the price of the BV5900 by at least 40% for us to even consider it as a worthy candidate."
  ],
  "headers": {
    "2": "Design",
    "6": "Hardware",
    "9": "Performance and in use",
    "13": "Competition",
    "16": "Final verdict"
  },
  "links": {
    "a modular one": "https://www.techradar.com/reviews/blackview-bv9700-pro-rugged-smartphone",
    "13,000mAh battery": "https://www.techradar.com/reviews/blackview-bv9100-rugged-smartphone",
    "phablet": "https://www.techradar.com/reviews/blackview-bv6100-ruggedised-smartphone",
    "as a walkie talkie": "https://www.techradar.com/reviews/blackview-bv9500-pro",
    "one with a projector": "https://www.techradar.com/reviews/blackview-max-1-projector-smartphone",
    "BV6100": "https://www.techradar.com/reviews/blackview-bv6100-ruggedised-smartphone",
    "Cubot Quest Lite": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-7653006502288165000&p=https%3A%2F%2Fwww.gearbest.com%2Fcell-phones%2Fpp_009559696851.html%3Fwid%3D1349303",
    "Cubot Quest": "https://www.techradar.com/reviews/cubot-quest-rugged-smartphone",
    "Elephone Soldier": "https://www.techradar.com/reviews/elephone-soldier-ruggedised-smartphone",
    "BV6800 Pro": "https://www.techradar.com/reviews/blackview-bv6800-pro",
    "Oukitel WP1": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-3893936710689070000&p=https%3A%2F%2Fwww.gearbest.com%2Fcell-phones%2Fpp_009319388085.html%3Fwid%3D1349303",
    "Cubot King Kong 3": "https://www.techradar.com/reviews/cubot-king-kong-3-rugged-smartphone"
  }
}