{
  "source": "https://www.techradar.com/reviews/asus-rog-mothership",
  "title": "Asus ROG Mothership review",
  "category": "computing",
  "updated": "2019-09-23T14:17:35Z",
  "author": "nick-rego",
  "summary": "Mother of all PCs?",
  "verdict": "The ROG Mothership is certainly going to turn heads wherever it’s set up, and is capable of some incredible performance beyond its wild looks. The only setbacks are its price tag and a few design choices, which makes it difficult to immediately recommend.",
  "pros": [
    "Insane performance",
    "Interesting form factor"
  ],
  "cons": [
    "Staggering price tag",
    "Keyboard is disappointing"
  ],
  "article": [
    "Asus has been long known to make some interesting looking laptops and PCs. Their ROG lineup regularly features impressive specifications, RGB lights aplenty, and price tags that you’ll have to do a double-take over.",
    "The Asus ROG Mothership follows in these footsteps, and might be the company’s most ambitious device ever. Part laptop, part desktop, it’s a hybrid machine that features some insane specifications, and an equally eye-watering price tag to go along with it. While the Asus ROG Mothership clearly has its sights set on gamers, it’s actually built like an entry-level workstation, so those looking for sheer power for intense applications like 3D rendering or AutoCAD may actually benefit from owning one of these.",
    "The Asus Mothership is available now, but stocks will vary slightly based on where you are. For example in the Middle East, Asus has said that the few units that were up for pre-order have already been sold, surprisingly snatched up by architects rather than gamers.",
    "Regardless of where you buy one, the Mothership is not a cheap purchase. Our review configuration is priced at a whopping $6,806 (£5,457, AUD$10,054, AED 24,999) - that’s more expensive than an iMac Pro, which currently sits at $5,000 (£4,009, AUD$7,386, AED 20,999).",
    "This is a machine that pretty much sticks with you once you’ve bought it – upgrading a few internal components is possible (more on that later), but whatever configuration you get should hopefully be good enough to see you for at least the next four to five years.",
    "It’s entertaining to try and refer to the Mothership as a laptop, because the only time it looks like a normal laptop is when it’s closed and lying flat on a table. Prop it up, and an automatic kickstand deploys at the back to provide some strong support. You can then lower the bottom lip to reveal the keyboard and trackpad, similar to how you’d set up a Microsoft Surface.",
    "No matter which angle you look at it from, the Mothership is an intimidating piece of tech to have on your desk.",
    "The metal chassis and flashing LED lights certainly tout its gamer-inspired styling, but turn off all of the fancy lights and you’ll still be left with a rather impressive-looking desktop replacement.",
    "Should you want a bit more flexibility when using the Asus ROG Mothership, you can quickly detach the keyboard and fold it in half, turning it into a wireless keyboard or even tethered via the included USB-C cable. Asus says that this was done to make the Mothership more adaptive to different use scenarios, as gamers may want to reposition the keyboard when gaming, but have it attached as normal when typing emails or browsing the web.",
    "There are ports aplenty on the Mothership, so connectivity is not going to be an issue. There’s a decent amount of USB Type-A ports, as well as Thunderbolt 3 / DisplayPort 1.4 and an HDMI 2.0 port for driving additional external displays.",
    "An unfortunate side effect of having this much power available is that you need two power bricks to drive the Mothership, which makes it a little less effective when (and if) you do decide to take it anywhere. The machine itself is heavy to carry around, so if you’re adding two power bricks to your backpack, you’re not going to be carrying this for very long.",
    "Asus claims that the upright nature of the ROG Mothership improves the machine’s cooling mechanisms, as it’s easier to funnel hot air straight up and out of the machine at the top and sides. Two internal fans and a myriad of cooling pipes across the CPU and GPU help to keep temperatures in check, but a fair word of warning that the top and sides of the Mothership can get really hot under heavy usage, as the system works to expel hot air.",
    "When Asus first revealed the ROG Mothership to us, we were told that both a Full HD and a 4k version would be available for sale. It’s worth noting that those who do eventually opt for the 4k panel will get a 60Hz, 25ms version, with 100% Adobe RGB compatibility. Our review version was equipped with a Full HD display, which is a bit of a shame as we would have liked to see at least a 2k resolution on such a powerful machine.",
    "Despite sporting just a Full HD display, you’ll still get enjoy 144Hz refresh rates and Nvidia G-sync technologies, so gaming on the Mothership is an absolute dream when it comes to response times. While the Full HD panel only provides sRGB support, it’s still quite decent for multimedia work such as video or photo editing.",
    "Viewing angles are also fairly decent, though we imagine that most of your time will be spent looking at the Mothership head-on, rather than trying to swivel it around to show something to someone nearby.",
    "Performance with external displays was very good, both across HDMI and Thunderbolt 3, so those looking to use 4k displays won’t be disappointed. The Mothership was able to comfortably drive two external displays without any performance issues, so you can play around with your setup to find something that meets your gaming or design needs.",
    "The keyboard is an interesting feature of the ROG Mothership. Detach the keyboard and you have to wait probably a second or two for the system to automatically detect the keyboard running in wireless mode. There’s a manual switch on the keyboard that turns the wireless mode off or on, but leaving it on doesn’t cause any issues, even when it’s attached.",
    "Typing is quite comfortable, as the keys have been slightly curved to cradle your fingers better. With 2.5mm of key travel, you don’t have to press as hard to register a keystroke, so long hours of gaming shouldn’t be a problem. The keyboard also supports per-key RGB lighting, so you can pick a visual style that matches your preferences, or just turn off the lighting altogether.",
    "A point to note is that when the keyboard is attached, there’s an alarming amount of flex to it at the part where the hinge is attached just above the keys. We’d be quite worried if something heavy fell on this keyboard as it most certainly would cause some damage to it.",
    "The other annoyance is the second hinge the connects the keyboard to the Asus ROG Mothership often takes a bit of fiddling to properly connect. It’s not as quick as connecting a keyboard cover to an iPad or even the Microsoft Surface, so you’re going to spend a good few seconds wriggling things about until the keyboard is seated properly.",
    "When detached from the Mothership, the typing experience does turn a bit sour, since the keyboard is so flat that it makes typing slightly uncomfortable for long periods. There’s unfortunately no way to elevate the keyboard, so we would stick to just using it while still attached to the Mothership.",
    "Asus has also built a trackpad to the side of the keyboard, which doubles as a numeric keypad. While this may be a thoughtful addition, in practice the trackpad is simply abysmal. It’s too cramped to navigate without difficulty, so you’d only end up using it in dire circumstances when you don’t have an external mouse attached."
  ],
  "headers": {
    "2": "Price and availability",
    "5": "Design",
    "12": "Display",
    "16": "Keyboard"
  },
  "links": {
    "iMac Pro": "https://www.techradar.com/reviews/imac-pro"
  }
}