{
  "source": "https://www.techradar.com/reviews/kensington-sd5300t-thunderbolt-3-dock",
  "title": "Kensington SD5300T Thunderbolt 3 Dock review",
  "category": "computing",
  "updated": "2019-12-02T17:38:14Z",
  "author": "desire-athow",
  "summary": "Meet the new flagship dock from the peripheral specialist",
  "verdict": "The Kensington SD5300T has come to the market at a time where competition in the Thunderbolt 3 docking station vertical is heating up tremendously. Sadly, this product lacks compelling features compared to its rivals and fails in other important aspects such as connectivity options and power delivery.",
  "pros": [
    "Good price",
    "Well designed",
    "Three year warranty",
    "Bundled adapter"
  ],
  "cons": [
    "Slower UHS-1 card reader",
    "Fewer connectors",
    "Can only deliver 60W",
    "No power-off button"
  ],
  "article": [
    "Docking stations have been hailed as the answer to the ever diminishing number of physical ports that popular mainstream laptops like the Apple MacBook or the Dell XPS 13 sports. This is especially true in the business context where the rise of remote working and BYOD has made it challenging for employers and employees to come up with solutions that simply work.",
    "Kensington recently unveiled a new Thunderbolt docking station, the SD5300T, which has a suggested retail price of $320 but can be picked up for as little as $240 from Amazon with free product support and 3-year warranty.",
    "Kensington embraced a combination of metal and glossy plastic for the SD5300T to give it a slightly exclusive look. There’s a couple of LED indicators at the front next to an SD card reader, two USB .3.1 Gen 1 ports, a 3.5mm audio/mic jack and no power-off button.",
    "On the side are a pair of Kensington security slots then at the back, from left to right, three USB 3.1 Gen 1 ports, a Gigabit Ethernet connector, a 15W Thunderbolt 3 port, a 60W version, an HDMI 2.0 port and a proprietary power supply unit socket.",
    "All in all, that’s 11 ports, fewer than say, the Caldigit TS3 Plus. And unlike the latter, the SD5300T is designed to be used flat, you can’t use it on its side.",
    "It is reasonably hefty at 448g and smaller than one would expect at 230 x 85 x 23mm, making it easily transportable. Two tiny holes at the back can be used to securely attach the device at the back of a monitor although you will need an optional backplate to make it happen.",
    "It is always a good idea to update your laptop with the latest firmware and drivers to make sure that it works properly with any Thunderbolt 3 device, sadly the industry is still not totally there when it comes to plug-and-play; it doesn’t support Linux as well. Kensington recommends using the TB3 cable that came with the dock, for example, and we’d recommend the same as we have encountered issues with sub-par cables in the past.",
    "We didn’t encounter any issues with the Kensington SD5300T during our short test. The device didn’t heat up too much thanks to its wide surface area and because the ports were placed one next to the other, we didn’t encounter issues with tight spaces.",
    "Note that the device can only deliver 60W through one of its TB ports which means that it will have a tough time charging bigger laptops like the Dell XPS 15 2-in-1 that we used during our test. By tough time, we mean that it will take far longer to charge the laptops.",
    "We were slightly disappointed to see that the dock uses a UHS-1 card reader which is the slower type and reaches just over 100MBps. As expected, it is powered by the older Alpine Ridge Thunderbolt 3 controller (JHL6340) rather than the newer model (Titan Ridge). Introduced in 2018, it adds support for DisplayPort 1.4 and better compatibility with USB-C devices via a USB-C fallback mode.",
    "Oh and you will be able to run a single 5K monitor or two 4K monitors in extended mode (either two HDMI or one HDMI and one DisplayPort). Note that Kensington provides a 3-year warranty as standard and a free application called DockWorks that makes your docking station smarter (by automatically switching off Wi-Fi for example if it detects a wired LAN connection).",
    "There’s an increasing number of Thunderbolt 3 docking stations on the market, a clear indication of the impact that Apple’s decision to embrace the connector wholeheartedly had on the higher end of the market.",
    "Kensington itself has a staggering six TB3 docking stations; the SD2400T, the SD5500T, the SD5350T, the SD5200T, the LD5400T and the SD5300T. Then there’s the rest of the competition: the OWC Thunderbolt 3, the Caldigit TS3 Plus or the Startech Thunderbolt 3 plus dozens of other devices are vying for the attention of laptop owners.",
    "Two docks do stand out, at least on paper; the Dell TB16, partly because it is one of the cheapest and smallest on the market at less than $150. Then there is the outlandishly looking HP Smart Buy TB dock which integrates a speaker from Bang and Olufsen and a microphone to allow calls to be made. At $259, it is not much more expensive compared to the SD5300T.",
    "There are better docking stations out there, either from Kensington’s own stable or from elsewhere. The SD5300T is not competitive enough in terms of features or pricing in order to earn itself a higher rating. It is well designed, has a three year warranty and we didn’t encounter any major issues. However, the fact that it has fewer connectors, can only delivery 60W and has a slower card reader make it hard for us to give it a recommendation."
  ],
  "headers": {
    "2": "Design",
    "6": "In use",
    "11": "Competition",
    "14": "Final verdict"
  },
  "links": {
    "Docking stations": "https://www.techradar.com/news/the-best-laptop-docking-stations",
    "SD5300T": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FKensington-Thunderbolt-Docking-Station-K38625US%2Fdp%2FB07VL5XLBS%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1227762642603463000-20",
    "Caldigit TS3 Plus": "https://www.techradar.com/reviews/caldigit-ts3-plus-thunderbolt-3-docking-station",
    "Dell XPS 15 2-in-1": "https://www.techradar.com/reviews/dell-xps-15-2-in-1",
    "DockWorks": "https://www.awin1.com/awclick.php?awinmid=6350&awinaffid=103504&clickref=trd-us-1116507941223535100&p=https%3A%2F%2Fwww.kensington.com%2Fen-gb%2Fdockworks%2F",
    "OWC Thunderbolt 3": "https://www.techradar.com/reviews/owc-thunderbolt-3-docking-station",
    "Startech Thunderbolt 3": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB01BM16ROI%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9256292232835900000-20",
    "Dell TB16": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FDell-Business-Thunderbolt-USB-C-Dock%2Fdp%2FB06XN5ZFVX%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7976980719572084000-20"
  }
}