{
  "source": "https://www.techradar.com/reviews/acer-chromebook-spin-15-review",
  "title": "Acer Chromebook Spin 15 review",
  "category": "computing",
  "updated": "2019-06-20T20:17:45Z",
  "author": "michelle-rae-uy",
  "summary": "The ultimate Chromebook for multitasking",
  "verdict": "The Acer Chromebook Spin 15 leaves a lot of room for improvement, especially in its design. However, as it is now, it’s already an incredible device, with a knack for juggling several processor-hungry tasks at the same time while hardly breaking a sweat.",
  "pros": [
    "Plenty of power",
    "Extremely long battery life",
    "Affordable price tag",
    "Beautifully responsive touchscreen"
  ],
  "cons": [
    "Lots of wasted real estate",
    "Trackpad could be better",
    "Second-rate speakers"
  ],
  "article": [
    "The Acer Chromebook Spin 15 might just be one of the very few Chromebooks that can make converts out of traditional laptops users. That is, especially for those on a strict and limited budget, but still want a certain level of performance.",
    "This 15-inch Chromebook by the Taiwanese manufacturer sits somewhere between the lofty perch of the Google Pixelbook and Samsung Chromebook Pro, and the bargain-basement position that models like the Dell Chromebook 11-inch inhabits.",
    "Yet, as far as performance, the Chromebook Spin 15 can hold its own against the premium models, and it’s just the ticket for folks who want to get a lot out of a lightweight device without spending enough money to make them feel like they should have just sprung for a traditional laptop in the first place.",
    "We’ve tested the Acer Chromebook Spin 15 and discovered for ourselves what it’s capable of, so that you can decide for yourself if it’s time to jump on the Google Chromebook bandwagon.",
    "The Acer Chromebook Spin 15 has several selling points, and one of them is its price tag. This Chromebook starts at $399 (about £317, AU$580), and touts an Intel Pentium N4200 processor (CPU), 4GB of memory (RAM), 32GB eMMC storage and an Intel HD Graphics 505 graphics processor (GPU).",
    "This is the base model, one of two that are available in the US. Unfortunately, this configuration is not available in the UK and in Australia. In fact, the Acer Chromebook Spin 15 is unavailable at all in Australia at the time of the review.",
    "In the UK, there’s only one configuration available, and it’s the same as our review model touting the specs to your right. This configuration will set you back £499 ($449 in the US). The only difference between this one and the base configuration is the storage, which means you’re paying $50 to double it.",
    "Considering that most laptops charge an arm and a leg for any SSD upgrade, that’s not too shabby. However, seeing as you can find a 500GB external SSD for $90 or 1TB external hard drive for $50, upgrading to a 64GB eMMC storage is hardly worth it.",
    "To put the Acer Chromebook Spin 15’s price more into perspective, the Asus Chromebook Flip 12.5-inch has the same storage and only very slightly better graphics (Intel HD Graphics 515), but only 4GB LDDR3 RAM and Intel Core m3-6Y30 CPU for $499. To be fair, the Chromebook Flip is lighter and more compact.",
    "Meanwhile, the HP Chromebook 14 offers the slightly comparable Intel Celeron N3350 and 4 GB LPDDR4 RAM, but with HD Graphics 500 and only 16 GB eMMC, for $309. That’s $99 cheaper than the Chromebook Spin 15’s base model with better graphics and twice the storage.",
    "We sort of have a love-and-hate thing going with the Acer Chromebook Spin 15’s design. While this 2-in-1 Chromebook’s performance has impressed us immensely, its design definitely has left us wanting.",
    "Not that it’s a bad design per se; but the opportunities for improvement are so glaring that it’s frustrating that Acer hasn’t gone back to the drawing board to reevaluate the design before releasing it to the public.",
    "There’s so much wasted real estate on this Chromebook, its 15-inch form factor plagued with too much unused space, from the thick bezels on an otherwise great display to the space above the keyboard that sits there gathering dust. The whole thing just looks like it’s from the ‘90s.",
    "We’d like if they thinned out those bezels for a much more immersive movie-watching or light gaming experience, and slap on better-sounding speakers. Granted, it isn’t a Chromebook, but the HP Spectre x360 15 did just that, with a numpad and a wider trackpad, and it still manages to be smaller.",
    "To be fair to the Acer Chromebook Spin 15, it does have a few things going for it as far as its design goes.",
    "The keyboard is comfortable and pleasant to use, offering just enough travel, resistance and space between the keys to make for a lovely typing experience that isn’t fatiguing or too loud to distract your neighbors at the office. In fact, we wrote this whole review on the Acer Chromebook Spin 15, and it was easy to transition to its keyboard from the 2014 MacBook Pro keyboard we know and love.",
    "This keyboard also boasts its set of dedicated media keys dedicated for browsing, volume and screen brightness.",
    "The upward-facing speakers – located on both sides of the keyboard – while admittedly hollow, lacking bass and could use a boost in the mids, are loud enough for solo use or if you’re with a couple of friends. We had the Acer Chromebook Spin 15 playing Parks and Rec on Netflix, The X-Files on Hulu and The Sims Mobile game all at once, and we could discern every single sound coming from all three sources. These speakers also have a fairly even frequency at low volumes, which means they actually sound decent if you don’t set the volume too high.",
    "The Corning Gorilla Glass trackpad is reliable enough, nice to touch and has a little more give in the bottom left and the bottom right where the left and right buttons are.",
    "And, the trackpad has a sturdy feel to it, even if it is a little stiff and not always accurate. That is, the pointer or cursor on the screen doesn’t always precisely copy what you’re finger is doing on the trackpad, whether due to latency or plain inaccuracy, we’re not quite sure. But, it’s subtle enough that this Chromebook’s target audience might not even notice.",
    "The display looks fine, but is nothing mind-blowing especially in its color reproduction. However, the touchscreen functionality is very responsive and very accurate. This isn’t surprising, as this 15-inch HD display is made of the good stuff. In fact, if we weren’t so used to the laptop mode when going through our day to day workload, we’d use the touchscreen more than the trackpad.",
    "Since this is a 2-in-1 laptop, we must talk about the hinges. The hinges on this Chromebook feel very sturdy, with enough give so you can easily flip between modes and enough resistance so it doesn’t collapse when you’re in tent mode.",
    "Speaking of modes, you’ll feel just as comfortable using the Acer Chromebook Spin 15 like a traditional laptop as you would using it in tablet mode. This Chromebook isn’t thin and light, but because of its boxier (as opposed to rounder) design, handling it in tablet mode feels natural.",
    "Finally, there’s the availability of ports, which is actually decent. There are two USB-C ports to make it future-proof, two USB 3.0s for many of your existing devices, an audio jack for video conferencing, and a Micro SD reader should you need to do some light photo editing on this computer."
  ],
  "headers": {
    "4": "Price and availability",
    "10": "Design"
  },
  "links": {
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "Google Pixelbook": "https://www.techradar.com/reviews/google-pixelbook",
    "Samsung Chromebook Pro": "https://www.techradar.com/reviews/samsung-chromebook-pro",
    "Dell Chromebook 11-inch": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/dell-chromebook-11-2015-1284386/review",
    "Google Chromebook": "https://www.techradar.com/news/best-chromebook",
    "Asus Chromebook Flip": "https://www.techradar.com/reviews/asus-chromebook-flip-c302",
    "HP Spectre x360 15": "https://www.techradar.com/reviews/hp-spectre-x360-15t-2019",
    "2-in-1 laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451"
  }
}