{
  "source": "https://www.techradar.com/reviews/razer-kraken-kitty-edition",
  "title": "Razer Kraken Kitty Edition review",
  "category": "computing",
  "updated": "2020-01-15T16:28:50Z",
  "author": "jackie-thomas",
  "summary": "Ears for your ears",
  "verdict": "The Razer Kraken Kitty Edition is a win for Razer looks-wise, but it goes deeper. The Kitty Edition also delivers excellent sound quality and comfort, making it easy to recommend.",
  "pros": [
    "Great sound quality",
    "Very comfortable",
    "Streaming integration",
    "Unique aesthetic"
  ],
  "cons": [
    "Could use a mute button"
  ],
  "article": [
    "The Razer Kraken Kitty Edition is a sign of progress in the peripheral scene. If you go back even two or three years, gaming peripherals used to be inundated with edgy 'gamer' designs. Red, black, and full of obnoxious RGB lighting, you had to have very specific tastes if you didn't want to hide them away whenever you had company.",
    "Luckily, over the last year or so, we've started seeing a new approach to gaming peripheral design: make something for everyone. It's not even a radical idea, but we're happy that the industry has finally implemented it.",
    "The Razer Kraken Kitty Edition is a wired USB gaming headset with customizable lighting, THX Spatial Audio, awesome cooling-gel ear cushions and some great streaming-focused features. It will set you back $149 (£149, AU$243), which puts it in the same league as the SteelSeries Arctis Pro at $179 (£199, AU$449). It's definitely an intense match-up, but the Razer Kraken Kitty Edition has enough up its sleeve to make it worth the high asking price.",
    "The Razer Kraken Kitty Edition earns its name when you first spot it. The model we're reviewing here is pink or 'Quartz' color, and has two RGB cat ears springing up from the headband. There's also a black color option if you don't want to rock the Quartz model, but really, the Quartz is where it's at as far as we're concerned.",
    "If you know the Razer Kraken, most of the rest of the design will likely be very familiar to you. The ear cups have the Razer Logo on either side, and those are obviously RGB. There's also a pulsing RGB light on each ear cup around the Razer Logo. The entire outer side of the headset is pink, and while the ear cups are inexplicably made of plastic, the band itself is metal, which means it won't break if you drop it.",
    "All the padding has this gray color to it, which is an odd pairing for the pink exterior, but it kind of works anyway. The padding itself is extremely soft up top, and the ear pads have a cooling gel inside that'll stop you from getting too sweaty during intense sessions.",
    "The Razer Kraken Kitty Edition only has one button that toggles the THX Spatial Audio, as well as a volume dial. That's pretty limited in terms of controls, but because it's not a wireless headset it doesn't need much more. We would have liked to see a mic mute there, however. Right now, in order to mute the mic you have to push it back into the headset.",
    "And, yeah, you read that right, the mic is retractable, which is a solid positive as far as we're concerned. We've played with hundreds of headsets, and we still think it's the best solution for a gaming headset microphone, it doesn't get lost like a removable mic and doesn't stick out when not in use.",
    "All of the lighting is controllable in Razer Synapse, which isn't too surprising, but you'll need to download another piece of software if you want to take advantage of the more unique features on offer.",
    "You see, one of the big selling points of the Razer Kraken Kitty Edition is the ability to have your streaming audience interact with the device. Through Razer's Streamer Companion App, you can connect your Twitch account to have the headset react to certain things in your stream. For instance, when you get a follow, you can configure the Razer Kraken Kitty Edition to set off custom lighting effects that your audience can see in real time.",
    "We test this feature by just hitting the 'Test' button in the Streamer Companion App, because we're simply not cool enough to have a streaming audience, but it seems to work extremely well, and its a neat feature. We're sure this feature will be particularly popular among streamers – whether they're pro or just aspiring to be.",
    "The Razer Kraken Kitty Edition is undeniably an attractive piece of kit, but that obviously doesn't matter if it doesn't sound good. Fortunately, it keeps up with the best of them.",
    "The headset is packed with 50mm drivers, so its not surprising that they sound great for most content. The bonus for us, however, is that they're not half bad for listening to music. Most gaming headsets are way too bass heavy, making anything other than video games and some movies sound awful, but this has a nice, balanced soundstage that doesn't overwhelm. In fact, The Razer Kraken Kitty Edition is balanced enough to appreciate the new FKA Twigs album, which is full of extremely subtle instrumentation.",
    "And, it does this while still sounding great in games. We got a little too into Red Dead Redemption 2, and that incredibly immersive game sounds great here. Whether its explosive combat or the sounds of wildlife, it sounds great here.",
    "Voices sound great here, too, which isn't much of a surprise. What is surprising, however, is how good the mic sounds. Our voice came through nice and clear on discord with our friends actually commenting on how it sounds. We wouldn't go as far as to say it's good enough to use as a streaming mic, but if you're in a pinch it will actually work.",
    "The Razer Kraken Kitty Edition may actually be one of the best headsets out there right now. It's on the mid-range of the pricing scale, and while it's not wireless, it does mean there's one less point of failure in your streaming setup. The sound quality is fantastic for the money you're paying, too, so you don't have to compromise.",
    "It may be easy at first glance to write off the Razer Kraken Kitty Edition as a novelty, but it delivers on more than just the aesthetic. It's an easy headset to recommend, and we hope it means that other gaming peripheral manufacturers will start to make more products like this. We love it."
  ],
  "headers": {
    "3": "Design",
    "11": "Performance",
    "15": "Final verdict"
  },
  "links": {
    "gaming headset": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675",
    "SteelSeries Arctis Pro": "https://www.techradar.com/reviews/steelseries-arctis-pro-headset",
    "Razer Kraken": "https://www.techradar.com/reviews/pc-mac/peripherals/speakers-and-headphones/headsets-and-headphones/razer-kraken-7-1-chroma-1273126/review"
  }
}