{
  "source": "https://www.techradar.com/reviews/blackview-bv6100-ruggedised-smartphone",
  "title": "Blackview BV6100 ruggedised smartphone review",
  "category": "phones",
  "updated": "2019-08-15T23:25:26Z",
  "author": "desire-athow",
  "summary": "A phablet with a lot of character and few issues",
  "verdict": "The Blackview BV6100 will turn heads with its big screen. Families will love it as a tablet replacement with oomph and we foresee a bright future for it in the ruggedised business market should Blackview decide to market it as a waterproof connected tablet. There are some minor issues but nothing that can’t be resolved in the future.",
  "pros": [
    "Solidly built",
    "Very keenly priced",
    "Bluetooth 5.0",
    "Type-C connectivity",
    "NFC",
    "Very large screen",
    "Big battery"
  ],
  "cons": [
    "Front facing camera placement is odd",
    "Questionable free casing",
    "Glass back is a puzzling choice"
  ],
  "article": [
    "For its latest smartphone, Blackview chose to go big. It took what looks like the BV9000 Pro and supersized it while removing a few features. The result is the BV6100, a 6.88-inch smartphone that packs a lot of interesting features with a price point that’s actually quite enticing.",
    "Let’s start by what we consider to be the biggest problem with the BV6100; it has a glass back. Bear in mind that this is a ruggedised smartphone that boosts IP68, IP69K and MIL-STD 810G certification and one might see a slight problem with shoving a big slab of glass at the back.",
    "Perhaps a sign of post-production wisdom, Blackview has also bundled a free carry case - for the first time ever - with the BV6100 which, you’ve guessed it, shields the back.",
    "Otherwise, it embraces the traditional Blackview design with a mixture of polycarbonate and metal, mixing dark grey and black colours. The front and back glass panels are recessed and protected by a raised border of plastic; should you drop the phone on a hard surface, that ring is supposed to absorb some of the shock.",
    "At 181 x 89.7 x 11.5 mm for a weight of 315g, it is surprisingly, not the heaviest IP68 smartphone we tested to date. The HomTom Zoji Z11 and the Poptel P9000Max are both heavier because of far larger batteries. Its large form factor means that it won’t fit in most pockets.",
    "On the left of the device is the SIM tray and a customizable “intelligence” button. That’s how Blackview calls it. The opposite side contains two volume buttons and the power one next to a fingerprint reader; further down is a dedicated camera button. Top and bottom edges host the Type-C connector and an audio socket, both behind rubber flaps to prevent any dust/water ingress.",
    "The front screen is protected by a Corning Gorilla panel, with the right top edge of the usable viewing area cut off and used for the front facing camera; one of the very few smartphones that have adopted this rather than the usual water drop design. The back has two cameras and a flash plus a single speaker outlet.",
    "Given the price point (sub $200), the leeway to come up with an outstanding phone is quite tight but the BV6100 delivers. Sure there are some compromises like the low screen resolution (at 1352 x 640px), the small onboard storage (16GB) or the quad-core CPU (a Mediatek MT6761/Helio A22). This however is compensated by the Type-C port, NFC, a rarity at this price point and Bluetooth 5.0.",
    "There’s 3GB of low power RAM onboard which should be enough for Android 9.0 plus 802.11n. The three cameras are low resolution models (8mpx, 5mpx and 0.3mpx) so expect below average performance especially in low light. You won’t be able to use two SIM cards and a microSD card at the same time as well.",
    "Having a big form factor means that Blackview can afford to pack in a big battery and at 5.58Ah, the one that equips the BV6100 is one of the bigger models we’ve seen on a ruggedised phones. No it doesn’t compete with the 10Ah+ monsters like the HomTom Zoji Z11 or Poptel P9000 Max.",
    "No surprise here; the BV6100 posted some abysmal numbers and that was expected given the components used. In fact, the use of a low resolution display might actually have improved the numbers. It has only 40 per cent of the pixels of a smartphone with a full HD display.",
    "Upfront, Blackview confirmed that this phone can only be used in Europe and Asia. Not in the US, probably because of the bands.",
    "Adding the casing makes the device far more uncomfortable to use as the frame adds a not-so-insignificant amount of girth, moving the total weight of the device nearer to 400g, that’s far more than the iPad Mini, which has a bigger screen.",
    "A number of apps are preinstalled, some tied to the CPU’s built-in features; that includes Game Mode, Step Count, FM Radio, SOS, Wireless Emergency Alert, Child Mode (which allows you to offer a subset of apps and add time limits to usage). Also in the bag is a suite of DIY apps that can come in handy (pun intended); these tend to be bundled with the majority of ruggedised smartphones that we’ve reviewed over the past few years.",
    "There’s no real competition for the BV6100; Blackview has managed to find a niche without any actual rivals. At the time of writing, we don’t know of any ruggedised smartphone with a near 7-inch display at any price points.",
    "Two categories of users will be interested in this smartphone: the first one will be someone looking for a device with a bigger-than-average screen for media consumption. The presence of BT 5.0 makes it even more intriguing as it is far more flexible compared to Bluetooth 4.2. A big battery and IP68 are nice to have with computing and graphics performance, secondary concerns.",
    "The second category of users will use this as a tablet replacement, either from a professional perspective or for a family. Running Android 9.0 means that it is futureproofed for at least two years with LTE connectivity and a very affordable price tag, excellent incentives.",
    "We have strong reservations with regards to the glass back and the free casing. This is a ruggedised device so to protect it with a free casing means that the existing chassis is not up to scratch. We couldn’t find any evidence of that during our review.",
    "A future version of the BV6100 should eliminate that anomaly and allow external peripherals - like an external battery back or a barcode scanner - to be connected. Blackview has some experience in doing this via the BV9700 Pro but it is Doogee, with its ambitious S90 Pro that has managed to do it (almost) right."
  ],
  "headers": {
    "1": "Design",
    "7": "Hardware",
    "10": "Performance and in use",
    "14": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "BV9000 Pro": "https://www.techradar.com/reviews/blackview-bv9000-pro",
    "HomTom Zoji Z11": "https://www.techradar.com/reviews/homtom-zoji-z11-rugged-smartphone",
    "Poptel P9000 Max": "https://www.techradar.com/reviews/poptel-p9000-max",
    "iPad Mini": "https://www.techradar.com/reviews/ipad-mini-2019",
    "BV9700 Pro": "https://www.techradar.com/reviews/blackview-bv9700-pro-rugged-smartphone",
    "S90 Pro": "https://www.techradar.com/reviews/doogee-s90-rugged-smartphone"
  }
}