{
  "source": "https://www.techradar.com/reviews/nokia-81-review",
  "title": "Nokia 8.1 review",
  "category": "phones",
  "updated": "2019-01-29T15:36:25Z",
  "author": "james-peckham",
  "summary": "No longer the flagship for Nokia",
  "verdict": "You may be disappointed that this isn’t a true follow-up to the original Nokia 8, but the Nokia 8.1 is trying to be something different and it succeeds at exactly that. It’s a top of the mid-range phone that we found to do everyday tasks surprisingly well if not particularly majestically.",
  "pros": [
    "Well built design",
    "Large, clear display",
    "Suitably powerful"
  ],
  "cons": [
    "Not waterproof",
    "Lacks wireless charging",
    "Easy to cover speaker"
  ],
  "article": [
    "If you own the Nokia 8 flagship phone from HMD Global that was announced late in 2017 and you’re now looking for the follow-up, the Nokia 8.1 - somewhat confusingly - isn’t that.",
    "Ever since HMD Global took over the Nokia brand and began releasing phones with the Nokia name, the company has been updating its handsets and sticking the number 1 at the end of them to signify a sequel. That’s not the case here.",
    "While the original Nokia 8 sported a top-end chipset (at the time), a QHD display and a splash-proof design, none of those flagship specs feature on this revamped version of the phone - this is a distinctly mid-range affair.",
    "If you’re still interested in a mid-range Nokia phone, we have a full review of the handset below, where we run through what we like and dislike about the Nokia 8.1.",
    "Announced late in 2018, the Nokia 8.1 is available around the world now from a variety of different retailers. However, there’s still no clear release date for those in the US or Australia.",
    "HMD Global has brought most of its Nokia phones to Australia in the past, so fingers crossed this will also be one to land there. We haven’t seen many Nokia phones in the US for a while, but the company has just announced it will be partnering with US networks Verizon and Cricket Wireless to bring its phones to the market.",
    "Exactly when that will be remains unclear, but that may mean you’re able to buy the Nokia 8.1 in the US in the coming months. In the UK, the price is set at £379.99 (roughly $485 / AU$665), which considering it’s a mid-range device is a good price compared to a lot of the competition.",
    "The Nokia 8.1 is essentially a larger Nokia 7.1 when you hold it in your hand. A lot of the design elements are similar, this is just a larger version of that handset, but it’s still not impossible to hold.",
    "With dimensions of 154.8 x 75.8 x 8mm it’s easy enough for most people to hold, and it isn’t too heavy at 180g.",
    "A lot of the design elements we’ve come to like from newer HMD Global-made Nokia handsets are here, and overall the design is attractive if not premium.",
    "The front and rear of the phone is made of glass, and there’s an aluminum frame holding the whole thing together. Our grip wasn’t fantastic on the phone at first because of that glass back, but it’s something we got used to after a few days of using it.",
    "The corners of the rear of the phone are rounded meaning it sits in the palm of your hand comfortably. The rear of the phone houses a fingerprint scanner that we found to work quickly and be in an easily reachable position.",
    "The camera sits above the scanner. It’s raised out from the back of the phone quite a long way. In fact, it protrudes out another 1.5mm over the phone, meaning the handset won’t sit down flat on a desk next to you. It’s not out far enough that it becomes uncomfortable in a pocket, though.",
    "The bottom edge of the Nokia 8.1 features a USB-C port as well as the single speaker, which is remarkably easy to cover up. You may find that an annoyance when watching video. The side edges of the phone are clear apart from a volume rocker, power button and the SIM tray.",
    "Then the top edge of the phone features a 3.5mm headphone jack, which anyone who likes wired headsets is sure to appreciate sticking around for this latest generation of Nokia handsets.",
    "The bezels around the display are thin, especially for a mid-ranger. There’s a notch at the top of the display to hide away the selfie camera and other tech, but we couldn’t get it to look like a normal notch.",
    "Instead, the two sides of the notch are covered in black and house the information you’d expect such as the time, notifications and battery level. So in other words the notch is semi-hidden. To be able to properly display the notch you’ll need to have developer software running on the phone, which is something we weren’t able to do.",
    "The 8.1 in the name of this phone doesn’t refer to the size of the screen, luckily. Instead the Nokia 8.1 features a 6.18-inch display with a Full HD+ resolution. That’s 2280 x 1080, with a pixel density of 408ppi.",
    "We found the display is good enough for the size of the phone. Picture quality isn’t incredible as it isn’t a QHD panel, and the technology used here is an IPS LCD rather than AMOLED.",
    "That said, for the price of this phone you’re unlikely to be disappointed with how the Nokia 8.1 looks. It’s around an 81% screen to body ratio though, so you’re not going to be getting an all-screen front on this handset..",
    "One final thing to note is that this isn’t waterproof. You won’t be able to get your Nokia 8.1 particularly wet, and we don’t currently know its exact IP rating so it may not even do well in the rain. That’s a shame if you’re after a durable device, but it’s not all that common that we see mid-range phones with high IP ratings to protect from water damage."
  ],
  "headers": {
    "4": "Nokia 8.1 release date and price",
    "7": "Design and display"
  },
  "links": {
    "Nokia 8": "https://www.techradar.com/reviews/nokia-8",
    "Nokia 7.1": "https://www.techradar.com/reviews/nokia-71-review"
  }
}