{
  "source": "https://www.techradar.com/reviews/naim-uniti-atom",
  "title": "Naim Uniti Atom review",
  "category": "audio-visual",
  "updated": "2019-04-12T16:18:48Z",
  "author": "gerald-lynch",
  "summary": "An all-round star player",
  "verdict": "If you have the money, you’ll be hard pressed to find a better all-in-one system than the Naim Uniti Atom.",
  "pros": [
    "Beautifully designed",
    "Great source option",
    "A surprisingly useful app"
  ],
  "cons": [
    "Expensive",
    "Low-end could do with more punch"
  ],
  "article": [
    "The modern music lover enjoys music however they can get their hands on it, whether through the high-res streaming playback of services like Tidal, the convenience of a Bluetooth connection or the luxury of vinyl.",
    "The Naim Atom Uniti all-in-one music player wants to be the focal point of them all.",
    "Offering compatibility with every music source under the sun, it’s a forward-thinking, service-and-format-agnostic music player that proves to be as easy on your ears as its design is on your eyes. If you’ve got the money, it’s well worth a listen – read on to find out why.",
    "The Naim Uniti Atom is out now, with pricing hovering around the £1800 mark ($3,299, AU$3795). It’s expensive, but there are few all in ones that can match this player for performance, features or class.",
    "The Naim Uniti Atom is quite the looker. Measuring 95mm x 245mm x 265mm, it’s a decent size – but not so big that it couldn’t be squeezed onto a solid shelf if needed. Boxy by design, it’s made primarily of a brushed, anodised aluminium finished in a slick black.",
    "On top you’ll find a large glossy volume wheel that turns with a satisfyingly smooth action, and lit by a volume-indicating LED array.",
    "The front is a glossy panel too, and features the player’s 5-inch LCD display – it’s bright and attractive, with the Naim Uniti Atom’s software pulling through album artwork and metadata in an attractive, highly-legible way. There’s also an optionally-lit Naim logo, sat beneath a USB port and headphone jack, with backlit buttons for power, play / pause, input and favorites.",
    "Industrial-looking ventilation sits around the side, with the majority of connections present, as expected, on the rear. A kettle lead power supply (designed specifically to reduce any issues vibrations may bring), sits next to speaker terminals, an Ethernet network input (a Wi-Fi connection is also supported) and a USB port. Analogue and digital inputs sit on the right, with digital supporting two optical and one coaxial input.",
    "If you’d like to add the Naim Uniti Atom to a home cinema set up, a separate version is offered up for an additional £100 that throws in a HDMI port too. It’s the one we’ve been testing, and it works a treat.",
    "All that’s left is to connect your own speakers to it. For the purposes of this review, we paired the Naim Uniti Atom primarily with the Q Acoustics Concept 20 bookshelf speakers, which now hover around the £250 price point. But with 40 watts per channel fed into 8 ohms, you could easily pair this system with something far more lavish, with the unit’s amplifier a Class A/B number derived from Naim’s classic NAIT integrated designs.",
    "A long gloss-finish remote also comes as part of the package, with shortcuts to playback controls, menu navigation and more. But the Naim Uniti Atom can also be used with an iOS and Android app, and though that remote is great, the app is our preferred control method. With so many playback options, sources, connected services and multi-room options, it’s the simplest way to get the most out of the player. It’s stable and well designed too, which makes a nice change from the majority of afterthought-app designs we see with music players.",
    "And what a selection of playback options you have here. As well as network-stored tracks, and USB playback, the Uniti Atom has support for Spotify Connect, AirPlay, Google Chromecast, Tidal, internet radio and Bluetooth aptX HD.",
    "There’s also the means to hook up a CD player or record player using that anloague input, and with multi-room set up features included as part of the set-up process, that effectively means you could use the Naim Uniti Atom to beam your vinyl audio around your house. It’s pretty special.",
    "[Update: The Naim Uniti Atom now also supports AirPlay 2, which enables advanced multi-room functionality as well as voice control via Apple's Siri AI assistant.]",
    "Whatever you throw at the Naim Uniti Atom, no matter what playback source or musical genre, it’ll caress your ears with sound. Dynamic and textured, it was able to pull details out of recordings without any extra added flab with precision and perfect timing.",
    "With Tidal as our primary testing source, we ran through a diverse catalogue that included everything from ABBA pop-bangers to the esoteric indie madness of BC Camplight to the violin concertos of Jean Sibelius.",
    "The Uniti Atom had no problems with any – the sliding bass, tinkling guitars and synth warbles of BC Camplight’s Fire in England were reproduced with room to breathe, bringing out the depth of the composition beautifully. Take things to a more sparse soundscape with Brian Eno’s An Ending (Ascent) and the sustained choral synths of the piece sing, with the gentle waves reproduced with beautiful insight.",
    "If there’s somewhere the Uniti Atom felt just a tad lacking, it was with low-end thump – Mylo’s Drop the Pressure lacked the kick we’d hoped for – but not so much as to be unenjoyable by any stretch.",
    "The Naim Uniti Atom is a near-perfect player. It has a wealth of connectivity and source options, an attractive design and a highly-usable app. Its screen is clear and colorful, and its playback precise and detailed. Pair it with a good pair of speakers and high-quality source material and it’ll bring new life to your favorite tunes.",
    "It’s undeniably expensive, but as a top-notch central home for all your music needs, it’s money well spent."
  ],
  "headers": {
    "3": "Price and availability",
    "4": "Design",
    "10": "Connectivity and features",
    "14": "Performance",
    "18": "Verdict"
  },
  "links": {}
}