{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-note-8-review",
  "title": "Samsung Galaxy Note 8 review",
  "category": "phones",
  "updated": "2019-01-17T16:25:18Z",
  "author": "matt-swider",
  "summary": "The best big smartphone with a stylus",
  "verdict": "The Note 8 at launch had the best big display on a smartphone and acts as Samsung's big phone comeback story, making up for the Note 7 recall. It has an expansive 6.3-inch ‘Infinity Display,’ faster 6GB of RAM performance and two outstanding rear cameras, which add up to one of the most expensive phones ever. Just don’t expect record-breaking battery life from its predictably average-sized battery that plays it safe. It’s a great phone, if you can handle the enormous size and equally huge price.",
  "pros": [
    "'Infinity Display' is excellent",
    "Great dual-lens camera",
    "Fast with 6GB of RAM"
  ],
  "cons": [
    "‘Infinitely’ expensive at launch",
    "Battery life held back",
    "Weak speaker"
  ],
  "article": [
    "Update: The Samsung Galaxy Note 8 has been steadily dropping in price, but it now has some newer competition too. We've added details of both these things to this review.",
    "Even in 2019, the Galaxy Note 8 remains one of Samsung's biggest phones, and does more than enough to right the major wrongs of the recalled Note 7. This is a mega-sized mea culpa.",
    "We've tested the Note 8 for many months and it's even more interesting today thanks to the new Deep Sea Blue color that came out post-launch in the US and UK, and the big Android Oreo update that it got. This catches it up to the Samsung Galaxy S9 and similarly sized Galaxy S9 Plus.",
    "After all of our hands on time with the Note 8 it has us convinced: this is a true redesign of not just the Note series, but of the average smartphone from top-to-bottom, edge-to-edge, and rear camera to, well, rear camera. There are now two cameras on the back, a first for a Samsung flagship smartphone (the new S9 Plus and Samsung Galaxy Note 9 has this too). It takes brilliant portrait photos, and you can even edit the depth of field post-capture.",
    "What makes the Note 8 different is the handy S Pen stylus and larger 6.3-inch ‘Infinity Display’ to work with – but one that doesn’t increase the dimensions of the actual phone too much. The phone acts like a big, borderless glass canvas for your important handwritten notes and masterpiece doodles.",
    "Watch our video review of the Samsung Galaxy Note 8 below.",
    "Why buy this instead of the 6.2-inch Galaxy S9 Plus? The extra tenth of an inch of screen is insignificant and doesn’t matter, but Note fans adore the S Pen stylus functionality and its more square shape. Over the S8 Plus, the Note 8 also benefits power users with 6GB or RAM and a superior dual-lens camera, both features passed on to the S9 Plus.",
    "Of course, it's not quite a match for the Samsung Galaxy Note 9, but given its lower price it doesn't have to be.",
    "This is still one of the most powerful Samsung phones with a stylus. It does, however, cost you in multiple ways. First, it’s too big for some. You’re going to need a Note 8 case to confidently hold this unwieldy glass beast, and two hands to operate it.",
    "Second, the big screen also comes at the cost of the Note’s usual oval-shaped fingerprint sensor home button. It’s gone. The on-screen button that replaces it works fine, but the fingerprint sensor is now located on the back of the device and off-center – it’s a textbook flawed design, and the alternative iris scanner doesn’t always work when you want to unlock the phone. We're hoping the Galaxy Note 9 fixes this in a couple of months.",
    "Then there’s the Note 8 price. While not as expensive as it once was, this is still a pricey phone.",
    "Can your wallet, and the extent of your grip, handle the Note 8? That’s pretty much all that you – if you have faith in Samsung again – need to ask yourself before buying this phone.",
    "The Galaxy Note 8 release date was Friday, September 15 2017 in the US and UK, while Australia got the new phone on September 22. It's readily available.",
    "The official Note 8 price is $929 (£869, AU$1,499), but many stores now sell it for far less. You can find it cheaper via Amazon US for example, with prices now coming in at around $715 (£475, AU$900).",
    "It's still pricey, but no longer anywhere near what it once was. Of course, it's no longer the latest Note, as the Samsung Galaxy Note 9 is now available.",
    "The Note 8 maximizes Samsung’s dual curved edge and nearly bezel-less Infinity Display to the point where this phone feels like a mini tablet from the future. It’s impressive-looking, but also big and heavy – 9mm taller than any previous Note phone, and 195g.",
    "Stretching your fingers is well worth if you can physically manage it. Its expansive 6.3-inch display – now without a physical home button – has an unheard-of 83% screen-to-body ratio. The iPhones have a 67% screen-to-body ratio for comparison. That's a lot less screen for such big phones, at least until iPhone 8 arrives to change everything.",
    "Samsung keeps topping itself, launching phones with the world’s best display every six months. Its maximum brightness, 3K resolution with Mobile HDR Premium, and wider color gamut are hard for anyone else to compete with. It's Always-On Display continues to be an appealing feature in a smartphone.",
    "Lit up, the all-screen Note 8 feels like we’re carrying around a piece of light when we’re out and about. It's much better than the Pixel 2 and Pixel 2 XL display, Google's biggest weakness.",
    "The entire front glows with unimpeded information – as long as you don’t drop and crack it, and you’ll need to be extra careful as the entire phone is enveloped in glass wrapped around an aluminum frame. Combined with its size, this makes for one slippery smartphone.",
    "While we spent most of the time using this phone naked (that’s without a case), we did test several Note 8 cases and instantly felt more confident carrying it around. Why? The added grip (and peace of mind) let us operate it with one hand, whereas we struggled with the pure glass body at such tall and wide dimensions. Sorry – you’re going to need a case with this phone.",
    "There were very few Note 8 colors at launch. It came in muted tones of Midnight Black and Orchid Gray and we only recently saw the Deep Sea Blue color launch in the US. This vibrant blue and tempting Maple Gold colors were first launched in other regions. Samsung, annoyingly, refreshes its phones with new colors after a few months, much to the chagrin of loyal early adopters.",
    "You also won’t get the best sound from the Note 8. It's a multimedia powerhouse visually, but its bottom-firing speaker still had us cupping the bottom of the phone to get better audio. Samsung has yet to deliver dual front-facing speakers like the Sony Xperia XZ Premium, or customizable Hi-Fi audio like the LG V30. Maybe next year.",
    "The Note 8 is IP68 water-resistant, so it can survive up to 1.5m (5ft) underwater for 30 minutes, and it uses the reversible USB-C standard. Both are new perks for most Note fans. There’s also no camera bump, and that gaudy Samsung logo has been moved to the rear, no longer staring you in the face. Unfortunately, the fingerprint sensor has moved there, too.",
    "We hate the fingerprint sensor on the Galaxy Note 8, just as we did on the S8 and S8 Plus. Maybe a tiny bit less, but we still don’t like its off-center rear location for the same reason: we keep blindly smudging the far-too-close dual-lens camera. It’s really difficult to unlock the phone.",
    "What’s improved – slightly? The offset fingerprint sensor and center-aligned camera are a few milimeters further away from each other. Samsung wisely moved the flash and heart rate monitor in between the sensor (which requires your fingerprints) and the camera (which always gets fingerprint smudges all over it). That built-in heart rate monitor you forget still existed on Samsung phones now serves a purpose again.",
    "Samsung’s unlocking alternatives don’t work as advertised. Face unlock has proven to be less secure, so much so that we don’t even suggest using it. And while you won’t fool the iris scanner, it won’t recognize you wearing sunglasses, or walking and holding the phone at the improper distance.",
    "It’s ironic that we have a phone that looks like it comes from the future, yet it’s been designed with a fingerprint sensor that’s become a textbook design misfire on smartphones. Samsung could fix this issue with an in-glass front fingerprint sensor, but the technology isn’t ready yet. Expect this to be a grand announcement for the Galaxy S9 or Note 9 – please act surprised.",
    "There are two types of people in the world – those who will use the Note 8’s S Pen, and those who think they’re going to use it, but will stop taking it out of its holster after about a week. It’s like everyone’s desire to own a Fitbit – you had good intentions when you set out to buy it.",
    "Anyone who sticks with the S Pen, however, will get their money’s worth from the Note 8. We signed a PDF contract last week without having to print or scan it – in fact, we didn’t even have to leave the email app. We also jotted down handwritten notes and took screenshots that we were instantly able to mark up.",
    "Plus the S Pen is also great for sketching with over 4,096 levels of pressure sensitivity.",
    "These features – usually reserved for pro-level tablets or 2-in-1 computers – are even handier on a phone. After all, the best note-taking device is the one you have with you all the time.",
    "Frequent note-takers will love the off-screen memo feature, which lets you jot down white-ink notes on the turned-off black screen as soon as you eject the S Pen. Off-screen memos, introduced with the doomed Note 7, enable you to capture your thoughts without having to unlock the phone first.",
    "The Note 7 also debuted S Pen features like GIF Capture and Translate, but these will be new to most Note 8 users. And new to the Note 8 is the ability to write out ‘Live Messages’, creating sparkly animations that you can send to anyone in GIF form.",
    "If the S Pen lets you skip a few archaic steps – like printing, finding a working pen, and scanning a document – the Note 8 may be worth the extra $105 over the similarly sized S8 Plus if you can't find a good deal."
  ],
  "headers": {
    "12": "Price and release date",
    "15": "Design and display",
    "24": "The fingerprint sensor has marginally improved",
    "28": "The S Pen is full of new and old tricks"
  },
  "links": {
    "Note 7": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-note-7-1325876/review",
    "Android Oreo": "https://www.techradar.com/news/android-oreo-features-release-date",
    "Samsung Galaxy S9": "https://www.techradar.com/reviews/samsung-galaxy-s9-review",
    "Galaxy S9 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s9-plus-review",
    "Samsung Galaxy Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "Note 8 case": "https://www.techradar.com/news/10-best-samsung-galaxy-note-8-cases",
    "Galaxy Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "cheaper via Amazon US": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB075XKBN7M%2F%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1840558253787728600-20",
    "iPhone 8": "https://www.techradar.com/reviews/iphone-8-review",
    "Note 8 colors": "www.techradar.com/news/samsung-galaxy-note-8-colors",
    "Sony Xperia XZ Premium": "https://www.techradar.com/reviews/sony-xperia-xz-premium-review",
    "LG V30": "https://www.techradar.com/reviews/lg-v30",
    "S Pen is also great for sketching": "https://www.techradar.com/news/samsungs-s-pen-makes-the-galaxy-note-8-a-truly-portable-artists-tablet"
  }
}