{
  "source": "https://www.techradar.com/reviews/nikon-z7-review",
  "title": "Nikon Z7 review",
  "category": "cameras",
  "updated": "2019-10-11T04:18:20Z",
  "author": "matt-golowczynski",
  "summary": "Nikon's new Z-series gets off to a mighty fine start",
  "verdict": "The Nikon Z7 may not be the prettiest camera, and it's certainly not cheap either, but it's still a formidable debut model in the Z system. With excellent image quality, great videos, lovely handling and a wonderful EVF, together with much-appreciated support for F-mount optics, Nikon has smashed our expectations with the Z7.",
  "pros": [
    "Superb electronic viewfinder",
    "Effective sensor-based VR system",
    "Very responsive in use",
    "Noise well suppressed in high-ISO images",
    "Plays well with third-party lenses",
    "Very good dynamic range"
  ],
  "cons": [
    "Relatively shallow buffer depth",
    "AWB can be neutral in daylight",
    "XQD cards still pricey",
    "Expensive next to Z6",
    "Battery life far from class leading",
    "No DCI 4K – only UHD 4K"
  ],
  "article": [
    "Nikon's first stab at the mirrorless game was an interesting one but not quite the success the company probably has hoped for.",
    "While its models had some unique features and sold very well in some territories, their relatively small 1-inch sensors and bodies that were a little too devoid of physical control means there just wasn't enough here to tempt the enthusiast away from what they were currently using (or rival mirrorless lines).",
    "The company's new Z system couldn't be more different, and the Nikon Z7 is the first of two cameras in the line-up, alongside its Z6 launch partner. With a fresh lens mount that's been crafted with wide-aperture lens design in mind, and its first two models built around full-frame sensors, this is a system that many photographers had wanted from the start.",
    "The more senior of the pair is the Z7, whose closest equivalent in the company's DSLR lineup is the hugely successful D850. With Sony's now on its ninth full-frame mirrorless camera, and Canon spoiling Nikon's fun quite recently with its own full-frame mirrorless EOS R model, the Z7 has been launched at a time where it won't get an easy ride.",
    "That said, many photographers have been waiting patiently to see what Nikon would end up doing, and, minor card slot debacle aside, the response from the photographic community had been overwhelmingly positive to the Nikon Z7.",
    "[Update: Nikon released a firmware update for both the Z6 and the Z7 in May, adding a number of improvements. The most important was the addition of Eye AF focusing which now allows the camera to automatically detect a subject's eyes to make attaining critical focus easier.]",
    "The Nikon Z7 shares a 45.7MP (effective) pixel count with the company's still-popular D850 DSLR, and both sensors have a backside-illuminated (BSI) design to help with light capture, together with no anti-aliasing filter for better detail capture. The sensor in the Nikon Z7, however, is different; while we're not told quite how it compares in terms of performance, it contains 493 phase-detect AF pixels to help with focusing – more on this later.",
    "There's also a new lens mount, which currently accepts three native lenses, but many more are promised over the next few years. The flange depth measures just 16mm and the diameter of the lens mount is a wide 55mm, which bodes well for high-quality lenses with wide apertures. 2019, for example, will welcome a NIKKOR Z 58mm f/0.95 S Noct lens, which Nikon has made a lot of noise about since the launch of the Z system.",
    "Images from the Nikon Z7 are output at a maximum resolution of 8256 x 5504 and tend to weigh around 17-31MB, depending on what it is you're capturing, ISO setting and so on. Opened up in Photoshop, these measure a hefty 130MB at default settings.",
    "The Nikon Z7 can also be set to capture 14-bit raw files, in either compressed, losslessly compressed or uncompressed formats, and you can also output TIFFs straight away if you need to.",
    "One of the most significant changes between the Nikon Z7 and its DSLR cousins is that Vibration Reduction is located inside the camera, rather than in the lens. This system is said to be effective for up to five stops, and can work over five axes: roll, pitch, yaw and X an Y shift.",
    "The main advantage of this VR system for the current Nikon user is that their older non-stabilised lenses can suddenly benefit from the equivalent technology inside the Z7. This is made possible through the optional FTZ adapter, which allows F-mount lenses to be mounted. Nikon assures owners that AF and auto-exposure will be maintained with around 90 or so lenses, and AF will be maintained for around 360 in total. And, if you happen to be using an optic with VR included on the Z7, the two systems with join forces and work together.",
    "The Nikon Z7's viewfinder boasts a 3.69million-dot OLED panel and an impressive magnification of 0.8x, which is supported by a 2.1-million dot tilt-angle touchscreen. That 3.69million dot panel has now been eclipsed somewhat by the 5.67million-dot types that have popped up on the likes of the Fujifilm GFX 100 and Panasonic S1 and S1R, but we'll investigate how well it performs in a moment.",
    "The Nikon Z7's 4K video recording is offered only in the 4K UHD (3840x2160) flavour, rather than in both DCI 4K and UHD 4K, and footage can be captured at 30, 25 and 24p. If you're happy to apply a DX crop to footage – this may, after all, even be preferable depending on your subject, lens and so on – Nikon promises that you'll actually benefit from slightly crisper footage, as it will capture 5K-worth of information with full-pixel readout, before downsampling this to a 4K output.",
    "As is now becoming standard on such cameras, 4K recording is supported by Full HD recording to a maximum 120/100p, which can respectively be output 5x and 4x slower, and the option to capture 4K-resolution (8.3MP) stills during recording has also made the cut.",
    "Nikon has also chosen the Z7 to debut its own Log shooting function, dubbed N-Log, and this is bolstered by a raft of features such as zebra patterning, focus peaking, timecode. An electronic version of the company's Vibration Reduction can also be called upon to steady recordings, either on its own or in conjunction with the sensor-based system, and you can hook up both a microphone and set of headphones through ports at the camera's side for audio monitoring and recording respectively.",
    "Nikon's decision to equip the Z7 with a single XQD card slot has proved to be something of a controversial move, both for the choice or format and the absence of a secondary slot, but the company is keen to stress the rigidity and performance advantages of these cards. On top of that, support for the CFExpress successor is also pegged for the future, which will potentially ready the Z system for the arrival of even higher-megapixel sensors and video recording in formats beyond 4K.",
    "Wireless connectivity is also on hand with the Nikon Z7, both through a vanilla Wi-Fi connection and Bluetooth. Nikon's SnapBridge system can also be used, either working with Bluetooth Low Energy (LE) to keep the camera sending low-resolution images through to a smart devices, or you can transfer full-resolution images and videos through a standard Bluetooth connection. Remote operation of the Nikon Z7 from a smart device is also a possibility.",
    "Battery life is rated at 330 frames per charge of the EN-EL15b battery (according to CIPA standards), which is similar to a number of other mirrorless cameras but still somewhat on the low side next to some rivals. The Sony A7R III, for example, which is arguably the camera's closest rival, manages 650 frames per charge.",
    "That said, most users will be able to get far more frames than the CIPA figures suggest, and the fact that you can charge the battery through the camera's USB-C port is an added convenience. Existing Nikon user? If you own a camera that uses the long-standing EN-EL15 or EN-EL15a batteries you can also use these to power the camera, although these can't be charged through the USB port in the same way as the supplied EN-EL15b cell."
  ],
  "headers": {
    "6": "Nikon Z7 review: features"
  },
  "links": {
    "Z6": "https://www.techradar.com/reviews/nikon-z6-review",
    "D850": "https://www.techradar.com/reviews/nikon-d850-review",
    "EOS R": "https://www.techradar.com/reviews/canon-eos-r-review",
    "no anti-aliasing filter": "https://www.techradar.com/news/the-a-to-z-of-photography-low-pass-filter",
    "Fujifilm GFX 100": "https://www.techradar.com/reviews/fujifilm-gfx-100-review",
    "Panasonic S1": "https://www.techradar.com/reviews/panasonic-lumix-s1-review",
    "Sony A7R III": "https://www.techradar.com/reviews/sony-alpha-a7r-iii-review"
  }
}