{
  "source": "https://www.techradar.com/reviews/akg-n700nc-noise-cancelling-headphones",
  "title": "AKG N700NC Noise-Cancelling Headphones review",
  "category": "audio-visual",
  "updated": "2019-02-04T20:45:42Z",
  "author": "lewis-leong",
  "summary": "Solid noise-cancelling headphones that fall just short of greatness",
  "verdict": "The AKG N700NC are a well-rounded pair of wireless noise-cancelling headphones. We love the design, build quality and sound quality, however, they're not as comfortable nor as good at blocking out noise as the competition. Overall, they're a solid offering from AKG that audiophiles will love - even if they're not class-leading.",
  "pros": [
    "Excellent build quality",
    "Rich and detailed sound",
    "Strong and reliable connection"
  ],
  "cons": [
    "Puts pressure on your head",
    "No aptX HD support",
    "Bulky travel case"
  ],
  "article": [
    "AKG, most known for its portfolio of audiophile and professional audio equipment, has finally released a headphone for commuters and travelers.",
    "That segment has long been ruled by Bose with its excellent QC35 II, but has seen increased competition from likes of the Plantronics BackBeat Pro 2 and the class-leading Sony WH-1000XM3. It's a crowded field that's about to get a bit tighter now AKG has thrown its hat into the ring.",
    "That said, on paper the N700NC is a solid competitor, offering 20 hours of battery life, the ability to let ambient noise in and an expertly built exterior. It offers AKG’s signature sound quality and you won’t be disappointed by its reference tonal balance and strong ability to reproduce detail.",
    "Overall, that makes it a solid pair of travel headphones for the audiophile crowd. Too bad its competitors are still simply doing some things better.",
    "The AKG N700NC are a handsome pair of headphones that utilize metal, plastic, and leather throughout. The earcups have a nice chamfered edge that give the headphones a premium look and feel, plus the leather used for the earcups feels luxurious, but do make your ears slightly steamy after extended listening periods.",
    "The left earcup has music playback controls while the right earcup features a power/pairing slider as well as a “Smart Ambient” button. That button can be programmed to either adjust how much ambient noise to let in, or to pause your music and let all of the ambient noise in so you can hold a conversation without taking off your headphones. That said, to do any sort of re-programming, you'll need to download the AKG app for iOS or Android.",
    "While the ultra-soft suede that covers the headband feels luxurious, it may not hold up as well as the leather on the earpads. Worse, though, is the fact that the AKG N700NC causes some discomfort on the top of your head after long listening sessions thanks to the combination of its weight and clamping force. The Bose QC35 II feels lighter and doesn’t have this problem.",
    "Included in the packaging are a slew of accessories including an airplane adapter, 3.5mm cable, microUSB charging cable, and a hard carrying case. The case itself is well-built with a pouch to carry all of your cables, however we wish that the whole package was a bit less bulky.",
    "Sound quality of the AKG N700NC is excellent, featuring one of the most neutral presentations we’ve heard from a headphone in this class.",
    "In terms of sound, bass is rich and digs deep, mids are natural and offer a nice representation of texture and highs are never harsh but still features a nice energy. Soundstage is about average with sound not constrained to inside your head but they also aren’t as spacious as the Sony WH-1000XM3.",
    "Noise cancelling of the AKG N700NC is good, but slightly bested by both the Bose and Sony. Bose and Sony are neck and neck with their ability to block out noise and AKG is just slightly behind its competitors.",
    "That’s not to say that the AKG’s ANC is bad, however. As far as noise-cancellation is concerned it's up there with the best and doesn’t put any pressure on our ears as some ANC headphones do.",
    "Similarly, battery life is good, offering up to 36 hours of playback in wired mode. We found the headphones sound a little bit better when used wirelessly, but that will come at the expense of the battery life. Overall, when used wirelessly the N700NC can stand toe-to-toe with the 20 hours you'd get from the Bose QC35 II but just can't match the ridiculous 30 hours of playback you can expect from the WH-1000XM3.",
    "After spending several weeks with the AKG N700NC, we came away impressed. They offer a good balance of design, build quality, sound quality, and features for the price. While the Sony WH-1000XM3 remain the king in the travel headphone quality, the AKG N700NC is a formidable foe for the Bose QC35 II. The latter offers unrivaled comfort and excellent noise cancelling, but those who don’t like the soft sound quality of the Bose will enjoy the AKG’s tuning.",
    "While we enjoyed the sound quality and build quality of the AKG N700NC, the slightly warmer sound, class-leading ANC and better battery life make the Sony WH-1000XM3 too tough an act to beat, especially for the same price."
  ],
  "headers": {
    "4": "Design",
    "8": "Performance",
    "13": "Final verdict"
  },
  "links": {
    "QC35 II": "https://www.techradar.com/reviews/bose-quietcomfort-35-ii",
    "Plantronics BackBeat Pro 2": "https://www.techradar.com/reviews/plantronics-backbeat-pro-2",
    "Sony WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "Bose QC35 II": "https://www.techradar.com/reviews/bose-quietcomfort-35-ii"
  }
}