{
  "source": "https://www.techradar.com/reviews/kyocera-ecosys-p3155dn",
  "title": "Kyocera Ecosys P3155dn review",
  "category": "computing",
  "updated": "2021-03-03T17:26:02Z",
  "author": "jim-hill",
  "summary": "Fast, efficient and economical laser printing",
  "verdict": "If you don’t need Wi-Fi, the costly new Ecosys is faster, greener and better than before.",
  "pros": [
    "Very fast printing",
    "Low per page cost",
    "Crisp mono prints",
    "High paper capacity"
  ],
  "cons": [
    "Expensive",
    "Wi-Fi costs extra",
    "No touchscreen or NFC"
  ],
  "article": [
    "Kyocera has updated its range of mono Ecosys printers with a refreshed design offering better efficiency and, apparently, a lower impact on the environment. The compact off-white casing of the Kyocera Ecosys P3155dn certainly looks smarter than your average office printer and the specifications make for impressive reading.",
    "With a first page out time of 4.5 seconds and a print rate of 55 pages per minute, this is one of the fastest printers around. The 500-sheet main paper tray and 100-sheet multi-purpose tray provide plenty of paper capacity and there’s enough toner in the box for 10,000 pages.",
    "At around £632 (about $770) including VAT, it might seem a little expensive for an A4-sized monochrome device, but running costs are actually very competitive at around 0.4p per page, and despite the small size, this printer could service a fairly large workgroup.",
    "The simple symmetrical design of the Kyocera Ecosys P3155dn looks rather tasteful in its unassuming off-white livery, and it hides the large 500-sheet paper tray well. It’s a pity the angled LCD panel doesn’t fold flat, but then Kyocera’s engineers have done well to reduce the number of moving parts here, so perhaps that’s a good thing.",
    "The new five-line display is at least an improvement on the frustrating two-line affair found on older models such as the Kyocera Ecosys P5206cdw, but a touchscreen would have been welcome.",
    "It is compact enough to stand on a desk, but tall and short cabinets on coasters are available from Kyocera for this model if you prefer to have it freestanding. You can also increase the paper capacity by 500 sheets by adding another drawer. The front folding multipurpose tray holds another 100 sheets of A4 and this is where you can feed in headed letter paper and envelopes.",
    "There’s a USB port conveniently located at the front, with more ports at the rear for another USB flash drive, a square USB Type-B cable and an Ethernet cable. With no Wi-Fi built in, it’s a pity neither of these cables are included in the box. At least the box and its inner packaging use a minimal amount of plastic as most of it is made from more environmentally friendly pulp material.",
    "The front of the printer hinges open to reveal the unique cartridge-less design and the toner container that will need replacing when the 10,000 pages of supplied toner runs out.",
    "The Ecosys P3155dn includes key features such as auto duplex printing, a front USB input for printing directly from a flash drive (although it won’t read some file types including Word documents), and it has enough on the security front to print private documents in a shared office. It can handle most paper sizes up to A4 and heavier media up to 220gsm in weight.",
    "However, it does not have Wi-Fi by default. You’ll need to fork out an additional £80 (about $100) for the optional Wi-Fi module if you cannot connect an Ethernet cable, or you wish to use Wi-Fi Direct. There’s no NFC either.",
    "That aside, the base specifications are impressive. The Ecosys prints at 55 ppm (pages per minute) for single A4 sheets, or 39 ppm for duplex printing – and that’s about as fast as it gets. The paper capacity is 500 sheets in the main tray with room for another 100 sheets in the multipurpose tray.",
    "The highest available toner refill is good for 25,000 pages, so we’re looking at the kind of capacity that would suit a pretty large workgroup, or a very busy office.",
    "Setting up the Ecosys P3155dn for the first time means opening up the front panel to access the toner container and giving it a little shake before reinstalling. Then you’ll need to wait briefly while the toner is applied to the roller. This process is a little noisy, but after that the printer is relatively quiet in operation.",
    "There’s no Wi-Fi on board, as mentioned – at least on the default model we reviewed – so it’s a case of connecting to the internet via an Ethernet cable.",
    "The five-line display is an improvement on the two-line display found on older Ecosys printers, but there’s no denying that a touchscreen like that of the Xerox VersaLink C500DN would have made day-to-day operation a lot easier. To select paper size and type you have to scroll through the options using the accompanying buttons.",
    "There is also a companion app called Kyocera Mobile Print that makes it easier to print from your mobile. The Kyocera Ecosys P3155dn is compatible with Apple AirPrint, Google Cloud Print and Mopria.",
    "In our testing, Kyocera’s Ecosys P3155dn printed all documents without a hitch or a jam. It really does print as promptly from a standing start as the brochure claims, turning out duplex documents at around 39 ppm, which is almost as fast as our current record holder, the Xerox VersaLink B600DN.",
    "It churns quickly, but not noisily, and the quality is consistently high. The print resolution is better than most mono printers at 1200 x 1200 dpi, so there’s no loss of detail when printing black and white photographs. With photos, the toner is applied evenly to solid areas of black, so you don’t see the streakiness that photocopies usually suffer from. In fact, some of our monochrome prints looked good enough to frame.",
    "Plain text documents look crisp and dark with well-defined individual characters, even at very small point sizes. The results look best with smooth laser paper, but it’s not intolerant of cheap paper either. Kyocera says anything between 80gsm to 220gsm is fine for duplex printing.",
    "The Ecosys P3155dn looks and feels like a premium machine and justifies its hefty price tag with impressive specifications and excellent print quality. It’s one of the fastest machines we’ve tested and it was hard to fault the test pages flying out of it.",
    "It’s a pity there’s no built-in Wi-Fi by default, or NFC connectivity, and it lacks a touchscreen, but its high capacity for paper and toner makes it ideal for a busy workgroup looking for a reliable and economical printer."
  ],
  "headers": {
    "3": "Design",
    "8": "Features and specifications",
    "12": "Setup and operation",
    "16": "Performance",
    "19": "Final verdict"
  },
  "links": {
    "Kyocera Ecosys P5206cdw": "https://www.techradar.com/reviews/kyocera-ecosys-p5026cdw",
    "Xerox VersaLink C500DN": "https://www.techradar.com/reviews/xerox-versalink-c500dn",
    "Xerox VersaLink B600DN": "https://www.techradar.com/reviews/xerox-versalink-b600dn"
  }
}