{
  "source": "https://www.techradar.com/reviews/sigma-70-200mm-f28-dg-os-hsm-or-sports-review",
  "title": "Sigma 70-200mm f/2.8 DG OS HSM | Sports review",
  "category": "cameras",
  "updated": "2019-01-25T15:05:56Z",
  "author": "matt-golowczynski",
  "summary": "Feature-packed telephoto zoom that doesn't cost a fortune",
  "verdict": "It's something of a beast in the hands, but if you can tolerate that then the 70-200mm f/2.8 DG OS HSM | Sports will reward you with excellent all-round performance. The fact that Sigma has managed to deliver it at this price makes it all the more impressive.",
  "pros": [
    "Very effective image stabilisation",
    "Great build quality",
    "Sharp results, even wide open at f/2.8",
    "Superb control over chromatic aberration"
  ],
  "cons": [
    "Zoom ring position might bother some",
    "Heavy, even by 70-200mm f/2.8 standards",
    "Some vignetting (particularly at 70mm end)",
    "Tripod foot can't be removed"
  ],
  "article": [
    "Sigma may have won much praise for many of its recent prime lenses, but the company has also steadily been updating its collection of zooms. The 24-70mm f/2.8 DG OS HSM | Art and 14-24mm f/2.8 DG HSM | Art arrived over the past couple of years, and now, with the 70-200mm f/2.8 DG OS HSM | Sports lens, the company has completed a trinity that covers the full 14-200mm range without once dipping below a maximum f/2.8 aperture.",
    "Thanks to their wide focal range and bright maximum aperture, 70-200mm lenses are frequently relied upon by professionals working across all kinds of disciplines, from wildlife to weddings and everything in between. The lens on test certainly appears to have been specced to an uncompromising standard on paper, and its price seriously undercuts those of its competitors. So, it will no doubt catch the attention of many users looking to save money without wanting any corners to be cut.",
    "Despite being significantly cheaper than Canon’s EF 70-200mm f/2.8 L IS III USM offering, and almost half the current street price of Nikon’s equivalent 70-200mm f/2.8E AF-S FL ED VR option, there are no obvious holes in the spec sheet; everything we expect at this level is present.",
    "The optical array comprises 24 elements spread across 22 groups, and this includes nine FLD pieces of glass and a single SLD lens, all of which are used to help control chromatic aberration. That’s quite some step up from the two FLD and three SLD elements found in the lens’s eight-year-old predecessor.",
    "Multi-Layer coatings have also been applied to banish flare and ghosting, which in turn should help to keep contrast high, while an impressive 11 diaphragm blades should help to keep bokeh looking natural.",
    "Focusing is handled by the company’s longstanding Hyper Sonic Motor technology, which uses ultrasonic vibrations to drive the focusing group. The lens can focus as close as 1.2m away from the subject - about average for such a lens - although a switch on the barrel allows the user to restrict this to a smaller range between 3m and infinity, which should help to speed things up when capturing more distant subjects.",
    "Manual focus is also possible, as is Manual Override (MO). With this latter feature, the user is able to continue using autofocus as normal, before making any final manual adjustments using the focusing ring around the lens. This is particularly useful when capturing moving subjects, which may move slightly just prior to capture.",
    "Those wanting to get the most out of the lens will be pleased to know that it’s also compatible with a broad range of accessories. This includes the Sigma's TC-1401 and TC-200 teleconverters, which boost the effective focal range to 98-280mm and 140-400mm respectively, as well as the USB Dock that allows firmware to be updated and both AF and image stabilisation to be tweaked.",
    "Finally, the lens can be mounted onto a tripod through a foot attached to the lens barrel, and this clicks as it passes through 90º points when rotated. Its design also ensures compatibility with the Arca Swiss system, although this foot can't be removed from the lens, only rotated out of the way.",
    "We certainly don’t expect 70-200mm f/2.8 lenses to be modest in size nor weight, and the 70-200mm F2.8 DG OS HSM doesn't subvert expectations. In fact, its weight of 1,805g makes it around 265-325g heavier than its peers, while its 82mm filter thread and 94.2mm diameter are both relatively wide.",
    "The lens certainly feels robust enough in the hands, though. Magnesium alloy has been used for the barrel to keep it sturdy, while the mount has been fashioned out of brass. Dust- and splash-resistance comes courtesy of internal seals around all vulnerable points, and these are complemented by an external rubber seal at the mount, as well as water- and oil-resistant coatings on the front and back elements.",
    "In terms of operation, Sigma has kept the order of controls to the same format as with its previous 70-200mm 1:2.8 EX DG OS HSM. This includes a zoom ring positioned right towards the front of the barrel and a focusing ring behind this. Quite which way around these should be is a matter of personal preference, as it's common to see one setup as much as the other, although many photographers do prefer to have the more commonly used zoom ring closer to the body where it's easier to reach.",
    "A collection of switches lines one side of the barrel, namely focusing mode, focus limit range, optical stabilisation and a custom setting control. These are quite flush to the barrel but easy to flick and they move between positions with a pleasing positivity. The lens also sports a triplet of buttons, and these can be customised to perform different focusing tasks.",
    "The camera's autofocus system delivers a strong performance throughout its focusing range. Whereas some lenses are characterised by manic movements followed by a final shift for accuracy, the lens on test moves smoothly but surely between different focusing points, without the hesitation we sometimes get just prior to confirming focus. There is a little noise as this happens, although this isn't too distracting. Certainly if you turned off any beeps from the camera, you could realistically use this lens in more discreet environments without too much bother.",
    "The Intelligent OS system promises a maximum four stops of correction, which equates to around 1/13sec at 200mm, although testing shows that a steady hand can yield even better results. A number of images captured at 1/10sec appeared acceptably sharp (even if it wasn’t possible to achieve this consistently) but it was surprising to find images at 1/8sec and even 1/5sec to be rendered much to the same extent. It’s worth noting that this is with a 22MP full-frame camera, and that higher resolution models such as the Canon EOS 5DS and Nikon D850 may give more raise to slightly more blur when images are viewed at 100%. Even so, this is still a very good performance indeed.",
    "Vignetting can be seen at both ends of the focal range, although it takes longer to lift from the 70mm end as you progressively stop down the aperture. It's only when you get to f/5 that it's almost all gone, although even this is only really visible when shooting a uniform subject. The lens fares better at the telephoto end, with mild-moderate vignetting wide open, but this quickly improves at f/3.2 and past f/4 it's not really an issue.",
    "There's very little curvilinear distortion at the 70mm end, although there's a touch of more noticeable pincushion distortion at the 200mm. Again, however, this is only really visible when capturing subjects with defined linear details, rather than something that you'll see in general everyday use.",
    "Something that's particular impressive is control over chromatic aberrations, although with so many low-dispersive elements in the optical array, this shouldn't come as too great a surprise. Only very minor traces of lateral chromatic aberration can be seen towards the edges of the frame at 70mm, and there's even less at 200mm. More impressive is control over axial chromatic aberration the centre of the frame, which is virtually absent.",
    "Sharpness is already strong at both ends of the lens at f/2.8, as is consistency across the frame, and this only gets better as you close down the aperture. At middle-range apertures such as f/5.6, details are already so well defined that you only need a modest touch of sharpening when processing Raw files, otherwise more natural elements can appear overly sharp.",
    "There's a lot to love about this lens. With excellent detail at even wider apertures, great control over chromatic aberrations, very effective image stabilisation and prompt autofocus, it delivers what the professional demands at this level. Great build and weather sealing make it even more competitive, as does that price tag. It's not a cheap lens, but you get an impressive performance for the money.",
    "No lens is faultless, and the minor chromatic aberration and more visible vignetting visible here are worth noting, although both can be easily rectified. Possibly more of a pain is the fact that the lens is relatively heavy, and the fact that the tripod foot cannot be removed may bother those who tend to work handheld. Even so, these are minor marks against a lens that deserves serious attention. Bravo, Sigma!"
  ],
  "headers": {
    "2": "Features",
    "9": "Build quality and handling",
    "13": "Performance",
    "19": "Verdict"
  },
  "links": {
    "24-70mm f/2.8 DG OS HSM | Art": "https://www.techradar.com/reviews/sigma-24-70mm-dg-os-hsm-art",
    "14-24mm f/2.8 DG HSM | Art": "https://www.techradar.com/reviews/sigma-14-24mm-f28-dg-hsm-or-art",
    "Canon EOS 5DS": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/canon-eos-5ds-1283846/review",
    "Nikon D850": "https://www.techradar.com/reviews/nikon-d850-review"
  }
}