{
  "source": "https://www.techradar.com/reviews/ulefone-power-5s-rugged-smartphone",
  "title": "Ulefone Power 5S rugged smartphone review",
  "category": "phones",
  "updated": "2019-06-11T07:10:13Z",
  "author": "desire-athow",
  "summary": "A big phone in every sense",
  "verdict": "13,000mAh battery, FHD display, 4GB of RAM for under $200. The Ulefone Power 5S is a tantalising beast. If you can survive with 330g in your pocket and no NFC, then it may well be the phone you need.",
  "pros": [
    "Cheap for what it offers",
    "Wireless charging",
    "Facial recognition",
    "Massive battery life",
    "Solidly built"
  ],
  "cons": [
    "No NFC",
    "Doesn’t do two SIM cards AND microSD",
    "No 802.11ac"
  ],
  "article": [
    "Ulefone is one of the better known Chinese smartphone vendors outside the big eight (Huawei, Vivo, Xiaomi, OPPO, Honor, Meizu, OnePlus and Lenovo). Yes they do vie for scraps but in a market of more than hundreds of millions of potential customers, without barely any foreign brands, even fractions of a percent can be big money.",
    "We have tested a handful of Ulefone devices over the years: the original Armor, Armor 2, Armor 3, Armor 5, Armor 6. All were rugged smartphones, a vertical that has proved lucrative for a number of vendors over the years as margins on traditional smartphones have dwindled.",
    "The Power 5S is not a rugged smartphone per se but its built says otherwise and its unique selling point, a massive 13,000mAh that doubles as an emergency portable battery charger will be handy for remote workers as well.",
    "You immediately notice the heft of the Power 5S the moment you pick it up. It weighs in at 330g with its power supply unit adding another 48g. Think it is heavy? Compare that to the Anker PowerCore 13000 which has a similar battery capacity and weighs in at 255g. Granted the latter comes with additional ports and electronics but still, it means that the Power 5S is not actually that bad.",
    "And at 169 x 80 x 16mm is quite a handful; note here that the device sports a 6-inch display which warrants a bigger chassis. The Power 5S exhibits traits of a rugged phone; flushed display, exposed rear screws, an eight-edge design and massive bezels.",
    "Its front harbours two cameras, a status light and a sensor; there’s a downward firing speaker and no 3.5-mm headphone jack although you will be able to a type-C audio adapter to connect headsets with that legacy port. A Type-C connector can be found at the bottom of the device, a SIM tray on the left and the volume rocker, the fingerprint scanner, the power button and a dedicated camera button. Press that one for a few seconds and it will bring up the sound recorder app.",
    "The rear houses two camera with an LED flash and the Ulefone logo. Metal is used to reinforce the frame with an oleophobic layer on the front glass and plastic (that looks like leather) on the back.",
    "The Power 5S uses a mid-range MediaTek Helio P23 MT6763T SoC with eight cores and 4GB of RAM. There’s 64GB onboard storage and a 6-inch 2160 x 1080 pixel IPS display manufactured by AUO Display. Given its mainstream status, we were disappointed to see a lack of 802.11ac Wi-Fi.",
    "The phone has four cameras, 21MP and 5MP at the back - both from Sony and a pair of 8MP and 5MP sensors in the front; all four should be more than adequate for most imaging tasks. Given the capacity of the battery, a beefy 25W charger (5V,5A) has also been included.",
    "Ulefone judiciously added face recognition to the Power 5S which worked fairly well during our test. There’s also QI wireless charging (up to 10W) and yes you will be able to use the phone as a powerbank to charge others. The smartphone runs on Android 8.1 stock using a standard (i.e. clean) skin, no bloatware or modifications noticed. Sadly, it doesn’t do triple play (i.e. dual nano SIM cards running concurrently with one microSD one).",
    "The device hits average numbers on most benchmarks; that was expected given the processor and the GPU that it sports. Its large amount of system memory and its relatively clean Android version means that it will seldom stutter on common, non-gaming tasks.",
    "The screen is bright, with good contrast and colour reproduction and - as expected - sharp given the high pixel density.",
    "The Blackview P10000 Pro is the obvious competitor; it has a 11,000mAh battery but uses an older processor. It does have real leather at the back although we’re not sure whether that will be enough to hide the fact that it is more than half more expensive than the Power 5S and that it doesn’t do wireless charging. A pass from us.",
    "The Homtom Zoji Z11 is half as expensive as the Blackview P10000 Pro, at $150, and is IP68-rated. It has a lower screen resolution which could reduce power consumption, it doesn’ do NFC and its 10Ah battery falls short of the Ulefone Power 5S. Tempting at this price but we’d rather get the Power 5S because of the better camera setup.",
    "The Oukitel WP2 was a bit of a mixed bag when we reviewed it. It has a smaller battery (10Ah) but does come with NFC, a nifty flashlight feature and IP68 rating. However it has a higher price point at $200, a slower processor and microUSB rather than Type-C. And of course, no wireless charging. A pass from us again.",
    "The Power 5S is a 13,000mAh smartphone that doesn’t actually look silly like the now defunct Energizer Power Max P18K Pop which had an 18,000mAh battery. It sells for a fraction of what the latter aspired to. The combination of a big battery and relatively cheap price tag is appealing enough for most. Add in the fact that it is solidly built (rugged without any IP-rating though) and can be wirelessly charged and you have a winner.",
    "Yes, you may not have the level of after sales (and accessories) support you’d get from Xiaomi, Samsung or Huawei but then again, this is a different proposition and it hit a sweet spot. It won’t sell loads but it will get heads turning with a unique selling point.",
    "Usual caveats aside, the only improvements we would suggest are a smaller screen with a lower FHD resolution (that would help shave power consumption, size and weight). We’d gladly swap a 4GB/64GB configuration for 4GB/128GB if that’s possible; IP68 being optional."
  ],
  "headers": {
    "3": "Design",
    "7": "Hardware",
    "9": "In use",
    "12": "Competition",
    "15": "Final verdict"
  },
  "links": {
    "Armor": "https://www.techradar.com/reviews/ulefone-armor",
    "Armor 2": "https://www.techradar.com/reviews/ulefone-armor-2",
    "Armor 3": "https://www.techradar.com/reviews/ulefone-armor-3",
    "Armor 5": "https://www.techradar.com/reviews/ulefone-armor-5",
    "Armor 6": "https://www.techradar.com/reviews/ulefone-armor-6-rugged-smartphone",
    "portable battery charger": "https://www.techradar.com/news/top-portable-chargers",
    "Anker PowerCore 13000": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB00Z9QVE4Q%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6215334960621715000-20",
    "Blackview P10000 Pro": "https://bit.ly/2XKIS4d",
    "Homtom Zoji Z11": "https://www.techradar.com/reviews/homtom-zoji-z11-rugged-smartphone",
    "Oukitel WP2": "https://www.techradar.com/reviews/oukitel-wp2",
    "Energizer Power Max P18K Pop": "https://www.techradar.com/news/the-18000mah-energizer-phone-dies-an-undignified-death-after-funding-failure"
  }
}