{
  "source": "https://www.techradar.com/reviews/hp-officejet-pro-9025-all-in-one-inkjet-printer",
  "title": "HP Officejet Pro 9025 all-in-one inkjet printer review",
  "category": "computing",
  "updated": "2021-03-03T17:38:19.991Z",
  "author": "desire-athow",
  "summary": "This year’s printer cuvée gets more than just a fresh lick of paint",
  "verdict": "The HP Officejet Pro 9025 AIO is an excellent, all-rounder printer with an exhaustive list of features like large paper handling capacity, a big ADF tray and fast printing speeds. It will also appeal to small and medium workplaces interested in exploring the MSP-like Instant Ink concept with no commitment or annual fee.",
  "pros": [
    "Pretty fast (printing and scanning).",
    "Apps works well",
    "Clean, likable design",
    "Front USB",
    "500 page tray capacity",
    "Instant Ink compatible"
  ],
  "cons": [
    "No NFC",
    "Smaller display",
    "More expensive than the competition",
    "Smart Tasks don’t sync"
  ],
  "article": [
    "The OfficeJet Pro 9025 is HP’s brand new flagship all-in-one color inkjet printer aimed at the small and medium business market. It joins the growing ranks of HP business printers that offer compatibility with the company’s popular Instant Ink technology, which HP claims, can cut ink costs by up to 70% and automatically ordering ink when you’re running low.",
    "At the time of writing The printer costs $249.99 direct from HP and comes with a free $5 Instant Ink starter kit/prepaid e-code. The high yield CMY (Cyan, Magenta, Yellow) cartridges are $34.99 each, contain twice the ink volume of the normal ones and can print up to 1600 pages. The K (Black) version of it costs $53.99 and can print up to 3000 pages while the normal one costs $32.99 and prints 1000 pages only.",
    "A 3-pack of normal CMY cartridges retails for $63.99 ($22.99 if purchased individually) and can print up to 700 pages. The Instant Ink plan for business printing costs only $19.99 for 700 pages per month, that’s less than 3c a page, regardless of whether you print colour or black with each additional 20 pages costing $1. That is a particularly enticing package for digital agencies or businesses that print a lot of pages in colour but not for your average SoHo that prints out mostly monochrome documents.",
    "You can also purchase a 3-year next day exchange HP care back for $85. Well worth it if the printer is a critical part of the work process of the organisation (e.g. to issue invoices or print presentations).",
    "The HP Officejet Pro 9025 is the direct successor to the 3-year old HP Officejet Pro 8720. It embraces a monolithic, white/dark gray design with sharp edges and a clear move away from the smoother, pebble-like design of its predecessor. HP claims that re-engineering the printer helped save space. A lot, with the 9025 being up to 39% smaller than the 8720.",
    "At 396 x 437mm, it still requires significant desk space plus some extra clearance for the fold out paper tray. It is heavy at 12Kg and requires about 60cm of vertical clearance (when opening the scanning lid).",
    "HP designers opted for a minimalist approach: the LCD touch display has been shrunken; it is bright and responsive, not very large (6.75cm diagonally) making it difficult sometimes to get your requests through.",
    "There’s only two status lights and the power button is on the top while a lone USB port is located at the bottom to allow external storage devices to plug in. At the back are two RJ11 modem ports, one 10/100MBps Ethernet port and a USB 2.0 connector. A pop-out paper tray is present to catch printed material and two input paper trays: one standard A4 (250 sheets) and one multi purpose one (250 sheets).",
    "The usual caveats apply to print speed. It depends on what you print, how you connect to your printer, what sort of computer you have, what application you are printing from and what’s running in your background (and a host of other things). Then there’s the obvious parameters like printing resolution and the quality of print.",
    "The HP Officejet Pro 9250 is rated at 24ppm (black), 20ppm (color) and 39ppm (draft), with a maximum resolution of 1200 x 1200 dpi in black and color and up to 4800 x 1200 dpi on HP Advanced photo paper. In both cases, HP marketing literature mentions buzzwords like rendered and optimized, which may allude to some level of tweaking.",
    "First pages are out as fast as 9s/10s for black and color prints while the monthly duty cycle and the recommended monthly page volume stands at 30,000 and 2000 pages respectively.",
    "We printed four pages of photos from Microsoft Word in less than one minute with the printer starting the process within six seconds. That was on the default setup and one thing that surprised us was how noisy it was; we measured up to 64dB standing just next to the printer. The other thing worth mentioning is the lateral vibration that this printer produces. It is significant and worth keeping in mind.",
    "Push the print resolution to maximum and selecting best with photos from the printer menu increased the printing time dramatically. The first page didn’t come out till the 91st second and we had to wait a whole 4:15 minutes for the four pages to be printed.",
    "The printer is at its best when printing office documents, it is not, after all, a photo printer. A five-page document printed from Google Docs with 1866 words was despatched in 22 seconds with the first paper out in less than seven seconds. Impressive!",
    "Print quality depends on the paper and the print mode and there’s a level of subjectivity. On normal paper, we found the photos to have some banding and slightly muddied at default print setting. When the resolution was pushed to maximum, the result was not much better, due to the intrinsic nature of office print paper. The amount of ink projected on the A4 sheet meant that the print out was still slightly damp in the paper tray.",
    "HP says that the Officejet Pro 9250 can scan up to 24ppm (black) and 20ppm (color) with a resolution of up to 1200dpi. It is equipped with duplex ADF (auto-document feeder) capabilities and can accommodate up to 35 sheets.",
    "Using the HP Smart app on Windows 10 with the default setting (150dpi, single sheet, medium compression and output to PDF), we managed to scan our sample set of documents (old bank statements) in 156 seconds. That’s a speed of about 27ppm for 72 pages or 36 sheets; not bad at all. Yes, that’s more than the theoretical limit of 35 and we’re pretty sure that you will be able to scan 40 sheets without much trouble.",
    "The scanning quality is adequate and you can save in PDF, JPEG or TIFF formats. From the multifunction printer you can either scan to email, folder, sharepoint or thumb drive. You will also be able to send them to Dropbox, Google Drive, Onedrive and more",
    "A 1.2GHz dual-core processor powers the printer and it is backed by 512MB memory; its wireless capabilities extend to 802.11n and it is compatible with a number of mobile printing standards (e.g. AirPrint).",
    "Smart Tasks is heralded as one of the stand out features of the Officejet Pro 9025. These are essentially routines/scripts/macros that HP claims, can slash the time it takes to complete a task by half. You can create your own or you can use the existing four (see below). During our test, we found that the Smart Tasks on the printer didn’t sync with our desktop or smartphone app.",
    "The all-in-one printer also incorporates some interesting security features usually found on business laptops like automatic firmware recovery (self-healing BIOS), firmware integrity/secure boot, run-time integrity and automatic firmware update, all of which attempt to eliminate the risk of BIOS tampering by a third party. In addition, the MFP offers WPA Enterprise Wi-Fi encryption as well as secure Wi-Fi direct to harden the device’s wireless connectivity.",
    "The embedded web server feature is useful for larger offices, multiple users or for system administrators as it allows you to set access rules and control the onboard firewall. But it will likely be shunned by non-technical users because of its inherent complexity.",
    "The Canon Maxify MB5120 is the not-so-obvious rival to the HP Officejet Pro 9025. Not so obvious as it is far cheaper - at $205 - than its rival. The next step up, the MB5420, is far more expensive at $305. The MB5120 holds its ground against the 9025 with a bigger touchscreen and a similar duty cycle but half the paper holding capacity and fewer features like voice-activated printing.",
    "Brother’s MFC-J995DW all in one printer is even cheaper at $150 and it comes with up to 1-year of printing included, which is not only incredibly ambitious but cheap as well. The ink cartridges as well are far more substantial than the competition with Brother promising 3000 pages for the black cartridges and 1500 page for the colour ones. It does have an array of useful features including NFC.",
    "With a suggested retail price of $300 but often available for as little as $200, the Epson WorkForce Pro WF-4740 is perhaps the most formidable rival to the Officejet Pro 9025. It’s 50-page ADF is the highest of its class while its 4.3-inch touchscreen LCD is the biggest. It has both Wi-Fi Direct and NFC and matches HP’s paper loading capacity.",
    "For the sake of simplicity, we haven’t looked at color laser all-in-one-printer printer options. Note that all prices are at the time of writing and may fluctuate depending on ongoing promotion",
    "Product comparisons are snapshots in time and even within a review, it is a perilous exercise hence why, as readers, you need to do your evaluate your aspirational purchase based on up-to-date pricing (e.g. promotional sales) or features (firmware updates), in the territories where you are located.",
    "Back to the HP Officejet Pro 9025, it is a very capable SoHo, small and medium business printer. As expected, photo printing was not its forté and it is not a speed champion. For the rest, it delivers everything one could have expected from it and more. We’re not big fans of smart task but there are use cases where they can be useful."
  ],
  "headers": {
    "1": "Printer costs",
    "4": "The design",
    "8": "Print speed and quality",
    "15": "Scanning speed and quality",
    "18": "Other notable features",
    "22": "The competition",
    "26": "Final verdict"
  },
  "links": {
    "OfficeJet Pro 9025": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-3458835349615541000&p=https%3A%2F%2Fstore.hp.com%2Fus%2Fen%2Fpdp%2Fhp-officejet-pro-9025-all-in-one-printer",
    "all-in-one color inkjet printer": "https://www.techradar.com/news/best-all-in-one-printer",
    "$249.99 direct from HP": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-6006948360459254000&p=https%3A%2F%2Fstore.hp.com%2Fus%2Fen%2Fpdp%2Fhp-officejet-pro-9025-all-in-one-printer",
    "Canon Maxify MB5120": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-6368588165834796000/https://shop.usa.canon.com/shop/en/catalog/maxify-mb5120",
    "MFC-J995DW": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FBrother-MFC-J995DW-Printing-Included-Replenishment%2Fdp%2FB07D5VJDF6%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7894521687339435000-20",
    "Epson WorkForce Pro WF-4740": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-6405895364226111000/https://epson.com/For-Work/Printers/Inkjet/WorkForce-Pro-WF-4740-All-in-One-Printer/p/C11CF75201"
  }
}