{
  "source": "https://www.techradar.com/reviews/oneplus-7t-pro-review",
  "title": "OnePlus 7T Pro review",
  "category": "phones",
  "updated": "2020-04-14T08:46:02Z",
  "author": "james-peckham",
  "summary": "The OnePlus 7T Pro is more of the same – but is it a problem?",
  "verdict": "The upgrade here over the OnePlus 7 Pro is minuscule, but the OnePlus 7T Pro may be perfect for you if you have an older phone that you’re looking to replace. The display is beautiful, there’s lots of power, and it’s all likely to come for a lower price than you’d expect from other flagship handsets.",
  "pros": [
    "Smooth and beautiful display",
    "Great design",
    "Pop-up camera is fun"
  ],
  "cons": [
    "Still no wireless charging",
    "Limited upgrade",
    "Camera can struggle"
  ],
  "article": [
    "The OnePlus 7T Pro is a strange phone – in fact we’re not entirely certain about why it even exists, as the upgrade here over the OnePlus 7 Pro is minuscule; however, that doesn’t make it any less of a great phone to buy right now.",
    "OnePlus has undeniably made its most impressive device yet with the 7T Pro, but if you’ve already bought the 7 Pro you won’t be missing out by not upgrading.",
    "The big highlight of the OnePlus 7T Pro is its 90Hz 6.67-inch display, with no notch or cutout to get in the way of what you’re watching or playing on your phone.",
    "That higher refresh rate means whatever you’re scrolling through on your display loads faster than on other devices, and it gives your social media feeds a smooth feeling that you won’t get on most smartphones (although some other specific gaming phones include this feature).",
    "The 7T Pro doesn’t have a notch because it sports a pop-up camera that only appears from the top of your phone when you need it. This unique feature is sure to turn some heads when you’re showing the phone off, but it’s not a reason particularly to buy the handset.",
    "It also boasts strong all-day battery life, so you’ll be able to use your phone intensively and be confident that it’s going to last for a whole day from a single charge.",
    "It’s not the perfect phone – neither the camera nor the power are the best we’ve seen – but overall this is an impressive handset that’s likely to cost less than a lot of the competition.",
    "The OnePlus 7T Pro isn't available in the US or Australia, but you can buy it from most other regions. Those in the US are only able to buy the OnePlus 7T from the company's latest range of devices.",
    "It costs £699 in the UK and AED 2,699 in the UAE, which is £50 / AED 300 more than the most basic version of the OnePlus 7 Pro. That's likely because the standard version of the phone now comes with more storage. It was released on October 17, 2019.",
    "If you’ve used the OnePlus 7 Pro, you’ll be familiar with most of the design language here. It’s actually quite difficult to tell the 7T Pro apart from the 7 Pro, but that’s not an issue as that was a great-looking device.",
    "The back of the phone has a matte finish, and there’s only one color available called Haze Blue that you can see pictured throughout this review.",
    "The device itself is quite large in order to facilitate that big display, and that may make it difficult to hold for those with smaller hands. It’s a comfortable device to have in your hand, though, thanks to the rounded edges of the rear and the matte finish.",
    "The 7T Pro measures 162.6 x 75.9 x 8.8mm and weighs 206g, making it one of the heftier handsets we've seen recently.'",
    "On the bottom edge of the OnePlus 7 Pro are the SIM tray, USB-C port and a single speaker. You won’t find a 3.5mm headphone though, as that’s a feature OnePlus dropped a while ago.",
    "It’s also important to note that the OnePlus 7T Pro doesn’t come with an IP water resistance rating – the company doesn’t submit its phones for testing by the body that issues that standard – so you probably shouldn’t get this device wet to ensure it doesn’t get damaged, although that’s not to say it won’t survive the odd splash.",
    "One of the highlights of the OnePlus 7T Pro is its gorgeous, large display – in this respect the phone can compete with any other top-end handset you may be considering.",
    "It’s a 6.67-inch display that’s slightly curved at the side edges and looks gorgeous when you’re holding the phone. The resolution of 3120 x 1440, which comes out to 516 pixels per inch.",
    "The icing on the cake display-wise is that, unlike a lot of other handsets you may be considering, there’s no notch, punch-hole or anything else encroaching on the display.",
    "Instead, the front-facing selfie camera sits within a pop-up mechanism that comes out of the top of the device whenever you activate the shooter. It’s a feature we found to work well when it was introduced on the OnePlus 7 Pro, and the camera deploys just as swiftly and smoothly here.",
    "If you’re worried about snapping this camera off when it’s poking out of the top of the phone, we’d say that’s very unlikely. It’s possible that you could damage it by knocking it or dropping the phone, but the OnePlus has included a feature that detects if you’ve dropped the device, and automatically retracts the camera to help it survive the fall.",
    "We found the maximum brightness on the display to be impressive, and overall everything we did on the device looked good. As mentioned, the display boasts a 90Hz refresh rate, which is a rarity in smartphones – most current handsets have screens that refresh at 60Hz.",
    "What does that mean in practice? It means the display here refreshes 1.5 times faster than those on most other phones, which makes for a smoother viewing experience.",
    "This is particularly noticeable when you’re gaming, or scrolling through social media feeds such as Twitter or Instagram. It may not be something you’re instantly aware of, but once your eye gets used to it you’ll notice the difference if you switch back to a 60Hz handset.",
    "There’s also a fingerprint scanner embedded in the display. This is easy to reach, and we found that it worked quickly and accurately throughout our testing period, being by far the easiest way to unlock the phone.",
    "You can still use patterns, your PIN or Face unlock instead of your fingerprint, but we found the most efficient option was to use the in-screen scanner.",
    "OnePlus has furnished the OnePlus 7T Pro with the latest and greatest chipset from Qualcomm, the Snapdragon 855 Plus. That’s paired with 8GB of RAM, making this a powerhouse of a phone.",
    "The phone is only available with 256GB of onboard storage, with no option to expand this via SD card much like other OnePlus phones. That’s more than enough for the average person though.",
    "The power on this phone is also impressive. In everyday use we didn’t encounter any problems with stuttering, and it’s able to load and run the latest games with ease.",
    "Our benchmarking tests include using Geekbench 5, and here the 7T Pro returned a score of 2584. It’s difficult to compare that score to other flagship phones at the moment as the Geekbench software has recently been updated so most of our benchmarking has been done on a previous version and isn’t easy to compare. We’ve run Geekbench 5 on the Samsung Galaxy S10 Plus 5G, which scored 2197.",
    "It was beaten in the same test by the Sony Xperia 5, which scored 2655, while the iPhone 11 blew it, and all other contenders, out of the water with a score of 3186.",
    "That said, we found that the 7T Pro performed everyday tasks without issue, and it’s unlikely that you’ll notice those benchmarking results reflected in your day-to-day experience.",
    "The OnePlus 7T Pro arrives running Android 10 software, but Android here doesn’t look like it does on other smartphones, as it’s a specific overlay made by OnePlus called Oxygen OS.",
    "It’s designed to have a unique look that matches with the OnePlus branding, and you also get a few OnePlus-exclusive features thrown in for good measure.",
    "Everything looks great within the software, but if you’re used to stock Android, or another manufacturer’s take on Android, you may find it takes you some time to adjust.",
    "Extra features included within the latest version of Oxygen OS are a dark mode – we found it looked stylish across the entire system – and you also get existing features such as Zen mode, which prompts you to turn your phone off to give yourself some peace and quiet.",
    "You can still access emergency numbers when you’re in Zen mode, but it’s designed to give you a moment’s peace when you’re easily distracted by your smartphone. It’s a unique idea and you may find it useful within the software.",
    "The rear camera array on the OnePlus 7T Pro is a triple-camera setup, with a 48MP main snapper joined by 16MP ultra-wide-angle and 8MP telephoto options.",
    "In general the OnePlus 7T Pro can take some good-looking shots, but it doesn’t have the best camera we’ve seen on a smartphone.",
    "While image sharpness has been improved recently on OnePlus’s cameras, like its predecessors the 7T Pro struggles in low-light conditions, with images looking noisier than we’d expect from a phone at this price point; there is, however, a Nightscape mode for when you need to shoot in the dark, which we found to produce generally good results.",
    "The ultra-wide camera came in useful on multiple occasions during our time using the phone, and it’s especially appreciated when you need to squeeze more of a scene, or more people, into the frame.",
    "The telephoto lens is impressive too, enabling you to zoom in on subjects without sacrificing image quality – below you can see comparison shots taken with the ultra-wide, normal and telephoto lenses.",
    "Video shot on the 7T Pro looked good, and you can shoot 4K footage if you want maximum quality.",
    "The pop-up selfie camera is 16MP, but while that number looks good on paper, it isn’t the most impressive selfie camera we’ve used. It’s fine for the kind of shots you’ll be uploading to social media, but that’s about it.",
    "The 4085mAh battery in OnePlus 7T Pro performs admirably, matching the OnePlus 7 Pro and perhaps even exceeding it in some regards. We found it would comfortably last a whole day on a single charge, even with extensive usage.",
    "During the week-long period we were using the phone, on only one day did we need to recharge it before turning in for the night at around 11pm, and that can’t be said of every smartphone on the market right now.",
    "We run a battery test where we play a 90 minute video with the screen on full brightness and we found this phone only dropped 10% of its battery from a full charge. That's quite an impressive score considering other top-end phones.",
    "Fast-charging technology is where OnePlus has put its focus on this device, and we found we could top up the 7T Pro quickly when we needed to, using the included charger.",
    "OnePlus says this phone charges 23% faster than previous OnePlus devices, and while weren’t able to test that specific claim, we did find that it charged fast enough for us to be able to plug it in for 20 minutes and get enough juice to last us through the day.",
    "Once again OnePlus is placing the emphasis on fast charging rather than including wireless charging on a phone. OnePlus remains convinced that wireless charging isn’t a useful feature, but it’s a noticeable omission here given that top-end devices from the likes of Samsung and Apple include it.",
    "You want more for less",
    "The OnePlus 7T Pro won’t be as affordable as the OnePlus 7T, but knowing OnePlus’ normal pricing strategy you can expect this device to be cheaper than a lot of other top-end flagship devices. It won’t quite be a mid-range price, but it’ll certainly be more affordable than the best iPhone or Samsung Galaxy.",
    "You need long battery life",
    "We found the battery life on the OnePlus 7T Pro to be pretty impressive, and if you’re after a device with a large cell inside that can last you a full day without needing a recharge this will suit you perfectly. It’s not the very best battery life we’ve seen, but you’re unlikely to have the phone die on you before the end of the day.",
    "You want a smooth display",
    "Whether it’s for gaming or for checking your social media, it’s hard not to be impressed by the smooth 90Hz display on the OnePlus 7T Pro. We love the way it looks, and it’s likely to impress you as soon as you pick up the device.",
    "You’re looking for the very best camera phone",
    "Once again the camera on a OnePlus phone falls short of the standards being set by rivals, and if you’re after the best possible shooter you’ll want to aim for a device from Samsung, Google, Huawei or Apple.",
    "You want wireless charging",
    "Not including this feels like a miss on the part of OnePlus, as it’s something many people find extremely useful. Whether it’s because you want to clear the cables from your bedside table, or because you like to have a charging mat on your desk at work, this isn’t the phone to get if you’ve incorporated wireless charging into your daily routine.",
    "You need your phone to be waterproof",
    "OnePlus doesn’t have an IP rating for its smartphones, and that means it can’t guarantee that the device will be able to survive even a quick dip in water. That means you should probably keep it well away from the shower, let alone take it near the swimming pool.",
    "First reviewed: October 2019"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "OnePlus 7T Pro price and release date",
    "9": "Design",
    "15": "Display",
    "25": "Specs and performance",
    "31": "Software",
    "36": "Camera",
    "43": "Battery life",
    "49": "Buy it if...",
    "55": "Don't buy it if..."
  },
  "links": {
    "OnePlus 7 Pro": "https://www.techradar.com/reviews/oneplus-7-pro",
    "OnePlus 7T": "https://www.techradar.com/reviews/oneplus-7t",
    "Sony Xperia 5": "https://www.techradar.com/reviews/sony-xperia-5-review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "Android 10": "https://www.techradar.com/news/android-q",
    "best iPhone": "https://www.techradar.com/news/best-iphone",
    "Samsung Galaxy": "https://www.techradar.com/news/best-samsung-phones"
  }
}