{
  "source": "https://www.techradar.com/reviews/pipedrive",
  "title": "Pipedrive CRM platform review",
  "category": "computing",
  "updated": "2021-02-15T19:00:26Z",
  "author": "michael-graw",
  "summary": "A straightforward CRM platform with a visual sales funnel",
  "verdict": "Pipedrive is an easy to use CRM platform with a helpful visual sales funnel. However, the software is pricey and lacks features for generating leads.",
  "pros": [
    "Visual sales funnel with actionable alerts",
    "Extremely simple setup and user interface",
    "Real-time email syncing and calendar integration"
  ],
  "cons": [
    "Not many tools for lead generation",
    "Reporting requires third-party integrations",
    "Somewhat pricey for the tools available"
  ],
  "article": [
    "Pipedrive is a user-friendly CRM software platform that focuses on visualizing and managing your sales funnel. This platform is very simple to get started with and makes it simple to stay on top of emails, calls, and meetings. But, Pipedrive lacks some of the feature depth of similarly priced competitors.",
    "Pipedrive offers three plan tiers. The Essential plan starts at $12.50 per user per month and offers customizable pipelines, fields, and a dashboard. You miss out on some of the platform’s most helpful features at this price point, though.",
    "Those come with an Advanced plan for $24.90 per user per month. With this plan, you get email inboxes that sync in real-time, email automation and open tracking, highlighted fields to identify key information, and the ability to set user permissions for everyone on your team.",
    "The Professional plan is pricey, at $49.90 per month. It adds email distribution lists, call tracking, multiple customizable dashboards, and revenue forecasting. This plan also includes more admin features, including the ability to limit the visibility of contacts and deals to certain members of your sales team.",
    "Note that Pipedrive also offers an Enterprise plan, which can be further customized to fit your needs. This option starts at $99 per user per month for a minimum of 10 users, but you’ll need to contact Pipedrive for the actual cost for your business.",
    "On top of these plans, Pipedrive has introduced a new Leadbooster chatbot add-on. This tool costs an extra $32.50 per company per month.",
    "Pipedrive places most of its emphasis on your company’s sales funnel. It excels at tracking deals from inception to closing, as well as helping you manage all of the aspects of winning clients. However, Pipedrive doesn’t offer many tools for lead generation and you’ll need to rely on third-party integrations for reporting.",
    "The number one reason to use Pipedrive is its visual sales funnel. The platform makes it incredibly simple to see the status of all your deals in progress. The visual display includes alert icons to show which deals are ahead of schedule, which ones are stalled, and which ones have upcoming meetings on your schedule.",
    "Better yet, the sales funnel display is very customizable. You can add as many columns as you need to represent how your business manages prospective clients. Simply click and drag when it’s time to move a deal into the next stage of your pipeline. For companies with sales teams divided by geography or clientele, managers can create a different display for each team’s deals.",
    "Lead management is not Pipedrive’s strong suit. The platform doesn’t distinguish between leads and contacts. If your sales team doesn’t automatically market to every lead that comes its way, this can be a major pitfall to Pipedrive. You can add a ‘lead’ field to your contact forms, but it’s not quite as seamless as how many other CRM tools manage this process. It’s also not particularly easy to separate leads from clients after a deal has been closed.",
    "Pipedrive is also relatively limited when it comes to generating new leads. The platform allows you to set up web forms easily, but there’s no way to integrate the CRM software with social media or to automatically scrape contact details from email signatures. If you pay extra for the Leadbooster chatbot add-on, the bot can generate leads from your website automatically and even book meetings to jumpstart the sales process.",
    "Pipedrive offers integration with most major email clients, including Gmail, Outlook, and iCloud Mail. Sales reps can conduct all their emails from within the software thanks to real-time syncing, and emails are automatically tagged to a contact within your Pipedrive database. You can also track when your contacts open emails or click on embedded links thanks to live notifications.",
    "Email marketing is also supported within Pipedrive. The platform comes with a readily customizable set of email templates, and it’s simple to segment contacts using custom fields. Helpfully, the templates will automatically populate your emails with contact data for personalization.",
    "The platform also offers one-click calling and call recording. Recordings are automatically saved to the contact so you can refer back to the conversation later.",
    "An activity calendar is another useful productivity feature within Pipedrive. It integrates easily with your other calendars and presents a simple display of everything on your to-do list for the day. You can set reminders to follow-up with clients based within the activity calendar. Or, book select several open slots in your calendar and send those times to a contact in a meeting request form.",
    "Pipedrive is consistently easy to use. The platform requires very little setup when you first get started, and with a few tweaks you can add new deals to your sales funnel with just one click. All of the other management tasks from creating contacts to setting follow-up reminders are straightforward.",
    "On top of that, Pipedrive has useful visual cues to keep you and your team on task. The sales funnel has alert icons that allow you to immediately see if there’s something on your activity calendar for that deal or whether a deal is progressing or stalling. It’s simple to create reminders that can pop up in your inbox, on your screen, or on your phone.",
    "The Pipedrive mobile app (iOS and Android) is another benefit to this CRM platform. It’s just as easy to use as the desktop client and makes it easy to keep track of your schedule on the go. Plus, for sales reps in the field, there’s a map view that shows nearby contacts.",
    "Pipedrive offers excellent customer service. The English-language help line is open 24/7 and there are additional phone numbers for support in Portuguese, German, French, and Spanish. On top of that, Pipedrive offers email support and an extensive online documentation library.",
    "Pipedrive gives up features for lead generation and reporting in favor of ease of use. For a similar price, though, there are a couple options that offer much more functionality. Zoho CRM and Nimble are both surprisingly inexpensive and give you the ability to scrape contacts from social media. Zoho CRM also stands out for advanced reporting tools and integration with the entire Zoho business app ecosystem.",
    "Pipedrive is a capable CRM software that puts the user interface first. The visual sales funnel is a terrific feature, and everything from setup to bulk emailing is straightforward using this platform. However, Pipedrive is somewhat costly for what you get, and the platform falls flat on tools for lead generation and management."
  ],
  "headers": {
    "1": "Plans and Pricing",
    "6": "Features",
    "7": "Sales Funnel",
    "9": "Lead Management",
    "11": "Email and Productivity Tools",
    "15": "Interface and In Use",
    "18": "Support",
    "19": "The Competition",
    "20": "Final Verdict"
  },
  "links": {
    "CRM software platform": "https://www.techradar.com/best/the-best-crm-software"
  }
}