{
  "source": "https://www.techradar.com/reviews/devil-may-cry-5-review",
  "title": "Devil May Cry 5 review",
  "category": "gaming",
  "updated": "2019-03-06T16:00:18Z",
  "author": "jason-coles",
  "summary": "Dante want to live forever",
  "verdict": "Devil May Cry 5 is a magnificently over-the-top action game that serves as a good reminder of just how important showing off is.",
  "pros": [
    "Great character variety",
    "Beautiful visuals",
    "Exceptional soundtrack",
    "Embraces its absurdity"
  ],
  "cons": [
    "Story has some moments of poor pacing",
    "New players will feel a little lost"
  ],
  "article": [
    "It's been over a decade since our last chance to hack and/or slash up demons in Capcom's Devil May Cry series. In that time many things have changed, but the one thing that hopefully hasn't is the sheer joy of being the most stylish devil hunter around.",
    "A quick DMC refresher then: long ago a demon named Sparda rebelled against his kin and fought on the side of the humans his brothers sought to enslave. He fell in love with a human woman and they ended up having twin sons; Dante and Vergil. Dante has been the protagonist of Devil May Cry since its inception, but in Devil May Cry 4 new guy Nero took center stage.",
    "Devil May Cry 5 is set a few years after DMC 4, Nero has had his arm ripped off of his body and seeks revenge on the perpetrator, travelling with his friend Nico to the city of Red Grave. Meanwhile, Dante has come to Red Grave investigating a strange occurrence at the behest of the mysterious V – which isn’t a euphemism, but actually the name of a character.",
    "It is here that things go in a viciously horizontal direction very quickly and the excrement hits the spinning blades that help you stay cool. It seems some naughty so-and-so has decided to set down their roots in town – literally in this case as it is a gigantic demonic tree.",
    "This causes all sorts of issues like the town being torn apart, people being bled dry to feed the evil flora, and weird demons being absolutely everywhere. It is up to you then, to take control of Nero, V, and Dante in order to play the part of lumberjack/exterminator.",
    "Devil May Cry has always been an action-packed series. DMC 5 is no different, in fact, it may well be the best the series has ever been. Having three characters that you flit between during the story makes each mission feel more varied than ever before.",
    "Nero has an assortment of fragile, but exceptionally powerful, Devil Breaker arms at his disposal. He specializes in dragging enemies towards him and is a huge amount of fun to play while in the air. V is the biggest change in playstyle the series has ever seen. He rarely gets involved himself, instead opting to have his demonic friends do the fighting for him. You get to feel like an almighty puppet master, one who only ever gets his hands dirty when dealing the finishing blow. Then we have Dante. This legendary devil hunter uses a wide array of weapons and can change them in an instant. It makes for an incredibly fluid combat system that the other two characters can’t quite match.",
    "The story itself flits through time a little bit as well. Each of the missions is time-stamped so you know exactly where it falls in the timeline. While much of the game is chronological, it is fun to jump back a month to see what caused the present-day kerfuffle. For the most part the story keeps a good pace, though it has a weird dip around three-quarters of the way through that feels a bit dragged out. Thankfully, it doesn’t last long, and the pace returns to breakneck for the last part of the game.",
    "Devil May Cry 5's story is very much for veteran players of the series; throughout the game there are a plethora of references, winks, and emotional notes that you won’t get unless you have played all of the games. It can still be enjoyed as a newcomer, just not quite as much.",
    "The core of DMC has always been trying to show off as much as possible. You can dress it up however you like, but this is the crux of the game. In each fight you get into your aim is to be as stylish as possible. You do this by mixing up different attacks and never getting hit, all with the aim of hitting that SSS rank. If this style of action game isn’t your thing there is an auto-combo function which will allow you to hammer away at the buttons and still look damn good doing it. It means that you will never be punished because you can’t do it, the game is more than happy to help.",
    "It isn’t just a grade in this one either. As you do better in each fight you will hear the music build. It gets louder and more complex as you perform better. It is a wonderful bit of audio design that helps pump you up as you start doing well, doing away with the nerves that can sometimes come from a good performance.",
    "This flair for the dramatic is present throughout the entire game. Hell, Dante gets a hat at one point and launches into a dance number reminiscent of a certain thrilling popstar. The beautifully animated cutscenes all show off this same disregard for the reasonable. The game embraces its absurdity in a way that makes it clear it isn’t meant to be taken seriously. You are meant to be having fun, and fun is exactly what you will have.",
    "A run through of the game will set you back around 10 hours of your mortal life. Time well spent no doubt. However, to truly beat the game will take far longer, as you will unlock harder difficulty modes as you go. So, the experience itself will last far longer than the time spent enjoying the story. When you then add in the secret missions, hidden items, and then the mission’s rankings themselves, you could easily lose dozens of hours to this fiendishly good action game.",
    "That being said, the mission design is a little old-school. You go from arena to arena beating the hell out of each devil you find. The levels pretty much all end with a boss fight, with each boss being preceded by a phone booth. The phone booths allow you to spend orbs to level up and, if you’ve ever played an RPG before, they signal the boss fight in much the same way a save point would.",
    "Sure, the missions aren’t reinventing the wheel, but the game is so much fun that you’ll rarely be aware of that.",
    "Devil May Cry 5 is the action game equivalent of a grown-up goth kid. It looks better than it ever has before, it works a lot harder than it used to, and it still has the same music taste.",
    "Each fight is a genuine joy to get stuck into and seeing your rank climb and hearing the music swell never gets old. It does absolutely everything right for long-time fans when it comes to the story. Yet, the self-contained story is easy enough to follow for newcomers. The gameplay is the best it has ever been by a long shot too. So, while a devil may well cry, it won’t be because of this hellishly fun game.",
    "(Image credits: Capcom)"
  ],
  "headers": {
    "5": "Lights, camera, ACTION!",
    "9": "Smokin’ sexy style",
    "12": "Devils don’t die",
    "15": "Verdict"
  },
  "links": {}
}