{
  "source": "https://www.techradar.com/reviews/roccat-vulcan-122-aimo",
  "title": "Roccat Vulcan 122 AIMO review",
  "category": "computing",
  "updated": "2019-10-21T15:33:38Z",
  "author": "bill-thomas",
  "summary": "A piece of beauty",
  "verdict": "The Roccat Vulcan 122 AIMO is a gorgeous piece of gaming kit. It's got the aesthetics, the comfort and a unique design. It's expensive, but it's worth it.",
  "pros": [
    "Beautiful design",
    "Comfy keyswitches",
    "Easy to clean"
  ],
  "cons": [
    "Wrist rest isn't very comfortable",
    "Expensive"
  ],
  "article": [
    "The Roccat Vulcan 122 AIMO is the followup to the fantastic Vulcan 120 AIMO that came out about back at Computex 2018. Back when we reviewed that earlier model, we praised it for having a delightful aesthetic, along with a pleasant typing experience that worked both for gaming and productivity – a rare feat indeed.",
    "With the Vulcan 122 AIMO, Roccat understands that it hit gold with that original design, releasing this gaming keyboard more as a refinement than a revolution. The core difference here is the white color option. Beyond that, the Vulcan 122 AIMO is using the same key switches, has the same price point at $159 (about £120, AU$230). So, if you already have the Vulcan 120 AIMO, there's pretty much no reason to go with this gaming keyboard unless you absolutely need that clean aesthetic – which we really can't blame you for.",
    "Over the last couple of years, gaming peripherals have been going through kind of a renaissance. The edgy red and black designs that were so commonplace a decade ago are being phased out, being replaced by cleaner designs that really make RGB lighting pop. The Roccat Vulcan 122 AIMO, then, might just be the prime example of this new age of gaming peripheral design.",
    "In a lot of ways, the Roccat Vulcan 122 Aimo is pretty much the Roccat Vulcan 120 AIMO, but with a cleaner design. The general shape of the keyboard is the same, along with the elevated keycaps. But, it still manages to look completely different.",
    "Whereas the original keyboard had a black plastic body with the top consisting of a gunmetal-colored aluminum keyboard tray, the Roccat Vulcan 122 AIMO is white with a lighter-textured aluminum casing.",
    "This keyboard is simply stunning as a result. We don't know why more keyboard manufacturers don't jump on a clean design like this, as the RGB lighting really comes alive with this keyboard. Even in a bright office environment, this keyboard absolutely glows.",
    "The biggest benefit that this keyboard offers is the raised keycaps, though, and cleanliness is the name of the game. If you've had a keyboard for a long period of time, you'll know that no matter how diligent you are at keeping things clean, your keyboard will eventually be full of dust, hair, skin and all manner of disgusting particles. Cleaning it out typically requires pulling out all of the keycaps and spraying it with canned air. With the Roccat Vulcan 122 AIMO, you don't need to pull out the keycaps, just a quick spray with some canned air will get it looking good as new.",
    "Of course, you couldn't have a gaming keyboard in 2019 without it having dedicated software to control things like lighting, key assignments and macros. In fact, you can set custom sound feedback for typing.",
    "Now, there are four options, a \"Click Sound,\" a \"Typewriter Sound,\" a \"Beam Sound\" and a \"Sci-Fi Sound.\" The first two of these options aren't that bad, and will make it sound like you're typing even when you're wearing headphones, so you can have the same experience as your coworkers around you.",
    "However, the Beam Sound and the Sci-Fi Sound are two of the most annoying things we've had to deal with in our time on planet Earth. Turning it on in the process of writing this review results in a headache nearly immediately, sounding like we're in the middle of an intense space battle. It's too early in the morning for that, and will probably always be no matter what time it is.",
    "There's only one bit of the design we're not fans of. The wrist rest: it's just this piece of white plastic with no padding. For the amount of cash needed to pick up this keyboard, we would have liked to see something padded, especially since every other part of this keyboard is so comfortable to use.",
    "The Roccat Vulcan 122, rather than using the same Cherry MX keys that everyone else's keyboard uses, instead opts for Roccat's own Titan Switches. They feel pretty close to a Cherry MX Brown switch to our fingers, but even better.",
    "Now, we'll just come right out and say we prefer Brown switches, the rigid clickiness of Reds and Blues aren't really our cup of tea, likely because we spend a good amount of time typing. It's not going to be quite as fast, but it is comfy.",
    "Don't take that to mean that this keyboard can't perform with the best of them, though. It's not packed with something like Razer's new Optomechanical switches, but its still a fast and unique switch. Roccat claims that by reducing key bouncing, it allows your PC to recognize inputs up to 20% faster. We don't have the hardware to put that to the test exactly, but we can say that it feels faster than the average MX Brown key.",
    "Now, admittedly we didn't put this keyboard to the test in an esports title like Overwatch, but we don't think this keyboard is exactly aiming at that crowd anyway. Instead, the Roccat Vulcan 122 AIMO seems to be for folks that just want a premium experience, and it delivers.",
    "In Gears 5, the game felt just as fast as frenetic as ever, with the added comfort that the Titan Switches offer. Nothing feels like its holding our performance back, other than our lack of skill.",
    "We already mentioned how well these switches feel, but they're incredible for typing. If you're a gamer that needs to get some typing done either on the side or for your day job, this might just be the best keyboard out there.",
    "The Roccat Vulcan 122 AIMO is a winning gaming keyboard for a multitude of reasons. It's a comfy typing experience, easy to keep clean and just looks amazing. It's really hard to find things to complain about with the Roccat Vulcan 122 AIMO.",
    "The only negative point of this entire keyboard is the price – at $159 (about £120, AU$230), it may be hard to justify. But, if you have the cash to spare, you certainly do get your money's worth."
  ],
  "headers": {
    "2": "Design",
    "11": "Performance",
    "17": "Final verdict"
  },
  "links": {
    "Vulcan 120 AIMO": "https://www.techradar.com/reviews/roccat-vulcan-120-aimo",
    "Computex 2018": "https://www.techradar.com/news/computex-2018",
    "gaming keyboard": "https://www.techradar.com/news/gaming/10-best-gaming-keyboards-1295703"
  }
}