{
  "source": "https://www.techradar.com/reviews/bang-and-olufsen-e8-motion",
  "title": "Bang & Olufsen E8 Motion review",
  "category": "audio-visual",
  "updated": "2019-08-02T14:59:41Z",
  "author": "nick-rego",
  "summary": "Stylish audio while you work out",
  "verdict": "The Bang & Olufsen Beoplay E8 Motion look and sound great, and are easy to setup. The touch controls are responsive, while the ear fins make sure they stay in place during your workout – but the price tag may make you think twice about picking these up.",
  "pros": [
    "Excellent audio quality",
    "Easy to setup",
    "Comfortable fit"
  ],
  "cons": [
    "Doesn’t provide noise canceling",
    "Expensive"
  ],
  "article": [
    "Bang & Olufsen has always been known for creating stylish audio products, but would you ever take one of its headphones into the gym with you? That’s supposedly the purpose of the Bang & Olufsen Beoplay E8 Motion – a gym-worthy pair of headphones that joins the E8 lineup.",
    "We put the Bang & Olufsen Beoplay E8 Motion through its paces to see if it could keep up with our vigorous workouts, and whether or not it deserves a spot in your gym bag.",
    "With Bang & Olufsen products, you always pay a premium for style and design, and that reflects in the price tag for the Beoplay E8 Motion. Priced at AED 1,450 ($350 / £300 / AU$599) it’s much more expensive than other similar products that would probably be equally suited to the gym.",
    "The Bose SoundSport Free wireless headphones, for example, come in at AED 839 ($169 / £169 / AU$299) for nearly identical features. There’s Apple’s Airpods as well from AED 679 ($159 / £159 / AU$249), though they’re probably not the best for the gym as they'd pop out during vigorous workouts.",
    "You can’t fault B&O for their attention to detail – the Beoplay E8 Motion looks gorgeous, and anyone would love to show these off at the gym. The earphones themselves have the same design as we’ve seen previously in the E8 series, but with an enhanced ear tip that ensures a comfortable-yet-snug fit while working out.",
    "As with most earphones, you can adjust the size of both the ear fins and the ear tips with the pairs included in the box. They only come in one color, which is white – an odd choice for something that’s going to be regularly stained by sweat or dust when not in its protective case.",
    "The accompanying charging case looks equally stylish, and allows you to quickly recharge your earphones just before you hit the gym. A mere 20 minutes in the charging case will give you up to an hour’s worth of playback, but we’d recommend always returning your earphones to the carry case to keep them topped up as well as protected when being scuffed around in your gym bag. The case itself holds an additional three full charges, so in total you’re looking up to 16 hours of playback, which is more than enough for a few workouts.",
    "The case can also be wirelessly charged, and for this B&O sells a wireless charging pad separately, but that’s going to add an extra AED 500 to the price - we suggest using any regular Qi wireless charging pad instead.",
    "In terms of style, the Beoplay E8 Motion looks great when you wear them. They will stick out a bit ever so slightly, but the ear fins keep them securely in place. Each earpiece houses touch-sensitive controls, which let you control volume and playback. Should you wish to do so, you can use just the right earphone on its own.",
    "Pairing and setup is brilliantly simple: just pop the earphones out of the case and they’re ready for pairing with your phone. The right earphone controls track playback, voice activation, and increasing volume, while the left earphone reduces volume, skips to the previous track, and can activate transparency mode.",
    "Transparency mode is a useful option that pauses what you’re listening to and amplifies the sounds outside, which is handy for when someone asks you something and you don’t want to remove the earphones.",
    "There’s a slight learning curve with using the Beoplay E8 Motion, simply because you’ve got to try and remember how many taps are required for the right operation. Was it two taps to skip a track? Or three? No, wait, that activates the voice assistant... In practice you’ll come to learn these, but the specific controls aren't that intuitive, and the first few days can be a little bit frustrating. Tapping at all also rings quite loudly in your ear canal, making us want to use the touch controls quite sparingly.",
    "The audio is of course the most important feature for the Beoplay E8 Motion earbuds, and we’re happy to say that they sound great. The included app gives you plenty of choices with tweaking the audio quality, so you can switch between profiles and audio settings in just a few taps. The earbuds sounded great right out of the box, with music sounding crisp and full-bodied, making for a truly enjoyable listening experience.",
    "For wearing in the gym, the Beoplay E8 Motion are super light and don’t get in the way at all. They stay firmly in your ears during intense workout sessions (such as boxing), and don’t slip out when you get sweaty. It’s important to wipe them down if you get too sweaty, before popping them back in the charging case. We never felt like they were going to fall out at any point and be forever lost, which is reassuring given how much these actually cost.",
    "However if you’re looking to drown out the noise of the gym’s techno playlist or others grunting on machines around you, then you might be disappointed here. The Beoplay E8 Motion’s snug fit can only do so much to isolate you from the world, so noise canceling isn’t a feature here.",
    "The Bang & Olufsen Beoplay E8 Motion are clearly the best looking earphones to take to the gym, and their audio quality is superb as well. We can overlook the lack of noise cancellation as these are a bit too tiny, but what might be a bit of a pill to swallow is the price tag. There are cheaper alternatives available on the market, but if you need your headphones to stand out during your workout, then these are the ones for you."
  ],
  "headers": {
    "2": "Price and availability",
    "4": "Design",
    "8": "Features",
    "12": "Sound quality",
    "15": "Final verdict"
  },
  "links": {
    "E8 lineup": "https://www.techradar.com/reviews/bang-and-olufsen-beoplay-e8-20-review",
    "Bose SoundSport Free": "https://www.techradar.com/reviews/bose-soundsport-free-true-wireless-earbuds-review",
    "Apple’s Airpods": "https://www.techradar.com/reviews/apple-airpods-2019-review-uae"
  }
}