{
  "source": "https://www.techradar.com/reviews/g-technology-g-drive-mobile-pro-thunderbolt-3-ssd-500gb",
  "title": "G-Technology G-Drive mobile Pro Thunderbolt 3 SSD 500GB review",
  "category": "computing",
  "updated": "2019-03-31T15:00:54Z",
  "author": "desire-athow",
  "summary": "It’s bigger and faster, but is this drive better than its non-Pro sibling?",
  "verdict": "The G-Drive mobile Pro is a great choice for those looking for peace of mind as well as durability. It is built to last and boasts the longest warranty of any external SSD storage device on the market.",
  "pros": [
    "5-year warranty",
    "Good performance",
    "Nice design"
  ],
  "cons": [
    "Expensive",
    "No 2TB capacity available"
  ],
  "article": [
    "Thunderbolt 3 storage devices are gradually making their way onto the market with an increasing number that are small enough to be carried in a backpack (or your jeans back pocket). The G-Drive mobile Pro stands out from the crowd by combining blazing speed – thanks to an NVMe drive – with the sort of sturdy appearance you’d expect from an all-terrain vehicle.",
    "Available in capacities of 500GB and 1TB for $230 and $450 respectively, this is one of the very few external drives – let alone a Thunderbolt 3 model – to come with a five-year warranty. It’s a shame there’s no 2TB product in the range; we tested the 500GB model.",
    "The G-Drive mobile Pro is the bigger brother of the G-Mobile mobile SSD which we reviewed recently. It is, in a nutshell, a larger version of the latter, having to accommodate for – one might argue – more components or a bigger circuit board.",
    "Like its nimbler sibling, it has an aluminum core that enhances its sturdiness whilst keeping it cool and light. A black rubber shell protects it from scratches and the device has slits through which you can see the heatsink that covers the NAND chips (or so we believe).",
    "G-Drive claims that the design allows the drive to withstand a three meter drop and a downward force of 4,450 Newtons. Other than the silver ‘G’ and Thunderbolt logos on the front, there’s hardly anything in the way of distracting visuals. The Thunderbolt 3 connector can be found on one side and a status light on the other end. G-Drive doesn’t bundle any software with its drive but includes a 50cm Thunderbolt 3 cable.",
    "Four screws secure the device which is chunky with a weight of more than 200g. Its dimensions, 112 x 80 x 17mm, make it as big as a traditional 2.5-inch internal drive. Not a bad thing per se, just don’t expect it to be as pocketable as a USB drive like the minuscule Samsung T5.",
    "Curiously, the drive is identified as the SanDisk Extreme Pro by CrystalDiskInfo, although that shouldn’t really matter given that they are both part of the same holding company: Western Digital Corporation.",
    "It is likely that the storage components used in the G-Drive mobile Pro are the same as the Western Digital PC SN720, an NVMe drive that has a five-year warranty and read speeds of up to 3.4Gbps. Not surprisingly, it is available in 512GB and 1TB versions – again with no 2TB offering. As to G-Tech’s claim that this drive can hit 2.8Gbps, we found it to be true, as CrystalDiskMark recorded a staggering 2,830Mbps during our tests.",
    "Write speeds were understandably slower at 2.3Gbps with our test machine, a Lenovo ThinkPad X1 Yoga. AS SSD and Atto benchmarks reported slower read speeds (between 2.1 and 2.4Gbps) with write speeds hovering between 1.8 and 2.1Gbps. A single 100GB file took 137 seconds to be shuttled from the host PC’s drive to the mobile Pro, which is faster than the Patriot Evlvr or the OWC Envoy Pro EX, but slower than the Samsung X5.",
    "The device was warm to the touch when in use, but not to the level of anything unpleasant. Bear in mind that you will need to reformat the drive in order to use it on Windows 10, and that lower capacity SSDs tend to perform worse than bigger models.",
    "The mobile Pro targets a niche within a niche. It’s aimed at the videographer on the move who has to face Mother Nature and adverse terrains, its small capacity meaning that it can only be a temporary abode for digital video footage before it’s transferred elsewhere. There are no other Thunderbolt 3 storage devices that come with such a long warranty and have been tested to a three meter drop; if you find any, do let us know.",
    "The X5 from Samsung is the fastest external drive (non-RAID) on the market and while it might not be the most rugged looking out there, it can still withstand drops of up to two meters – and there’s a 2TB model available. It is also more expensive than the G-Drive mobile Pro, although not by a significant amount.",
    "If price is paramount, ahead of warranty, ruggedness and speed, then the Patriot Evlvr is worth a look at $190 for the 512GB model. It is slower than the Samsung X5 or the G-Drive, has a two-year warranty, and while it does look sturdy, Patriot hasn’t made a big fuss of this aspect.",
    "The OWC Envoy Pro EX Thunderbolt 3 portable SSD comes with MIL-STD810G drop test certification and a three-year warranty. Its 1TB model is also far cheaper than the G-Drive equivalent, while being as fast. However, if ruggedness and the ability to survive a fall is your top priority, then the Envoy Pro EX has a fatal Achilles’ heel, in the form of a cable that’s permanently connected to it and can’t be replaced if damaged.",
    "The G-Drive mobile Pro has succeeded in hitting the right notes for its target audience: mobile, digital content creators. It is rugged, fast, and while not exactly cheap, it’s less expensive than its direct competitor, the Samsung X5. It has a long warranty, which will make it handy for some, although the lack of capacities bigger than 1TB will make some cringe.",
    "We’d like this drive to be smaller, in fact much smaller than the current model, but is it really important for the device to be as small as a matchbox? We would also have appreciated G-Technology bundling a cloud storage solution for extra peace of mind; WD already has Upthere, a service described by the firm as a home for all your stuff. In the case of the latter, you do get 20GB of storage for free and a 100GB account costs a mere $24 (for a year)."
  ],
  "headers": {
    "2": "Design",
    "6": "Performance",
    "10": "Competition",
    "14": "Final verdict"
  },
  "links": {
    "G-Mobile mobile SSD": "https://www.techradar.com/reviews/g-technology-g-drive-mobile-ssd-500gb",
    "Samsung T5": "https://www.techradar.com/reviews/samsung-portable-ssd-t5",
    "Lenovo ThinkPad X1 Yoga": "https://www.techradar.com/reviews/lenovo-thinkpad-x1-yoga-3rd-gen",
    "X5 from Samsung": "https://www.techradar.com/reviews/samsung-x5-portable-ssd",
    "Patriot Evlvr": "https://www.techradar.com/reviews/patriot-evlvr-thunderbolt-3-external-ssd-1tb",
    "OWC Envoy Pro EX Thunderbolt 3": "https://www.techradar.com/reviews/owc-envoy-pro-ex-thunderbolt-3-1tb-portable-ssd-2019",
    "Upthere": "https://www.techradar.com/reviews/wd-upthere"
  }
}