{
  "source": "https://www.techradar.com/reviews/control-review",
  "title": "Control review",
  "category": "gaming",
  "updated": "2019-11-27T17:02:51Z",
  "author": "jordan-oloman",
  "summary": "Free your mind",
  "verdict": "Control’s inspired narrative is framed by cinematic visuals, clever environment design and a set of standout performances, the experience complemented by a deeply satisfying combat system that makes for an electrifying, unmissable narrative juggernaut that will invade your dreams and probe your psyche.",
  "pros": [
    "Stunning particle effects",
    "Inspired art direction",
    "Seamlessly melding live-action and voice-over performances",
    "Mixes crunchy gunplay with satisfying psychic"
  ],
  "cons": [
    "Starts quite slow",
    "A few structural compromises"
  ],
  "article": [
    "Control feels like what would happen if David Lynch licked a Petri dish full of Jungian psychology and SCP entries. The resulting hallucination would be Remedy’s latest mystery. It’s the videogame that connoisseurs of absurd cinema and the surreal have been waiting for.",
    "Players are dropped into the capable shoes of Jesse Faden, our fiery-haired protagonist who seeks out The Oldest House, a brutalist bureaucratic building in New York that exists in a constant state of architectural flux and only appears to those who desire to find it.",
    "In an effort to locate her missing brother, she’s thrust into the position of director of the Federal Bureau of Control, a Big Brother-esque organisation that deals in information control and the containment of paranatural entities. This includes Altered Items, ordinary household objects that have been imbued with supernatural potential spoken into power by urban legends and the collective subconscious.",
    "Confused yet? Just wait until you get your hands on it.",
    "Control is a deeply cinematic game, and clearly the team at Remedy has given as much care to the finer details and framing of it’s gorgeous environments as they have to the development of the wider narrative. Vending machines line the now-vacant halls of The Oldest House, filled with white bags and no branding, only the name of the foodstuff. Previous employees linger in the air, twitching in unnerving unison. You see, they’ve been corrupted by The Hiss, an unknowable force that has wormed its way into The Oldest House and turned it into a psychosomatic nightmare theme park.",
    "Live-action shorts led by aloof scientists are cast onto cold brutalist walls, the whereabouts of the talent currently unknown. In one room I mistakenly knocked over a projector when I was using one of Jesse’s powers to hurl rubble at a winged, tormented bureaucrat, only to note that the remainder of the show played out half-cut on the west wall where the projector lay. It’s moments like this that helped cement just how much attention to detail there is in Control.",
    "Being a Remedy game, of course there are stacks of notes to find and countless supplements and summaries to read, depicting events where the supernatural has seeped into the reality outside of these claustrophobic halls.",
    "The bureau has redacted certain titbits, but by exploring and lending an ear to the broody hum of this atmospheric world, you gain a sense of context and understanding about the ways in which the FBC has permeated the subconscious of humans worldwide, launching misinformation campaigns via kooky nighttime radio shows, obfuscating the truth via reductio ad absurdum and always protecting its own experimental interests. A room known as ‘Dead Letters’ fails to catalogue thousands of earnest paranormal sightings, with elevators unusable due to being filled to the brim with mail.",
    "Max Payne himself James McAffrey absolutely knocks it out of the park as Zachariah Trench, the recently deceased, realm-crossing director who feeds Jesse information via a forbidden hotline, visually integrated via Twin Peaks-esque transparent film layers which dominate Jesse’s eyeline. It demands to be seen to be believed, and the cutscenes offer even more consistent back and forth dialogue as Jesse (Courtney Hope) wrestles with her new role.",
    "Sean Durrie steals a number of scenes late into the game when the narrative starts to really warp your psyche, but in protecting a gripping story we won’t spoil any of that here. You’re also fed teasing information by a suspicious, Astral Plane dwelling ‘Board’, their instructions delivered in garbled tones, evocative of the haunted radio in Kojima’s P.T.",
    "Even with its metroidvania influences and open-world design, we're trying to make it clear that Control is still very much a Tomahawk Steak of a narrative, a thin line to straddle for Remedy, and one where other developers have failed previously. We're glad to say that they court this ambitious setup with relative ease.",
    "We'd often shudder as we were walking around in Control, soaking in the blood-pumping sound design courtesy of Inside alum Martin Stig Anderssen. There’s always something to draw your eye in each sector of The Oldest House, from the otherworldly mold that rots away in it’s decrepit corners to the gorgeous translucent gasoline slick trail left behind by each enemy, which also happens to be the essence which Jesse can use to upgrade her abilities and weaponry.",
    "The puzzles are real brain teasers too. At one point we were stood up close to our TV, phone in hand using an audio-reversing app to solve a puzzle. On another occasion, we were translating a Finnish janitor’s warbling into English to gain some more context about his part to play in the story. That in itself is a testament to how much Control’s world had us hook, line and sinker. We wanted every last morsel of it’s writing.",
    "We have a minor gripe or two with the structure of the game. You’re meant to spend a lot of time rooting around for missing quest givers, secret abilities and items, some of which are not even tied to achievements or quests, a brave touch from Remedy that we really appreciated. Yet, as important as exploration is to Control, the game has quite a slow, linear start before it properly opens up, and when it eventually does open up (and it does so in style) there are still a few compromises to the open-world setup they were seemingly going for.",
    "One annoying example was a mold-covered wall that stops Jesse from entering the Medical Wing of the Containment Sector, which later opens up after you pass a certain story mission. There’s no satisfying answer or context to why it was there in the first place, stopping us from having a nosy. It’s a nitpick, but it felt at odds with the spirit of the Metroidvania design elements.",
    "As a chronic explorer, it was nice to see this approach conducted with care in plenty of other areas. Jesse has a growing clearance level that allows her access to mysterious side offices and areas, so the game goads even the most linear players into scouring old areas during the early mid and late-game, something we were eager to lap up.",
    "Checkpointing can also be frustrating and as brutal as the architecture at times. Enemy spawning isn’t perfect, and can often overwhelm you if you’re not careful. This makes for a refreshingly difficult experience, but there are times where you’ll curse the annoying run back to the objective when you get walloped out of nowhere.",
    "That’s not to say that combat is a slog: in fact, it’s perhaps one of Control’s most successful features. Controlling Jesse post-levitation upgrade feels like what Anthem should have been. You’re the ultimate psychic superhero and there’s a wondrous floaty feel to Jesse’s gait as she strifes and darts around enemies, hurling objects, pounding them into dust and seizing their vulnerable minds.",
    "The Service Weapon is as crunchy as they come too, with a number of meaningful variants including a charged blast that rips through flesh and collateral particles, creating a stunning graphical collage when tornadoes of rubble appear in the heat of Control’s intense engagements.",
    "If you’re wondering about replayability, Control has a surprisingly rich post-game, and we're fairly confident that even though we’ve now finished all of the side quests we can find and maxed out the ability tree, there are plenty more complex secrets hiding out within the confines of The Oldest House.",
    "In any case, there is plenty of room for Remedy to expand upon the story with DLC, something we’d be more than happy to pay for given the impeccable quality of the base game.",
    "The affinity with which Remedy has courted multiple difficult genres both in film and in games with Control and still managed to deliver a mind-bending story evocative of True Detective and Twin Peaks is absolutely remarkable. It makes a strong case for Remedy’s latest to be in the running for game of the year, and makes it very easy for us to tell you that you should not skip past this game in the Autumn crush.",
    "There’s really nothing quite like Control on the market, and Remedy’s abilities in ambience and mystery are fully unleashed here, yet they finesse the game with an unexpectedly enticing combat experience that doesn’t feel at all tacked on. Free your mind, pick up your controller and lose yourself to the call of The Oldest House."
  ],
  "headers": {
    "4": "Supernatural settings",
    "10": "Psychic puzzler",
    "13": "Dark phoenix",
    "21": "Verdict"
  },
  "links": {
    "Anthem": "https://www.techradar.com/news/anthem-update-news-dlc-tips-patch-notes-and-more"
  }
}