{
  "source": "https://www.techradar.com/reviews/smartmd",
  "title": "SmartMD review",
  "category": "computing",
  "updated": "2020-01-25T12:50:59Z",
  "author": "jonas-p-demuro",
  "summary": "A medical transcription service with plenty of extra features",
  "verdict": "SmartMD is an excellent choice for a medical transcription service, and we appreciate the choice of tiers with upfront pricing, and the multiple dictation options offered.",
  "pros": [
    "Free trial",
    "iOS app availability",
    "Upfront pricing"
  ],
  "cons": [
    "Lack of Android support",
    "iOS app can be confusing"
  ],
  "article": [
    "SmartMD has been devoted to serving physicians in the US since 1999, with offices located in Wisconsin, Georgia, and Florida. Over that time, SmartMD has been quite active, delivering over 7 million reports.",
    "SmartMD ticks a lot of the right boxes right out of the gate. This includes a US based workforce to produce a high quality of transcription. There are also plenty of options, with clinicians able to dictate via a variety of ways to fit different workflows, including a toll free 800 number, a digital recorder, or even via an iOS app that can be used on either the iPhone or iPad.",
    "The iOS app offers plenty of functionality, beyond just transcribing words which of course it supports, but also photographs can be taken to document the patient’s condition, lists of medications can be scanned via the smartphone camera, and the clinician can use a stylus to write on a worksheet on the screen- and when all combined gives the physician a ton of options to document each patient interaction completely and efficiently. There is also a HIPAA compliant snyc to the cloud function that allows the iOS platform to continue to be used even when offline.",
    "More than just a dictation service, SmartMD brings value add services to the equation. This includes the online archive of transcribed documents with HIPAA compliant security, so that important notes are never truly lost. This storage gets included on all of the tiers, from a minimum of 30 days on the starter tier, up to a maximum of a decade of storage time. This means that all transcribed notes can be viewed from anywhere, at anytime.",
    "There is also included secure messaging, for direct communication between clinicians and billers. This allows the clinician to be able to capture everything needed to bill for the visit, such as the contact information on the facesheet. Then the biller can message the clinician if anything is missing to bill for the encounter, or if there are any billing queries, without interrupting the clinician's workflow. SmartMD can also track revenue, and provide insight into it in real time.",
    "Other services include how the documents get organized and used after they are created. Dictations can be tracked so the office can follow the status for documents that have not been transcribed yet. There is also the option for the transcribed documents to be inserted directly into the EHR, under their EHR Scribe function. This then saves considerable staff time, and reduces errors and lost notes with the documentation being pushed directly into the patient’s medical record. The list of supported EHR’s is also quite long, including Allscripts, AthenaHealth, Cerner and McKesson among many others. Furthermore, SmartMD’s turnaround time promises for documents to be delivered by 9 am the next day.",
    "Reviews of SmartMD are overall quite favorable. The deficiencies focus around the mobile apps, particularly as there is no support for Android. Furthermore, the iOS app, while it offers many options, may simply offer too many for some clinicians, as they wish for a simplified version that only provides for the dictation- and nothing else.",
    "Live phone support is offered, and available seven days a week.",
    "We definitely appreciate the offer of the free trial- with no credit card required. It includes access to the platform for 30 days, 250 transcribed lines, and options to dictate via iPhone app, a toll free number, or via a digital recorder.",
    "Unlike much of their competition, SmartMD does actually provide pricing information on their website. There are also no startup fees.",
    "Plans are based on a four tier structure, with prices by the line. At the bottom is the Starter Tier, which starts at $0.079 (£0.061) per line, with the basic features of 9 AM delivery, dictations on the iPhone app, reports that get posted to the web, and 30 days of storage.",
    "The next tier up is Standard, at a cost of $0.099 (£0.077) per line, which upgrades the storage for a full year, provides standard templates, and adds the option to dictate via a digital recorder, in addition to all the features of the tier below.",
    "Moving up a tier brings us to the Professional one, at a cost of $0.127 (£0.099) per line, offering storage for up to 7 years, custom templates, the option for phone dictation, and faxing of reports to the office and referring physicians. The top plan, dubbed Medical Scribe, comes in at $0.138 (£0.11) per line and has all the features of the lower plans, along with storage for up to 10 years, the ability to sync with your EHR’s schedule, and to post reports directly into your EHR.",
    "In addition, for even more specifics, there are plenty of options to communicate with the company, whether via email or phone, for a custom, written quote for situations where your needs are better served with a combination of options not in an already existing plan. There is also no commitment, and no required minimum, making SmartMD a more flexible offering than many other plans.",
    "A veteran of the medical transcription space, SmartMD’s experience shows through with its choice of four tiers of service plans, including online storage, and options to dictate via phone, digital recorder, or iOS app. Shortcomings include the lack of support for the Android platform and difficulty using the iOS app, but overall, SmartMD is a robust option for a next generation transcription service."
  ],
  "headers": {
    "1": "Features",
    "6": "Drawbacks",
    "7": "Support",
    "8": "Pricing",
    "14": "Final verdict"
  },
  "links": {
    "SmartMD": "https://www.smartmd.com/",
    "Starter Tier": "https://www.smartmd.com/pricing/",
    "Standard": "https://www.smartmd.com/pricing/",
    "Professional": "https://www.smartmd.com/pricing/",
    "Medical Scribe": "https://www.smartmd.com/pricing/",
    "EHR": "https://www.techradar.com/best/best-electronic-health-record-ehr-software"
  }
}