{
  "source": "https://www.techradar.com/reviews/lenovo-yoga-c630",
  "title": "Lenovo Yoga C630 review",
  "category": "computing",
  "updated": "2019-06-06T15:49:46Z",
  "author": "matt-hanson",
  "summary": "Windows on Snapdragon redeemed?",
  "verdict": "The Lenovo Yoga C630 finally delivers on many of the promises other Windows-on-Snapdragon laptops made. In the US, at least, this is a very good laptop with some genuinely innovative features.",
  "pros": [
    "4G connectivity",
    "Huge battery life",
    "Thin and light design",
    "Attractive price (in the US)"
  ],
  "cons": [
    "Windows 10 S mode useless",
    "Limited app compatibility",
    "Expensive (in the UK)"
  ],
  "article": [
    "The Lenovo Yoga C630 is the new laptop from Lenovo that users Qualcomm’s latest mobile compute platform – the Snapdragon 850 – rather than traditional AMD and Intel hardware.",
    "While previous Windows on Snapdragon laptops have promised to bring the best of PC and mobile technology together, they've been hampered by poor performance and high price tags.",
    "With the Snapdragon 850-toting Yoga C630, Lenovo is promising up to a 30% increase in performance, improved battery life of up to 25 hours, and faster 4G LTE speeds. So can the Yoga C630 avoid the disappointments of its predecessors and provide us with a Snapdragon-powered laptop that’s worth buying? Let’s find out.",
    "Previous Windows-on-Snapdragon laptops have had high price tags – which often makes their lack of performance harder to stomach – and price-wise the Lenovo Yoga C630 continues this trend at £929.99 / AU$1,700.",
    "In the US, however, the Lenovo Yoga C630 is much better value at $549. In fact, the price difference is so large – it’s about half the price as in the UK – that it means UK customers are are getting relatively poor value for money. Lenovo hasn't given an explanation for the price discrepancy.",
    "So in the UK this is a pricey laptop, and it goes squarely into the high-end laptop bracket. Previous Snapdragon-powered laptops have clocked in at around this price – such as the flawed HP Envy x2, which cost $999 / £999 (around AU$1,800).",
    "Once you start asking for that sort of money for a laptop, customers expect a certain level of specification and performance – something previous Snapdragon laptops have failed to deliver.",
    "Whichever price you're paying, for your money you get an 8-core Qualcomm Snapdragon SDM850 processor, 13.3-inch 1080p display, 8GB RAM and 128GB storage – as well as a data SIM card which offers you 24GB of data to use over 12 months.",
    "The processor is a decent upgrade compared to the Snapdragon 835 found in the Envy x2. It also has twice the RAM of the Envy x2, so at the very least we should see a noticeable bump in performance with the Yoga C630. It’s worth noting, though, that the Envy x2 has now dropped to around £650 / $830 / AU$1,200, which is a more palatable price.",
    "Part of the appeal of Snapdragon-powered laptops is that they run a lot cooler than traditional laptops that use Intel or AMD hardware. This allows manufacturers to create thinner and lighter devices, and Lenovo has done a great job of producing an impressively svelte laptop with the Yoga C630.",
    "Its fanless design means there’s no need for space in the body for airflow (and also makes it practically silent when in use), and it's just 12.5mm thin and weighs only 1.2kg.",
    "This is a laptop that you can comfortably carry around with you while traveling. Thanks to its metal body it also feels robust, despite its thinness, and it looks great as well.",
    "As with other laptops in the Yoga line, the screen can be flipped 360 degrees, allowing it to be used as a standard laptop or as a tablet-like device.",
    "The thin design means that when the screen is folded back into tablet mode the Yoga C630 is thin enough to feel like a standard tablet. It’s still not quite as thin as a tablet, and it’s too heavy to comfortably hold in one hand for long periods of time, but it’s an improvement on other 2-in-1 devices.",
    "The bezels that run down the sides of the screen are impressively thin, which helps keep the overall size of the Yoga C630 down. The top bezel is slightly thicker, but that’s forgivable as it houses a webcam.",
    "The bottom half of the Yoga C630 houses the keyboard. The keys are nice and large, which makes typing on them easy and comfortable, even if you type fast. Key travel isn’t that deep, but it’s a price you have to pay if you want a device this thin, and there’s enough tactile feedback for the keys not to feel too soft when you're typing.",
    "The trackpad beneath the keyboard is large enough to use comfortably, and only requires light taps to register as clicks. It features a glass surface that lets your fingers glide smoothly over the trackpad as you use it. To the right of this there’s a fingerprint scanner that enables you to quickly and easily log into Windows 10.",
    "Setting up your fingerprint to unlock Windows 10 is done during the initial setup process when you first turn on the Yoga C630, and it’s easy enough to configure.",
    "It also works well – on some laptops we’ve found the finger printer scanner to be a bit hit and miss, but here it registers your fingerprint quickly and logs you in straight away.",
    "On the right-hand edge of the body are the power button, audio jack and USB-C port. On the left-hand edge are another USB-C port for charging and data transfer, and a SIM card tray (which is opened with an included pin).",
    "Overall, the design of the Lenovo Yoga C630 gives it a solid and premium feel, similar to some of the more expensive Ultrabooks we’ve tested. It’s a thin and light laptop that's easy to carry around, feels robust and is attractive enough that it should garner appreciative looks when you take it out in classrooms and meetings.",
    "Arguably the biggest selling point of the Lenovo Yoga C630 is the fact that it runs on Qualcomm’s Snapdragon 850 mobile compute platform, rather than hardware by Intel or AMD as most laptops use.",
    "While it's appearing in a growing number of laptops, Qualcomm’s Snapdragon platform is best known for powering smartphones and tablets, which means it's able to bring some of the best features of these mobile devices to the Lenovo Yoga C630.",
    "Among other benefits, this means it’s got incredibly fast start-up times. Lenovo calls this ‘instant on’, and it does feel similar to how a smartphone turns on compared to a standard Windows laptop, with barely a pause between you hitting the power button and the Windows 10 login screen appearing.",
    "It manages this because, like a phone, rather than turning it off entirely you can leave it in a low-powered sleep mode. Thanks to the Snapdragon hardware powering the Lenovo Yoga C630, it’s able to last longer in this low-powered state, and it also remains connected to the internet, so it can receive emails and messages which will be waiting for you when you log back in.",
    "As we mentioned earlier, the Lenovo Yoga C630 also features a SIM card tray. It has a built-in Snapdragon X20 LTE modem, so if you have a 4G data plan you can insert the SIM and the Lenovo Yoga C630 will remain connected to the internet. Not only is this more convenient, as it means you don’t have to hop between Wi-Fi hotspots when you’re on the move, but it’s also much more secure than using an open Wi-Fi network.",
    "Windows 10 handles connecting to an LTE network well, allowing you to set up the connection much like you would connect to Wi-Fi. You’re also able to set Windows 10 to recognize the data connection as a metered connection, so large updates won’t download when you’re not connected to Wi-Fi.",
    "We were supplied with an EE 4G SIM card (EE is a network operator in the UK), and as with other laptops with LTE connectivity, we found it to be a brilliant addition. Being able to open the laptop and browse the internet or check emails straight away, without having to join a Wi-Fi network, remains an impressive experience, and this feature alone will make the Lenovo Yoga C630 tempting to many people."
  ],
  "headers": {
    "3": "Price and availability",
    "9": "Design",
    "21": "Mobile features"
  },
  "links": {
    "HP Envy x2": "https://www.techradar.com/reviews/hp-envy-x2-2018"
  }
}