{
  "source": "https://www.techradar.com/reviews/nokia-1-review",
  "title": "Nokia 1 review",
  "category": "phones",
  "updated": "2019-03-04T12:10:07Z",
  "author": "sean-cameron",
  "summary": "How smart can this phone really be?",
  "verdict": "For its launch price, the Nokia 1 is a difficult sell. With poor screen quality, paltry performance, and poky specifications, it doesn't offer much in the way for value for money. As a smartphone it fails, but as an 'advanced' feature phone it excels.",
  "pros": [
    "Good battery life",
    "Customizable back",
    "Durable design"
  ],
  "cons": [
    "Tinny speaker",
    "Poor performance",
    "Dim screen"
  ],
  "article": [
    "Not too long ago, Nokia was the largest manufacturer of phones on the planet. A great part of this success lay in the ability of the Finnish firm to tap firmly into the low-end of the market as well as the high-end.",
    "Various devices over the years, in particular the Nokia Lumia 520, typified this trend, selling by the bucketload while delivering value on all fronts.",
    "Launched in 2018, the Nokia 1 is a strong attempt on the part of the recently reformed company (under HMD Global) to reclaim its throne. Boasting a price which undercuts almost all of its rivals, it can certainly turn heads. But making a budget smartphone now is a different game than it was in 2013.",
    "While handsets then were slow and unreliable, now $100 / £100 / AU$150 can buy a device that - although demonstrably not bulletproof - can nonetheless impress with performance and more.",
    "So, with this in mind, does the Nokia 1 do enough to succeed and claim its place in the annals of phone history?",
    "Launched for $85 / £79.99 / AU$149, the Nokia 1 is verging on impulse-buy territory for many.",
    "And that was when it launched in April 2018, almost a year on and with the arrival of the Nokia 1 Plus, prices could come down further.",
    "With debate surrounding the smartphone-world focused so strongly on the high-end, devices like the Nokia 1 are framed by what they don’t have, as opposed to what they can do.",
    "Regardless, the handset sports a series of specifications straight out of 2010. That is to say a 4.5 inch 480 x 854 screen, 1.1GHz quad-core MediaTek MT6737M chipset, 1GB of RAM, a 5MP rear camera, a 2MP front-facing camera and 8GB of internal storage.",
    "The rear of the handset is removable (a trend which has sadly passed on), allowing access to the relatively large 2,150mAh battery.",
    "No mention is made to whether Gorilla Glass is used in the design of this device, indeed the front cover may not be glass at all - not that this matters when the price of construction was so low.",
    "Beyond these core specifications and characteristics, there is no marketing to really give the Nokia 1 an identity. That is aside from a slightly old-school addition on the part of Nokia, with various colorful 'Xpress' covers offered separately to the device, allowing users to customize their handset to their heart’s delight.",
    "With not a lick of metal to be seen anywhere in the construction of the Nokia 1, the real story of its design is the use of plastic. That is to say, there is a polycarbonate frontage and back plate, with no fancy modern all-screen design going on.",
    "The rear of the device is removable, leading way to the microSD card slot, the nanoSIM card tray and a 2,150mAh battery.",
    "In the hand, the Nokia 1 is reminiscent of past budget-minded Nokia phones, not least the well-known Lumia 520, which boasted a similarly sized screen and set of specifications. There is some evidence of flex, and the strength of construction didn’t exactly leave us inspired.",
    "That isn’t to say that this is an issue however, with the Nokia 1 being so cheap to purchase, buying another will almost always be more economical than seeking a repair. It isn't quite worth insuring.",
    "One slightly odd construction decision is the white band running around the border of the screen. Although it matches well with a white back, with any other the rounded corners give it a bit of a 'my first smartphone' effect.",
    "This is borne out too by the weight, which at 131g is almost feather-light, and all the better to resist nasty drops. It is a little jarring when picking the Nokia 1 up for the first time, the hand expects something more substantial, and it does unfortunately mean that the device feels every bit as cheap as it looks.",
    "We weren’t too pleased by the apparent lack of an oleophobic coating on the screen either. Though this can be applied manually with the right tools, its absence means that the screen holds on to the various oils of the human hand with real gusto.",
    "In all, this does just about enough to stand out on the shelf, but unfortunately may look a little too much like a Doro phone to appeal to the youth.",
    "Pixel density is never an absolute metric when determining the quality of a smartphone display, yet marketing types have been keen for years to have the world believe that nothing less than a 1080p panel is essential for eternal happiness, and that's a standard the Nokia 1 doesn't come close to reaching.",
    "At 218ppi, it falls well short of what we might consider to be 'retina' territory, that being where individual pixels on the screen are no longer visible to the naked eye.",
    "Unfortunately, 'jaggies' are a common part of life with this device, with the effect becoming worse depending on the backgrounds used and the websites visited. This is no Samsung Galaxy S9.",
    "Something must be said for using such a small display on a regular basis, however. In keeping with the generally dated feel, using the Nokia 1 is somewhat nostalgic. It really is a dinky customer, and although this makes reading and watching videos less enjoyable, it conversely improves one-handed usability considerably.",
    "As for color accuracy and brightness, it is best not to go there. While bright enough for a dimly lit room on a winter’s evening, the panel fails to become visible in even the least challenging of outdoor lighting conditions - even if there appears to be no issues with uneven backlighting.",
    "Colors tended too far towards the cool end of the spectrum for our liking, with whites becoming bluish all too easily. This is only exacerbated further by the absence of a 'night light' feature, or any screen calibration tools.",
    "Though it may be a little too much to ask of such a low-priced device, such an addition would have been much appreciated."
  ],
  "headers": {
    "5": "Nokia 1 price and availability",
    "7": "Key features",
    "12": "Design",
    "20": "Screen"
  },
  "links": {
    "Nokia Lumia 520": "https://www.techradar.com/reviews/phones/mobile-phones/nokia-lumia-520-1133192/review",
    "Nokia 1 Plus": "https://www.techradar.com/reviews/hands-on-nokia-1-plus",
    "Samsung Galaxy S9": "https://www.techradar.com/reviews/samsung-galaxy-s9-review"
  }
}