{
  "source": "https://www.techradar.com/reviews/hands-on-jbl-bar-51-surround-sound",
  "title": "Hands on: JBL Bar 5.1 Surround Sound review",
  "category": "audio-visual",
  "updated": "2019-09-05T17:33:00Z",
  "author": "henry-st-leger",
  "summary": "Big bass, Multi-Beam, and JBL style",
  "verdict": "",
  "pros": [
    "Strong and powerful sound",
    "Sleek, unassuming design",
    "Multi-beam audio"
  ],
  "cons": [
    "Confusing branding",
    "Bass can feel oppressive",
    "Lack of EQ settings"
  ],
  "article": [
    "JBL has refreshed its range of soundbars, and the JBL Bar 5.1 Surround Sound is the biggest and boldest of the lot.",
    "Announced at IFA 2019, the JBL Bar 5.1 Surround Sound is the successor to last year’s Bar Series 3.1 – and not, as you might think, the current JBL Bar 5.1, which is due its own new iteration at CES 2020 next year.",
    "But with an emphasis on bass (through a mini-fridge sized subwoofer), and Multi-Beam audio that hopes to mimic the effect of surround sound without needing a vast array of speakers around the room, the JBL Bar 5.1 Surround Sound seems a powerful companion to your movie nights in.",
    "Here’s what we thought in our time with the £549 (around $680 / AU$990) soundbar so far.",
    "The JBL Bar 5.1 Surround Sound is very much in the same style as the rest of its new soundbars, with curved edges rounding off a sleek, low profile and gray / silver coloring.",
    "There’s little flourish visually, meaning this isn’t a soundbar that will try to distract from the action happening on screen, but it carries its shape well and focuses rightly on the sound coming out of the soundbar – and the sizeable 10-inch subwoofer you’ll likely place beneath it.",
    "Along the top of the soundbar you get the usual buttons for power, volume control, and source input (i.e. Bluetooth, HDMI, or otherwise).",
    "Unlike the JBL Bar 5.1 (which, again, is a different soundbar entirely), the Surround Sound model doesn’t have separate tweeters you can remove from the main body of the soundbar. Instead, there are two additional tweeters built into the sides of the soundbar, pointing out diagonally – using JBL’s Multi-Beam technology to direct audio across the room, giving the impression of actual surround sound.",
    "So, how well does the Multi-Beam feature work? In our time listening so far, we found the output impressive, with a strong and powerful roar matching the sound of monsters traipsing across the screen (yes, we were watching Godzilla).",
    "The floor would rumble beneath us from the force of the subwoofer, making a strong argument for a bass driver you can leave on the floor itself. The tweeters, too, were able to throw voices across the room, though the sheer power of the bass and mids – which sadly can’t be adjusted through any EQ settings – did seem to have a muffling effect on the vocals, and there’s the impression of a soundbar with a roar bigger than its soundstage.",
    "The JBL Bar 5.1 Surround Sound is a capable soundbar with a strong 500W output and the beginnings of surround sound – though it’s unlikely it can compete with an actual array of speakers placed around the room.",
    "There’s a reason for the lower price point than the JBL Bar 5.1 model, then, with its separate tweeters, and higher retail price of £699.",
    "This will be a soundbar for those wanting high impact audio for their movies, music, or sports matches – and the sound of a crowd cheering over its five-channel drivers is sure to be a delight. But we’ll be updating this review in the coming weeks to see how its strengths and compromises balance out."
  ],
  "headers": {
    "4": "Design",
    "8": "Performance",
    "10": "Early verdict"
  },
  "links": {
    "IFA 2019": "https://www.techradar.com/news/ifa-2019-news",
    "JBL Bar 5.1": "https://www.techradar.com/reviews/jbl-bar-51"
  }
}