{
  "source": "https://www.techradar.com/reviews/master-and-dynamic-mw65",
  "title": "Master & Dynamic MW65 review",
  "category": "audio-visual",
  "updated": "2019-05-13T19:13:00Z",
  "author": "lewis-leong",
  "summary": "Luxury materials but disappointing noise cancellation",
  "verdict": "The Master & Dynamic MW65 feel great and have unrivaled build quality but using them is frustrating. The ANC is weak compared to the much cheaper competition and while we appreciate the luxurious build, we can’t recommend them for those who rely on noise cancellation on flights.",
  "pros": [
    "Unrivaled build quality",
    "Google Assistant built in",
    "Punchy and fun sound"
  ],
  "cons": [
    "Frustratingly weak ANC",
    "Finicky earpads",
    "Expensive"
  ],
  "article": [
    "Master & Dynamic has always done luxury headphones right with immaculate build quality and high-quality materials. However, as the headphone market started adopting more technology like active noise cancellation (ANC), voice assistants, and customizable sound, Master & Dynamic stuck with wired and wireless headphones.",
    "That changes with the Master & Dynamic MW65, the company’s first headphone to feature ANC and Google Assistant.",
    "We were excited to try out the MW65 as we loved Master & Dynamic’s other headphones but, after spending several weeks with the MW65, we came away disappointed. While the inclusion of ANC and Google Assistant are welcomed features, the company has compromised the core experience. Here’s why.",
    "While performance is a bit of a mixed bag, the Master & Dynamic MW65 is beautifully designed and built like the company’s previous headphones - its design is a mix between the wired MH40 and the wireless MW60 and is as handsome as ever.",
    "The headband is wrapped in leather as are the earpads, which feel great on the head. The ear cup forks are adjustable via a slider that’s buttery smooth and a joy to operate. There’s metal and leather everywhere you look.",
    "That said, the biggest design accomplishment of the MW65 is its featherweight heft. While we love the bank vault-like heft of the company’s previous headphones, we wished they were slightly lighter. By changing to an “ultra-high strength aluminum,” Master & Dynamic managed to get the MW65’s weight down to 250g - which is about 200 grams less than an iPad Air. (For comparison, the MH40 weighs 363g.)",
    "One thing we noticed taking off the ear pads is that Master & Dynamic got rid of the trick magnets that made ear pad changes extremely easy. Replacing the magnets are clips, which help drop the headphone’s weight further, however come at the cost of making the headphones feel less luxurious.",
    "In terms of controls, the button to toggle ANC between off/low/high and the power/pairing slider can be found on the right ear cup. On the right, there’s playback controls and the play/pause button doubles as your Google Assistant button. The Assistant works just as you would expect on any other headphone and you’ll need to have the Google Assistant app downloaded for the headphones to work.",
    "Let’s start off with the good news: The Master & Dynamic MW65 sound excellent.",
    "The company has retained its signature dynamic and punchy sound that makes music energetic and fun. The audio quality doesn’t change between the ANC modes either, allowing you to enjoy the best sound the headphones can give in any mode.",
    "Bass is balanced and provides nice impact. Mids shine through for vocals and highs are never sibilant. Overall, we like the tonal balance of the MW65. It’s a fun-sounding headphone that doesn’t take itself too seriously.",
    "However, the ANC is disappointing. Compared to the competition, it’s extremely weak and only effective at block out lower frequencies. It's so bad, in fact, we found that a good pair of noise isolating earbuds blocked out more of the outside environment than the MW65 which offer active noise-cancellation. Even the $200 (£180, AU$250) JBL Live 650BTNC offer better ANC.",
    "Now, the MW65 do offer both a 'high' and a 'low' setting for ANC, similar to other ANC headphones like the Sony WH-1000XM3, but we also barely noticed a difference between the two modes - and for a headphone that costs $500 (about $384, AU$710), that's inexcusable.",
    "Another quirk of the headphone is how finicky the ear pads are with sealing. We found during our testing that there was an audible thump if the seals broke with ANC active and they broke constantly with movement like running or even chewing. This made for an extremely frustrating listening experience.",
    "This isn’t entirely surprising as the MH40’s ear pads had this quirk as well, creating an airtight seal but since that headphone doesn’t feature ANC, it didn’t have the MW65’s audible thumping.",
    "While the company absolutely nailed the sound quality and build but for the price, there are ANC headphones that perform much better. For less money, you can get the Sony WH-1000M3, which are one of the best ANC headphones you can buy right now. (The Bose QC35 II also have class-leading ANC but both the WH-1000XM3 and the MW65 does sound significantly better.) If you’re looking for an ANC bargain, the $200 JBL Live 650BTNC is an excellent all-rounder for the price.",
    "We wanted to love the beautifully built Master & Dynamic MW65, but due to the frustrating ANC and ear pad seals, we just couldn't."
  ],
  "headers": {
    "3": "Design",
    "8": "Performance",
    "15": "Verdict"
  },
  "links": {
    "MH40": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/master-dynamic-mh40-1292797/review",
    "JBL Live 650BTNC": "https://www.techradar.com/reviews/jbl-live-650btnc",
    "Sony WH-1000M3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "best ANC headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Bose QC35 II": "https://www.techradar.com/reviews/bose-quietcomfort-35-ii"
  }
}