{
  "source": "https://www.techradar.com/reviews/steelseries-arctis-1-wireless",
  "title": "SteelSeries Arctis 1 Wireless review",
  "category": "computing",
  "updated": "2019-09-10T15:32:48Z",
  "author": "bill-thomas",
  "summary": "Making the switch",
  "verdict": "The SteelSeries Arctis 1 Wireless provides an excellent wireless Switch experience, but it may not be comfortable to wear for long game sessions.",
  "pros": [
    "Easy to use",
    "Excellent sound quality",
    "Long battery life"
  ],
  "cons": [
    "Not comfortable for long periods"
  ],
  "article": [
    "The SteelSeries Arctis 1 Wireless looks to answer a problem that every Nintendo Switch owner has run into: where can you get a wireless headset that's compatible with the Switch, with minimal fuss?",
    "You see, right now, there are plenty of Bluetooth dongles available for the Nintendo Switch, but all of them require some degree of fuss in order to get to work. With the SteelSeries Arctis 1 Wireless, the wireless connection is handled with a single 2.4GHz USB-C dongle, so you don't have to worry about pairing, and you can easily swap between devices.",
    "However, at $99 (£99, AU$119), the lack of Bluetooth connectivity and the relatively simple build might hold this gaming headset back from true greatness – especially compared to other headsets out there like the $99 (£99, AU$169) HyperX Cloud Alpha, a wired headset that's much more comfortable for long periods of time, and is also compatible with Nintendo Switch via a 3.5mm jack.",
    "SteelSeries peripherals are generally pretty low-key – the designs don't attract too much attention. And, this is generally true for the SteelSeries Arctis 1 Wireless, too. The headset is matte black all around, with the only decoration being the SteelSeries logo on either ear cup.",
    "The ear cups themselves are incredibly comfortable, with what seems like memory foam tucked beneath this soft and breathable fabric. The headband, on the other hand, is incredibly simple. Made entirely of plastic, there's nothing fancy here, and the only padding you'll find is at the center-top of your head. It's comfortable enough for short periods of time, but it's not something that you'll want to wear during an hours-long gaming binge.",
    "It's not all bad with the headband – the internals are all metal, so you don't have to worry about it breaking on you. And, since this headset is ostensibly meant to be carried around with you, that peace of mind that it's not going to crack in your backpack is valuable.",
    "The SteelSeries Arctis 1 Wireless is controlled through buttons on the body of the headset. You've got a power button on the bottom of the right earcup. Over on the left, you have a switch that mutes the mic, a volume knob, a 3.5mm audio jack, a micro USB for charging, and the mic slot.",
    "This does mean that the mic is removable, which is good, as it means you can take the SteelSeries Arctis 1 Wireless out in public without having a mic sticking out in front of your face.",
    "As for how you'll actually connect this headset to your Nintendo Switch, you'll find a little USB-C dongle in the package, which connects to the bottom of the Nintendo Switch. Once it's plugged in, all you need to do is turn the headset on, and you're connected. If you want to connect the SteelSeries Arctis 1 Wireless to your PS4 or PC, you'll find a USB-A to USB-C cable which will let you connect the USB-C dongle.",
    "One of our favorite things about this headset was the fact that we could plug the dongle into our MacBook Pro to listen to music - but we do wish that there was a Bluetooth option, however. Being able to listen to music on an iPhone would have been a nice bonus. If your phone does have a USB-C port, however, this will be a non-issue.",
    "At the end of the day, the SteelSeries Arctis 1 Wireless is the kind of headset that you'll be able to take with you on your commute to work, but for longer gaming sessions it may be a bit uncomfortable. And, really, that's all that this headset sets out to do, so we can't really hold that against it.",
    "Because the SteelSeries Arctis 1 Wireless features the same drivers as the Arctis 7, this headset sounds fantastic. Whether you're listening to music, or playing Fire Emblem on a plane ride, you won't be disappointed.",
    "Listening to Amanda Palmer's Theatre is Evil in its entirety, we're able to hear all the small details of the music. And, while you're obviously not going to get the same audio experience out of this headset as headphones built for music, if you're just looking to listen to some music in your downtime, you shouldn't have a problem.",
    "Where this headset excels, of course, is in games. Having the SteelSeries Arctis 1 Wireless while playing Fire Emblem: Three Houses is a blessing. While sound isn't all that important in that game, the sound of battles are visceral and lively, while the dialogue comes through clear.",
    "As for the battery, SteelSeries claims that this headset can reach 20 hours. And, while we didn't test the battery life, it does seem like this headset will last a couple of days between charges – we didn't need to recharge it during our testing.",
    "If you're looking for a gaming headset that will let you play your favorite Nintendo Switch games on the train, this headset will get the job done. And, while its lacking some high-end features of headsets more oriented to the PC, it should work just fine there, too – even if it isn't comfortable enough for that 12-hour WoW Classic binge.",
    "The SteelSeries Arctis 1 Wireless sets out to provide Nintendo Switch owners a convenient wireless headset experience without having to mess around with convoluted Bluetooth devices – and, for the most part it delivers. This headset does exactly what it sets out to do, with some pretty excellent sound quality.",
    "Still, it's not the most comfortable gaming headset to wear for long periods of time, and the plastic build doesn't feel great. If you're willing to look past those flaws though, the SteelSeries Arctis 1 Wireless may just end up being right up your alley."
  ],
  "headers": {
    "3": "Design",
    "11": "Performance",
    "16": "Final verdict"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "gaming headset": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675",
    "HyperX Cloud Alpha,": "https://www.techradar.com/reviews/hyperx-cloud-alpha",
    "Arctis 7": "https://www.techradar.com/reviews/steelseries-arctis-7-gaming-headset",
    "WoW Classic": "https://www.techradar.com/news/how-to-get-into-world-of-warcraft-classic-what-you-need-to-know-about-vanilla-wow"
  }
}