{
  "source": "https://www.techradar.com/reviews/goplay-video-editor",
  "title": "GoPlay Video Editor review",
  "category": "computing",
  "updated": "2020-08-19T08:36:17.116Z",
  "author": "steve-paris",
  "summary": "Does this video screen grabber have everything you need to edit your project?",
  "verdict": "If you’re looking for a screen grabbing tool, GoPlay may meet your needs. However its editing capabilities might frustrate you in the long run, unless you’re not too bothered about editing what you capture.",
  "pros": [
    "Simple video screen grabbing tool",
    "Can build an edit fast"
  ],
  "cons": [
    "Limited video creation options",
    "Very few editing tools",
    "Small number of transitions and effects",
    "Poor uploading options"
  ],
  "article": [
    "Don’t let the name GoPlay Video Editor confuse you: this Windows-only app is not strictly speaking a traditional video editor. Yes, it can import footage and let you cut it, reorder it, etc, which in a sense is editing, but the strength of this piece of software is its ability to record your screen - a very useful tool if you’re into making tutorials or recording your game sessions for instance.",
    "When you first launch the app, you’re offered a very simple menu: ‘Video Editor’ or ‘Recorder’. Since we’ll be needing footage, let’s take a look at its recording capabilities first.",
    "Having Clicked on ‘Recorder’, you’re then graced with a live preview of what is currently seen on your screen. All the controls you need are at the bottom of that window. By default, GoPlay will record the entire screen for you, but if you select ‘Area’ instead, you can focus the recording on a specific section. This is useful as there doesn’t appear to be any ability to crop the recorded clip in the editing part of the app, so if you don’t want to share parts of your screen with others, this is the way to go.",
    "There’s an option to use a webcam connected to your PC to record yourself at the same time. This is a cool feature which works as advertised, but you must specify how big you want the recording of yourself to be, and where on the screen you want to place it prior to starting the recording; you cannot alter this during the editing process. The video of yourself is essentially burned onto the footage as it’s being recorded.",
    "You also have the option of recording the audio that comes from your PC and/or the one from your PC’s built-in microphone.",
    "Once all your preferences are set, hit the big red button, and GoPlay will immediately begin recording the screen. Stoping the recording is done either via a keyboard shortcut or by clicking on that red button again.",
    "The Editing part of GoPlay Video Editor looks and feels like a regular non-linear video editing app, although your options are very limited. On the plus side, when you select a new tab or feature for the first time, a quick animated overlay appears to explain to you how to use is.",
    "Any footage you’ve recorded appears in the browser section. Double-click on any clip to see it in the preview section to the right. Not only are the screen recordings there, but you can also import any number of other video clips stored on your hard drives.",
    "Just as you’d expect, you create your video in the Timeline section. GoPlay doesn’t allow gaps in your video so as you drag more and more clips, they’re automatically added to the end of the previous one. Even better, delete a clip within your edit and all footage to its right is automatically moved to the left. This is not how most video editors work, and it allows you to build an edit fast.",
    "One reason this works so well is that you can only have one video track - which really marks this app down as a truly basic editor. There is a sort of workaround thanks to the picture in picture track. As its name suggests you can add a video on top of another. As it’s designed to be a picture in picture effect, by default, that second video will be smaller than the one underneath it. However, not only can you reposition it to where you want it to be, you can resize it too.",
    "So theoretically, this could allow you to work with a maximum of two layers of video, but you’d have to resize every clip you add there, and if you delete a clip in the primary track it won’t affect the picture in picture clips’ position, so this is a solution that is very far from ideal.",
    "You have access to a few intro graphics which GoPlay calls ‘Beautiful Intros’. These intros come with customisable text. You do have some changeable parameters, such as font type, size, colour and justification.",
    "Overlay images are available as well, should you wish to place bats or cartoon eyes on your video, for instance.",
    "As you’d expect, you also have access to a handful of transitions, filters and text options, each with their own customisable parameters.",
    "As far as editing tools are concerned, you can split a clip into two and, well, that’s it. No slip, slide or roll tools, no JKL keyboard shortcuts. When we said it was basic, we meant it.",
    "If you’re not keen to record a narration as you’re grabbing the screen, you have the option of doing it as you’re working on the edit via the Dub button. Click on it, and the audio recording starts at the playhead’s location. Unfortunately it doesn’t mute the other layers as you do so, meaning that if you forget to mute the tracks yourself, it will make it impossible to reposition your voice-over to another position later on as you’ll transfer a copy of the background audio too.",
    "A subtitling tool is included, which is also compatible with srt files (meaning you could work on the text and the time it comes on and off the screen in a separate program and import the file into GoPlay).",
    "Once you’re happy with your video, it’s time to share it. GoPlay offers you two options: YouTube or Twitter. We couldn’t find an option to upload to another social media site, or even to just save the film as a self-contained file on your hard drive, so unless you’re fan of YouTube or Twitter, you seem to be out of luck.",
    "GoPlay’s selling point is its video screen grabbing capabilities, and this works pretty much as you’d expect. The editing section of this app is dramatically basic, and so are its exporting options. With that in mind, it’s best to try out the limited free version to make sure this meets your needs before paying out for the Pro version."
  ],
  "headers": {
    "1": "Interface",
    "6": "Editing",
    "9": "Picture in picture",
    "11": "Effects and transitions",
    "15": "Audio recording",
    "17": "Exporting",
    "18": "Final verdict"
  },
  "links": {
    "GoPlay Video Editor": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8809797445117044000&xs=1&url=https%3A%2F%2Fwww.goplayeditor.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fgoplay-video-editor",
    "video editor": "https://www.techradar.com/best/free-video-editing-software"
  }
}