{
  "source": "https://www.techradar.com/reviews/agm-x3-rugged-smartphone",
  "title": "AGM X3 rugged smartphone review",
  "category": "phones",
  "updated": "2019-02-22T19:00:49Z",
  "author": "desire-athow",
  "summary": "This is the best rugged smartphone on the market – but be prepared to pay a premium",
  "verdict": "The AGM X3 is the rugged smartphone to beat, combining elegance with ruggedness at a price point that’s definitely premium. With components that rival current flagships and localized support, it easily tops our list of the best rugged mobiles.",
  "pros": [
    "Top marks for elegant design",
    "Flagship-level hardware",
    "Localized version",
    "Wireless charging"
  ],
  "cons": [
    "Top model isn’t available in UK yet",
    "No oleophobic layer for screen"
  ],
  "article": [
    "Chinese vendor AGM has always tried to raise its game in the competitive world of rugged smartphones. The company’s flagship devices, like the AGM X1 and the AGM X2, made a positive impression due partly to the use of superior components (like Qualcomm Snapdragon system-on-a-chips) and unique features like a VOC (Volatile Organic Compound) sensor.",
    "So AGM’s third flagship, the X3, had expectations riding high when it was unveiled in China back in September 2018. However, the most important thing, from one perspective, is not the device itself – but the fact that for the first time ever, a Chinese rugged smartphone vendor has decided to take the UK market seriously.",
    "The X3 will go on sale at agmmobile.co.uk soon for £599.99 (8GB/128GB) and £559.99 (6GB/64GB) respectively with a local warranty. The 8GB/256GB model – which won’t be available in the UK – can already be purchased on Amazon US for $864.",
    "AGM claims that the X3 is the most rugged smartphone on the market with IP68 certification, and having been tested (yes, actually tested) to MIL-STD 810G standards. And frankly, that’s hard to believe – not that we doubt the X3’s credentials. This rugged phone is one of the lightest and thinnest 6-inch devices we’ve ever seen, and its chassis looks nothing like the Doogee S90 or the Poptel P60 to name a couple of rivals.",
    "It adopts a rectangular shape and has rounded edges protected by rubber, with the rest of the chassis being made of metal, or as AGM puts it “an air-grade metal frame” with a “suspension frame” and a “0.35mm screen dispensing technology” that mitigates the impact of a fall. You won’t find much polycarbonate plastic here.",
    "The front plays host to a sensor, a notification light and a front-facing 20-megapixel camera, the highest we’ve encountered to date. Flip it over to reveal two more camera sensors (both Sony, 12-megapixel and 24-megapixel units), a dual LED, a fingerprint scanner and two speaker grills (again a first) as well as the AGM logo.",
    "Two microphone holes and a USB Type-C connector can be found on the top and bottom edges of the phone. On the right side is the dual SIM tray (which can also house a microSD card), the power button and a dedicated camera button (with a distinctive gold color). The left edge contains a dedicated Google Assistant button and a volume rocker. There’s no apparent customization option for the former button which is a shame.",
    "The AGM X3 marks a few firsts for us. This is the first time that we’ve tested a rugged smartphone with 8GB of RAM and a top-of-the-range system-on-a-chip, the Qualcomm Snapdragon 845. That is the same component that powers the likes of the Google Pixel 3, the Samsung Galaxy S9 or the Note 9.",
    "The Snapdragon 845 brings a number of improvements with it, including support for Bluetooth 5.0, 802.11ac 2x2 MIMO Wi-Fi, and dual-SIM, dual-VoLTE – probably the best wireless connectivity available on any commercial smartphone, on par with the other flagships on the market.",
    "Powering the X3 is a tiny 18W (9V, 2A) adaptor that feeds the 4,100mAh battery, which supports Quick Charge 4.0, meaning it can be charged from flat to 100% in 2.5 hours. You can charge the phone using a wireless 10W fast charger, too. The AGM X3 also comes with a charging cable, a USB Type-C audio adaptor, and two small rubber plugs for the Type-C connector.",
    "Unique amongst rugged smartphones are the dual JBL speakers which, AGM claims, have a much lower distortion rate than the iPhone X, and they are paired with a smart PA audio chip. It’s also worth noting that the Chinese market will get an exclusive version of the phone with JBL technology and a (real) crocodile skin finish.",
    "The VOC sensor, which was one of the unique selling points of the X2, has been quietly removed, making the X3 less attractive for professionals for whom a VOC detector could be a matter of life-or-death.",
    "For the first time ever, we had to read through and agree to a long end user license agreement (EULA) and a privacy policy during setup. With GDPR around, and given AGM’s ambitions to gain market share in the EU, this probably isn’t a bad idea from the Chinese vendor.",
    "When it comes to sheer performance, the X3 is a bit of a monster. It is the fastest smartphone that we have ever tested, obliterating anything that comes in sight. Unsurprisingly, it achieved the highest scores on all of our benchmarks with relative ease.",
    "Despite using Corning Gorilla Glass 5, we found that the screen on the AGM X3, while sharp and bright, was not oleophobic. As such, it got covered with fingerprints quite quickly.",
    "The X3 runs a stock version of Android 8.1 with the only extra apps being the AGM tools, a bundle of utilities that includes a compass, loupe, plummet and protractor amongst others. No update to Android 9 Pie has been planned.",
    "Facial recognition worked very well on the X3, as promised, as did the fingerprint reader. We’ve no complaints on either front. Special mention should be made of the audio performance of the AGM X3, which is simply head-and-shoulders above the rugged smartphone competition. The addition of another speaker combined with some dedicated hardware transforms the sonic experience on the X3.",
    "The X3 has effectively positioned itself nicely as the rugged version of the OnePlus 6T – the latter doesn’t come with an IP68 rating, but is slightly more affordable. In fact, one might argue that that the AGM X3 bridges the gap between rugged and non-rugged devices. For the first time ever, there’s finally a flagship smartphone that will be equally at home when being used at a gala night or on an oil rig.",
    "Well, there’s no real competition for the X3 in the rugged market. While it’s true that you can get the Ulefone Armor 6 and the Doogee S90 for far less money, both are casually trounced by the X3 when it comes to sheer firepower and class.",
    "AGM has delivered a masterclass, a benchmark for other rugged device manufacturers to follow. It took three iterations, but the X3 is finally delivering the closest thing yet to the perfect rugged smartphone.",
    "In truth, though, both the Armor 6 and the S90 look more rugged than the X3 will ever be, and the modularity of the S90 is likely to make it an instant favorite with some professionals."
  ],
  "headers": {
    "3": "Design",
    "7": "Specifications",
    "12": "In use",
    "17": "Final verdict"
  },
  "links": {
    "AGM X1": "https://www.techradar.com/reviews/agm-x1",
    "AGM X2": "https://www.techradar.com/reviews/agm-x2",
    "agmmobile.co.uk": "http://www.agmmobile.co.uk",
    "8GB/256GB": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Foffer-listing%2FB07KN21JYT%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2606515797991859000-20",
    "Doogee S90": "https://www.techradar.com/reviews/doogee-s90-rugged-smartphone",
    "Poptel P60": "https://www.techradar.com/reviews/poptel-p60-rugged-smartphone",
    "Google Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "Samsung Galaxy S9": "https://www.techradar.com/reviews/samsung-galaxy-s9-review",
    "Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "GDPR": "https://www.techradar.com/news/what-is-gdpr-everything-you-need-to-know"
  }
}