{
  "source": "https://www.techradar.com/reviews/audio-technica-at-lp5x-turntable",
  "title": "Hands on: Audio-Technica AT-LP5x turntable review",
  "category": "audio-visual",
  "updated": "2019-09-04T09:00:02Z",
  "author": "gerald-lynch",
  "summary": "A great step up for the budding vinyl enthusiast",
  "verdict": "The Audio-Technica AT-LP5x is looking like a great step up towards premium audio for those entering the world of vinyl fandom.",
  "pros": [
    "Great price",
    "USB-out for recording",
    "Now supports 78 playback"
  ],
  "cons": [
    "Won’t scratch Ed Sheeran records"
  ],
  "article": [
    "The vinyl boom shows no sign of slowing, so, a few years into the format’s phoenix-like ascendance, where does the budding enthusiast take their next step with record collecting.",
    "Previously, we’d have potentially suggested coughing the cash up for Audio Technica’s delightful AT-LP5, a feature-rich and expressive turntable that would offer a rich and spacious soundstage without breaking the bank. That may be about to change though, by virtue of the introduction of its successor – the LP5x.",
    "We had a brief hands-on session with turntable before its IFA 2019 debut, and discovered a vinyl player with significant improvements at the exact same price as the earlier model. Read on for our initial thoughts on the Audio-Technica AT-LP5x.",
    "The AT-LP5x goes on sale September 2019, priced at £349 (about $425 / AU$630). That’s a very reasonable price tag given the specifications here – a worthy investment for those still listening on a ‘My First Turntable’ deck.",
    "For alternative options, be sure to check out our list of the best turntables money can buy.",
    "The AT-P5x is unassumingly attractive, its matte-black chassis weighty and constructed of anti-vibration damping materials to avoid any shakes and rattles disturbing playback. There’s also now a new external power supply to further remove unwanted sounds from the signal chain.",
    "A quick-start direct drive turntable with a die-cast aluminium platter, perhaps the AT-LP5x’s biggest feature addition over its predecessor is the introduction of 78 RPM playback, alongside 33 and 45s. It’s a niche within a niche, but 78 playback is a great addition for the budding vinyl fan looking to widen the scope of their collection.",
    "The turntable comes equipped with the new AT-VM95E Dual Moving Magnet stereo cartridge, which is the latest evolution of the popular AT95E. For straight-out-of-the-box playback, the AT-VM95E comes already mounted for the AT-P5x on a universal ½” AT-HS6 headshell. (Note that to play 78 RPM records, you’re going to need to additionally buy an AT-VM95SP stylus).",
    "Likewise, a built-in phono-line preamp lets you connect up to a home stereo or powered speakers (that wouldn’t have a phono stage of their own) as soon as you plug the turntable in, letting you get to your tunes straight away.",
    "A familiar J-shaped tonearm, the same as that of the AT-LP5, is again in play here (a nod to Audio-Technica’s retro turntables of the 1960s and 1970s), using precision bearings and a metallic gimbal suspension system. Audio-Technica promises that, in tandem with precision-machined platter, you should avoid any tracking issues as a result.",
    "As for modcons, there’s no Bluetooth support here – Bluetooth being a dirty word among some analogue enthusiasts, a quality of life feature for others – but there is USB output for anyone looking to digitise their sacred vinyl. Audio-Technica offers up a code to download Audacity software for converting vinyl (or any other analogue source) to MP3 or WAV files in the box, too.",
    "If you’re looking for a Bluetooth turntable, Audio-Technica do offer one in the form of the AT-LP60XBT – potentially a better buy if you can’t live without the modern convenience of wireless connectivity.",
    "We had only a few minutes to listen to the AT-LP5x at the preview event which it was showcased at, but it was hard to not be excited by the quality of what it offers against the price point. It also helped that we were treated to playback of one of the most beautiful piano pieces ever written – ‘Merry Christmas Mr. Lawrence’ by Ryuchi Sakamoto, as cut for the album Coda.",
    "Its twinkling piano lines fall into rich and sonorous chords, and the AT-LP5x wrapped itself around the notes wonderfully. It’s a wide soundstage, pulling out the fine details from Sakamoto’s piece, but delivering the punch and intensity required when emotions peak.",
    "We could have listened all day, but we were glad we were given an opportunity to sit with the turntable and listen through a Cambridge Audio phono stage and a pair of Audio-Techinca ATH-W1000Z wooden closed back headphones. It made for a lovely intimate listening experience.",
    "We’ve had only the briefest of sessions with the AT-LP5x, but even at this early stage it’s hard to find fault – although the lack of Bluetooth connectivity may put off those who want to avoid frustrating their speaker setup with annoying cables. Still, that wired connectivity is usually seen as a plus within the audiophile community, many of whom believe it offers a higher level of audio quality.",
    "There’s a commitment to good materials, smart additional features and flexibility for adding other audio components of your choice that makes for a turntable that will grow along with your love of vinyl. Those looking to make the next step on their vinyl adventure should definitely stop off here."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "12": "Sound",
    "15": "Early verdict"
  },
  "links": {
    "IFA 2019": "https://www.techradar.com/news/ifa-2019-news",
    "best turntables": "https://www.techradar.com/news/best-turntables",
    "AT-LP60XBT": "https://www.techradar.com/reviews/audio-technica-at-lp60xbt"
  }
}