{
  "source": "https://www.techradar.com/reviews/bo-beoplay-h9",
  "title": "B&O Beoplay H9 review",
  "category": "audio-visual",
  "updated": "2019-06-19T06:35:23Z",
  "author": "lewis-leong",
  "summary": "Better than Beats ... but not by much",
  "verdict": "The B&O Beoplay H9 are luxury headphones that miss some key marks. Materials, battery life and active noise cancellation are great, but their overwhelming bass, lack of features and high price make them hard to recommend.",
  "pros": [
    "Stellar battery life",
    "Luxurious materials",
    "Effective noise cancellation"
  ],
  "cons": [
    "Overpowering bass",
    "No multipoint pairing",
    "Poor value"
  ],
  "article": [
    "Love them or hate them, Beats headphones have normalized purchasing headphones that cost way too much. But with their ubiquity, there are some audio lovers out there who want to stand out from the crowd and aren’t afraid of paying a bit more to do so – and luxury brands, like Bowers & Wilkins, Master & Dynamic and Bang & Olufsen have started to take notice. Each now have luxury headphone offerings for the audiophile fashionista.",
    "Headphones from these brands push the envelope when it comes to design and materials but often have a major achilles heel when it comes time to perform. Unfortunately, the B&O Beoplay H9 wireless headphone that we’ll be reviewing today fail to buck this trend.",
    "While the build quality and materials help the B&O Beoplay H9 feel as luxurious as its $500 (£450 / AED 2,170, about AUD$750) price tag would suggest, it misses the mark when it comes to sound quality and features. Here’s why.",
    "[Update: B&O has just launched its third-gen version of the H9s, with built-in support for Google Assistant, a button to summon your device's voice assistant, and increased battery life, bringing the total playtime up to 25 hours.]",
    "The B&O Beoplay H9 are wireless headphones that are designed to fit around your ears, rather than on top. This means the headphones feel great for hours on end, though our ears did get steamy walking around the city with them.",
    "Bang & Olufsen nails the look and feel of the H9 with its mix of leather, canvas and metal. The headphones feel substantial and special. Those sick of the plastic build of most headphones will appreciate the materials and attention to detail.",
    "Externally, there are no buttons on the headphones and that’s because playback and volume are all controlled via the right earcup’s touchpad. We’re not fans of touch controls on headphones as we find them universally finicky and, while we wish it were otherwise, the B&O Beoplay H9 is no exception.",
    "Tapping to play/pause takes half a second longer than it should to register and swiping to skip tracks fails to register half the time. Volume is controlled by sliding your finger clockwise or counterclockwise and it works well, though you have to slide quite a distance to get any significant volume change.",
    "One nice thing about the design of the B&O Beoplay H9 is the fact that its ear pads and battery pack are replaceable. This means the H9 are able to last for years by replacing parts. Most Bluetooth headphones have sealed battery packs which means you have to toss the headphones once the battery stops holding a charge – a serious problem when you're paying $500+ for a pair of cans.",
    "If you’re dropping this much money on a pair of headphones, they had better sound good. Unfortunately, the B&O Beoplay H9 miss the mark in the sound department. Bass is overly exaggerated, resulting in a muddled mid-range and its highs sound sibilant at times.",
    "For those who love the exaggerated bass of the Beats Solo 3 headphones, the H9 may be a good choice. There’s a ton of bass impact and top 40 songs sound exciting with boosted bass. Audiophiles who value neutrality and balance probably won't enjoy these as much and should probably stick to other, more balanced headphones like the Sennheiser HD800.",
    "Soundstage is good, with a good sense of space around your head and gets better when in wired mode. In fact, we found the H9 sounded slightly better in wired mode with tamer, tighter bass and an even wider soundstage.",
    "In terms of battery life, the H9 comes with 14-hour rating with noise cancelling activated, which is good, but not class leading. Both the Bose QuietComfort 35 and Sony MDR-1000X offer 20 hours of life with active noise cancellation turned on. However, the B&O Beoplay H9 do have a replaceable battery pack if you want to carry spares with you to swap.",
    "Speaking of, noise cancellation is great, helping to drown out a majority of noises from a busy city street. There is a slight pressure on the ears with noise cancellation turned on, which is something to be aware of. While we think the Sony and Bose offer slightly better noise cancellation, the B&O aren’t far off.",
    "Compared to the competition, though, the H9's feature set is less-than-ideal. There’s no multipoint Bluetooth pairing, which means you’ll have to manually pair and unpair the headphones with every device you use. There’s also no auto play/pause when you take off the headphones nor is there the ability to quickly silence your music to hear the outside world, like with the Libratone Q-Adapt.",
    "In a vacuum, the B&O Beoplay H9 wireless are a great pair of over-ear headphones. They offer exciting bass response, good battery life and excellent build quality and materials. However, when you start comparing the H9 to the competition, the headphones fall short of excellence.",
    "It’s unforgivable that the H9 doesn’t offer multi-device pairing, a feature that can be found in headphones a fifth of the price. Competitors like the Bose QuietComfort 35 and Sony MDR-1000X offer better active noise cancellation, battery life and features. If the Bose and Sony are too expensive, the Plantronics BackBeat Pro 2 are an excellent choice for $200 (£230, AU$250).",
    "But if you like exaggerated bass and don’t care about having extra wireless features, the B&O Beoplay H9 could be a good choice."
  ],
  "headers": {
    "4": "Design",
    "9": "Performance",
    "15": "Final verdict"
  },
  "links": {
    "Beats headphones": "https://www.techradar.com/news/audio/portable-audio/cheap-beats-by-dre-deals-1302753",
    "Beats Solo 3": "https://www.techradar.com/reviews/beats-solo-3-wireless",
    "Sennheiser HD800": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/sennheiser-hd800-619255/review",
    "Bose QuietComfort 35": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/bose-quietcomfort-35-1322715/review",
    "Sony MDR-1000X": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/sony-mdr-1000x-wireless-headphones-1327770/review",
    "Libratone Q-Adapt": "https://www.techradar.com/reviews/libratone-q-adapt-on-ear",
    "Plantronics BackBeat Pro 2": "https://www.techradar.com/reviews/plantronics-backbeat-pro-2"
  }
}