{
  "source": "https://www.techradar.com/reviews/jaybird-tarah",
  "title": "Jaybird Tarah review",
  "category": "audio-visual",
  "updated": "2019-11-18T15:28:23Z",
  "author": "henry-st-leger",
  "summary": "Strong sound in a basic package",
  "verdict": "The Jaybird Tarah earphones are capable and well-made running earphones, even if they lack some of the fancier features of more premium Jaybird products.",
  "pros": [
    "Jaybird on a budget",
    "Crisp sound",
    "Brilliant Jaybird app"
  ],
  "cons": [
    "No magnetic earbuds",
    "Pretty big in your ear",
    "Cable can be fiddly to adjust"
  ],
  "article": [
    "Jaybird has quickly become one of the best go-to brands for sports and running earphones. With its range of Jaybird X4, Jaybird X3, and Jaybird Tarah Pro headphones, Jaybird caters to a range of prices and indoor / outdoor training needs.",
    "And while many manufacturers are chasing the true wireless trend, Jaybird is still offering capable Bluetooth earphones that make good use of a neck band for those inclined towards exercise – or prone to losing their gadgets.",
    "We’ve already made our thoughts on the more premium Tarah Pro earphones clear (they’re brilliant), but here we take a look at the original Jaybird Tarah, to see how the cheaper pair measures up.",
    "The Jaybird Tarahs are the company’s budget offering, and will only set you back $99 / £89 / AU$149. That’s a decent amount below the Tarah Pros ($159 / £139 / AU$229), and just shy of the mid-range Jaybird X4s ($130 / £109 / AU$189).",
    "The Jaybird Tarah earphones come in three colors: black (with yellow tips), white (green tips), or a dark blue (frosty blue tips). The earbuds are connected by a flat cable which is rigid enough that you shouldn’t need to untangle it every time it comes out of your pocket. There’s a small clip – Jaybird calls it a ‘speed cinch’ which you can use to adjust the length of the cable around your neck, although you have to drag it quite firmly, and the flat shape of the cable means it can slip out when being pulled through.",
    "The Tarahs are simply designed, but well made, with a rubber casing that manages to avoid feeling overly cheap. One difference with the higher-end models is the lack of magnets inside the earbuds, meaning you can’t clip them together around your neck when they’re not in use: it’s certainly a convenient feature, but not one you especially need if you’re just popping the Tarahs on for a run and aren’t wearing them throughout the day.",
    "The Tarahs look a little boxier than the rest of the Jaybird range. The earbuds protrude more from your ear, and feature larger wing tips to keep themselves in place during use. They’re certainly comfortable enough, and you won’t have to worry about them falling out mid-run, but they make their presence known more than other earphones in the range.",
    "You get the same IPX7 water rating as the X4 earbuds, meaning the Tarahs can survive immersion in up to 1m of water for up to 30 minutes; enough for a quick dip in the pool, but possibly not what you want if you’re doing lengths for a good hour.",
    "The Jaybird Tarahs are straightforward to use, and will last through several days’ worth of workouts on a single charge. Like the X4s, they also feature quick charging, enabling you to get an hour of listening time from a 10-minute charge.",
    "There’s little to complain about in terms of sound. The Jaybird Tarah earbuds feature the same audio specs as the more expensive X4s, and mainly differ in having fewer choices of wing tip to slip over the earbuds, and a middling six-hour battery life instead of the X4s’ eight hours (or the Tarah Pros’ 14 hours).",
    "The audio performance from the Tarahs is great for the price, then, with a clear, crisp sound that’s as effective for podcasts as it is for pop or hip hop. You might find them a bit light on bass, without the dynamism or wider frequency range of the Tarah Pro earbuds, but the Jaybird app also lets you boost the bass if that’s what you want from your music.",
    "The app itself is one of the best out there for EQ, letting you pick a number of presets to stress the bass, mid-range, or treble on your running playlists (we recommend Bring The Bass for thumping workout tunes, or Extended Listening for those prone to headaches). You can even create your own presets, and share them with the Jaybird community.",
    "The Jaybird Tarah earphones are capable and well-made running earphones, with high water resistance and good materials, and strong audio for the price, even if they lack some of the fancier features of more premium Jaybird products.",
    "If you can afford them, the Jaybird Tarah Pro earphones excel in every area, and moving from the Pros to the basic Tarahs can feel like something of a step backwards. But if you’re buying into Jaybird for the first time and don’t want to break the bank, the Jaybird Tarah earphones are a reliable bet."
  ],
  "headers": {
    "3": "Pricing and availability",
    "4": "Design",
    "9": "Performance",
    "12": "Mini verdict"
  },
  "links": {
    "Jaybird X4": "https://www.techradar.com/reviews/jaybird-x4",
    "Jaybird X3": "https://www.techradar.com/reviews/jaybird-x3",
    "Jaybird Tarah Pro": "https://www.techradar.com/reviews/jaybird-tarah-pro-review",
    "Bluetooth earphones": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335"
  }
}