{
  "source": "https://www.techradar.com/reviews/garmin-forerunner-935-review",
  "title": "Garmin Forerunner 935 review",
  "category": "wearables",
  "updated": "2019-12-03T18:47:56.190Z",
  "author": "gareth-beavis",
  "summary": "A running and fitness watch with phenomenal battery life",
  "verdict": "The Garmin Forerunner 935 is an exceptional multi-sport watch that will just keep chugging along for days and days on your wrist. It's also an excellent smartwatch and fitness tracker in many ways, with perhaps music support the only notable omission. It's a little chunky and expensive to some - but if you're truly invested in your fitness hobby, it's a worthwhile investment.",
  "pros": [
    "Varied sports tracking",
    "Amazing battery life",
    "Excellent fitness information"
  ],
  "cons": [
    "More expensive than most",
    "No onboard music",
    "No Garmin Pay"
  ],
  "article": [
    "There’s nothing better than training with a decent partner - and the Garmin Forerunner 935 promises it can be the very best that you can bring with you.",
    "Whether it’s through extended battery life, more activities tracked than you can shake a stick at or just a strong watch that will stick with you through thick and thin, the Forerunner 935 could be one of the top running watches on the market.",
    "That said, it’s also pretty expensive - so is this the right device for the casual fitness fan, or is it only the purview of those taking on an Ironman-level challenge?",
    "The Garmin Forerunner 935 release date was mid-2017, coming to the market in readiness for the Ironman season. It’s now been on the market for a few years, but the prices haven’t plummeted hugely in that time.",
    "When it launched, you buy the Forerunner 935 for £450 in the UK, or £569 if you go for the ‘tri’ bundle (which gives you the triathlon in-water heart rate monitor). Those same options can be had in the US and Australia for $500 / AU$700 for the basic package, or $650 / AU$850 for the more full-stocked tri-bundle.",
    "Several years after release, the device is cheaper, but not notably so, and you'll be hard pressed to find a three-figure price reduction in many shops except during particular sales periods.",
    "If you’re a fan of the Garmin range, then the look and feel of the Garmin Forerunner 935 won’t be that much of a surprise to you.",
    "In essence, it’s the Fenix 5 - an incredibly powerful watch from Garmin that can manage to track all manner of things - in a more ‘Forerunner’ shell, with less hardened glass and metal and more sleek rubber all around.",
    "It’s less of a fashion statement and more of a refined model - the metal buttons around the display are the most striking element of an otherwise anonymous design.",
    "That’s not to say that it’s bad - the strap is a nice silicone option, which stretches nicely in between the lugs to sit comfortably on the wrist. It’s super easy to put this watch on, which is worth noting as it's oddly difficult with some other brands, who employ a ‘double band’ approach that you have to feed the strap into.",
    "That’s not easy one-handed, but we’ve never had any issues with the Garmin watch falling off, even jumping in and out of water.",
    "The underside of the Forerunner 935 houses Garmin’s heart rate monitor, which protrudes to stick into your skin a small amount. It’s not sharp at all and can’t really be felt - although you will be left with a temporary indentation when you take the watch off.",
    "The screen on the Garmin Forerunner 935 is perfect for what you need - 64 colors, 240 x 240 resolution in the 1.2-inch round display. It uses transflective technology, which means that it’ll take the ambient light and reflect it back really well, making the watch always visible outdoors.",
    "It’s just the right size to not be overpowering, but also allow you to see four data screens easily - so if you want to know how fast you’re going, for how long, the heart rate you’re working with and the time the sun sets, you can have that all on one screen.",
    "It's not a touchscreen, but the buttons on the outside of the Garmin Forerunner 935, as mentioned, are metal and very easy to find and hit without looking - which is a key feature when you’re going to be jumping in water, onto bikes and sprinting around tracks with this device.",
    "It’s a touch heavier than some watches at 49g, but that’s much lighter than the Garmin Fenix 5X and barely registers on the wrist if you’re used to wearing a running watch.",
    "We’ve used the 935 as a day to day watch for months and found it to be compact enough to fit alongside a shirt or slip through a tight compression top sleeve - it might be pricey, but for the tech you’re getting in there it’s a good companion for most outfits if you want to have a top fitness watch ready to go at any point in the day."
  ],
  "headers": {
    "3": "Garmin Forerunner 935 price and release date",
    "6": "Design and screen"
  },
  "links": {
    "Garmin Fenix 5X": "https://www.techradar.com/reviews/garmin-fenix-5x"
  }
}