{
  "source": "https://www.techradar.com/reviews/pixpa",
  "title": "Pixpa review",
  "category": "computing",
  "updated": "2019-03-19T09:00:24Z",
  "author": "steve-paris",
  "summary": "Showcase and sell your photos online with ease",
  "verdict": "If you’re looking for a service that will host your photographs in an elegant website with good e-commerce features, then you should take a good look at what Pixpa has to offer.",
  "pros": [
    "Simple, elegant and easy to use",
    "Good customisation of navigation menu",
    "Original mobile app galleries",
    "Great customer support"
  ],
  "cons": [
    "Can’t use the same photos in different galleries unless they’re re-loaded",
    "Cheapest option feels restrictive to the point of being not fit for purpose",
    "It should be easier to delete demo photos",
    "Trial period prevents you from publishing anything online"
  ],
  "article": [
    "There are many reasons to create a website and have an online presence for yourself. Pixpa doesn’t pretend to cater for all of them. In fact, its focus is primarily aimed at photographers. Either those you just want to display their work away from the Flickrs and Instagrams of the world, or those wishing to make a living out of their passion by selling their shots online.",
    "If this describes you, Pixpa is enticing you with a free 15-day trial which doesn’t require you to hand over your credit card details. So hop on over to Pixpa's website and click on ‘Get Started’.",
    "All you need to check this service out is your name, an email address and a password. You’re then graced with 38 different themes to choose from. As the info at the top of the page says, you can skip this step and even change themes whenever you like, so whatever decision you make now will have little impact on your forthcoming site.",
    "Your new site is then available for exploring, and is populated with template pages and sample photos. Once you’ve looked through them, feel free to delete them as it’s quicker to get rid of a page entirely than having to select each photo to remove.",
    "Top left of the interface is a big red ‘+’ button. Click on it to see the types of pages you can add to your site. ‘Galleries’ are front and centre, but you can also add Pages, Blogs, Forms, Guestbooks, etc. You can truly create something versatile, and unique to you.",
    "All the pages you create can be reordered - this changes their position on the site’s navigation menu. Separators give a bit of space between menus so they don’t feel too cramped. This works well, as long as you don’t have too many menus up there.",
    "To deal with a potential menu clutter, you can add Folders and Dropdown menus. A Folder is a page filled with as many galleries as you need, each represented by a large thumbnail. A Dropdown menu lets you see the name of the galleries contained within it straight from the menubar. Both also allow you to store other types of pages within them as well, such as blogs or forms for instance. Each has their own uses and lets you organise yourself as you see fit.",
    "As far as photos are concerned, you can place them in any gallery you wish, but be aware that there is no central library; if you want to put the same shots in different galleries, you have to duplicate them. This won’t be a problem for most customers, as all but the basic ‘Start’ plan include unlimited uploads (more on this later).",
    "Once inside a gallery, your editing capabilities are fairly limited. You can reorder and rotate your images, and add a caption, description, and keywords to each photo via the ‘Image Properties’ menu, but that’s pretty much the extend of it.",
    "The blog options are as you’d expect, although it was disappointing to not be able to choose images from the various galleries, but instead have to yet again grab the photos from your computer.",
    "What makes this more frustrating is that there’s a “Blog post gallery” section at the bottom of each post. It would make sense to be able to link to one of your existing galleries, but instead, you need to keep uploading images…",
    "If you have merch to sell, then you’ll want to take a close look at Pixpa’s online store. It lets you sell both physical products and digital downloads. Adding products is very straightforward, and populating the fields is self explanatory.",
    "Online sales are handled via Stripe or PayPal. You also have the option of selecting an offline method of payment, and Indian customers can also choose to use PayUmoney.",
    "We liked the ability to create discount coupons, setting their name, value and duration, but we then had a problem localising our store. Thankfully, Pixpa’s online customer support (which is available by clicking on the lower right blue button at any time) was both friendly, and very responsive. With their help, we found where the localisation options were - in our account settings, which is the last button in the floating tool palette, lower left of the page.",
    "An interesting and original feature of Pixpa is its Mobile Apps Gallery. It’s a convenient and original way to send previews to clients. Creating an app is as easy as adding a new gallery, blog post or product. You can include up to 250 photos per app (again you have to upload those photos - you can’t choose them from an existing gallery) and have a degree of customisation on how the photos are displayed.",
    "Once saved, you select who to send an email or SMS message to. The recipients are given simple instructions on how to create an app out of the webpage they’re previewing, whether they’re using iPhones or Androids. Once done, they can then see the photos via that app.",
    "What’s good about this is that you can then change the shots at will. As it’s all web based, your clients (or friends and family) will instantly see the updated images the next time they open the app, without having to install anything again.",
    "If all of this sounds good to you, you need to know what it’s going to cost. Once your 15-day trial elapses, the most basic option, ‘Start’, will set you back $6/month (billed annually). This allows you to only upload up to 200 images and sell up to 3 products. This small number of images cripples this option in our opinion, especially since Pixpa is supposed to be all about showcasing photography.",
    "‘Grow’ (at $9/month - billed annually), jumps to an unlimited amount of images, and up to 10 products.",
    "If you’re more into e-commerce, then you’ll be more in the market for either the ‘Plus Store’ or ‘Plus Images’. One is more geared to the sell of physical products and digital downloads while the other favours the sell of your images as prints and downloads. Both cost $15/month (billed annually). It is a puzzling differentiation and we feel it would’ve been simpler to just combine the two. Instead, you have to make what might not be an obvious choice.",
    "Pixpa does a good job of helping you create elegant websites that showcase your photography. It is flexible enough to allow for a good range of customisation, and the app gallery feature is a clever touch. There are good e-commerce features and a very responsive customer support."
  ],
  "headers": {
    "2": "Getting started",
    "7": "Creating galleries",
    "9": "Blogging",
    "11": "E-commerce",
    "14": "Apps",
    "17": "Pricing",
    "20": "Final verdict"
  },
  "links": {
    "create a website": "https://www.techradar.com/news/the-best-website-builder",
    "Pixpa": "https://www.pixpa.com/",
    "website": "https://www.pixpa.com/",
    "Start": "https://www.pixpa.com/pricing",
    "Grow": "https://www.pixpa.com/pricing",
    "Plus Store": "https://www.pixpa.com/pricing",
    "Plus Images": "https://www.pixpa.com/pricing"
  }
}