{
  "source": "https://www.techradar.com/reviews/earfun-free-true-wireless",
  "title": "Earfun Free True Wireless review",
  "category": "audio-visual",
  "updated": "2019-11-20T00:27:08Z",
  "author": "lewis-leong",
  "summary": "Budget true wireless headphones that nail the basics",
  "verdict": "While the Earfun Free may not stand out from the crowd of truly wireless earbuds, they nail the basics. Connectivity is good, battery life is great, and they sound fine. The Earfun Free are perfect entry-level truly wireless earbuds for those who just want something that work and sound good.",
  "pros": [
    "Reliable connection",
    "30 hours of battery life",
    "Wireless charging"
  ],
  "cons": [
    "Cheap build quality",
    "Few accessories",
    "No volume control"
  ],
  "article": [
    "Earfun is a newcomer to the wireless audio space, but it's not exactly new to the audio industry. The company was started by former employees of Tribit, which produces one of our favorite budget Bluetooth speakers, the Tribit XSound Go.",
    "The Earfun Free, the company’s first pair of truly wireless earbuds, may not look like much on the outside but we are impressed with what the company achieved on such a tight budget: For $50 (£46, about AU$86), you get a pair of truly wireless earbuds with 6 hours of playback on a single charge (30-hours total), a reliable connection, good sound, and even wireless charging.",
    "While we have a few nitpicks about the Earfun Free, it’s tough to be too critical about a product that's this affordable.",
    "The Free's design is basically like most other true wireless earbuds on the market - the headphones themselves are a somewhat large teardrop shape and the charging case is a standard-looking pill shape.",
    "What separates these earbuds from the pack, however, is that the charging case uses USB-C and wireless charging, both features you don’t see often in this price range. There’s also four white LEDs on the front of the charging case to let you know the charge level and status.",
    "In terms of build quality, the charging case and earbuds are made entirely out of plastic, which helps keep the weight to a minimum but also makes the headphones feel cheap (because they are). For example, the lid of the charging case flops a bit when opened and makes a cheap plastic snap when shut.",
    "The headphones themselves feature a single button on each earbud that let you control music playback and your phone’s voice assistant, but notably absent is any volume control buttons which means you’ll have to use your phone to adjust the volume.",
    "In terms of accessories, there are small, medium, and large ear tips to help you get a good seal and a USB-C charging cable - which is par for the course at this price point, but a bit weak compared to higher-end models. Lastly, the Earfun Free come in two colors: white like our review unit or in matte black.",
    "So how do they sound? Sound quality of the Earfun Free is fine, with a slight bass boost that gives the headphones an overall warm presentation. Soundstage is average, portraying music without much spatial depth or width.",
    "Noise isolation is quite good, allowing the Earfun Free to block out most external noise without the need for active noise cancellation. While there are only three pairs of ear tips in the box, we found a good fit without much of a problem but your mileage will vary.",
    "Connection strength is excellent with the inclusion of Bluetooth 5.0. Downtown San Francisco provides a ton of interference, which is particularly challenging for true wireless headphones but the Earfun Free maintained a stable connection with only a rare stutter once in a while.",
    "Battery life, according to Earfun, is around 6 hours on a single charge and an additional four charges from the case for a total of 30 hours of playback. In our testing, we found that figure achievable if you keep the volume at or below 50%. This is excellent for a true wireless headphone in this price range. The headphones take 2 hours to charge from flat, and 2.5 hours to charge from flat via a wireless charger. While wireless charging takes longer than charging via a cable, it’s nice that Earfun included the feature. Even better, if you own a Galaxy S10 or Galaxy Note 10 you can reverse charge the Earfun Free, just like you can with the Galaxy Buds.",
    "Summed up, the Earfun Free’s overall sound quality is perfectly fine for most people, but those looking for more richness and depth will want to step up to something like the Creative Outlier Air.",
    "The Earfun Free provide tremendous value in the true wireless headphone space. Most competitors in the price range suffer from connectivity issues, poor battery life, and bad sound quality but the Earfun Free suffers from none of those. Plus, they come with wireless charging, which much more expensive true wireless headphones don’t even offer. For the money, it’s hard to do better.",
    "However, those looking for better sound quality and battery life will want to check out the Creative Outlier Air. For a bit more, the Outlier Air sound better and offer longer battery life in both the 'buds and in the charging case."
  ],
  "headers": {
    "3": "Design",
    "8": "Performance",
    "13": "Verdict"
  },
  "links": {
    "Tribit XSound Go": "https://www.techradar.com/reviews/tribit-xsound-go",
    "Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Galaxy Note 10": "https://www.techradar.com/reviews/samsung-galaxy-note-10-review-and-specs",
    "Galaxy Buds": "https://www.techradar.com/reviews/samsung-galaxy-buds",
    "Creative Outlier Air": "https://www.techradar.com/reviews/creative-outlier-air-review"
  }
}