{
  "source": "https://www.techradar.com/reviews/anker-soundcore-2",
  "title": "Anker SoundCore 2 review",
  "category": "audio-visual",
  "updated": "2019-07-02T18:39:25Z",
  "author": "lewis-leong",
  "summary": "A cheap speaker that can put up with your abuse",
  "verdict": "The Anker SoundCore 2 offers a ton of features for the price like water resistance, great battery life and a rugged body. While its sound quality leaves something to to be desired, it’s hard to think of a better speaker for under $50/£50.",
  "pros": [
    "Extremely affordable",
    "Water resistant",
    "24-hour battery life"
  ],
  "cons": [
    "Average sound quality",
    "Anemic bass",
    "Not loud enough outdoors"
  ],
  "article": [
    "While your phone’s speaker may be good enough to play your music on the go, they're far from the ideal solution. Their sound doesn't carry far and as far as frequency range is concerned, phones typically fail to impress.",
    "Thankfully, Bluetooth speakers are cheap and rugged enough now that anyone can afford to upgrade their sound without breaking the bank. Take, for example, the Anker SoundCore 2, an affordable, durable Bluetooth speaker that proves you don’t have to spend a lot of money to get robust-sounding audio.",
    "For around $50 (£46, about AU$63), the SoundCore 2 gives you a staggering 24 hours of battery life, a ruggedized and water resistant body, and much better sound than your phone’s speaker. While it doesn't quite hold against other speakers in the category in terms of audio performance, the Anker SoundCore 2 is still an incredible value for the price.",
    "Anker won’t win any accolades for the SoundCore 2’s design; it’s a generic-looking black bar with power, playback, pairing and volume controls on the top.",
    "On the front of the speaker you’ll find a black metal grille which obscures two 6-watt drivers. On the side you’ll find a water resistant flap that protects the microUSB charging port and 3.5mm aux port for use with older devices.",
    "The body of the Anker SoundCore 2 is coated in a grippy matte black rubber, which is nice to the touch but quickly shows fingerprints.",
    "Build quality is excellent and it’s nice to know that its rugged body and water resistant design can withstand the abuse of being outdoors. Just be sure to keep in mind that the SoundCore 2 is only IPX5 water resistant, which means it’ll survive splashes but can’t be dunked into a pool like the UE Wonderboom.",
    "In terms of size, the Anker SoundCore 2 measures in at 165mm x 54mm x 45mm, which makes it small enough to toss into a bag without fear of it breaking and not too large that it takes up a ton of space. Its bar-shape makes it easy to transport and it’s light enough that you won’t mind taking it with you.",
    "Sound quality of the Anker SoundCore 2 is average, though miles better than playing music from your smartphone speaker. While sound quality is nicely balanced, bass sounds anemic at times with electronic dance music and hip-hop. Highs are good but exhibit distortion when the volume is pushed.",
    "Speaking of volume, the Anker SoundCore 2 doesn’t get quite loud enough for our tastes. The speaker sounds plenty loud listening in a quiet room but once it has to compete with ambient noises, you’ll quickly find the SoundCore 2’s volume limit. We compared the Anker with the UE Wonderboom and found the UE destroyed it when it came to max volume and distortion.",
    "Compared to similarly sized speakers, the Anker SoundCore 2 sounds strained, like its amp isn’t powerful enough to drive its speakers. In insolation, the SoundCore 2 sounds quite good but bass lovers will be wanting more.",
    "Battery life is an incredible 24 hours, which is much longer than much of the competition. For example, the UE Wonderboom only lasts 10 hours and the Bose SoundLink Color 2 lasts just 8 hours.",
    "The Anker SoundCore 2 also has the ability to take calls and be used with voice assistants like Siri and Google. Simply press and hold the play/pause button to activate your phone’s assistant. Calls came through loud and clear while using the SoundCore 2, with the other party reporting good voice quality.",
    "For around $50 (£46, about AU$63) – currently $33.59 at the time of this writing, the Anker SoundCore 2 is an excellent entry-level Bluetooth speaker. We loved it for its 24-hour battery life, rugged build quality, and water resistance.",
    "While its sound quality leaves something to be desired in the power and clarity departments, it will please most people. It's loud enough to fill a small room, but will struggle to be heard on a noisy beach or street. This is to be expected from such a compact speaker with stellar battery life but it's a trade-off nonetheless.",
    "Those who want 360-degree audio, waterproofing, and better sound should look at the UE Wonderboom. Bass lovers should check out the JBL Charge 3, which is much larger but lasts just as long as the Anker."
  ],
  "headers": {
    "3": "Design",
    "8": "Performance",
    "13": "Verdict"
  },
  "links": {
    "UE Wonderboom": "https://www.techradar.com/reviews/ue-wonderboom",
    "Bose SoundLink Color 2": "https://www.techradar.com/reviews/bose-soundlink-color-2",
    "JBL Charge 3": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/jbl-charge-3-bluetooth-speaker-1324500/review"
  }
}