{
  "source": "https://www.techradar.com/reviews/netgear-orbi-voice",
  "title": "Netgear Orbi Voice review",
  "category": "computing",
  "updated": "2019-03-01T15:36:31Z",
  "author": "matt-hanson",
  "summary": "Mesh Wi-Fi and smart speaker combined",
  "verdict": "The Netgear Orbi Voice is an innovative combo of mesh Wi-Fi and Alexa-powered smart speaker that adds good-quality audio to existing Orbi setups. If you’re not an Orbi user, though, this won’t be for you.",
  "pros": [
    "Looks good",
    "Sounds good",
    "Powerful networking",
    "Reasonably easy to set up"
  ],
  "cons": [
    "Sound needs tweaking",
    "Not standalone",
    "Expensive",
    "App can be buggy"
  ],
  "article": [
    "The Netgear Orbi Voice is either a brilliant idea, or a crazy one. Perhaps it’s both. It’s a satellite add-on to Netgear’s excellent Orbi Wi-Fi mesh networking kit, but not only does it help extend your wireless network around your home, it also has a speaker created by audio experts Harman Kardon built-in, along with Amazon Alexa support.",
    "It’s available as a single a satellite add-on, for existing owners of an Orbi setup, or as a pack that includes the Orbi Voice satellite and Orbi router, which is aimed at people who are looking to jump into the world of mesh Wi-Fi. It’s also angled at Orbi owners who are looking to also buy a smart speaker that offers superior sound to the Amazon Echo and Google Home speakers.",
    "So, it’s a pretty specific market that Netgear is targeting with the Orbi Voice; some may even call it ‘niche’. However, we’ve got to admire Netgear for experimenting with its mesh Wi-Fi products, and to be fair it has packed the Orbi Voice with some impressive tech when it comes to both networking and audio.",
    "The Netgear Orbi Voice is an expensive bit of kit, and much more pricey than the entry-level Amazon Echo and Google Home smart speakers.",
    "The reason for this is twofold. First, the Orbi Voice features the same networking hardware as the satellites of Netgear’s mid-range Orbi RBK44 system, with tri-band AC2200 Wi-Fi, and the ability to add up to 2,000 square feet to your Orbi network.",
    "It’s also got a large and powerful Harman Kardon speaker built-in, with 35W of peak power.",
    "On its own the Netgear Orbi Voice costs $299 / £279.99 / AU$499, putting it in the same price bracket as the Apple HomePod and making it pricer than the Sonos One and Amazon Echo Plus. However, as we said above, those other premium smart speakers don’t have networking kit built in.",
    "It’s important to note that the Netgear Orbi Voice doesn’t work as a standalone smart speaker, nor is it compatible with mesh Wi-Fi products from other brands. This means that if you don’t already have an Orbi setup you’ll need to purchase one, which will add to the cost.",
    "Netgear does sell a pack, labelled RBK50V, which comes with the Orbi Voice and a standard Orbi router (which plugs into your modem and connects wirelessly to the Orbi Voice satellite). This costs $429.99 / £429 / AU$799, making it an expensive proposition, although if you’re thinking of getting the Orbi system and a premium smart speaker, then this is an elegant solution that could save you a bit of money.",
    "Netgear’s existing Orbi products are some of the nicer-designed mesh Wi-Fi devices on the market, and the Orbi Voice continues that trend. It’s slightly smaller and rounder than the Orbi RBK50 satellites, and it’s wrapped in a gray fabric, giving it a similar look and feel to the Google Home range of devices.",
    "It's also an attractive and premium look, which means this isn’t going to be a Wi-Fi device you feel you need to hide away – this is a Wi-Fi mesh satellite that won't look out of place in the home. In fact, it looks so much nicer than the standard Orbi kit that it’s a bit of a shame Netgear doesn’t appear to be redesigning the Orbi router that comes with the Voice in certain packs to match the look.",
    "At the top of the Orbi Voice are four microphones with far-field voice recognition support for Alexa. The top also lights up to show that Alexa is listening to you.",
    "As the Netgear Orbi Voice is a satellite extender, it doesn’t have an Ethernet port for plugging in your modem. However, it does have two Ethernet ports for connecting wired devices to the network, along with a DC power port, a power button and a reset button. There’s also a Sync button for connecting up to the Orbi router, or adding to an existing Orbi setup.",
    "We already had the Orbi RBK50 network set up, so adding the Orbi Voice was a reasonably straightforward experience. All we had to do was place the Orbi Voice in an area where we needed a boost to the Wi-Fi signal, and where we also wanted an Alexa-powered speaker – of course this might narrow your choices a bit when it comes to where to place the unit.",
    "After plugging it in, we loaded up the Orbi smartphone app and selected ‘Add satellite’, and after a few minutes of searching it asked us to press the Sync button. We did, and after a few more moments the app found the Orbi Voice and added it to the system.",
    "The app then asked us to link our Amazon account to the Orbi Voice so that Alexa could work. Here, things got a bit flaky, as the app appeared to be stuck in a loop asking for our language settings and permission to connect Alexa. We restarted the app and tried it again, and after a bit of fiddling about it worked, and Alexa was on the Orbi Voice.",
    "As with other Orbi products, there's little in the way of documentation included with the Orbi Voice – just a slim leaflet explaining how to connect Alexa, and what the LED lights mean when they glow certain colors. It's reasonably useful, but most of the help with setting up the Orbi Voice is accessed through the app, which is all well and good – unless there’s a problem with the app itself.",
    "Still, we were able to get up and running without too much issue. If you're starting from scratch and don’t have an existing Orbi network, then the setup process is slightly more convoluted, as you need to plug the router into your modem first, set that up and then add the Orbi Voice as a satellite; again, this is all done through the app.",
    "With Netgear’s networking technology inside, the Netgear Orbi Voice does an excellent job of offering fast and reliable Wi-Fi. The combination of the Voice with the router gives you coverage of about 4,500 square feet, and a combined network speed of 3Gbps.",
    "This is probably overkill for all but the largest properties, and it meant the building we tried it in (a UK townhouse over three floors) was completely covered by high-speed 802.11ac Wi-Fi. That’s one of the fastest Wi-Fi technologies available at the moment, although 802.11ax is gaining popularity. Netgear has hinted that it could release 802.11ax Orbi devices in the future, but there are no plans at the moment for an 802.11ax Orbi Voice. That doesn’t make the Orbi Voice quite as future-proof as many would have hoped, but for most people 802.11ac will be absolutely fine for the next few years.",
    "On the top floor of the house, with the Orbi Voice on the bottom floor, we saw link speeds of 325Mbps and a signal power of -59 dBm. When standing next to the Orbi Voice, link speed rose to 780Mbps with a signal power of -30 dBm.",
    "Jargon aside, what you’re getting is a powerful satellite that can boost your Wi-Fi, and with careful placement in your house, you’ll easily get coverage throughout. The Orbi app lets you keep an eye on your network, along with internet speeds, and you can see what devices are connected and easily switch their access to the internet on and off – a useful feature that makes it easy to keep an eye on what gadgets are accessing the internet and when.",
    "The app still isn’t perfect, though. For example, it showed all devices in the building connected to the router, and none to the other Orbi satellites, including the Orbi Voice. Checking online, this seems to be a bug in the app that’s been around for a while now. Hopefully Netgear sorts this out soon – it’s not vitally important, but it makes the app less useful, and considering the price Netgear is asking for its Orbi system, you’d want a flawless app.",
    "While the networking performance of the Orbi Voice is important, so is the audio performance, and the good news here is that the Orbi Voice offers loud and clear sound that far exceeds the rather flat audio quality of the Amazon Echo. When you hover your hand over the top of the Orbi Voice icons appear that enable you to change the volume, mute the microphone and more. It’s a nice touch, and using this we whacked the volume up high while streaming music from Spotify.",
    "The Orbi Voice manages to get pretty loud without distorting. You can alter the EQ settings using the Orbi app, which we recommend doing, as a bit of tweaking allows you to get a more rounded sound – out of the box it’s a bit bass-heavy.",
    "The EQ settings are divided into various genres such as Classical and Rock, and they do make subtle differences to the audio quality of the Orbi Voice. However, when you apply a new EQ there is a brief pause in the music playback, which is a bit jarring. It also takes a few seconds to register, something we noticed a few times when using the Orbi app to control the Orbi Voice.",
    "You can also tweak the EQ settings yourself, but this is very limited. You only get two sliders: one for bass and one for treble. While this gives you some control over how your music sounds, audiophiles who expect more granular control over audio quality – especially on a device that pitches itself as a premium audio product – may be disappointed.",
    "It’s also worth pointing out that while the Orbi Voice does get nice and loud, if you’ve got audio playing at high volume you may find it struggles to pick up your voice commands, which is understandable but worth bearing in mind.",
    "There’s no Bluetooth built-in, unlike other smart speakers, nor is there an AUX audio-in port. This means you can’t plug in a device and use it as a speaker via either a cable or over Bluetooth, so you’re limited to Spotify, Deezer and other streaming services available via the Alexa service. While most people will be perfectly fine with that, as that’s how they'll be using the Orbi Voice to play music, it’s one less feature that its smart speaker competitors have.",
    "It also means you won’t be able to buy the Orbi Voice and use it as a standalone smart speaker without buying the rest of the Orbi kit – this is first and foremost an add-on to the Orbi networking system.",
    "The Netgear Orbi Voice is an odd product, one with a lot of competitors – and none at all. It’s hard to compare it to smart speakers like the Amazon Echo and Apple HomePod, because it’s not a standalone product, and it comes with networking hardware those speakers don’t have.",
    "It’s also unique to mesh networking kits, as no other mesh Wi-Fi device (that we know of) doubles as a premium Alexa smart speaker.",
    "That means the Orbi Voice is aimed at a very specific market. If you’ve got a Netgear Orbi setup already, and are looking to expand its range with a new satellite and were thinking of getting a new smart speaker, then the Orbi Voice is almost tailor-made for you.",
    "If you’ve been thinking of upgrading your home Wi-Fi to mesh Wi-Fi, and you also want a smart speaker, then the bundle that comes with an Orbi router and the Orbi Voice is an affordable way to get both. Netgear’s Orbi system is one of the best mesh Wi-Fi kits around, so you’ll be getting excellent mesh Wi-Fi and a very good smart speaker in one.",
    "However, for everyone else, the Orbi Voice will simply be a curio. It’s incompatible with other brands, doesn’t work as a standalone device, and it’s expensive.",
    "Still, we applaud Netgear for doing something different, and if you’ve already invested in the Orbi system this could be an excellent addition.",
    "Images credit: TechRadar"
  ],
  "headers": {
    "3": "Price and availability",
    "9": "Design and setup",
    "18": "Performance",
    "30": "Verdict"
  },
  "links": {
    "Orbi": "https://www.techradar.com/reviews/netgear-orbi",
    "mesh Wi-Fi": "https://www.techradar.com/news/best-wireless-mesh-routers",
    "Amazon Echo": "https://www.techradar.com/reviews/amazon-echo-2014",
    "Google Home": "https://www.techradar.com/reviews/google-home",
    "Apple HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review",
    "Amazon Echo Plus": "https://www.techradar.com/reviews/amazon-echo-plus"
  }
}