{
  "source": "https://www.techradar.com/reviews/nikon-z50",
  "title": "Nikon Z50 review",
  "category": "cameras",
  "updated": "2019-12-06T02:57:40Z",
  "author": "amy-davies",
  "summary": "Another mirrorless marvel from Nikon, but the mid-range competition is very hot",
  "verdict": "The Nikon Z50 is an excellent debut for the company in the crowded APS-C mirrorless market. It’s an ideal travel camera, and it’s also a great option for those looking to move from a Nikon DSLR, or who just love the brand. Offering great handling, excellent value and a set of enticing features, there’s a lot to like about the Z50, even if it does fall a little short in a few areas.",
  "pros": [
    "Great handling",
    "Good value",
    "Impressive viewfinder and screen",
    "Great for travel",
    "SD cards more common than XQD"
  ],
  "cons": [
    "Tilt screen can’t be used with tripod",
    "No joystick for selecting AF points",
    "Just a single UHS-I card slot",
    "Limited native lens range"
  ],
  "article": [
    "Nikon made a spectacular debut in the mirrorless full-frame world with the Nikon Z6, an all-rounder that currently sits top of our best camera list. And now it’s trying to repeat the trick for APS-C cameras with the dinkier, more hobbyist-friendly Nikon Z50.",
    "What are APS-C cameras? This sensor format became dominant in the early days of DSLRs, and is used in cameras that sit below full-frame models. Smaller than full-frame, and called DX format by Nikon, these sensors are found in more compact, affordable bodies that are great for travel.",
    "Not that the Nikon Z50 is small for an APS-C camera. Perhaps thinking of those who might be moving from its DSLRs, Nikon has prioritized handling in the form of a generous grip, at the expense of a very small body that is the calling card of cameras like the Fujifilm X-T30.",
    "Central to the Z50 is its use of the same Z-mount that debuted in the Z7 and Z6. This means you can use all of the existing lenses that have already been announced for the Z range, as well as existing F-mount (DSLR) lenses via an optional adapter. However, there have been two lenses especially created for the DX format, which are set to be joined by plenty of others over time.",
    "Those lenses are a 16-50mm f/3.5-5.6 ‘pancake’ lens, which is the standard kit lens, and a 50-250mm telephoto, which you can buy separately or as part of an excellent-value twin lens kit with the Z50.",
    "At the heart of the Z50 is a 20.9MP sensor, which is joined by an Expeed 6 processor (the same engine as found in the Nikon Z6/Z7. Although this has the same pixel count as the Nikon D500 DSLR, we’re told it’s not the same sensor. The Expeed engine helps to facilitate features like 4K video recording, as well as the native ISO range, which starts as low as ISO 50 and tops out at ISO 25600.",
    "Also joining the party from the Z6 is the same hybrid autofocusing system, with 209 on-sensor AF points that cover approximately 90% of the frame and promise to deliver edge-to-edge sharpness. Sensitivity down to -4EV is promised for low-light shooting, and there’s also Eye-Detection AF, which should come in handy when photographing people; unlike Sony’s similarly specced models, there’s no Animal Eye AF, though.",
    "To compose your images, you’ve got the choice of a 0.39-inch, 2360k-dot electronic viewfinder (which is smaller and lower in resolution than the one on the Z6/Z7), or a 3.2-inch tilting TFT LCD, which is touch-sensitive. Unlike the Z6/Z7, you have the benefit of tilting this to face forward from the bottom hinge, making it useful for selfies – but less so for attaching the camera to a tripod.",
    "The option of shooting 4K video is pretty standard on most cameras now, and the Z50 includes this, with frame rates up to 30fps available.",
    "To transfer your files to your smartphone there’s in-built Wi-Fi and Bluetooth, which works with Nikon’s SnapBridge app. There’s a micro USB port for in-camera charging too, which means you can restore its charge via a portable external battery, although it’s a shame this isn’t the increasingly common USB-C connection type.",
    "A final thing worth mentioning is that this camera accepts SD cards in its single card slot, rather than the XQD format used by the Z6/Z7. This is good news for those who are already in possession of a stack of SD cards – and for the wallets of those who aren’t, as this format is much cheaper than XQD.",
    "Place the Z50 next to its full-frame siblings, the Z6 and Z7, and you can definitely see the family resemblance. There’s the same kind of layout, viewfinder placement and button layout, only in a more compact frame.",
    "Using the camera with the new Nikkor 16-50mm f/3.5-5.6 ‘pancake’ lens makes for a very neat overall package; it’s not quite pocket-friendly, but it certainly slides much more neatly into smaller bags than a full-frame equivalent.",
    "Some controls have been removed to save space, though. You won’t find a top-plate LCD, and nor is there a joystick on the back of the camera. The former we didn’t miss too much, but a joystick for changing the AF point would have come in really handy.",
    "Unlike on some rival cameras, you can’t continue to use the touchscreen while working with the viewfinder, and this can really slow down the process of selecting the appropriate AF point, as you have to work with the much slower directional keys; it’s not the end of the world though.",
    "On a more positive note, the buttons that are present don’t feel too cramped, despite being housed in a smaller form factor. The grip is also nicely pronounced, making it comfortable to use for long periods of time. Some of the missing buttons’ functions have been replaced with ‘virtual’ touchscreen options, such as the magnify option and the display button.",
    "There’s a mode dial on the top of the camera, with a switch that allows you to jump straight to shooting video, and back to stills again. Also on top of the camera are a dedicated video record button, an ISO button and an exposure compensation button.",
    "While the Z50’s electronic viewfinder isn’t quite up to the standard of those on its full-frame siblings – not that you’d expect it to be – it remains very usable, and if you’ve never used one of the full-frame models, you’re also much less likely to notice the reduction in quality. The tilting screen is also great, with the new forward-facing option being helpful for selfies and video recording, though some will be disappointed that you can’t use it easily when the camera is mounted on a tripod.",
    "The Nikon Z50 uses the same AF system as the Z6, with the impressive array of 209 points giving you 90% coverage across the frame.",
    "In most situations, the camera is capable of locking onto subjects quickly and easily, and it only rarely picks out the wrong subject to lock onto when left set to Auto-area AF. Switching to Single-point AF allows you to select your own AF point. It’s only in particularly low-light conditions that there’s a little hunting before the system locks on to the subject, but it’s rare for a false confirmation of focus to be displayed.",
    "For moving subjects, you can switch to AF-C and enable a continuous frame rate. As we’ve seen with the Z6 and Z7, while the camera is a good performer when the subject is fairly predictable, being able to follow something which isn’t moving too erratically, it’s not on the same level as Sony has achieved with cameras like the A9, and even the Sony A6500 from its APS-C range.",
    "If you’re someone with a penchant for photographing sports and action, this is probably not the camera for you. But for the occasional moving subject, such as pets and kids, it copes reasonably well.",
    "It’s fairly disappointing that only the slower UHS-I SD cards are compatible with the Z50. Although up to 11fps shooting is available, relying on these cards means the buffer tends to fill up fairly quickly. However, if you’re just shooting for a few seconds here and there it’s not too problematic.",
    "Eye AF does a great job of detecting a subject’s eye in a scene, and following it even when the face moves around. Again, this is probably not a camera that will be used extensively by professional portrait photographers, but for those who take family snapshots, this kind of feature can prove invaluable.",
    "A 300-shot battery life is promised from the new EN-EL25 battery for the Z50. While this isn’t the most generous rating on the market, that 300 figure is a conservative estimate, and in practice you should find that at the very least it lasts for a full day of average shooting. If you’re someone who likes to capture a lot of 4K video, though, it might be worth buying an extra battery.",
    "Despite the smaller sensor, and lower resolution than both the Z6 and Z7, the Nikon Z50 produces images with a great overall impression of detail. When pixel- peeping at 100%, you’ll likely see that the detail isn’t quite as fine as from the 45.7MP Nikon Z7, but for the price and level you wouldn’t expect that to be the case – besides which, not too many enthusiasts and hobbyists are likely to be examining their images that closely.",
    "The colors produced by the sensor are great, looking realistic while having a good amount of vibrancy and saturation, an the all-purpose metering setting does a very good job of judging exposures to produce balanced results in a variety of shooting conditions. Similarly, the automatic white balance setting copes well with different lighting conditions, perhaps erring just a touch towards yellowish tones when faced with artificial lighting sources.",
    "In low light, with its smaller sensor, the Z50 doesn’t cope quite as well as NIkon’s full-frame Z Series cameras, but it still puts in a good performance. It’s best if you can keep the ISO setting to ISO 6400 or below, as from ISO 12800 up you can see noticeable smoothing, and some noise, when looking at images at A4 size; you can get away with higher ISOs if you only intend to share or print a smaller image.",
    "As with its big brothers, the Z6 and Z7, there’s a heck of a lot to like about the Nikon Z50. It’s not a perfect camera by any means, but it’s a welcome addition to what is an admittedly crowded market.",
    "If you’re already a fan of the Nikon brand – perhaps you already have one of its DSLRs – and have been contemplating moving to mirrorless, it’s an especially tempting proposition. The Z50 is also a great option for those looking for their first ‘proper’ camera, giving you many of the perks of the Z6/Z7 without such a high price tag.",
    "The build and handling are particularly appealing, with the Z50 being essentially a miniaturized version of those superb full-frame models. The deep grip and good spread of buttons make it comfortable and quick to use in most situations, though not having a joystick slows down AF point selection when working with the viewfinder.",
    "Speaking of which, the viewfinder, while smaller and lower in resolution than those found on the Z6 and Z7, is still very usable and comfortable to use – and if you’ve never used a full-frame Z Series model you’re unlikely to feel that you're missing out. It’s also on a par with cameras from rival brands that compete closely with the Z50, such as the Fujifilm X-T30, which uses a similar 0.39-inch, 2360k-dot device.",
    "Being able to tilt the screen is handy, but the fact that it tilts from the bottom of the camera means you can’t use it with a tripod. It’s fine for selfies, but much less useful for those intending to use the camera for vlogging.",
    "Talking of rivals, Nikon has a tough job on its hands to convince floating voters to choose the Z50 over Fujifilm’s popular X Series cameras or the Sony Alpha range. While having the same Z mount as its full-frame siblings means the Z50 is compatible with a useful array of lenses, it can’t yet compete with the range and variety available elsewhere.",
    "That said, the Z50 does have the upper hand over its rivals in two areas. One is value, particularly if you buy the keenly-priced twin-lens kit. The other is handling, which is most noticeable when you compare it to Sony’s less ergonomic Alpha cameras.",
    "The Z50 is a fantastic first foray into the APS-C mirrorless market for Nikon. It shows that the company is keen to keep developing in this area, and perhaps signals another nail in the coffin for DSLRs, at least at the hobbyist level. It’s not a perfect camera, but it is a very good one – and one that will only get better as the price drops, and more lenses become available.",
    "One of the Z50’s closest rivals is the beautifully styled Fujifilm X-T30. This also totes an APS-C sensor, excellent viewfinder and plenty of dials and buttons, and it’s hard to choose between the two. In terms of the available lens range the Fujifilm is the clear winner, but Nikon is hot on its heels, with plenty of lens launches planned for the upcoming year."
  ],
  "headers": {
    "5": "Nikon Z50: Features",
    "11": "Nikon Z50: Build and handling",
    "18": "Nikon Z50: Performance",
    "25": "Nikon Z50: image quality",
    "28": "Verdict",
    "36": "The competition"
  },
  "links": {
    "Nikon Z6": "https://www.techradar.com/reviews/nikon-z6-review",
    "best camera": "https://www.techradar.com/news/best-camera",
    "Fujifilm X-T30": "https://www.techradar.com/reviews/fujifilm-x-t30-review",
    "Nikon D500": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/nikon-d500-1312621/review",
    "Sony A6500": "https://www.techradar.com/reviews/sony-alpha-a6500"
  }
}